{"rows": [["2003.01.01", "India", "Gahend", 1, 0, "Islamic terrorists shoot the daughter of a civilian to death after an unsuccessful attempt to abduct her from her family."], ["2003.01.02", "India", "Kashmir", 2, 0, "Two civilians are abducted and killed by the Mujahideen."], ["2003.01.02", "Israel", "Jordan Vally", 1, 0, "72-year old man stoned to death by al-Aksa Martyrs Brigade."], ["2003.01.02", "Israel", "Menahamiya", 1, 0, "Badly burnt body of a 70-year old man (father of nine) found after being kidnapped by Fatah-al-Aqsa."], ["2003.01.05", "Algeria", "Aures Mountains", 49, 19, "Islamic \"Salafist Group for Preaching and Combat\" ambushes a security convoy and kills forty-nine, wounds nineteen."], ["2003.01.05", "Algeria", "Blida", 13, 0, "Thirteen members of two families are killed in an attack by Islamic extremists."], ["2003.01.05", "Israel", "Tel Aviv", 23, 100, "Twenty-three people are killed and more than one-hundred injured by twin Palestinian suicide bombers."], ["2003.01.07", "India", "Hapatanar", 3, 0, "Mujahideen behead three villagers, including a father and son."], ["2003.01.07", "India", "Srinagar", 1, 0, "Prominent liquor dealer slain by Islamic fundamentalists while pumping gas."], ["2003.01.08", "Algeria", "Douadiche", 5, 1, "Five people killed, one badly wounded in attack on village by Islamic extremists. Victims include a 37-year-old woman, her two children, ages 2 and 5, and her two uncles."], ["2003.01.09", "Algeria", "Tizi Ouzou", 8, 0, "Eight killed in an ambush on a security convoy."], ["2003.01.09", "India", "Bandipore", 2, 0, "A policeman is abducted and murdered by Islamists as the body of a civilian tortured to death by the same group surfaces."], ["2003.01.10", "Chechnya", "Grozny", 9, 3, "Nine Russians killed by Mujahideen rocket attack.  Three others are wounded."], ["2003.01.10", "India", "Kashmir", 2, 7, "Three Jihad attacks leave two civilians dead and seven more injured. (Ghulam Qadir, Baramulla, Nihama)."], ["2003.01.11", "England", "Birmingham", 1, 0, "21-year-old woman stabbed to death by Pakistani on her wedding day for rejecting an arranged Muslim marriage."], ["2003.01.11", "India", "Hari Budha", 2, 0, "The Mujahideen fire into the home of a civilian, killing his wife and son."], ["2003.01.13", "India", "Panar", 2, 0, "Two sons of a civilian suspected of providing information on terrorist activities are kidnapped from their home, tortured and then shot dead."], ["2003.01.13", "Israel", "Moshav Gadish", 1, 5, "Two Palestinian gunmen from Jenin penetrate a farming community and open fire on random vehicles.  One civilian is killed, five are injured."], ["2003.01.13", "Israel", "Nitzana", 1, 1, "Gaza gunmen opens fire on two Israeli soldiers near Egyptian border.  One is killed, the other injured."], ["2003.01.13", "Philippines", "Zamboanga", 3, 0, "Muslim gunmen kill three Christians."], ["2003.01.14", "England", "Manchester", 1, 3, "A police detective and father of three is stabbed to death by a Muslim terrorist."], ["2003.01.14", "India", "Seeldhar", 3, 1, "Three civilians are abducted and murdered by militant Muslims."], ["2003.01.15", "India", "Doda", 1, 3, "Terrorists kill a village constable and injure three other civilians."], ["2003.01.15", "India", "Patta Dhar", 1, 3, "The Mujahideen kill a police officer in his home.  Three family members are injured."], ["2003.01.17", "Israel", "Givat Harsina", 1, 3, "Two Hamas gunmen open fire on a house, killing a father and injuring his four-year-old daughter along with two others."], ["2003.01.18", "Bangladesh", "Dariapur", 8, 15, "Bomb blast at a carnival kills eight and injures fifteen.  Islamic hardliners behind the attack."], ["2003.01.18", "Israel", "Kiryat Arba", 1, 3, "Hamas (Islamic Resistance) terrorists kill a father of five as he is eating dinner with his family.  Three others, including a 5-year-old girl are wounded."], ["2003.01.19", "India", "Bandipore", 3, 0, "Hizb-ul-Mujahideen gunmen enter a house and kill a police officer, his 16-year-old son and another child."], ["2003.01.19", "India", "Kulgam", 0, 21, "Twenty-one people are injured by a Hizb-e-Islami grenade attack on a bus."], ["2003.01.20", "Bangladesh", "Begungram Astana", 5, 0, "Five persons are murdered in Bangladesh by members of the Jamaatul Mujahideen extremists group."], ["2003.01.20", "India", "Baramulla", 1, 0, "Bomb planted in a rickshaw near a college kills one Indian soldier."], ["2003.01.20", "India", "Doda", 2, 0, "Terrorists kill two men belonging to a civilian defense force (established to protect villagers from Muslim terrorists)."], ["2003.01.20", "India", "Rajouri", 1, 4, "One killed and four injured when a terrorist rocket hits a residential house."], ["2003.01.21", "India", "Doda", 3, 1, "Two men are abducted and murdered by the Mujahideen.  The same group shoots another civilian to death on the same night."], ["2003.01.21", "Kuwait", "Kuwait City", 1, 1, "Gunmen fires from behind bushes at two American servicemen, waiting at a traffic light.  Both suffer multiple gunshot wounds, one is killed."], ["2003.01.22", "India", "Dhok", 1, 0, "Mujahideen terrorists abduct and behead a villager."], ["2003.01.23", "India", "Shrai", 2, 0, "Islamists halt a passenger bus, then drag off two civilians and shoot them to death by the side of the road."], ["2003.01.23", "Israel", "Hebron", 3, 0, "Hamas terrorists ambush and kill three Israeli soldiers protecting an intersection."], ["2003.01.23", "Pakistan", "Swat", 3, 0, "Religious extremists kill a writer who was critical of the Taliban, along with two patrons at a shop."], ["2003.01.25", "India", "Aeshmuqam", 1, 6, "Mujahideen target a police vehicle killing one and wounding six."], ["2003.01.26", "Afghanistan", "Nangarhar", 2, 1, "Taliban gunmen attack a UNHCR convoy, killing two and wounding one."], ["2003.01.26", "Lebanon", "Beirut", 1, 3, "Car bomb explodes in Christian residential area killing one and injuring three."], ["2003.01.27", "India", "Kashmir", 2, 0, "Two brutal attacks leaves two civilians dead (Dangiwacha & Mawar)."], ["2003.01.27", "India", "Mumbai", 1, 27, "Group calling itself the Student Islamic Movement of India detonates bomb in a crowded area, killing a woman and injuring twenty-seven."], ["2003.01.27", "Pal. Auth.", "Abu Qash", 1, 0, "After being raped by her brothers, and refusing to commit suicide as her mother suggested, a teenage girl is stabbed and beaten to death by her father."], ["2003.01.28", "India", "Udhir", 2, 0, "Two men are gunned down by Hizb-ul-Mujahideen terrorists for refusing to support them."], ["2003.01.28", "Israel", "Gaza", 3, 0, "Three Palestinians die when a home-made bomb detonates prematurely."], ["2003.01.31", "Afghanistan", "Kandahar", 18, 1, "al-Qaeda landmine blows up a passenger bus, killing eighteen and injuring one."], ["2003.01.31", "India", "Anantnag", 1, 15, "A militant Muslim kills a civilian and injures fifteen more, including women and children, with a grenade."], ["2003.01.31", "India", "Srinagar", 1, 0, "The editor of a newspaper is assassinated by the Hizb-ul-Mujahideen."], ["2003.01.31", "Pakistan", "Faisalabad", 2, 2, "A sectarian attack inside a mosque leaves two people dead and two injured."], ["2003.02.01", "India", "Bemina", 1, 0, "A Jaish-e-Mohammad member kills a police officer."], ["2003.02.02", "Chechnya", "Grozny", 2, 0, "Two Russians killed by a car-bomb blast in Grozny."], ["2003.02.03", "Algeria", "Hassi-Khelifa", 1, 0, "Device hidden in a stuffed toy explodes near a home's entrance, killing an 8-year-old girl."], ["2003.02.03", "Pakistan", "Karachi", 1, 2, "Motorcycle bomb in a commercial area kills one, injures two."], ["2003.02.05", "Pakistan", "Karachi", 1, 0, "Head of a Sunni school assassinated by radical Shiites."], ["2003.02.06", "Chechnya", "Dyshne-Vedeno", 3, 3, "Muslim rebels ambush riot police, killing three and wounding three."], ["2003.02.06", "India", "Kalal Kas", 1, 1, "Muslim terrorists force their way into a civilian's home, killing him and injuring his brother."], ["2003.02.06", "Israel", "Nablus", 2, 0, "al-Aqsa gunmen attack an army outpost in the West Bank and kill two soldiers."], ["2003.02.06", "Pakistan", "Karachi", 2, 0, "Two more Sunni scholars gunned down by Muslim radicals."], ["2003.02.07", "India", "Frisal", 2, 3, "Two civilians are killed in a Mujahideen ambush."], ["2003.02.08", "Iraq", "Sulaimaniyah", 6, 0, "Muslim militants assassinate a top Kurdish politician and five others with automatic weapons and grenades."], ["2003.02.09", "Algeria", "Drra El Mizan", 3, 0, "Two policeman were killed by Muslim extremists, who had erected a fake roadblock.  A third policeman is shot to death in El Harrach."], ["2003.02.09", "Chechnya", "Grozny", 3, 0, "Jihadists bomb a gas station, killing three policemen."], ["2003.02.09", "India", "Varmul", 1, 0, "A civilian is kidnapped from his home and murdered by Islamic radicals."], ["2003.02.10", "Afghanistan", "Naushki", 7, 12, "Taliban attack on an Afghan vehicle checkpoint leaves seven dead and twelve wounded."], ["2003.02.10", "Philippines", "Mindanao", 3, 8, "Muslim guerillas kill three soldiers and injure eight more in an ambush.  Soldiers were on a morning jog."], ["2003.02.11", "Israel", "Bethlehem", 1, 0, "Palestinian sniper guns down Israeli soldier in front of the Church of the Nativity."], ["2003.02.12", "India", "Dharam", 3, 0, "Hiz-ul-Mujahideen terrorists abduct and kill three civilians."], ["2003.02.12", "India", "Konibol", 1, 4, "Militants blow-up police vehicle, killing one and injuring four."], ["2003.02.13", "India", "Bonkoot", 3, 2, "Five civilians are abducted from their homes by Muslim terrorists.  Three are beheaded in captivity."], ["2003.02.15", "Algeria", "Kabylie", 2, 0, "Two security force personnel are attacked and killed while on police patrol."], ["2003.02.15", "Israel", "Beit Lahia", 4, 0, "Hamas terrorists use a roadside bomb to kill four Israeli soldiers who were in a passing tank."], ["2003.02.16", "India", "Varmul", 2, 0, "A man killed by radicals a few days after he lost his brother to the same group is one of two people killed in separate attacks."], ["2003.02.17", "Saudi Arabia", "Skaka", 1, 0, "Vice Governor of a Saudi province is gunned down after angering the fundamentalist element by suggesting that Saudi royalty should take women's opinions into account."], ["2003.02.18", "Philippines", "Matanog", 7, 11, "Ambush by Muslim rebels on a convoy kills seven soldiers and leaves eleven more injured."], ["2003.02.19", "Philippines", "Tubud", 14, 8, "Muslims attack a Christian village, burning and murdering at least fourteen civilians."], ["2003.02.20", "India", "Baramulla", 6, 3, "Six Hindu civilians are blown apart by a road-mine planted by Muslim militants."], ["2003.02.20", "Philippines", "Awang Airport", 1, 6, "Abu Sayyaf car bomb explodes near the airport, killing one and injuring six other civilians."], ["2003.02.20", "Philippines", "Kabacan", 1, 10, "A 17-year old is killed and about ten others injured by a terror bombing."], ["2003.02.20", "Saudi Arabia", "Riyadh", 1, 0, "British man shot to death by Islamists while waiting at a traffic light."], ["2003.02.21", "India", "Srinagar", 2, 0, "A photographer and a woman are murdered in separate attacks by Muslim extremists."], ["2003.02.21", "Pakistan", "Korangi", 1, 0, "A policeman is killed by Islamists."], ["2003.02.22", "Algeria", "Draa El Mizan", 2, 1, "Two policeman are killed and one civilian is injured in a Muslim terrorist attack."], ["2003.02.22", "India", "Bandipore", 1, 0, "The Mujahideen kill a young boy with a landmine."], ["2003.02.22", "Pakistan", "Karachi", 9, 8, "Nine Shi'ite worshippers are killed in a terrorist shooting attack outside a mosque.  At least eight others are wounded."], ["2003.02.23", "Algeria", "Ouargla", 4, 0, "Four local security guards are kidnapped by Muslim extremists, taken to the desert and then killed by having their throats slit."], ["2003.02.23", "India", "Gadyog", 2, 0, "Two villagers are killed when Muslim terrorists break down the door to their home and spray the inside with bullets."], ["2003.02.24", "India", "Rai Sehot", 4, 3, "Four civilians are gunned down by the Hizb-ul-Mujahideen in their village."], ["2003.02.24", "Pakistan", "Ghulam Hussain", 2, 0, "Muslim militants are suspected in the murder of two tribesmen on a road."], ["2003.02.25", "Afghanistan", "Dilaram", 1, 1, "Senior Afghan official gunned down in Taliban-sponsored attack.  His bodyguard is also injured in the shooting."], ["2003.02.25", "Algeria", "Hameur El Ain", 12, 7, "Armed Islamists set up bogus roadblock and then stab or shoot to death twelve civilians.  Seven others are injured in the attack."], ["2003.02.25", "East Timor", "Aidabaleten", 1, 2, "Pro-Jakarta militiamen attack a minibus in East Timor, killing one person and injuring two pregnant women."], ["2003.02.25", "India", "Punzgam", 1, 0, "A man is pulled brutally from his home and killed by a group of radical Muslims."], ["2003.02.25", "Philippines", "Zamboanga", 2, 2, "Muslim rebels attack a logging company and kill two employees."], ["2003.02.26", "Iraq", "Zamaqi", 3, 0, "Ansar al-Islam suicide bomber kills three Kurdish guards at a checkpoint."], ["2003.02.27", "Chechnya", "Argun", 3, 0, "Three Russian soldiers killed by Jihadi car-bomb in Chechnya."], ["2003.02.27", "Pakistan", "Joharabad", 1, 0, "A man is gunned down in a sectarian attack."], ["2003.02.27", "Pakistan", "Karachi", 2, 0, "Sunni terrorists kill two Shiites in a shooting attack at their coffee shop."], ["2003.02.28", "India", "Shindra Mohalla Kasian", 1, 0, "Militant Muslims abduct a man from his house and take him to a forest, where he is shot to death."], ["2003.02.28", "Pakistan", "Islamabad", 2, 6, "Islamic extremists guns down two police officers guarding a U.S. embassy.  Five other officers and a passer-by are also wounded."], ["2003.02.28", "Philippines", "Bukidnon", 1, 0, "Muslim rebels burn ten homes in a Christian village, killing at least one person."], ["2003.03.01", "Bangladesh", "Bagerhat", 1, 3, "Muslims invade the home of a Hindu farmer, chop him to death and then rape three members of his family."], ["2003.03.01", "Lebanon", "Ein el-Hilweh", 1, 2, "Terrorist bomb kills businessman and injures two bystanders."], ["2003.03.03", "India", "Yaripora", 1, 1, "Hizb-ul-Mujahideen terrorists invade a house and kill a woman. Another is injured."], ["2003.03.04", "Philippines", "Davao", 21, 150, "Muslim rebels plant a bomb at a civilian airport.  Twenty-one are killed in the blast and about 150 others are injured.  Among the dead is an American missionary and several children."], ["2003.03.05", "Chechnya", "Dyshne-Vedeno", 2, 4, "A pro-Russian Chechen commander and one other are killed by a bomb hidden in a sofa.  Four others in an adjacent house were injured."], ["2003.03.05", "Israel", "Haifa", 15, 30, "A Palestinian suicide bomber blows up a bus, killing at least fifteen and injuring thirty-seven.  A 14-year-old American girl is among the dead."], ["2003.03.06", "Philippines", "Buayan", 4, 0, "Muslim rebels attack a remote village and kill four civilians."], ["2003.03.07", "Israel", "Kiryat Arba", 3, 8, "Palestinians dressed as Jewish seminary students infiltrate a settlement and kill a husband and wife sitting down to dinner, along with one guest.  They also shoot eight other civilians."], ["2003.03.07", "Philippines", "Mindanao", 1, 2, "Two Moro Islamic Liberation Front bomb attacks kill one and injure two at a Catholic school."], ["2003.03.10", "India", "Kashmir", 3, 0, "Three civilians are killed in separate attacks by Muslim terrorists."], ["2003.03.10", "Israel", "Hebron", 1, 4, "One Israeli is killed and four more injured after roadside attack by Palestinians."], ["2003.03.10", "Philippines", "Pikit", 2, 4, "Muslim rebels stop a bus full of commuters, kill two, and then take dozens hostage."], ["2003.03.11", "Afghanistan", "Kandahar", 3, 5, "al-Qaeda car bomb kills three Afghani tribesmen and injures five more."], ["2003.03.11", "Bangladesh", "Dhaka", 2, 2, "Two policemen were killed and two more badly injured by terrorist bomb in the United Arab Emirates"], ["2003.03.11", "India", "City Chowk", 2, 9, "The Mujahideen plant a bomb at a candy shop that kills two civilians and injures nine more."], ["2003.03.12", "India", "Kashmir", 2, 2, "Separate Mujahideen attacks in Kashmir leave two policemen dead and two more injured."], ["2003.03.13", "India", "Bombay", 10, 55, "Islamic hardliners responsible for blast on a commuter train that kills eight women, two men and leaves more than 55 injured on the tenth anniversary of another series of Islamic bombings that killed two-hundred-fifty-seven and injured more than 1000."], ["2003.03.13", "India", "Poonch", 2, 5, "Islamic militants open up on a civilian vehicle, killing two and wounding five others, including an 18-month-old baby."], ["2003.03.13", "India", "Rajouri", 4, 33, "Four people, including a 6-year-old boy, are killed and thirty more injured by a bomb planted on a bus in Kashmir by an Islamic group."], ["2003.03.14", "India", "Batmaloo", 2, 0, "Two civilians are shot to death by the Mujahideen."], ["2003.03.14", "India", "Poonch", 7, 15, "Militant Islamics attack a hotel, take nine people hostage, spray fire and throw grenades at a crowded marketplace from an upper floor.  Seven people are killed and fifteen injured."], ["2003.03.15", "India", "Gool", 13, 5, "Muslims attack a remote police station and kill thirteen, including two civilians.  Two people were abducted and later found dead with slit throats.  Five others are injured in the attack."], ["2003.03.17", "India", "Pulwama", 2, 0, "Two civilians lose their lives in brutal attacks by the Islamic militants."], ["2003.03.18", "India", "Shopian", 1, 0, "A man is abducted from his home and murdered by Muslim terrorists."], ["2003.03.18", "Nigeria", "Kadarko", 22, 44, "Armed Muslims shouting \"we are going to finish off the infidels\" attack a Christian village and kill at least 22 villagers.  More than forty-four others were injured or missing."], ["2003.03.18", "Philippines", "Baliki", 1, 2, "Islamic boat attack kills one and leaves two injured."], ["2003.03.18", "Philippines", "Cotabato", 0, 5, "Rebel bomb attack on a Roman Catholic church during mass injures five worshippers."], ["2003.03.19", "Afghanistan", "Sherabik", 3, 0, "Taliban attack a remote army post, capture Afghan soldiers and then stab them to death."], ["2003.03.19", "India", "Kashmir", 2, 0, "The Mujahideen gun down one man on a city street, and another inside his home in separate attacks."], ["2003.03.19", "Philippines", "Mindanao", 9, 4, "Moro Islamic Liberation Front attacks a civilian minibus and kills nine, wounds four.  They stopped and boarded the bus, then specifically targeted non-Muslim males only."], ["2003.03.20", "India", "Khanyar", 1, 4, "Terrorists throw grenade into a group of security personnel, killing one and injuring four."], ["2003.03.20", "India", "Srinagar", 2, 2, "A grenade tossed into a street by a militant kills two civilians and injures two more."], ["2003.03.20", "Lebanon", "Sidon", 1, 13, "Bomb kills one and leaves thirteen others injured in southern Lebanon."], ["2003.03.20", "Philippines", "Buldon", 3, 2, "Moro Islamic Liberations Front attacks a post and kills three civilians, wounds two others."], ["2003.03.21", "India", "Kalalkas", 2, 4, "Militant Muslims ambush a security patrol, killing two members and injuring four."], ["2003.03.22", "India", "Lever", 2, 0, "Two civilians are brutally abducted from their home and shot to death by Islamic terrorists."], ["2003.03.22", "India", "Surankote", 1, 2, "Lashkar-e-Toiba terrorists invade a police officer's home and kill a young woman, injure two more."], ["2003.03.22", "Iraq", "Sayed Sadiq", 5, 8, "Ansar al-Islam suicide bomber kills five, including and ABC journalist and wounds eight others at a Kurdish checkpoint."], ["2003.03.23", "India", "Nadimarg", 24, 0, "Muslims militants cleanse a village of Hindus, ordering them out of their houses and opening up with machine guns.  The twenty-four dead include eleven women and two children. Eight of the victims were over 60.  An unknown number were wounded."], ["2003.03.23", "Kuwait", "Camp Penn.", 2, 11, "Muslim-American soldier throws three grenades into the tents of non-Muslim American soldiers.  Two are killed and eleven others are wounded."], ["2003.03.24", "Afghanistan", "Latkoo", 9, 6, "Taliban attack against a routine patrol leaves four dead and six injured.  In a separate incident in Yewar, Taliban terrorists captured five allied troops, slaughtered them and amputated their limbs."], ["2003.03.25", "India", "Chasana", 1, 3, "A woman is killed inside her home by the Mujahideen."], ["2003.03.25", "Philippines", "Carmen", 2, 0, "Islamists stop a cargo truck, tie up the Christian driver and his helper then shoot them to death."], ["2003.03.26", "Algeria", "Mefta", 9, 0, "Nine civilians are slaughtered by Muslim fundamentalists on an isolated road between two towns."], ["2003.03.26", "Chechnya", "Grozny", 2, 0, "Muslim rebels stop a car driven by the brother of a government minister and kill him along with his female passenger."], ["2003.03.26", "Chechnya", "Grozny", 4, 3, "Rebel landmine planted in a city street kills four Russians and injures three."], ["2003.03.26", "India", "Ahmadabad", 1, 0, "Hindu political leader assassinated by Muslim gunmen on a motorcycle."], ["2003.03.26", "India", "Jammu", 1, 6, "Militant bomb attack kills the driver of an oil tanker and injures six others."], ["2003.03.26", "Philippines", "M'lang", 7, 5, "Muslims blast Christian village with RPGs, killing seven, including a six-year-old child and injuring five others."], ["2003.03.27", "Algeria", "Chiffa", 4, 4, "Islamic fundamentalists invade a family home, kill the parents and injure four children, then murder two youths who were outside the home at the time."], ["2003.03.27", "Algeria", "Chtathia", 8, 0, "Islamic fundamentalists kill eight villagers."], ["2003.03.27", "India", "Banihal", 1, 0, "A young girl is shot to death in her home by armed Muslims."], ["2003.03.27", "India", "Vilgam", 2, 0, "A man and his wife are dragged from their home by the Mujahideen and killed in the street."], ["2003.03.28", "Algeria", "Kfar Shatatiya", 12, 0, "Armed fundamentalists kill twelve villagers in a late night attack."], ["2003.03.28", "India", "Surankote", 2, 6, "Islamic terrorists kill a man and his son after a home invasion.  Later, in Pannad, six other civilians are captured and mutilated by having their noses cut off."], ["2003.03.29", "Iraq", "Najaf", 4, 0, "Four American soldiers are killed at a checkpoint by a suicide bomber."], ["2003.03.29", "Philippines", "Lambayong", 4, 0, "Another Muslim rebel attack against a civilian home, this time of a farmer, who is shot to death along with his wife and two young children."], ["2003.03.29", "Philippines", "Malamawi", 5, 4, "Muslim rebel throws dynamite into the house of a fisherman, killing his wife, two young children and two other relatives."], ["2003.03.30", "Israel", "Netanya", 0, 38, "Islamic Jihad terrorist walks into a beachfront cafe and blows himself up, injuring more than thirty civilians."], ["2003.03.31", "India", "Nowpora Jageer", 1, 0, "Mujahideen rebels assassinate a member of the ruling political party."], ["2003.04.01", "India", "Kashmir", 3, 0, "A 14-year-old girl is among three civilians murdered by the Mujahideen in separate attacks."], ["2003.04.01", "Iran", "Tehran", 1, 0, "Truck bomb against the British Embassy in Tehran leaves one dead."], ["2003.04.02", "India", "Anantnag", 1, 12, "Islamic militant lobs a grenade at a crowd of people, kills one and injures twelve."], ["2003.04.02", "India", "Shopian", 1, 19, "Eighteen people are injured when militant Muslims toss a grenade into a bus stand.  Elsewhere (Chewdara) a woman is killed and her daughter injured."], ["2003.04.02", "Philippines", "Davao", 16, 44, "Moro Islamic Front terrorist bomb kills sixteen people (including several children) at a wharf and injures at least forty-four"], ["2003.04.03", "Afghanistan", "Deh Rawood", 2, 0, "Six Taliban gunmen assassinate a political figure in the Afghan government along with his nephew."], ["2003.04.03", "India", "Dolipora", 3, 0, "Muslim terrorists invade a residence and kill a man, his wife and their 2-year-old daughter."], ["2003.04.03", "Philippines", "Basilan", 1, 2, "Abu Sayyaf rebels ambush a village convoy, kill one and injure two."], ["2003.04.04", "Chechnya", "Grozny", 8, 10, "Bomb attack on a passenger bus by Muslim rebels kills at least eight and leaves ten others injured."], ["2003.04.04", "Indonesia", "Wamena", 15, 0, "Indonesian military raids Christian town, burning Bibles and churches, killing two Baptist pastors along with at least thirteen others.  Other Christians were tortured."], ["2003.04.04", "Iraq", "Hadithah Dam", 3, 2, "In a particularly heinous attack, two female car bombers drive up to a U.S. checkpoint, scream for help, then kill the three soldiers rushing to their assistance.  Two others are injured."], ["2003.04.04", "Nigeria", "Fobur", 1, 4, "Armed Muslims attack a village, kill a woman and burn down the houses of Christians."], ["2003.04.04", "Pakistan", "Karachi", 1, 0, "A doctor is gunned down in a sectarian attack."], ["2003.04.05", "Afghanistan", "Jalalabad", 0, 5, "Five military personnel injured by Taliban terrorist bomb attack on a headquarters."], ["2003.04.05", "India", "Kehlil", 1, 5, "A civilian is killed in an IED blast."], ["2003.04.05", "Philippines", "Parang", 0, 11, "Another bomb planted by Muslim separatists explodes at a bus terminal, injuring eleven."], ["2003.04.05", "Philippines", "Tacurong", 2, 2, "Two people, including a town mayor, were killed and two more injured by a bomb which exploded in front of an electrical shop."], ["2003.04.06", "India", "Kharbatpora", 1, 0, "In a horrible attack, the Mujahideen pull a man from his home and shoot him to death in a field."], ["2003.04.06", "Iraq", "Haswa", 5, 2, "Muslim terrorists kill five civilians in a drive-by attack."], ["2003.04.07", "Chechnya", "Grozny", 8, 0, "Landmine planted by Muslim rebels in the heart of Grozny kills five policemen riding in a car and three civilian bystanders."], ["2003.04.07", "India", "Kamboli Dhok", 2, 0, "Two boys killed by terrorist landmine."], ["2003.04.09", "India", "Anantnag", 1, 0, "Hizb-ul-Mujahideen assassinate a political activist."], ["2003.04.10", "Iraq", "Baghdad", 0, 4, "Suicide bomber seriously injures four U.S. Marines guarding a checkpoint."], ["2003.04.10", "Iraq", "Najaf", 2, 0, "Mob attack inside a Mosque leaves two Shiite clerics dead."], ["2003.04.10", "Israel", "Moshav Bekaot", 2, 9, "Palestinian terrorists infiltrate an Israeli training camp and kill two, injure nine."], ["2003.04.10", "Philippines", "Maguindanao", 13, 1, "Thirteen soldiers were killed in an ambush by members of the Moro Islamic Liberation Front."], ["2003.04.11", "India", "Qazigund", 1, 31, "Three separate grenade attacks by Islamic militants kills a physician and injures another thirty-one people (Qazigund, Shopiyan & Anantnag)."], ["2003.04.13", "Afghanistan", "Kandahar", 1, 2, "One person is killed and two injured by Taliban loyalists attempting a political assassination in a motorcycle attack."], ["2003.04.13", "Afghanistan", "Khost", 4, 0, "Car bomb detonates prematurely killing the four terrorists inside, who include a former Taliban intelligence officer."], ["2003.04.13", "Afghanistan", "Matta Cheena", 4, 2, "15-year old Muslim kills four soldiers and injures two others in a grenade attack on a vehicle."], ["2003.04.13", "Afghanistan", "Spin Boldak", 2, 0, "Two Afghan soldiers are shot to death in a terrorist attack by extremists."], ["2003.04.13", "Chechnya", "Roshnichu", 2, 0, "Terrorist bomb kills two soldiers riding in a truck."], ["2003.04.13", "India", "Kasblari", 1, 1, "Two Hizb-ul-Mujahideen members force their way into a civilian home and shoot a woman to death.  Her husband is injured in the attack."], ["2003.04.14", "Philippines", "Kabacan", 1, 7, "Two Islamic rebels kill a political official and injure seven others in a grenade attack on a restaurant."], ["2003.04.15", "Chechnya", "Grozny", 17, 0, "Mujahideen warriors kill sixteen civilians in a filmed attack on two vehicles."], ["2003.04.15", "India", "Topa", 1, 0, "The Mujahideen assassinate a political figure."], ["2003.04.15", "Israel", "Karni Terminal", 2, 7, "Hamas gunman enters a place of business and sprays fire from an automatic weapon.  Two Israelis are killed and seven injured."], ["2003.04.16", "Philippines", "Cotabato", 0, 3, "Three women were injured by a Moro Islamic Liberation Front bomb placed on a passenger bus."], ["2003.04.17", "India", "Hassanwani", 1, 0, "A man is yanked from his home and shot to death by Islamic radicals."], ["2003.04.17", "India", "Magam", 1, 8, "Muslim militants kill one and injure eight civilians in a bombing."], ["2003.04.17", "India", "Udhampur", 1, 2, "Muslim militants attack a police station, kill one and injure two."], ["2003.04.18", "Eritrea", "Bisha", 6, 0, "British geologist murdered by Eritrean Islamic Jihad.  The same group also took credit for a landmine attack in February that killed five Eritrean soldiers on routine border patrol."], ["2003.04.18", "India", "Hadipora", 1, 0, "The bullet-riddled body of a fruit merchant is found two days after he was abducted."], ["2003.04.18", "Sri Lanka", "Kattaiparichchan", 2, 14, "Muslim grenade attack against civilians at a protest rally leaves two dead and fourteen injured."], ["2003.04.19", "India", "Malpora", 1, 1, "Two people are abducted by the Mujahideen.  The survivor is released after his ears, nose and tongue are chopped off."], ["2003.04.19", "Philippines", "Alamada", 6, 3, "Six civilians, including a 12-year old girl are killed in an ambush by Islamic rebels.  Three others are badly injured."], ["2003.04.22", "Afghanistan", "Khost", 3, 2, "Taliban rocket attack on an airport kills three and leave two injured."], ["2003.04.22", "India", "Tral", 6, 12, "Terrorist bombing attack by Muslim separatists kills six and injures more than a dozen."], ["2003.04.22", "Nigeria", "Kano", 7, 0, "Muslims set fire to a house, killing a Christian pastor and six other members of his family, including his wife and three children."], ["2003.04.23", "Chechnya", "Grozny", 6, 0, "Mujahideen fighters abduct three young men out hunting and torture them to death.  Also three government officials are shot to death while sitting in a car."], ["2003.04.23", "India", "Gondoh", 2, 0, "Terrorists abduct then kill two civilians out grazing their cattle."], ["2003.04.24", "India", "Tral", 1, 3, "Muslim bomb kills one policeman and injures three members of a bomb disposal unit."], ["2003.04.24", "Israel", "Kfar Saba", 1, 13, "al-Aqsa member detonates a bomb at a railway station, killing a 23-year old guard and injuring more than a dozen bystanders."], ["2003.04.24", "Philippines", "Lanao del Norte", 12, 0, "Islamic rebels attack a passenger bus, killing at least twelve (including the driver) and taking several hostages."], ["2003.04.25", "India", "Bandipore", 6, 6, "Two separate attacks by Muslim suicide bombers in the same town kills six and injures six."], ["2003.04.25", "India", "Srinagar", 3, 34, "Bomb thrown by Muslim separatists next to a courthouse kills three and injures at least thirty-four."], ["2003.04.26", "India", "Baramulla", 0, 11, "Terrorist bomb injures eleven, including two children.  The target of the bombing was a finance minister who opposed Muslim violence."], ["2003.04.26", "India", "Srinagar", 3, 7, "Fedayeen suicide attack on a radio station kills three guards and leaves seven others injured."], ["2003.04.27", "Indonesia", "Jakarta", 0, 11, "Bomb set by the Jemaah Islamiyah terrorist group detonates at a Kentucky Fried Chicken restaurant in Indonesia's main airport, injuring eleven people."], ["2003.04.29", "Afghanistan", "Spin Boldak", 3, 2, "Muslim fundamentalists attack a government building, killing three Afghan soldiers and wounding two."], ["2003.04.29", "Israel", "Tel Aviv", 3, 55, "Hamas (Islamic Resistance) suicide bomber blows up a night club, killing three Israelis and injuring at least fifty-five."], ["2003.04.30", "India", "Dodi", 1, 4, "A political activist is killed and four others injured in a Mujahideen attack."], ["2003.04.30", "India", "Kala Wachi", 0, 5, "Terrorist lobs grenade at children playing in a field, injuring five of them."], ["2003.04.30", "India", "Shogababa", 1, 3, "Islamic radicals attack a passenger bus, killing one and injuring three."], ["2003.04.30", "Philippines", "Crossing Salvo", 2, 6, "Muslim rebels attack two houses and an army post.  Two residents are killed, including a one-year old baby, and six others are injured."], ["2003.04.30", "Sudan", "Molli", 64, 0, "An attack by the Janjaweed on a village earlier in the month leaves at least sixty-four people dead and an unknown number injured. (2003)"], ["2003.05.01", "India", "Dangiwacha & Magraypora", 2, 0, "Mujahideen fighters kill two Muslims suspected of being informants for an anti-terror unit."], ["2003.05.02", "Philippines", "Pikit", 3, 0, "Moro Islamic Front rebels ambush and kill two soldiers and one civilian riding on motorcycles."], ["2003.05.03", "India", "Anantnag", 0, 15, "Fifteen people are injured when a militant Muslim tosses a grenade at a bus stop."], ["2003.05.04", "Algeria", "Medea", 2, 3, "Ambush by Islamic extremists on two civilian vehicles leaves two dead and three injured."], ["2003.05.04", "Philippines", "Siocon", 27, 23, "Muslim separatists attack a Christian village, firing on houses and a hospital.  At least twenty-seven are killed and about two dozen wounded.  Fifteen residents are taken hostage."], ["2003.05.05", "India", "Doda", 1, 17, "Islamic hardliners detonate small bomb in a crowded bus station, killing one and injuring seventeen civilians."], ["2003.05.05", "Israel", "Shilo", 1, 2, "al-Aqsa members ambush a vehicle, killing a father and seriously injuring his 6-year old daughter.  A soldier rushing to help was wounded as well."], ["2003.05.06", "Algeria", "Keddara", 6, 0, "Islamic fundamentalists lob a bomb into a security patrol, then proceed to stab and shoot the survivors.  Six are killed."], ["2003.05.06", "India", "Pulwama", 1, 30, "Terrorist lobs grenade at a police vehicle near a crowd of people.  One civilian is killed and about thirty others injured."], ["2003.05.07", "Afghanistan", "Deh Rawood", 1, 0, "Pro-Karzai cleric is gunned down by Taliban terrorists outside a mosque."], ["2003.05.07", "Chechnya", "Urus-Martan", 4, 0, "Mujahideen rebels ambush a police vehicle, shooting to death all four people inside."], ["2003.05.07", "India", "Baramulla", 2, 5, "Al-Mansoorian terrorists ambush a search patrol, killing two and injuring five."], ["2003.05.07", "Lebanon", "Tripoli", 1, 0, "Bomb left at the front door of a Christian missionary couple explodes, killing one person."], ["2003.05.09", "Chechnya", "Grozny", 1, 2, "Terrorist bomb kills a policeman and injures two other people."], ["2003.05.09", "India", "Argi", 1, 0, "The Mujahideen pull a civilian from his home and kill him after torture."], ["2003.05.09", "India", "Bijbehara", 3, 0, "Hizbul Mujahideen militants kill three political activists of the ruling (PDP) party."], ["2003.05.10", "Philippines", "Koronadal", 13, 40, "Abu Sayyaf suicide bomber kills thirteen and injures more than forty people in a crowded marketplace."], ["2003.05.11", "India", "Khiram", 1, 1, "A civilian is killed in his home, and his sister injured by Islamic radicals."], ["2003.05.11", "India", "Kupwara", 3, 7, "Fedayeen suicide squad attack on a bank leaves three dead and seven injured."], ["2003.05.11", "India", "Roulka", 1, 6, "A village police officer is killed and six other people injured in a grenade attack."], ["2003.05.11", "Israel", "Ofra", 1, 0, "Fatah gunmen kill a 53-year old father of six who was driving to work."], ["2003.05.12", "Chechnya", "Znamenskoye", 60, 100, "At least sixty people, including seven children, are killed and more than one hundred hospitalized when three suicide bombers detonates a truck bomb outside a government building in a residential area."], ["2003.05.12", "India", "Bela", 1, 0, "The Mujahideen kill an abducted civilian after keeping him hostage for ten days."], ["2003.05.12", "Saudi Arabia", "Riyadh", 35, 194, "Three groups of al Qaeda suicide bombers shoot their way into housing complexes.  The blasts leave thirty-five dead and nearly two-hundred injured."], ["2003.05.13", "India", "Kashmir", 3, 0, "Three civilians are killed by the Mujahideen in separate attacks.  One was beheaded.  Another was a homeowner's daughter."], ["2003.05.14", "Chechnya", "Iliskhan-Yurt", 14, 145, "Female suicide bomber kills at least fourteen civilians at a festival and leaves nearly one-hundred and fifty injured."], ["2003.05.14", "India", "Kashmir", 2, 0, "Two civilians are killed in separate attacks.  One in his home in Nagrota.  The other after being abducted from Khawas."], ["2003.05.14", "Yemen", "Jibla", 0, 4, "Terrorist bomb thrown into a courthouse where al-Qaeda militant was sentenced to death for killing three U.S. missionaries."], ["2003.05.15", "India", "Kashmir", 4, 0, "Three separate Mujahideen attacks leave four people dead."], ["2003.05.15", "Pakistan", "Faisalabad", 1, 11, "A sectarian attack on a religious procession leaves one dead and eleven injured."], ["2003.05.15", "Pakistan", "Karachi", 0, 5, "Bombs set at nineteen Shell gas stations in Pakistan injure at least five."], ["2003.05.16", "India", "Kashmir", 4, 3, "Four terror attacks across the district leave four dead and at least three injured."], ["2003.05.16", "Morocco", "Casablanca", 41, 65, "Four coordinated suicide attacks by al-Qaeda against Western and Jewish targets leave at least forty-one dead and more than sixty-five injured."], ["2003.05.17", "Algeria", "Seraidi", 3, 4, "Armed Islamic group ambushes a security patrol, killing three and wounding four."], ["2003.05.17", "India", "Bhadoon", 1, 1, "Militant Muslims invade a home and abduct a husband and wife.  The woman is later killed and the man badly injured."], ["2003.05.17", "India", "Srinagar", 2, 0, "Two policeman are killed in a terrorist attack by the Muslim Hamadania Brigade."], ["2003.05.17", "Israel", "Hebron", 2, 0, "Hamas (Islamic Resistance) suicide bomber positions himself near a young married couple on a romantic stroll and kills them both."], ["2003.05.17", "Pakistan", "Multan", 1, 0, "A Sunni is killed in a sectarian attack."], ["2003.05.18", "India", "Kupwara", 2, 0, "Two civilians are murdered by the Mujahideen."], ["2003.05.18", "India", "Mehratop", 6, 0, "A shepherd family of five is attacked and killed in their home by Muslim militants.  Victims include four children and two women.  Most were beheaded."], ["2003.05.18", "Israel", "Jerusalem", 7, 20, "Muslim suicide bomber, dressed in Jewish religious garb as a disguise, boards a passenger bus and kills seven.  About twenty others are hospitalized."], ["2003.05.19", "India", "Chamror", 3, 0, "Jihadis ambush a security patrol killing two members and a civilian."], ["2003.05.20", "India", "Gujjarpati Aargam", 2, 0, "Muslim radicals force their way into a home and slit the throats of a woman and her daughter."], ["2003.05.20", "India", "Tral", 1, 0, "A civilian is shot to death by the Mujahideen."], ["2003.05.20", "Israel", "Afula", 3, 70, "Hamas (Islamic Resistance) and Islamic Jihad vie for responsibility of a bombing in a shopping mall that kills three and injures over seventy."], ["2003.05.21", "India", "Anantnag", 1, 1, "Muslim grenade attack on a Christian convent kills one female teacher and injures another."], ["2003.05.21", "India", "GoI Chakri", 1, 3, "Terrorist attack on a Intelligence Bureau vehicle kills one and injures three."], ["2003.05.21", "India", "Sangam & Chogal", 2, 0, "In separate incidents Muslim separatists abduct and kill two civilians."], ["2003.05.22", "Sudan", "Longochok", 59, 0, "Islamic troops attack a Christian village, burning homes and killing at least fifty-nine villagers.  They also take captive several women and children (some of whom are killed later)."], ["2003.05.23", "Israel", "Gaza", 0, 8, "Hamas detonates pipe bomb under a bus.  Eight passengers are hospitalized."], ["2003.05.23", "Pakistan", "Karachi", 1, 8, "A sectarian clash leaves a 15-year-old boy dead and eight others injured."], ["2003.05.24", "Chechnya", "Grozny", 14, 0, "The Mujahideen ambush a convoy and slaughter fourteen people."], ["2003.05.25", "Algeria", "Boukaat El Maqam", 8, 0, "Armed Islamic militants kill eight people in western Algeria."], ["2003.05.25", "India", "Jul-Sheeri", 2, 0, "Two people are killed inside their home after Muslim radicals force entry."], ["2003.05.25", "India", "Rajouri", 5, 0, "Muslim rebels kill five members of a shepherd family, including a mother and three of her children."], ["2003.05.26", "Algeria", "Chlef", 14, 0, "Islamics kill fourteen people, all from the same family.  The victims, who include children aged 18-months to 17-years all had their throats slit."], ["2003.05.26", "India", "Bandipore", 3, 0, "Muslim rebels invade a home and kill three members of a family."], ["2003.05.27", "India", "Arin Dardpora", 3, 0, "The Mujahideen invade a home and kill a man, his wife and elderly father."], ["2003.05.27", "India", "Tararan Wali", 1, 2, "A man is killed, and his wife and son seriously injured when Islamists open fire on their home."], ["2003.05.29", "Indonesia", "Marowo", 1, 1, "Muslim terrorists gun down a man for traveling with his Christian brother-in-law."], ["2003.05.29", "Philippines", "Cotabato", 5, 0, "Moro Islamic fighters raid three Christian villages, killing five civilians."], ["2003.05.30", "Chechnya", "Khankala", 7, 15, "Muslim rebels explode a bomb under a bus, killing seven and injuring fifteen."], ["2003.05.30", "India", "Hiltak & Kandi", 3, 0, "Jihad terrorists kill three, including a father and son."], ["2003.05.30", "India", "Karyot", 2, 0, "Two school students are killed in a mine attack by militant Muslims."], ["2003.05.30", "India", "Kashmir", 4, 3, "Four civilians are killed in three separate Mujahideen attacks."], ["2003.05.31", "Pakistan", "Quetta", 1, 1, "Sunni motorcyclists open fire on the car of a Shiite cleric, wounding him and killing his son."], ["2003.05.31", "Saudi Arabia", "Turba", 2, 2, "Two al-Qaeda members throw a bomb at Saudi security personnel, killing two and injuring two."], ["2003.06.01", "India", "Bhatta Dhar", 3, 0, "Militant Muslims abduct and kill three civilians.  Two were brothers grazing their cattle at the time."], ["2003.06.02", "India", "Jammu", 4, 0, "Four civilians are killed in separate attacks by Islamic terrorists, including one who is beheaded."], ["2003.06.02", "Indonesia", "Kapompa", 1, 1, "Muslim attack on a Christian village leaves one dead and at least one other injured."], ["2003.06.03", "India", "Kishtwar", 2, 0, "A man is killed in his home by the Mujahideen, who had abducted and murdered a second person earlier."], ["2003.06.03", "Kosovo", "Obilic", 3, 0, "Three members of a Serb family, including an elderly couple, are beaten to death in their beds by Muslim attackers."], ["2003.06.04", "Algeria", "Beni Douala", 8, 0, "Islamic militants kill eight policeman in an ambush."], ["2003.06.04", "Algeria", "Boumedefaa", 12, 2, "Twelve people are murdered and two more injured by Islamic extremists on a remote highway."], ["2003.06.04", "India", "Malat", 1, 0, "Lashkar-e-Toiba terrorists shoot a civilian to death in captivity."], ["2003.06.05", "Afghanistan", "Kandahar", 9, 0, "Nine people are killed by a Taliban attack."], ["2003.06.05", "Chechnya", "North Border", 17, 12, "Female Fedayeen suicide bomber blows up a bus containing civilians and military personnel.  At least seventeen are killed and more than a dozen injured."], ["2003.06.07", "India", "Chrung", 1, 3, "An AK-47 attack on a group of civilians by Lashkar-e-Toiba terrorists leaves at least one civilian dead."], ["2003.06.07", "India", "Samot", 3, 1, "Muslim terrorists ambush a wedding party, killing three civilians and critically wounding a fourth."], ["2003.06.07", "Turkey", "Yaylim", 1, 0, "A young woman finally dies after clinging to life for seven months in a coma following a stoning for becoming pregnant."], ["2003.06.08", "Afghanistan", "Kabul", 5, 11, "Suicide bombing attack against a bus carrying international peacekeepers kills four Germans and injures at least a dozen more. One passerby was also killed."], ["2003.06.08", "India", "Bhillwar", 4, 0, "Muslim militants kidnap and brutally execute four Hindu villagers."], ["2003.06.08", "India", "Machipora-Handwara", 1, 0, "Radical Muslims force their way into the home of a widow and shoot her to death."], ["2003.06.08", "India", "Pasri Adda", 1, 0, "Hizb-ul Mujahideen terrorists responsible for the murder of a government worker."], ["2003.06.08", "Israel", "Erez", 5, 4, "Gunmen from three different Islamic terrorist groups, disguised as IDF soldiers, open fire on a checkpoint in Gaza, killing four soldiers and wounding four others.  A fifth soldier is killed in Hebron."], ["2003.06.08", "Nigeria", "Numan", 1, 0, "Female Christian pastor stabbed to death by a radical Muslim as she was returning home from work (2003)."], ["2003.06.08", "Pakistan", "Quetta", 12, 9, "Sunni terrorists on motorcycles pull along side a truck full of policemen from the minority Shiite faith and spray them with automatic weapons.  Twelve are killed, nine injured."], ["2003.06.09", "Chechnya", "Dyshne-Vedeno", 2, 9, "Mujahideen bomb attack kills two policeman and injures nine more."], ["2003.06.09", "India", "Kashmir", 2, 0, "Two civilians are abducted and murdered by the Mujahideen in separate incidents (Karoos & Wanigam-Tragbal)."], ["2003.06.10", "India", "Kasbrari", 1, 0, "A government official is assassinated by Islamists."], ["2003.06.11", "Israel", "Jerusalem", 16, 112, "Hamas (Islamic Resistance) bomber, disguised as an Orthodox Jew blows up a bus, killing sixteen and injuring at least one-hundred and twelve."], ["2003.06.12", "Afghanistan", "Terin Kot", 9, 6, "Nine Sunni Muslims were killed and at least six others wounded in a religiously motivated attack by followers of the Shiite Muslim faith."], ["2003.06.12", "Algeria", "Batna", 3, 0, "Islamic extremists slit the throats of three captured civilians."], ["2003.06.12", "Algeria", "M'sila", 2, 0, "Two people, including a deputy mayor are assassinated by armed Islamists."], ["2003.06.12", "India", "Kokernag", 2, 5, "Terrorist blast kills two Indian soldiers and injures five more."], ["2003.06.12", "India", "Pazalpora", 3, 0, "Two civilians are abducted and slaughtered by the Mujahideen.  Another civilian suffers the same fate in Angmattipora."], ["2003.06.12", "Pakistan", "Karachi", 2, 0, "In separate incidents a Sunni activist and a civil engineer are killed in sectarian violence."], ["2003.06.13", "India", "Kupwara", 3, 1, "Mujahideen militants kill three civilians, including two women, after forcing their way into a home."], ["2003.06.14", "Algeria", "El-Youssoufia", 8, 2, "Attack by armed Islamic group leaves eight security force personnel dead and two wounded."], ["2003.06.16", "Algeria", "Tizi N'Tleta", 4, 1, "Four policemen are killed, and another injured, by terrorist bombing."], ["2003.06.16", "India", "Mangota", 1, 0, "Terrorists invade a home and kill one of the women living there."], ["2003.06.17", "India", "Khiram & Shopian", 3, 3, "In separate incidents, Muslim militants assassinate the son of a local politician in his home then kill two more people by setting a bomb in a market district."], ["2003.06.17", "Israel", "Kibbutz Eyal", 1, 3, "Palestinian gunmen open fire on a civilian car, killing a 7-year old girl and wounding her 3-year old sister along with her brother and grandfather."], ["2003.06.18", "Chechnya", "Grozny", 4, 1, "Shooting attack on a car by Muslim militants leaves four dead and one wounded."], ["2003.06.18", "India", "Jameri", 2, 0, "Hizb-ul-Mujahideen goes on a rampage in a village, setting homes on fire and killing two people, including a teenage boy."], ["2003.06.19", "Algeria", "El Ancer", 4, 0, "Four people killed by armed Islamic extremists in an attack on a civilian vehicle."], ["2003.06.19", "Iraq", "Baghdad", 1, 2, "Fedayeen attack on an ambulance kills one American and injures two more."], ["2003.06.19", "Israel", "Moshav Sde Terumot", 1, 0, "Father of six working in his grocery is killed by an Islamic Jihad suicide bomber."], ["2003.06.20", "Algeria", "Theniet El-Abed", 1, 3, "One killed and three others injured by a bomb set by Islamic fundamentalists."], ["2003.06.20", "Chechnya", "Grozny", 6, 36, "Suicide bombing by two Muslims kills six policeman and injures at least three dozen civilians."], ["2003.06.20", "India", "Dodi & Samot", 2, 0, "In separate incidents, two women are abducted and killed by Muslim terrorists.  One was shot to death and the other had poison injected into her."], ["2003.06.20", "India", "Pulwama", 0, 27, "Mujahideen grenade attack in a crowded marketplace injures twenty-seven."], ["2003.06.20", "Israel", "Ofra", 1, 3, "Israeli-American is killed by Hamas (Islamic Resistance) gunmen when driving through the West Bank with his elderly parents (also shot) and his wife."], ["2003.06.20", "Pakistan", "Quetta", 1, 0, "Shia leader gunned down by Sunni rivals."], ["2003.06.21", "Algeria", "Merjet el-Abed", 5, 0, "Five members of the same family, including three children were slaughtered by Islamic fundamentalists in an attack on a village."], ["2003.06.22", "India", "Shopian", 3, 0, "Three civilians are murdered by Muslim radicals, including a 34-year-old woman who is tortured before being killed."], ["2003.06.23", "India", "Lassipora", 3, 1, "Terrorists invade the home of an 80-year old man and kill him along with his son and daughter-in-law."], ["2003.06.23", "India", "Pulwama", 2, 33, "Muslim militants explode a bomb near a crowded bus, killing two civilians and injuring thirty-three others."], ["2003.06.23", "India", "Sam Samad", 1, 0, "A 20-year-old woman is abducted, sexually assaulted, and murdered by Mujahideen, who say that she was an informer."], ["2003.06.23", "Israel", "Gaza", 4, 4, "Four are killed, four others injured when a bomb carried by the Al Aqsa Martyrs Brigade explodes prematurely."], ["2003.06.24", "Iraq", "Amarah", 6, 8, "Six British military policemen are murdered by a Shiite mob.  Eight others are wounded in the attack."], ["2003.06.25", "Afghanistan", "Spin Boldak", 2, 1, "Taliban ambush a military vehicle in route and kill two of the occupants with point-blank machine gun fire."], ["2003.06.25", "Algeria", "Tablat", 8, 1, "Islamic fundamentalists kill eight villagers, including six children.  They also kidnap a 24-year old woman."], ["2003.06.25", "India", "Kulgam", 2, 1, "Muslim terrorist attack on a remote army camp kills two and injures one."], ["2003.06.25", "India", "Wagbal & Kishtwar", 2, 0, "Two civilians are killed by Muslim terrorists in separate incidents.  One involved a home invasion and the other was a shepherd who was abducted while grazing his cattle."], ["2003.06.26", "Iraq", "Baghdad", 1, 1, "Explosive device near a truck carrying Iraqi electrical workers kills one and injures one."], ["2003.06.26", "Israel", "Baqa al-Gharbiya", 1, 0, "Israeli security guard is shot and killed by an Arab youth sent by al-Aqsa martyrs brigade."], ["2003.06.28", "Algeria", "El Milia", 1, 0, "Former Islamist, who renounced extremists views, is kidnapped by Islamists and is murdered by having his throat cut."], ["2003.06.28", "India", "Chalpora Wadipora", 1, 0, "Civilian kidnapped, tortured and killed by Muslim terrorists."], ["2003.06.28", "India", "Jammu", 12, 8, "Fedayeen suicide attack on a military barracks kills twelve men and injures seven.  Most of the victims were sleeping when attacked."], ["2003.06.29", "India", "Kharoosa", 1, 0, "A man is killed in his home by the Mujahideen."], ["2003.06.30", "Chechnya", "Starye Atagi", 4, 8, "Terrorist attack on an administrative building leaves four dead and eight wounded."], ["2003.06.30", "India", "Seri Chawana", 2, 1, "Two civilians killed by Muslim terrorists, one other is injured."], ["2003.06.30", "India", "Swara Chalil", 1, 0, "Radical Muslims drag a 19-year-old girl out of her home and shoot her to death in the street."], ["2003.06.30", "Iraq", "Fallujah", 5, 15, "Explosives hidden in a Mosque for use against American explode prematurely killing at least five and injuring more than fifteen."], ["2003.06.30", "Israel", "Jenin", 1, 0, "One day after agreeing to a cease-fire, Fatah gunmen open up on a truck carrying foreign construction workers.  One Bulgarian is killed."], ["2003.07.01", "India", "Doda", 1, 10, "A civilian is gunned down by the Mujahideen, who injure ten civilians in a separate grenade attack."], ["2003.07.02", "India", "Balas Dharam", 1, 1, "A man is killed, and his wife injured in a Jihad attack on their home."], ["2003.07.02", "India", "Handwara", 2, 0, "Two civilians are kidnapped and executed by Muslim radicals."], ["2003.07.02", "India", "Shopian", 2, 0, "The Jaish-e-Mohammed abducts and murders two police officers."], ["2003.07.03", "Iraq", "Baghdad", 1, 0, "U.S. soldier guarding the National Museum is gunned down by a sniper."], ["2003.07.04", "India", "Larnu", 4, 20, "Islamic terrorists toss a grenade and open fire into a political meeting, killing two people and wounding twenty.  Two others later die of injuries."], ["2003.07.04", "Pakistan", "Quetta", 53, 60, "Sunni attack on a Shia Mosque, involving suicide bombers and automatic weapons, leaves fifty-three worshipers dead and at least sixty more injured."], ["2003.07.05", "Algeria", "Tizi Ouzou", 3, 0, "Three government officials killed by Islamic fundamentalists at a roadblock"], ["2003.07.05", "India", "Doda", 2, 0, "Two civilians are gunned down in separate Mujahideen attacks."], ["2003.07.05", "Iraq", "Baghdad", 1, 0, "24-year old British journalist shot in the back of the head by Fedayeen assassin outside a museum."], ["2003.07.05", "Iraq", "Ramadi", 7, 40, "Jihad terrorist bombing leaves seven Iraqi police recruits dead.  More than forty are injured."], ["2003.07.05", "Pakistan", "Ranala Kot", 1, 0, "Catholic priest, who received death threats from fundamentalist Muslims, is shot and killed in his home."], ["2003.07.05", "Russia", "Moscow", 14, 24, "Two Fedayeen suicide bombers, both female, kill fourteen young people and injure at least two dozen others attending a rock concert."], ["2003.07.06", "Chechnya", "Grozny", 3, 2, "Bomb planted by Muslim rebels in a passenger car kills three policemen and injures two."], ["2003.07.06", "India", "Baramulla", 3, 1, "Three people, including two children, are killed in two separate incidents."], ["2003.07.06", "Iraq", "Baghdad", 1, 0, "U.S. soldier guarding Baghdad University is shot in the back and killed."], ["2003.07.06", "Israel", "Ramallah", 1, 0, "Palestinian terrorists shoot and kill a 35-year old man suspected of being an Israeli collaborator."], ["2003.07.07", "India", "Nowshera", 5, 1, "Three Islamic gunmen open fire on a group of Hindu villagers, killing five, including two women, and critically injuring one."], ["2003.07.08", "Israel", "Kfar Yavetz", 1, 3, "Suicide bomber identified as Islamic Jihad kills a 65-year old grandmother of twenty watching TV in her house.  Three of her grandchildren are injured."], ["2003.07.09", "India", "Kulgam", 1, 0, "Hizbul Mujahideen terrorists assassinate political activist."], ["2003.07.10", "India", "Doda", 2, 0, "Muslim militants kill a civilian and one of their own who was attempting to surrender."], ["2003.07.10", "India", "Khara", 1, 0, "The Hizb-ul-Mujahideen kill a civilian at his village."], ["2003.07.10", "Indonesia", "Kawua", 0, 5, "A Christian-owned restaurant is bombed.  Five people suffer injuries including a child."], ["2003.07.10", "Indonesia", "Sulawesi", 1, 0, "Muslims attack and shoot a Christian to death as he was working his farm."], ["2003.07.10", "Iran", "Tehran", 1, 0, "The Iranian government beats a Canadian journalist to death, who was imprisoned for taking pictures of student protesters."], ["2003.07.10", "Philippines", "Koronadal", 3, 29, "Three people, including two children, are killed and about two dozen others wounded by a Moro Islamic terrorist bombing in a marketplace."], ["2003.07.10", "Russia", "Moscow", 1, 0, "Security officer attempting to defuse a female Fedayeen bomb is killed."], ["2003.07.11", "Pakistan", "Karachi", 2, 0, "Two office workers are killed in Islamic bombing attack against a Crown Plaza building."], ["2003.07.12", "Chechnya", "Alkhan-Kala", 3, 2, "Three sappers are killed in a terrorist bombing attack."], ["2003.07.12", "Chechnya", "Benoi-Vedeno", 3, 3, "Terrorist landmine kills three Russian servicemen and leaves another three injured."], ["2003.07.12", "Chechnya", "Shatoi", 9, 5, "Fedayeen fighters ambush a patrol vehicle with a landmine then rush in with automatic weapons and grenades.  Nine Russians are dead and five injured."], ["2003.07.12", "India", "Chak Banola", 1, 3, "A militant Muslim group attacks a police station, killing one of the officers and injuring three others."], ["2003.07.12", "India", "Kashmir", 1, 8, "The Mujahideen kill a civilian in Doda and injure eight others, including five women, in a Baramulla grenade attack on a bus."], ["2003.07.13", "India", "Machil", 2, 0, "Militant Muslim attack on a security patrol leaves two SF personnel dead."], ["2003.07.13", "India", "Surankote and Mendhar", 3, 0, "Three civilians are killed in their homes by Muslim militants."], ["2003.07.14", "Afghanistan", "Kandahar", 5, 2, "Taliban attack on a police station with automatic weapons kills five and injures at least two."], ["2003.07.14", "Algeria", "Tizi Ouzou", 3, 0, "Islamic extremists ambush a truck and kill three bank employees riding inside."], ["2003.07.14", "India", "Hapat Nar", 2, 3, "An ambush on a security patrol leaves two dead and three injured."], ["2003.07.15", "India", "Bomthan", 4, 0, "Islamic terrorists kill four civilians in four separate encounters (Bomthan, Zadoora, Tampora and SM Pura) on the same day."], ["2003.07.15", "Israel", "Tel Aviv", 1, 2, "al-Aqsa Fatah terrorist stabs three civilians, including one woman.  The Israeli killed used his body to successfully shield the woman from the Muslim's knife."], ["2003.07.16", "India", "Beerwah", 1, 1, "A man is killed inside his home by the Mujahideen, who also injure his young son in the attack."], ["2003.07.16", "India", "Guzarbal Bonkoot", 2, 0, "A woman is among two people kidnapped from their home by Islamic radicals and murdered in captivity."], ["2003.07.16", "Iraq", "Haditha", 2, 0, "Pro-American mayor is shot to death, along with his son, while sitting in his car."], ["2003.07.16", "Pakistan", "Hyderabad", 0, 11, "Islamic fundamentalists thought to be behind a bombing at a hospital that injures eleven."], ["2003.07.17", "Algeria", "Skikda", 4, 0, "Four civilians killed by Islamic extremists at a roadblock."], ["2003.07.17", "Chechnya", "Khasavyurt", 4, 15, "Two police personnel, a pregnant woman and a child were killed in a terrorist bombing by Muslim rebels.  Fifteen others were injured."], ["2003.07.17", "Dagestan", "Unknown", 3, 0, "Terrorist bombing near a police station kills at least three people, including a pregnant woman."], ["2003.07.17", "India", "Harong", 3, 0, "Hizb-ul-Mujahideen terrorists drag three Hindu villagers, including a woman, out of their houses and execute them."], ["2003.07.18", "Afghanistan", "Khost", 8, 1, "Eight Afghan soldiers are killed by Taliban militants in a mine explosion."], ["2003.07.18", "India", "Shopian", 2, 0, "Two people, including a young girl, are shot to death in their homes by the Mujahideen."], ["2003.07.18", "Iraq", "Fallujah", 1, 0, "Homemade terrorist bomb kills U.S soldier."], ["2003.07.19", "India", "Nag Batra & Khour", 2, 1, "In two separate attacks Islamic terrorists kill two villagers and injure a young girl."], ["2003.07.19", "India", "Tral", 0, 19, "Nineteen people are injured when Muslim militant hurls grenade into a crowded marketplace."], ["2003.07.21", "Chechnya", "Assinovskya", 1, 4, "Bus bombing kills one policeman and seriously injures four others."], ["2003.07.21", "Iraq", "Baghdad", 2, 3, "Sunni attack kills a soldier and an interpreter.  Three others are injured."], ["2003.07.22", "India", "Aknoor", 8, 12, "Fedayeen suicide attack on an Indian army camp kills eight and wounds at least a dozen."], ["2003.07.22", "India", "Banganga", 7, 42, "Brazen terrorist attack by Muslim militants on a crowd of Hindu villagers who had gathered to receive food kills at least seven and injures more than forty."], ["2003.07.22", "Iraq", "Hilla", 1, 1, "Shooting attack on a plainly marked Red Cross vehicle kills one staff member and injures the driver."], ["2003.07.25", "India", "Kashmir", 4, 0, "In separate incidents (Saliya, Khandaypora, Kathsoo, Barath) Muslim terrorists target and kill four civilians."], ["2003.07.25", "India", "Morha Bachchai", 2, 4, "Jihadis ambush a security patrol, killing two and injuring four."], ["2003.07.25", "Kosovo", "Kosovska Mitrovica", 1, 4, "Grenade attack on police station kills one and injures four."], ["2003.07.25", "Sudan", "Shoba East", 42, 10, "Government troops and Arab militias loot and destroy two African villages, killing at least forty-two civilians."], ["2003.07.26", "Chechnya", "Grozny", 1, 1, "Muslim militants attempt a political assassination, leaving one dead and one injured."], ["2003.07.26", "India", "Narkote", 1, 0, "A civilian is abducted and brutally killed by the Mujahideen."], ["2003.07.26", "Iraq", "Baqubah", 3, 4, "Sunni terrorist throws grenade into crowd of soldiers guarding a children's hospital from looters.  Three are killed and four badly injured."], ["2003.07.27", "Afghanistan", "Girishk", 6, 0, "Six afghan policeman are killed in an al-Qaeda attack on their vehicle."], ["2003.07.27", "India", "Thanna Mandi", 1, 12, "A village headsmen is killed by the Mujahideen.  Twelve civilians sustain injuries from an Anantnag grenade attack on a bus stop."], ["2003.07.27", "Pakistan", "Miranshah", 0, 9, "Islamic fundamentalists detonate a bomb under a vehicle at a crowded bazaar.  Nine people are injured."], ["2003.07.28", "India", "Mumbai", 2, 47, "Lashkar-e-Taiba terrorists plant a bomb on a passenger bus, killing two and injuring at least forty-seven."], ["2003.07.28", "India", "Surankote", 1, 1, "A girl is killed in her home, in an attack that also injures her mother."], ["2003.07.28", "Pakistan", "Saidgai", 3, 4, "Three people, including a woman, are killed in an Islamist bombing at a residence."], ["2003.07.29", "Afghanistan", "Nakhohni", 1, 0, "Religious cleric assassinated by Taliban gunmen."], ["2003.07.29", "Afghanistan", "Spin Kotal", 1, 1, "Taliban elements attack an international relief agency vehicle and kill the driver."], ["2003.07.29", "Algeria", "Sahara", 1, 0, "German woman, one of fifteen hostages held by Islamic fundamentalists in the Sahara desert, dies of heat stroke."], ["2003.07.29", "Chechnya", "Ingushetia", 5, 0, "Terrorist landmine kills five Russians."], ["2003.07.29", "India", "Bandipore", 1, 1, "Militant Muslims invade a civilian's home.  They kill one of the resident's daughters and injure another."], ["2003.07.29", "Pal. Auth.", "West Bank", 1, 0, "Muslim extremists abduct a Christian convert, butcher him and then return his body to his children in pieces."], ["2003.07.29", "Philippines", "Patikul", 3, 0, "Three civilians are gunned down by Abu Sayyaf terrorists in the Philippines."], ["2003.07.30", "Afghanistan", "Paktika", 1, 2, "A civilian was killed in his home by a Taliban bombing that also injured two policemen."], ["2003.07.30", "India", "Kokernag", 1, 0, "In a brutal attack, the Mujahideen kidnap and kill a civilian."], ["2003.07.31", "Algeria", "Jijel", 3, 3, "Islamic fundamentalists attack a group of civilians.  Three are killed and three injured."], ["2003.07.31", "Chechnya", "Pervomayskoy", 4, 0, "Four federal investigators are killed by a terrorist attack in Chechnya."], ["2003.07.31", "India", "Shopian", 1, 0, "A man is shot to death by the Mujahideen."], ["2003.08.01", "India", "Khablan", 1, 1, "The Mujahideen invade a home and beat a young girl to death.  Her sister is severely injured as well."], ["2003.08.01", "Russia", "Mozdok", 50, 100, "Muslim suicide bomber drives into a hospital and kills at least fifty.  More than one hundred are injured in the blast."], ["2003.08.02", "Iraq", "Baghdad", 3, 3, "Two soldiers and an interpreter are killed when Sunni terrorist detonate a landmine under their vehicle."], ["2003.08.03", "Algeria", "Chlef", 3, 0, "Islamic extremists stop a civilian vehicle, spray it with machine-gun fire, then slit the throats of the three occupants."], ["2003.08.03", "India", "Buntrchan", 1, 0, "A man is killed in his home by the Mujahideen."], ["2003.08.03", "Israel", "Jerusalem", 0, 4, "Palestinian gunmen open up on a car carrying a mother and three children.  All were wounded in the attack."], ["2003.08.04", "India", "Mahore", 2, 0, "Terrorists kill two people, including a teacher attending a wedding."], ["2003.08.05", "Indonesia", "Jakarta", 14, 100, "A successful Jemaah Islamiyah suicide attack on a Western hotel in Jakarta kills ten and injures over one hundred people."], ["2003.08.05", "Iraq", "Tikrit", 1, 0, "American oil worker killed by remote-controlled bomb."], ["2003.08.06", "India", "Sangrampora", 2, 0, "A man and his son are pulled out of their home and beheaded by Jihadis."], ["2003.08.06", "USA", "Houston, TX", 1, 0, "After undergoing a religious revival, a Saudi college student slashes the throat of a Jewish student with a 4\" butterfly knife, nearly decapitating the young man."], ["2003.08.07", "Afghanistan", "Desho", 7, 0, "Six Afghan soldiers and a driver are killed by a Taliban attack on a government building."], ["2003.08.07", "India", "Srinagar", 2, 5, "Militant Islamic grenade attack on a military vehicle in a crowded marketplace kills two and injures at least five."], ["2003.08.07", "India", "Tral & Dhok", 3, 0, "Islamic militants abduct and kill two citizens from Tral.  In Dhok, they kill another civilian in his house."], ["2003.08.07", "Ingushetia", "Border", 6, 7, "Jihad ambush on a vehicle kills six soldiers on routine patrol and injures another seven."], ["2003.08.07", "Iraq", "Baghdad", 16, 43, "At least sixteen people are confirmed dead and more than forty injured by a terrorist car bomb that exploded outside the Jordanian embassy."], ["2003.08.09", "India", "Kasblari", 2, 0, "The Mujahideen force their way into a house and kill a young man and his father."], ["2003.08.09", "Pakistan", "Karachi", 5, 0, "Five brothers shot to death in an armed attack outside a mosque."], ["2003.08.10", "India", "Kupwara", 2, 0, "Two civilians are murdered by Muslim terrorists.  One is shot in his home (Drubgam), the other is abducted and later killed (Kandi Khas)."], ["2003.08.10", "Pakistan", "Lahore", 5, 0, "Five women were murdered in their home by a man who 'doubted their modesty (Muslim 'honor' killing)."], ["2003.08.11", "India", "Kandi", 1, 0, "A woman is killed inside her home by the Mujahideen."], ["2003.08.11", "Israel", "Shlomi", 1, 4, "Hezbollah rocket attack on a village kills a 16 year-old and leaves four other civilians injured."], ["2003.08.12", "Afghanistan", "Ghazni", 2, 3, "Two Red Crescent aid workers are killed and three others wounded when their ambulance (bearing the insignia of the Red Cross, however) is attacked by Taliban loyalists."], ["2003.08.12", "India", "Budhan", 1, 0, "A civilian is abducted and killed by Islamic terrorists."], ["2003.08.12", "Israel", "Ariel", 1, 2, "Hamas suicide bomber kills one Israeli civilian and injures two others"], ["2003.08.12", "Israel", "Tel Aviv", 1, 10, "Fatah suicide bomber kills a 42 year-old father of two in a shopping mall.  Several others are injured."], ["2003.08.13", "Afghanistan", "Kabul", 2, 1, "Two Islamic university students are killed and another injured when a bomb that they were making for a terrorist attack explodes prematurely."], ["2003.08.13", "Afghanistan", "Lashkargah", 15, 5, "Taliban bomb on a passenger bus kills fifteen, including six children."], ["2003.08.13", "Chechnya", "Vedeno", 5, 3, "Five Russians are killed and three injured in IED attack."], ["2003.08.13", "India", "Bandipore", 3, 48, "Al-Mansoorain terrorists kill three people and injure nearly fifty others with an IED."], ["2003.08.13", "India", "Poonch", 2, 0, "Two civilians are killed in separate Jihad attacks, including one in a bombing at his shop."], ["2003.08.13", "Kosovo", "Gorazdevac", 2, 4, "Kosovo Muslims waiting in the bushes with automatic weapons ambush Serbian boys (ages 10 to 20) who were returning from a swimming trip.  Two are killed and four injured."], ["2003.08.13", "Saudi Arabia", "Riyadh", 3, 2, "al-Qaeda gunmen kill three security force personnel and injure two in a shootout."], ["2003.08.14", "Chechnya", "Samachki", 2, 10, "Two Russian soldiers are killed and ten others wounded in attack by Fedayeen terrorists."], ["2003.08.14", "India", "Bandipore", 2, 40, "Muslim militants plant a bomb on a bicycle that goes off killing at least two and injuring more than forty."], ["2003.08.14", "India", "Kashmir", 2, 0, "Two civilians are murdered in their homes by the Mujahideen (Thamlot & Kandi)."], ["2003.08.14", "India", "Khudwani", 1, 7, "Grenade lobbed by Muslim terrorists at a police station bounces into passersby, killing one and injuring another seven."], ["2003.08.14", "Iraq", "Zubayr", 1, 2, "Terrorist attack on a military ambulance kills one British soldier and leaves two others badly injured."], ["2003.08.15", "India", "Pakherpora", 0, 16, "Sixteen civilians are injured when militant Muslims toss a grenade into the street."], ["2003.08.16", "India", "Kashmir", 3, 0, "Three civilians are murdered in separate attacks by the Mujahideen."], ["2003.08.16", "Iraq", "Baghdad", 6, 59, "Six Iraqis are killed and nearly sixty injured by attempted terrorist attack on a U.S. position using mortar bombs."], ["2003.08.16", "Pakistan", "Karachi", 2, 0, "Two Shia, both career professionals, are gunned down by Sunni assassins.  Interestingly, the Shiites retaliate against KFC."], ["2003.08.17", "Afghanistan", "Barmal (Patika)", 7, 0, "A large-scale attack on a police station in southeastern Afghanistan by Taliban insurgents leaves seven Afghans dead."], ["2003.08.17", "India", "Rajouri", 1, 0, "Muslims kidnap and cut off the head of a civilian."], ["2003.08.18", "Afghanistan", "Kharwar", 10, 0, "Ten Afghan policeman, returning from a funeral, were ambushed and killed by Taliban fundamentalists."], ["2003.08.18", "India", "Kashmir", 3, 0, "In separate incidents, Muslim terrorists kill three civilians, including the elderly father of a police constable. (Damhal Khushipora, Morha Handa, Bumlakhi)."], ["2003.08.19", "India", "Baramulla", 2, 0, "A fruit merchant is abducted and killed in one of two terror attacks."], ["2003.08.19", "Iraq", "Baghdad", 23, 100, "At least twenty-three people are killed, and more than one-hundred injured, by Fedayeen suicide bombing attack on a hotel."], ["2003.08.19", "Israel", "Jerusalem", 20, 100, "Hamas (Islamic Resistance) take credit for blowing up a civilian bus killing at least twenty, including five children and a mother of thirteen (along with her five-month old baby), and injuring more than one hundred, including about forty children."], ["2003.08.19", "Pakistan", "Rajouri", 1, 0, "A doctor is gunned down in a sectarian attack."], ["2003.08.20", "India", "Naristan", 1, 0, "Islamic militants kidnap an 85-year-old man and kill him in captivity."], ["2003.08.20", "Iraq", "Tikrit", 1, 2, "An American interpreter is killed by a Sunni sniper and RPG attack, two others are injured."], ["2003.08.21", "Chechnya", "Grozny", 9, 2, "Muslim car bomb kills nine Russian soldiers and injures two more."], ["2003.08.22", "India", "Badikote", 1, 0, "The body of a young woman is found two days after she is kidnapped by the Mujahideen."], ["2003.08.22", "Pakistan", "Hyderabad", 0, 5, "Five people injured by a bomb placed under a restaurant."], ["2003.08.22", "Philippines", "Barangay Matarling", 1, 4, "Abu Sayyaf gunmen attack the house of a 37-year old Christian woman.  They kill her and injure four members of her family."], ["2003.08.23", "Afghanistan", "Dai Chupan", 5, 0, "Taliban attack on a truck carrying government soldiers leaves at least five dead."], ["2003.08.23", "Iraq", "Basra", 3, 1, "Fedayeen gunmen ambush a British vehicle with a flatbed truck, kill three and wound one."], ["2003.08.24", "Iraq", "Najaf", 3, 10, "Terrorists bomb the house of a Shi'ite leader, targeted for his moderate views.  The cleric survived, but three others are killed and ten injured."], ["2003.08.25", "India", "Katarmal", 3, 0, "Lashkar-e-Toiba terrorists force their way into a home and kill a man, his wife, and his daughter-in-law."], ["2003.08.25", "India", "Mumbai", 51, 156, "Two terrorist bombs in civilian areas kill at least fifty-one people and injure more than one-hundred and fifty.  Muslim student group behind the attack."], ["2003.08.25", "Russia", "Krasnodar", 3, 17, "Three people were killed in a series of bombings at a cafe and bus stop by Muslim terrorists."], ["2003.08.26", "Chechnya", "Grozny", 3, 0, "Three policemen were killed in a terrorist RPG attack."], ["2003.08.27", "Dagestan", "Makhachkala", 1, 1, "Islamic extremists place bomb on the roof of a car carrying a Russian minister.  The minister is killed and his driver badly injured."], ["2003.08.28", "Afghanistan", "Spin Boldak", 3, 0, "Three Afghan soldiers killed by a Taliban attack on a remote checkpoint."], ["2003.08.28", "India", "Bijbehara", 1, 2, "Militant Muslim lobs a grenade at a police vehicle, it misses, killing a bystander instead and injuring two others."], ["2003.08.28", "India", "Srinagar", 4, 0, "Three civilians were killed, along with a security officer, and an unknown number injured when Islamic terrorists attack a Hotel with grenades and firearms."], ["2003.08.29", "Iraq", "Najaf", 85, 142, "At least eighty-five people are killed in a car bombing by radical Islamists for the purpose of assassinating a moderate Shi'ite cleric.  At least one-hundred forty others are injured."], ["2003.08.29", "Israel", "Ramallah", 1, 1, "Israeli couple is attacked by Palestinian gunmen while driving.  The husband is killed and his 24-year old pregnant wife badly injured."], ["2003.08.30", "India", "Kashmir", 3, 0, "Two civilians are killed in Budgam by the Mujahideen, and another in his home in Kulgam."], ["2003.08.31", "India", "Handwara", 4, 0, "Lashkar-e-Toiba a search team, killing four members."], ["2003.08.31", "India", "Jugnu", 1, 0, "A woman is murdered inside her home by the Mujahideen."], ["2003.08.31", "Kosovo", "Gnjilane", 1, 5, "Terrorist grenade attack kills one Serbian, leaves five others injured."], ["2003.08.31", "Sudan", "Habila", 30, 0, "The Muslim Republic drops bombs on an African village earlier in the month, killing at least thirty civilians. (2003)"], ["2003.09.01", "India", "Jawahar Tunnel", 1, 3, "Bomb disposal specialist is killed, and three other people wounded, while attempting to defuse terrorist bomb."], ["2003.09.01", "Iraq", "Baghdad", 2, 1, "Sunni roadside bomb kills two military policemen and injures one other."], ["2003.09.02", "India", "Alla Kala", 3, 0, "Hizb-ul-Mujahideen terrorists kill three members of the same family in a home invasion, including a mother and her 14-year old son."], ["2003.09.02", "India", "Awantipora", 1, 20, "Terrorist bombing of a bus kills the driver and injures twenty passengers, including three women."], ["2003.09.02", "India", "Udhampur", 4, 0, "Four civilians, including a father and his two sons, are shot to death by militant Muslim terrorists."], ["2003.09.02", "Iraq", "Baghdad", 1, 10, "One Iraqi policeman was killed, and at least ten bystanders were injured when a car bomb exploded outside a police station."], ["2003.09.02", "Pakistan", "Karachi", 2, 0, "Two political activists murdered in a shooting attack by Islamic radicals."], ["2003.09.03", "India", "Chamalwas", 5, 0, "Militant Muslims break up a wedding party and kill five members of the same family including a child."], ["2003.09.03", "Iraq", "Ramadi", 1, 2, "Fedayeen suicide bombing kills an Iraqi interpreter and injures two U.S. soldiers."], ["2003.09.03", "Russia", "Kislovodsk", 5, 29, "Mujahideen terrorist bombing of a commuter train leaves five civilians dead and about thirty injured."], ["2003.09.04", "India", "Poonch", 1, 2, "An Indian woman is killed, and her two children injured, in a failed Fedayeen suicide attack on a military building."], ["2003.09.04", "Israel", "Jenin", 1, 4, "Palestinian gunmen kill an Israeli soldier and injure four more."], ["2003.09.04", "Pakistan", "Karachi", 5, 0, "Five people attending a funeral for two slain political activists are shot to death in a terrorist attack."], ["2003.09.05", "Afghanistan", "Nangrahar", 2, 19, "Two people are killed and another nineteen injured when terrorists throw grenades at a wedding party."], ["2003.09.05", "Algeria", "Mizrana Forest", 2, 3, "Islamic fundamentalists kill two Algerian soldiers and injure three others in a bombing."], ["2003.09.05", "Iraq", "Mosul", 1, 1, "A dedicated humanitarian and father of three is killed in a Sunni terrorist ambush while working for a charity organization that was working to clear mines in civilian areas."], ["2003.09.05", "Iraq", "al-Shab City", 0, 3, "Three Sunnis are injured by Shia shooting attack on a mosque."], ["2003.09.06", "India", "Srinagar", 7, 37, "Muslim car-bombing in a fruit market kills at least seven and injures over thirty-seven."], ["2003.09.06", "India", "Udhampur", 3, 6, "A Jihad attack on a remote police station leaves three people dead and six injured."], ["2003.09.08", "Afghanistan", "Ghazni", 4, 1, "Taliban insurgents stop a Danish relief vehicle carrying aid workers for a refugee project.  They tie up five of them and then execute four with AK-47s."], ["2003.09.08", "Afghanistan", "Shah Wali Kot", 5, 5, "Taliban attack on a pick-up truck kills five Afghan soldiers and leaves another five injured."], ["2003.09.08", "India", "Sarmarg", 1, 0, "A woman is shot to death by radical Muslims."], ["2003.09.09", "India", "Doda", 1, 7, "One young girl is killed and seven other people injured in a grenade attack by militant Muslims on a market."], ["2003.09.09", "India", "Sopat", 1, 1, "Muslim terrorists attempt to assassinate a political figure.  One bodyguard is killed and another injured."], ["2003.09.09", "Iraq", "Arbil", 3, 41, "Three Iraqis, including a 12-year old boy, are killed and more than forty others injured by a suicide bomber."], ["2003.09.09", "Israel", "Jerusalem", 7, 50, "Hamas (Islamic Resistance) bomber detonates explosives outside a cafe.  Seven patron are killed and at least fifty injured."], ["2003.09.09", "Israel", "Tel Aviv", 8, 15, "Eight people are killed and fifteen injured when a Hamas (Islamic Resistance) bomber dressed as an Israeli soldier detonates a suicide bomb at a bus stop."], ["2003.09.11", "England", "Bradford", 1, 0, "A 17-year-old girl is strangled by her family for resisting an arranged marriage."], ["2003.09.11", "India", "Srinagar", 2, 14, "al-Umar Mujahideen hurl a grenade into a busy market, killing a woman and injuring at least fourteen other people.  One of the injured later dies in hospital."], ["2003.09.13", "India", "Bijbehara", 2, 14, "Two civilians are killed, and another fourteen injured, by a IED explosion set by militant Muslims."], ["2003.09.13", "India", "Hajan", 3, 8, "Three people, including a former member of parliament, are killed and eight wounded in a terrorist attack."], ["2003.09.13", "India", "Neelidori", 4, 6, "Four security force personnel are killed, and five more wounded, in a Fedayeen attack."], ["2003.09.14", "India", "Sam Samad", 2, 0, "Two government teachers are killed by militant Muslims, one of whom was abducted and beheaded."], ["2003.09.15", "Iraq", "Khaldiya", 1, 2, "Iraqi police chief killed in a Sunni ambush.  Two others badly injured."], ["2003.09.15", "Iraq", "Mosul", 1, 13, "Militants hurl grenade at Albanian soldiers, one is killed and thirteen Iraqi bystanders are injured."], ["2003.09.15", "Philippines", "Campo Uno", 2, 0, "Muslim rebels ambush a group of civilians, killing a teacher and his student."], ["2003.09.15", "Russia", "Magas", 3, 25, "Fedayeen truck bombing kills at least three people and injures more than twenty-five others."], ["2003.09.16", "India", "Khanyar", 1, 7, "One civilian is killed in a blast engineered by a Muslim terrorist group.  Seven other people are injured."], ["2003.09.17", "Algeria", "Oued Djemaa", 9, 0, "Nine Algerian soldiers are killed in an ambush by Islamic fundamentalists."], ["2003.09.17", "India", "Chak Nutnusa", 2, 1, "Terrorists invade a home and open fire on a family.  A man and his son are killed, his daughter is injured."], ["2003.09.17", "India", "Laam", 2, 1, "Hizb-ul-Mujahideen terrorists attack a security patrol with an IED.  The device kills two and injures one other."], ["2003.09.18", "Afghanistan", "Ghazni", 4, 0, "Taliban car bomb kills four in front of the home of a local police commander."], ["2003.09.18", "India", "Kashmir", 4, 0, "Four civilians are killed in separate Mujahideen attacks, including one who was beheaded."], ["2003.09.19", "Algeria", "Boumerdes", 1, 0, "Man who repented his Islamic beliefs killed by armed Islamists."], ["2003.09.19", "India", "Kashmir", 5, 0, "Five civilians are killed in separate attacks by Islamic radicals."], ["2003.09.21", "India", "Rajouri", 4, 27, "Bomb planted by Muslim terrorists in a video camera explodes in a marketplace, killing four and injuring twenty-seven."], ["2003.09.21", "India", "Thanna Mandi", 2, 0, "Muslim terrorists invade a home, dragging out the husband and wife inside, then hanging them."], ["2003.09.21", "Iraq", "Baghdad", 2, 13, "Terrorist mortar bombing of a prison kills two U.S. military policemen and injured thirteen others."], ["2003.09.22", "Iraq", "Baghdad", 1, 16, "Suicide bomber kills one other person and injures sixteen in an explosion outside UN headquarters."], ["2003.09.22", "Israel", "Jerusalem", 2, 16, "A female suicide bomber motions over two Israeli policemen and then kills them.  Sixteen passersby are also injured."], ["2003.09.23", "India", "Chak Banola", 2, 0, "Militant Muslims kill a man and his son in their home."], ["2003.09.24", "Afghanistan", "Helmand", 2, 1, "The Taliban attack and kill two local humanitarian aid workers."], ["2003.09.24", "Iraq", "Baghdad", 1, 18, "Bus bombing kills one civilian and injures eighteen."], ["2003.09.24", "Iraq", "Mosul", 2, 8, "Grenade attack on a cinema kills two patrons and injures eight."], ["2003.09.25", "Iraq", "Baghdad", 1, 2, "Female member of the Iraqi governing council dies five days after terrorists ambush her vehicle.  Her two bodyguards were severely injured."], ["2003.09.25", "Iraq", "Baghdad", 1, 2, "One Somali is killed, and two other civilians injured, by a bomb placed at a hotel housing Western journalists."], ["2003.09.26", "Bangladesh", "Fatullah", 1, 10, "One businessman is killed and ten others people are injured in an attack by militant fundamentalists (Hizbut Touheed)."], ["2003.09.26", "Iraq", "Baqubah", 9, 15, "Mortar attack on a crowded marketplace kills nine and injures at least fifteen."], ["2003.09.26", "Israel", "Negahot", 2, 2, "Palestinian gunman infiltrates a settlement, randomly picks a house, and then proceeds to shoot the residents, including an infant girl."], ["2003.09.27", "Afghanistan", "Sangin", 7, 0, "Taliban attack kills seven Afghan bodyguards of local governor."], ["2003.09.27", "India", "Mahore", 4, 0, "A 2-year-old child is among four members of a family slaughtered by the Mujahideen in a heinous attack."], ["2003.09.27", "Pakistan", "Karachi", 0, 10, "Ten people are injured when a bomb goes off on a bus."], ["2003.09.28", "Kosovo", "Bresje", 2, 39, "Albanian Muslims shoot grenades into a Serbian marketplace, killing two and injuring thirty-nine."], ["2003.09.30", "Algeria", "Montgorno", 8, 3, "Islamic fundamentalists ambush Algerian military convoy.  Eight soldiers are killed and three injured."], ["2003.09.30", "Dagestan", "Unknown", 5, 0, "Jihad attack on police vehicle leaves five dead."], ["2003.09.30", "India", "Srinagar", 0, 19, "Nineteen people are injured when militant Muslims throw a grenade into a bus stop."], ["2003.09.30", "India", "Surankote", 2, 3, "Lashker-e-Toiba Fedayeen attack on a police station kills two and injures three."], ["2003.10.01", "India", "Thuru", 1, 1, "Hizb-ul-Mujahideen terrorists shoot and kill an unarmed youth, whose brother was also injured in the attack."], ["2003.10.01", "Indonesia", "Pandiri", 1, 0, "A 44-year-old man murdered for leaving Islam and embracing Christianity."], ["2003.10.01", "Iraq", "Tikrit", 1, 2, "A female driver is killed and two U.S. soldiers are injured by a roadside bomb in the Sunni triangle."], ["2003.10.02", "Chechnya", "Shali", 2, 0, "Muslim extremists open fire on a vehicle carrying a local mayor and his son.  Both are killed in the attack."], ["2003.10.02", "India", "Budhan", 1, 0, "Terrorists haul a man out of his house and shoot him to death."], ["2003.10.02", "India", "Kreeri Bazaar", 1, 0, "The Mujahideen kill a shopkeeper in his store."], ["2003.10.02", "Somalia", "Borama", 1, 0, "Islamic fundamentalists shoot an Italian aid worker to death on the grounds of the TB hospital she helped to found."], ["2003.10.03", "Afghanistan", "Kabul", 2, 3, "Two Canadian peacekeepers are killed, and three injured, by Taliban landmines targeting the patrol."], ["2003.10.03", "India", "Pulwama", 3, 0, "Militant Muslims kill three civilians in separate incidents (Budhan, Kreeri Bazaar, Wudar Bala)"], ["2003.10.03", "Iraq", "Baghdad", 0, 5, "Five Iraqis, including four teenagers, are injured by Sunni grenade attack."], ["2003.10.03", "Iraq", "Tikrit", 2, 0, "Two Iraqis are killed by a bomb placed in a traffic circle."], ["2003.10.03", "Pakistan", "Karachi", 6, 8, "Motorcycle shooting attack by Sunnis on a bus carrying Shiites on their way to worship leaves at least six dead and eight injured."], ["2003.10.03", "Pakistan", "Quetta", 1, 2, "Rocket attack by fundamentalists on a train kills the engine driver and injures two other employees."], ["2003.10.03", "Philippines", "Midsayap", 4, 20, "At least four people are killed and over twenty injured when a Muslim separatist hurls a grenade into a Mosque hosting government officials."], ["2003.10.04", "India", "Rowshera", 0, 6, "Six Hindus are injured when Muslim terrorists open fire on them as they were returning from temple."], ["2003.10.04", "India", "Suidhar", 2, 1, "Militant Muslims open fire on a group of civilians, killing two and injuring one."], ["2003.10.04", "Israel", "Haifa", 19, 55, "Nineteen people are killed and more than fifty wounded by a Islamic Jihad bomber in a restaurant.  Three children were among the dead."], ["2003.10.05", "Afghanistan", "Lashkargah", 2, 3, "Taliban attack on an Afghan military post kills two and injures three."], ["2003.10.05", "Algeria", "Beni Bouateb", 1, 0, "Armed Islamic extremists kill a communal guard for a small village."], ["2003.10.05", "Pakistan", "Islamabad", 5, 0, "Five people riding in a government vehicle, including a Sunni leader, are assassinated by gunmen."], ["2003.10.05", "Somalia", "Borama", 1, 0, "60-year old Italian medical missionary, a woman honored by the U.N. for her work with refugees, is shot twice in the head while leaving a hospital."], ["2003.10.06", "Israel", "Metulla", 1, 1, "Hezbollah snipers fire from southern Lebanon and kill an Israeli soldier."], ["2003.10.07", "India", "Ganeshphora", 3, 2, "Explosive device planted by militant Muslims detonates on a bridge, killing two BSF and injuring three."], ["2003.10.07", "Iraq", "Baghdad", 4, 3, "Four people are killed in a terrorist ambush."], ["2003.10.07", "Iraq", "Kirkuk", 1, 1, "One Iraqi employee is killed, and another injured, by al-Qaeda mortar attack on a government building."], ["2003.10.07", "Lebanon", "Israeli Border", 1, 0, "A Lebanese boy is killed when Hezbollah missiles, intended for Israel, fall short."], ["2003.10.07", "Philippines", "Manila", 3, 3, "Jailed Abu Sayyaf terrorist kills three policemen who were attempting to negotiate the release of hostages."], ["2003.10.08", "Iraq", "Kirkuk", 1, 1, "One Iraqi policeman is killed, and another badly wounded, by a terrorist RPG attack on their checkpoint."], ["2003.10.09", "Algeria", "Batna", 1, 0, "Algerian policeman has his throat slit by Islamic extremists at a roadblock."], ["2003.10.09", "Indonesia", "Poso", 2, 0, "Armed Muslims kill at least two Christian villagers and burn homes."], ["2003.10.09", "Iraq", "Baghdad", 1, 0, "Spanish diplomat assassinated by Muslim terrorists."], ["2003.10.09", "Iraq", "Baghdad", 8, 32, "Eight Iraqis are killed when two Fedayeen drive their car, packed with explosives, into a police station.  More than thirty are injured."], ["2003.10.09", "Israel", "Tulkarm", 1, 2, "One dead, two injured, by a 17-year old suicide bomber sent from the al-Aqsa Martyrs Brigade."], ["2003.10.10", "Iraq", "Baiji", 2, 4, "Roadside bombing against a bus kills two oil company employees and seriously injures four more."], ["2003.10.11", "India", "Nagbal", 1, 0, "A man is abducted from his home and killed in captivity by the Mujahideen."], ["2003.10.11", "Indonesia", "Sulawesi", 8, 24, "Muslim gunmen attack Christian villagers, killing eight, injuring dozens more and burning at least one church."], ["2003.10.12", "Afghanistan", "Zabul", 8, 2, "80 Taliban fighters on motorbikes attack two government buildings, killing eight people and injuring at least two."], ["2003.10.12", "Iraq", "Baghdad", 6, 32, "Six people are killed by Fedayeen car-bombing of a hotel.  At least thirty-two others are injured."], ["2003.10.12", "Iraq", "Fallujah", 2, 0, "Two Iraqi Christians murdered by Holy Warriors."], ["2003.10.13", "Chechnya", "Shatoi", 9, 0, "Militant Muslim attacks on outposts and a convoy leave nine Russians dead and an unknown number injured."], ["2003.10.13", "India", "Chalas", 2, 2, "Muslim separatists fire a rocket into a family home, killing a Hindu woman and her 4-year old child.  Two other family members were injured."], ["2003.10.13", "Iraq", "Baiji", 1, 1, "One American is killed, and another injured, by landmine while on patrol at oil refinery."], ["2003.10.14", "India", "Jabri", 1, 1, "Islamists kill a 75-year-old man in a shooting attack and leave his wife badly injured."], ["2003.10.14", "Iraq", "Baghdad", 1, 3, "Fedayeen car bomber kills a bystander and injures at least three others outside the Turkish embassy."], ["2003.10.15", "Algeria", "Barber", 1, 2, "One municipal guard is killed, and two others injured by terrorist bomb set by fundamentalists."], ["2003.10.15", "India", "Choontimulla", 1, 5, "The Mujahideen ambush a security patrol, killing one."], ["2003.10.15", "Israel", "Gaza", 3, 1, "Three American security guards are killed by a terrorist bombing on their car in Gaza."], ["2003.10.16", "Chechnya", "Achkoy-Martan", 0, 4, "Four people are injured, one seriously, by terrorist bombing of a cafe."], ["2003.10.16", "Iraq", "Karbala", 5, 7, "Five policemen (including three Americans) were killed and seven wounded by terrorists in an RPG attack and gun battle."], ["2003.10.17", "Chechnya", "Grozny", 1, 1, "A government official is killed after Muslim rebels place a bomb in his car."], ["2003.10.17", "India", "Srinagar", 3, 11, "Islamic militants attack the residence of a district prime minister, killing a civilian and two security personnel and injuring two civilians.  Nine policemen are injured in the ensuing gun battle."], ["2003.10.18", "Afghanistan", "Helmand", 2, 2, "Two government troops are killed, and two wounded by a Taliban roadside bombing attack."], ["2003.10.19", "Afghanistan", "Asadabad", 4, 5, "A civilian pick-up truck is bombed by Taliban insurgents, killing the driver, his brother, and two children."], ["2003.10.19", "Israel", "Ein Yabrud", 3, 1, "Fatah gunmen ambush an Israeli unit guarding a settlement.  Three are killed and one is injured."], ["2003.10.20", "India", "Srinagar", 1, 50, "One person is killed and more than fifty injured when a Muslim throws a grenade into a crowded bus terminal."], ["2003.10.21", "India", "Kulgam", 0, 17, "Militant Muslim throws a grenade into a bus stand, injuring seventeen civilians."], ["2003.10.21", "Somalia", "Sheikh", 2, 0, "A British couple who dedicated their lives to teaching in Africa are murdered by Islamic terrorists while sitting in their home."], ["2003.10.22", "Israel", "Hebron", 0, 2, "Two settlers are injured in a gun battle with Palestinian infiltrators."], ["2003.10.24", "Iraq", "Amarah", 1, 0, "Police chief is gunned down by Muslim terrorists as he leaves a mosque."], ["2003.10.24", "Iraq", "Mosul", 2, 4, "Sunni grenade attack kills two children and injures four others."], ["2003.10.24", "Israel", "Netzarim", 3, 2, "Two Hamas (Islamic Resistance) terrorists infiltrate a Jewish settlement and then enter a barracks to go room from room shooting female soldiers as they slept."], ["2003.10.25", "Afghanistan", "Shkin", 2, 0, "Two American contractors are killed in a Taliban ambush."], ["2003.10.25", "Iraq", "Habbaniya", 3, 2, "Three civilians are killed and two others injured by Sunni bombing and small arms attack on their vehicle in the Sunni triangle.."], ["2003.10.26", "India", "Bijbehara", 0, 14, "At least fourteen people are injured when Islamic militants hurl a grenade at a security patrol along a busy road."], ["2003.10.26", "India", "Kishtwar", 1, 9, "Muslim militant hurls grenade into a bus stop, killing one civilian and injuring nine others."], ["2003.10.26", "Iraq", "Baghdad", 1, 0, "Baghdad's deputy mayor assassinated in a drive-by shooting."], ["2003.10.26", "Iraq", "Baghdad", 1, 15, "Jihad rocket attack on a hotel injures 15 people and leaves a U.S. soldier on guard duty dead."], ["2003.10.26", "Thailand", "Narathiwat", 3, 0, "Muslim separatists kill a policeman and two defense volunteers, two days before a larger attack was planned."], ["2003.10.27", "India", "Gaghwal", 4, 9, "First day of Ramadan in Kashmir sees Islamic terrorists blow up a railroad bridge, narrowly missing a civilian passenger train.  Subsequent small arms leaves two civilians and two soldiers dead."], ["2003.10.27", "Indonesia", "Sulawesi", 1, 0, "Christian farmer killed by Jemmah Islamiah terrorists while working his field."], ["2003.10.27", "Iraq", "Baghdad", 11, 20, "At least eleven people are killed, and more that twenty injured, when a Fedayeen bomber targets the International Red Cross, a humanitarian organization helping Iraqis meet basic needs."], ["2003.10.27", "Iraq", "Baghdad", 16, 94, "Fedayeen bombing attacks on the first day of Ramadan on three Iraqi police stations kills at least sixteen and leaves nearly one hundred injured."], ["2003.10.27", "Philippines", "Tawi Tawi", 5, 0, "Abu Sayyaf rebels abduct six foreign tourists from a Malaysian resort then use them as human shields in a gun battle.  Five are killed."], ["2003.10.28", "Algeria", "Adekar", 2, 0, "Two Algerian soldiers are killed by a landmine planted by the country's Islamic fundamentalists during Ramadan."], ["2003.10.28", "India", "Aknoor", 2, 8, "Last surviving Muslim terrorist involved in the bridge bombing at Akhnoor opens indiscriminate fire on a family, killing two children and injuring eight."], ["2003.10.28", "India", "Khilani", 3, 7, "Three members of a security patrol are killed, and seven others injured in bombing and small arms ambush by militant Muslims."], ["2003.10.28", "India", "Srinagar", 3, 32, "Islamic rebels lob a grenade into a telegraph office, killing at least three civilians and injuring more than thirty."], ["2003.10.28", "Iraq", "Fallujah", 3, 6, "Three people, including school children, are killed and an six injured by a Fedayeen car bombing."], ["2003.10.28", "Iraq", "Mosul", 1, 0, "Editor of a pro-democracy newspaper gunned down by Islamists."], ["2003.10.28", "Philippines", "Cotabato", 0, 5, "Five people are injured when suspected Jemaah Islamiah members bomb a Catholic church."], ["2003.10.29", "Algeria", "Tipaza", 3, 0, "Islamic extremists kill three civilians after stopping them on a road during Ramadan."], ["2003.10.29", "India", "Anantnag", 0, 20, "Twenty people sustain injuries when a Muslim terrorist tosses a grenade into a crowd."], ["2003.10.29", "Iraq", "Mosul", 3, 0, "Three Iraqi civilians killed, and at least two others injured in RPG terrorist attack on police station."], ["2003.10.30", "India", "Kashmir", 2, 1, "Two civilians are abducted from their homes and killed by the Mujahideen (Shopian & Sopore)."], ["2003.10.31", "India", "Kashmir", 3, 16, "Three civilians are killed in separate Mujahideen attacks."], ["2003.11.01", "Bangladesh", "Jessore", 1, 3, "The leader of a Ahmadiyya religious group is killed by radical Muslims in an attack that also injures several others."], ["2003.11.02", "India", "Surankote", 1, 0, "A civilian is abducted and murdered by radical Muslims."], ["2003.11.02", "Iraq", "Fallujah", 2, 0, "Two civilian contractors are killed by bomb in their vehicle.  Muslim mob celebrates."], ["2003.11.02", "Israel", "Nablus", 1, 5, "Islamic Jihad bombing of a jeep, kills 1 Israeli soldier and leaves five others injured."], ["2003.11.03", "Iraq", "Karbala", 2, 4, "Car bomb kills two Iraqis and injures four near a Shiite shrine."], ["2003.11.03", "Saudi Arabia", "Mecca", 2, 1, "At least two killed and one wounded in militant Islamic shooting attack in Mecca."], ["2003.11.04", "India", "Hari Budda", 3, 2, "Militant Muslims bomb a security patrol, then use small arms fire to kill at three and injure two others."], ["2003.11.04", "Iraq", "Mosul", 2, 0, "Christian judge is assassinated in shooting attack.  This occurs a day after another judge is  kidnapped and murdered in Najaf"], ["2003.11.05", "India", "Srinagar", 1, 0, "A wildlife officer is shot to death by the Mujahideen."], ["2003.11.05", "India", "Tangmarg", 3, 0, "Militant Muslims invade three homes and kill three civilians, including a mother."], ["2003.11.05", "Iraq", "Mosul", 3, 9, "Three Iraqis are killed, and at least nine other people are injured in two separate terrorist grenade attacks.  The dead include a 10-year old boy."], ["2003.11.06", "India", "Baramulla", 3, 0, "Three civilians, including a woman, are killed in a brutal attack by Islamic terrorists."], ["2003.11.07", "Iraq", "Baghdad", 6, 0, "Six U.S. soldiers and judicial workers are killed when their helicopter is shot down during transport."], ["2003.11.08", "Algeria", "Bouira", 0, 4, "Four people are injured by Islamic extremists in two separate attacks using small-arms fire and a landmine."], ["2003.11.08", "Saudi Arabia", "Riyadh", 17, 122, "Seventeen people, including five children are killed and one-hundred and twenty-two injured by al-Qaeda suicide bombing in a residential neighborhood."], ["2003.11.08", "Sudan", "Darfur", 42, 0, "At least forty-two people are killed, and an unknown number wounded when Jihad militias attack 32 villages, burning houses and setting fire to crops."], ["2003.11.09", "India", "Awantipora Chowk", 5, 0, "Political activist gunned down by Islamic rebels - is the fifth political activist assassinated within the past week."], ["2003.11.10", "India", "Badgam", 2, 0, "Militant Muslims kill two civilians in their homes.  One was a photographer, the other a farmer."], ["2003.11.10", "Philippines", "Basilan", 1, 3, "Abu Sayyaf rebels ambush a routine patrol, killing one and injuring three."], ["2003.11.11", "India", "Quil Muqam", 2, 0, "Two civilians, including a woman, were killed by Islamic terrorists, who used them as human shields in a gun battle."], ["2003.11.11", "Iraq", "Basra", 6, 9, "Six Iraqi civilians are killed, and nine injured in a car bomb blast in the Shiite city of Basra.  School children were among the injured."], ["2003.11.12", "Afghanistan", "Kunar", 4, 3, "Taliban car bombing kills four and injures at least three Afghans."], ["2003.11.12", "Iraq", "Nasiriyah", 31, 80, "Over thirty people are killed, and about eighty injured when Fedayeen suicide bombers crash their cars through the gates of an Italian compound and detonate the explosives."], ["2003.11.13", "Iraq", "Balad", 1, 1, "Sunni terrorists shoot a civilian contractor to death, and injure another in an attack on their vehicle."], ["2003.11.14", "India", "Kashmir", 3, 0, "Three civilians, including a woman, are killed by Muslim terrorists in separate incidents (Gotapora, Srinigar, Pattan)."], ["2003.11.14", "Ingushetia", "Troitskaya", 5, 10, "Terrorists detonate bomb as Russian soldiers are conducting a house search.  Five are killed and ten injured, three critically."], ["2003.11.15", "India", "Hazratbal", 2, 6, "Six worshippers are injured by bomb blast at one of India's holiest shrines.  Elsewhere, in northern Kashmir, a man and his teen-age daughter are killed by militant Muslims."], ["2003.11.15", "Indonesia", "Sulawesi", 2, 0, "A church official and his nephew are shot to death by radical Muslims."], ["2003.11.15", "Turkey", "Istanbul", 23, 257, "Islamics attack two synagogues with car bombs, killing at least twenty-three and injuring over two-hundred and fifty.  The victims included children and at least one pregnant woman."], ["2003.11.16", "Afghanistan", "Ghazni", 1, 0, "Taliban terrorists shoot a female French aid worker to death in a motorbike attack."], ["2003.11.16", "India", "Gole Chakri", 3, 4, "Terrorists lob a grenade into a military jeep on a crowded street.  One SF personnel is killed and four other people, including two civilians, sustain injuries.  Another ambush in Briyali leaves two SF dead."], ["2003.11.16", "Indonesia", "Sulawesi", 1, 0, "A Christian man is dragged from his motorcycle and beaten to death by a Muslim mob."], ["2003.11.17", "India", "Tatagaon", 3, 0, "Three civilians are killed in separate incidents (Anantnag & Tatagaon) by militant Muslims, including a young girl who was tortured and then killed."], ["2003.11.18", "India", "Srinagar", 1, 5, "At least one person is killed, and more than five others injured when Islamic terrorists attack a hotel with bombs and automatic weapons."], ["2003.11.18", "Israel", "Gush Etzion Tunnel", 2, 0, "Palestinian (al-Aqsa) gunman approaches checkpoint with an AK-47 concealed in a prayer mat, which he then uses to shoot two Israeli soldiers to death at point-blank range.  He then flees."], ["2003.11.19", "Afghanistan", "Khost", 14, 23, "Sustained Taliban rocket attack on an airport kills fourteen Afghans and injures at least twenty-three."], ["2003.11.19", "Algeria", "Henchir Toumeghni", 2, 3, "Armed Islamists open fire in a cafe, killing a policeman and injuring several patrons.  Elsewhere (El Aouana) a rural watchman dies in an ambush."], ["2003.11.19", "Bangladesh", "Chittagong", 11, 0, "Eleven members of a Hindu family, including seven women and a newborn baby are burned alive by a Muslim mob that surrounded their home in the early morning hours."], ["2003.11.19", "France", "Paris", 2, 0, "Two Jews are brutally murdered by Muslims in separate attacks in Paris.  One has his throat slit and eyes gouged while a 53-year old mother is stabbed 27 times in the neck and chest."], ["2003.11.19", "Iraq", "Ramadi", 2, 1, "Saddam calls again for Holy War.  A child and one other person are then killed by a car bomb aimed at a pro-American Sunni leader."], ["2003.11.19", "Jordan", "Israeli Border", 1, 5, "Jordanian truck driver fires rifle across the border into Israel, killing an Ecuadorian women and injuring four of her tourist companions."], ["2003.11.20", "Iraq", "Kirkuk", 4, 6, "At least four civilians are killed, and at least a half dozen injured, by bomb blast in Kurdish political headquarters."], ["2003.11.20", "Turkey", "Istanbul", 31, 400, "Coordinated Fedayeen suicide truck bombings, one near a British bank and the other outside the British consulate, kill more than thirty and injure over four-hundred people.  Al-Qaeda and another Islamic group claim responsibility for the killing."], ["2003.11.21", "India", "Budgam", 2, 0, "Two citizens are shot dead by Muslim militants.  One in his house and the other as he was returning home from worship."], ["2003.11.22", "Iraq", "Baghdad", 4, 20, "Four people were killed when Islamists hurled a grenade into a market stall that was selling alcohol.  One of the dead was an 11-year old boy.  Some twenty others were injured."], ["2003.11.22", "Iraq", "Baqubah", 9, 15, "Six Iraqi policeman and three civilians are killed in a Fedayeen car bombing.  More than fifteen others were injured."], ["2003.11.22", "Iraq", "Khan Bani Saad", 9, 10, "Fedayeen suicide bomber kills nine Iraqis and injures ten at a police station.  A subsequent explosion in the same area injures at least two children."], ["2003.11.22", "Israel", "Jerusalem", 2, 0, "Two Israelis are shot dead while guarding a construction site."], ["2003.11.23", "India", "Mitrigam", 1, 0, "A civilian is shot to death inside his home by the Mujahideen."], ["2003.11.23", "Iraq", "Mosul", 2, 0, "A Muslim mob throws a concrete block in the way of a military vehicle, causing it two crash.  The mob then drags the two soldiers out, beats them and then slits their throats."], ["2003.11.25", "India", "Anantnag", 2, 4, "An assassination attempt on a Hindu politician by Muslim radicals leaves two people dead and four injured."], ["2003.11.25", "Israel", "Nablus", 1, 0, "Assassination attempt by Palestinian gunmen on Nablus mayor, said to be working with Jews, leaves his brother dead."], ["2003.11.27", "India", "Srinagar", 1, 12, "One person was killed, and twelve others injured when militants hurl a grenade into a busy intersection."], ["2003.11.27", "Philippines", "Barira", 5, 4, "Five people in the middle of planning a wedding were killed, and four others injured when Moro Islamic Front terrorists strafe their house with gunfire."], ["2003.11.28", "Algeria", "Djelfa", 9, 3, "Nine people, including a Saudi prince, are ambushed and killed by Islamic extremists while on a hunting trip in the desert."], ["2003.11.28", "India", "Shaashi", 1, 0, "A man is gunned down inside his home by Islamic terrorists."], ["2003.11.29", "India", "Wadna", 1, 4, "Militant Muslims fire at a passenger vehicle, killing one and injuring four."], ["2003.11.29", "Iraq", "Suwayrah", 7, 1, "Fedayeen ambush kills seven Spanish intelligence agents, riding in two cars, with grenades and automatic weapons."], ["2003.11.29", "Iraq", "Tikrit", 3, 0, "Two Japanese diplomats, and their Iraqi driver are shot and killed by Fedayeen terrorists."], ["2003.11.30", "India", "Jammu", 4, 8, "At least four people are killed, and eight injured when Muslim militants defy a brokered cease-fire and hijack two civilian vehicles."], ["2003.11.30", "Indonesia", "Poso", 2, 0, "Two Hindu migrants are gunned down as they sat outside their house."], ["2003.11.30", "Iraq", "Tikrit", 2, 2, "Two South Korean engineers are killed, and two others seriously wounded by Fedayeen terrorists while traveling in their vehicle."], ["2003.12.02", "India", "Srinagar", 0, 21, "Nineteen policeman and two civilians are injured when militant Muslims attack their station with grenades."], ["2003.12.02", "USA", "Chicago, IL", 1, 0, "A Muslim doctor deliberately allows a Jewish patient to die from an easily treatable condition."], ["2003.12.03", "Philippines", "Muti", 4, 0, "Abu Sayyaf terrorists round up four villagers, line them up on a road and shoot them."], ["2003.12.04", "Afghanistan", "Bukwakay", 1, 11, "A UN worker was killed by a Taliban attack while conducting a census.  Eleven others were injured."], ["2003.12.04", "Yemen", "al-Baidah", 1, 1, "Regional governor survives assassination attempt by Islamic extremists, with injuries.  His brother is murdered."], ["2003.12.05", "Iraq", "Baghdad", 4, 13, "At least three Iraqis and one U.S. soldier are killed by a roadside bomb on a crowded street.  Thirteen others, including eleven Iraqis are injured."], ["2003.12.05", "Russia", "Yessentuki", 44, 150, "Mujahideen suicide bomber detonates explosive on a Russian commuter train carrying civilians to work.  At forty-four people, including children eventually die and about one-hundred and fifty others are injured."], ["2003.12.06", "Afghanistan", "Kandahar", 0, 18, "Eighteen Afghan civilians, including three children are injured by a bomb detonated from a parked bicycle.  The Taliban takes credit for the attack."], ["2003.12.06", "Algeria", "Bouira", 1, 0, "24-year old police officer is gunned down in a store by Islamic extremists."], ["2003.12.08", "Afghanistan", "Muqur", 2, 0, "Taliban ambush kills two Pakistani engineers working to restore country's infrastructure."], ["2003.12.08", "Chechnya", "Itum Kale", 4, 1, "Four Russian soldiers are killed while investigating an explosion at a school.  Another is taken hostage."], ["2003.12.08", "India", "Anantnag", 0, 10, "Ten people, including civilians and policemen are injured in Mujahideen grenade and shooting attacks in Kashmir."], ["2003.12.09", "Iraq", "Baghdad", 3, 2, "Bombers target a mosque, killing two and injuring three."], ["2003.12.09", "Iraq", "Mosul", 0, 62, "Fifty-nine U.S. soldiers and at least three Iraqis sustain mostly light injuries when an Islamic suicide car bomber attempts an attack."], ["2003.12.09", "Iraq", "Mosul", 1, 2, "Drive-by shooting attack leaves one American hospital guard dead and two others injured."], ["2003.12.09", "Russia", "Moscow", 6, 14, "Female Fedayeen suicide bomber kills six people near the Kremlin and injures at least fourteen, including several college students."], ["2003.12.10", "India", "Poonch", 3, 15, "Muslim terrorists lob a grenade into a bus station and then fire indiscriminately into the crowd, killing three and injuring at least fifteen."], ["2003.12.10", "Iraq", "Mosul", 2, 4, "Militant Sunnis kill two U.S. soldiers on guard duty at two gas stations in drive-by shootings.  Four others are injured."], ["2003.12.11", "Iraq", "Ramadi", 1, 14, "Three Fedayeen suicide bombers in a furniture truck blow themselves up at the gates of a U.S. military base.  One guard is killed and fourteen others wounded."], ["2003.12.12", "Israel", "Nablus", 0, 7, "Palestinian gunmen ambush a van carrying Israeli worshippers on their way home from a prayer service.  Seven are injured."], ["2003.12.12", "Pakistan", "Quetta", 1, 0, "Young boy is killed by a bomb while sifting through garbage outside a house owned by President Karzai of Afghanistan."], ["2003.12.14", "Iraq", "Khaldiya", 17, 33, "Seventeen city workers, policemen, and civilian bystanders are killed, and another thirty-three injured by Fedayeen suicide blast."], ["2003.12.14", "Philippines", "North Cotabato", 4, 3, "Ambushes by the Moro Islamic Front leave four villagers dead and two wounded."], ["2003.12.15", "Dagestan", "Shauri & Mokok", 9, 0, "At least nine border guards are murdered by Muslim rebels who crossed over from Chechnya to attack a hospital."], ["2003.12.15", "Iraq", "Ameriyah", 0, 7, "Another Fedayeen suicide bomber kills himself and injures seven Iraqi policemen."], ["2003.12.15", "Iraq", "Baghdad", 8, 10, "Fedayeen suicide bomber drives car bomb to gates of a police station.  Eight Iraqis are killed in the explosion and at least ten injured."], ["2003.12.16", "Algeria", "Medea", 2, 0, "Islamic extremists shoot and kill two policemen."], ["2003.12.16", "Philippines", "Datu Piang", 4, 12, "Government troops seeking refuge in a mosque are attacked by Moro Islamic Front terrorists.  Four are killed and twelve are missing."], ["2003.12.17", "India", "Gagarsula", 1, 4, "Terrorists shoot dead one civilian and abduct four others from a remote village."], ["2003.12.17", "Iraq", "Baghdad", 2, 1, "A Shiite leader is gunned down near his home by Sunni loyalists."], ["2003.12.18", "India", "Rajouri", 2, 3, "Fedayeen attack on a police station kills two officers and leaves three more injured."], ["2003.12.19", "Iraq", "Baghdad", 1, 5, "Terrorist blast kills one woman working for the main Shiite party in their office building.  At least five others are injured."], ["2003.12.20", "Afghanistan", "Khaima", 5, 2, "Taliban terrorists attack a remote security post with machine guns and kill five Afghan soldiers as they are eating their evening meal."], ["2003.12.21", "India", "Kulgam", 0, 14, "Fourteen people are injured in a grenade attack against a police station by militant Muslims."], ["2003.12.22", "Iraq", "Baghdad", 3, 2, "Roadside bomb in the Sunni Triangle kills two Americans and an Iraqi translator.  Two others are wounded."], ["2003.12.22", "Iraq", "Mosul", 1, 0, "Top level judge shot six times in the back by Fedayeen loyalists."], ["2003.12.22", "Israel", "Kfar Darom", 2, 2, "Two Israelis are killed when members of the al-Aksa Martyrs Brigade open up on a security patrol with grenades and automatic weapons."], ["2003.12.23", "India", "Bandipore", 0, 10, "Ten people are injured when Muslim militants lob a grenade at a security patrol near a hospital."], ["2003.12.24", "Iraq", "Baghdad", 1, 2, "Civilian bus is bombed by Sunni terrorists.  The driver is killed and two passengers are injured."], ["2003.12.24", "Iraq", "Irbil", 3, 12, "A suicide car bomber kills three other people and injures at least a dozen innocents."], ["2003.12.24", "Sudan", "Darfur", 24, 25, "Government-sponsored militias in this Islamic Republic, kill another two dozen villagers - adding to a toll of more than two million over 20 years."], ["2003.12.25", "Israel", "Tel Aviv", 4, 18, "Suicide bomber kills four Israeli civilians, including a teenage girl and injures at least eighteen more at a bus stop."], ["2003.12.25", "Pakistan", "Rawalpindi", 17, 46, "Assassination attempt on Pakistani President by Muslim extremists, involving several car bombs, leaves seventeen dead and at least forty injured."], ["2003.12.26", "India", "Singhpora", 1, 11, "A 13-year-old girl is killed, and eleven other people are injured when Muslim terrorists trigger a roadside bomb against a transport vehicle."], ["2003.12.27", "India", "Tral", 1, 8, "An irrigation department employee is killed by the Mujahideen and eight others suffer injuries in a Shopian grenade attack."], ["2003.12.27", "Iraq", "Karbala", 12, 37, "Islamic Fedayeen terrorists kill twelve, including four Bulgarians, two Thai engineers and six civilians in three separate suicide attacks.  At least thirty-seven others are injured."], ["2003.12.28", "Afghanistan", "Kabul", 6, 0, "Six Afghan policemen are killed by two suicide bombers being transported for investigation."], ["2003.12.28", "India", "Surigam", 1, 0, "A man is lynched by Islamists."], ["2003.12.28", "Iraq", "Baghdad", 3, 5, "Two Iraqi children and one American are killed by a roadside bomb on a crowded street.  Five others are injured."], ["2003.12.29", "Afghanistan", "Spin Boldak", 5, 3, "Five Afghan soldiers are killed when their post is attacked by Taliban terrorists.  Three are injured."], ["2003.12.29", "India", "Bamkote", 1, 0, "A man is pulled from his house and killed just outside his village."], ["2003.12.29", "India", "Jammu", 0, 10, "Muslim terrorists injure ten people waiting for a bus with a grenade."], ["2003.12.30", "India", "Lawaypora", 0, 34, "Thirty-four personnel are injured when Hizbul Mujahideen militants bomb a military patrol."], ["2003.12.30", "Iraq", "Baghdad", 1, 3, "One Iraqi is killed, and three others injured in a roadside bomb attack."], ["2003.12.31", "Iraq", "Baghdad", 8, 35, "A car bomb rips through a restaurant, killing eight people and injuring at least thirty-five."]], "columns": ["Date", "Country", "City", "Killed", "Injured", "Description"], "year": 2003}