{"rows": [["2004.01.01", "India", "Rainawari", 0, 7, "A terrorist is killed, and seven civilians sustain injuries when a bomb being carried on a bicycle detonates prematurely."], ["2004.01.01", "India", "Srinagar", 1, 6, "Islamic rebels detonate a bomb near a site hosting a peace rally.  One civilian is killed and six others injured."], ["2004.01.01", "Nigeria", "Damaturu", 1, 0, "A group called the Muhajirun attacks a police station and kills an officer."], ["2004.01.03", "India", "Jammu", 4, 15, "Four people are killed, and more than fifteen injured when militant Muslims attack a railway station with grenades and small-arms fire."], ["2004.01.04", "Philippines", "Parang", 22, 81, "Twenty-two people at a political rally for a Christian mayor in a predominately Muslim region are killed by a bomb blast.  More than eighty are injured.  Two Muslims later identified and charged.."], ["2004.01.04", "Thailand", "Narathiwat", 4, 0, "Muslim extremists raid a government armory and then set fire to 18 secular schools in a rampage that leaves at least four soldiers dead and an unknown number injured."], ["2004.01.05", "Egypt", "Patmos Center", 1, 2, "One Christian is killed, and two others injured when elements of the Egyptian army burn down a church."], ["2004.01.05", "Pakistan", "Khanewal", 1, 0, "Christian priest shot dead by Islamic terrorists as he was boarding a train."], ["2004.01.05", "Thailand", "Pattani", 2, 0, "Two policemen are killed while trying to defuse a bomb on a parked motorcycle."], ["2004.01.06", "Afghanistan", "Kandahar", 15, 15, "Bicycle bombing by the Taliban (former religious leaders) along a crowded street kills fifteen people and injures more than fifteen.  Eight children were among the dead."], ["2004.01.06", "Iraq", "Fallujah", 2, 1, "Two French civilians are gunned down by Sunni insurgents."], ["2004.01.07", "Iraq", "Baghdad", 1, 30, "Rocket attack by Sunni terrorists on a U.S. logistical base leaves one soldier dead and about thirty wounded."], ["2004.01.08", "Iraq", "Fallujah", 9, 0, "A medivac helicopter, clearly marked with a red cross, is downed by a missile in the Sunni Triangle, killing all nine U.S. soldiers aboard."], ["2004.01.08", "Pakistan", "Adam", 4, 0, "Rocket attack on a military base near the Afghan border kills four Pakistani soldiers."], ["2004.01.09", "India", "Jammu", 0, 20, "At least twenty people are injured when a militant hurls a grenade at two police officers.  The blast carries into a local shop."], ["2004.01.09", "Iraq", "Baqubah", 4, 36, "Four Shiite worshippers are killed, and thirty-six others injured by a car bombing at a mosque in a predominately Sunni town."], ["2004.01.10", "India", "Lurgam", 2, 0, "Man and his wife killed by Mujahideen terrorists outside their home."], ["2004.01.10", "Indonesia", "Palopo", 4, 2, "Four people are killed, and at least two injured by a bomb blast at a karaoke cafe.  Islamist terrorist attacks killed nearly a dozen Christians there in November."], ["2004.01.11", "Afghanistan", "Gerdi Sari", 1, 0, "An Afghan civilian is murdered by the Taliban."], ["2004.01.11", "Chechnya", "Dyshne-Vedeno", 1, 1, "A Jihad attack on a security patrol leaves one Russian serviceman dead and another injured."], ["2004.01.11", "Israel", "Talmon", 1, 2, "Palestinian gunmen kill a father of five as he is traveling in his car.  Two others are shot and injured."], ["2004.01.12", "Afghanistan", "Kashrud", 4, 0, "Four government soldiers are killed when Taliban extremists attack their post with knives and assault rifles."], ["2004.01.12", "Bangladesh", "Mazar", 3, 36, "Jamaat-e-Islami fundamentalists place bomb at a shrine that kills three and injures thirty-six.  Ten-year old boy among the dead."], ["2004.01.12", "Chechnya", "Shali", 4, 0, "Muslim militants enter a house and butcher four people."], ["2004.01.12", "India", "Anantnag", 1, 14, "Grenade attack on a demonstration kills a police officer and injures fourteen other people."], ["2004.01.14", "Algeria", "Zaouia", 1, 1, "A mother and daughter heading out to harvest olives are hit by a bomb blast.  The mother is killed and the daughter seriously wounded."], ["2004.01.14", "Iraq", "Baqubah", 2, 12, "At least two civilians are killed, and a dozen other people, including children injured by a Fedayeen suicide car bombing attack."], ["2004.01.14", "Israel", "Gaza", 4, 10, "Female suicide bomber kills herself and four others at a checkpoint for Palestinians entering Israel to work.  Ten others are injured in the blast.  The mother-of-two pretended to fall over, then detonated her bomb against those rushing to help her."], ["2004.01.15", "Pakistan", "Karachi", 0, 12, "At least a dozen people are injured when a car bomb explodes outside the local headquarters of the Christian Bible Society."], ["2004.01.16", "India", "Srinagar", 0, 7, "Hezb-ul-Mujahedeen car bombing injures seven members of a security detail."], ["2004.01.17", "Iraq", "Tikrit", 5, 2, "Two Iraqis and three U.S. soldiers were killed by a remote-controlled bomb planted in a culvert.  Two others were injured."], ["2004.01.18", "Algeria", "Leghdira", 1, 2, "Islamic fundamentalists kills a \"repentant\" with a bomb that also injures two police officers."], ["2004.01.18", "Iraq", "Baghdad", 23, 61, "At least twenty-three Iraqis are killed, and more than sixty others injured by a Fedayeen suicide bomber who used day laborers as a cover for gaining entrance to a secured zone.  All eight were among the dead."], ["2004.01.19", "Afghanistan", "Manzalbath", 15, 58, "The country's former religious leaders detonate a bomb near two schools, killing fifteen innocents, including children."], ["2004.01.19", "Israel", "Lebanese Border", 1, 2, "Israeli bulldozer hit with a Hezbollah rocket attack.  One soldier was killed and two injured."], ["2004.01.21", "Afghanistan", "Uruzgan", 5, 1, "The Taliban take down five civilians with a landmine."], ["2004.01.21", "Indonesia", "Maranatha", 1, 0, "The 56-year-old head of a local Christian community is killed by Muslim villagers. (2004)"], ["2004.01.21", "Iraq", "Fallujah", 4, 1, "Four Christian Iraqi women, who were laundry workers for the coalition, are attacked and killed while riding in a minivan.  The male driver was injured."], ["2004.01.21", "Iraq", "Fallujah", 4, 5, "Sunni terrorists attack a police checkpoint with grenades and automatic weapons.  Three Iraqi policemen and a civilian are killed, with another five injured."], ["2004.01.22", "Iraq", "Baghdad", 2, 1, "Two members of the Communist party are killed by a bomb in their office."], ["2004.01.22", "Thailand", "Narathiwat", 1, 0, "A Buddhist monk is murdered by Islamic extremists."], ["2004.01.23", "India", "Kashmir", 4, 0, "Militant Muslims kill four people in Baramulla and Bandipora, all suspected of being politically active."], ["2004.01.23", "Thailand", "Narathiwat", 1, 0, "A policeman is murdered by Islamists."], ["2004.01.24", "Iran", "Khatoun Abad", 2, 2, "Two mine workers are cut down by government troops at a peaceful demonstration."], ["2004.01.24", "Iraq", "Samarrah", 4, 36, "Roadside bombing in the Sunni Triangle kills four Iraqi civilians and injures another thirty-six people.."], ["2004.01.24", "Thailand", "Yala", 2, 1, "Two Buddhist monks are hacked to death while begging for food in a Muslim neighborhood.  Another is seriously injured in the machete attack."], ["2004.01.25", "Iraq", "Ramadi", 4, 0, "Three policemen and a civilian are killed in a terrorist attack on a highway checkpoint."], ["2004.01.26", "Chechnya", "Sharoi", 4, 4, "Jihad attack on a convoy leaves four Russians dead and four injured."], ["2004.01.26", "Iraq", "Al-Amiriyah", 2, 3, "Two policemen are killed in a drive-by Fedayeen shooting attack on a checkpoint.  Two civilians and a third policeman were injured."], ["2004.01.26", "Iraq", "Baghdad", 2, 2, "IED device set on a busy highway explodes, killing two civilians and injuring two others."], ["2004.01.27", "Afghanistan", "Kabul", 2, 11, "Taliban suicide bomber throws himself on a patrol vehicle in downtown Kabul and kills one Canadian peacekeeper and a civilian.  Eleven others were injured."], ["2004.01.27", "Algeria", "Tizi Ouzou", 3, 0, "Islamic fundamentalists (Salafist Group for Preaching and Combat) kill two soldiers and one security guard in an ambush."], ["2004.01.27", "Iraq", "Baghdad", 2, 1, "Two CNN employees are killed in a shooting attack as terrorists open up on the car in which they are riding."], ["2004.01.27", "Iraq", "Baghdad", 5, 4, "Two Iraqi civilians are among five killed by two roadside bombs set to go off in succession in the Sunni Triangle."], ["2004.01.27", "Iraq", "Samarrah", 3, 4, "Three Iraqis killed, and four injured when truck bomb explodes outside a courthouse."], ["2004.01.28", "Afghanistan", "Kabul", 1, 4, "One British Peacekeeper is killed by a Fedayeen suicide bomber in a taxi.  Four others are injured in the blast."], ["2004.01.28", "Iraq", "Baghdad", 4, 17, "At least four people, including a South African national are killed by a Fedayeen car bombing outside a hotel.  Some seventeen others are killed."], ["2004.01.29", "Dagestan", "Makhachkala", 2, 2, "Muslim militants thought responsible for a shooting attack on a police car."], ["2004.01.29", "India", "Handwara", 4, 0, "Muslim gunmen invade a home and shoot to death a resident and a guest.  Two women are killed in a similar manner in Pulwama Rajouri."], ["2004.01.29", "Israel", "Jerusalem", 11, 50, "Eleven people are murdered, and at least fifty others injured by a Palestinian suicide bombing inside a passenger bus.  Al-Aksa martyrs brigade claims responsibility."], ["2004.01.30", "Saudi Arabia", "Riyadh", 7, 1, "Six security guards and a civilian are killed by radical Islamists operatives while attempting to break up a terrorist cell."], ["2004.01.31", "Iraq", "Mosul", 9, 45, "Nine people are killed and about forty-five injured by a Fedayeen suicide car bombing outside a police station."], ["2004.01.31", "Sudan", "Surra", 250, 30, "Final tally from the genocidal attack on an African village earlier in the month is about two-hundred and fifty people slaughtered, mostly women and children.  An unknown number were injured and thirty are still missing. (2004)"], ["2004.02.01", "Afghanistan", "Deh Rawood", 8, 5, "An Afghan mayor and seven of his family members, including three children are killed by a Taliban roadside bomb attack. Five others are injured."], ["2004.02.01", "Chechnya", "Alleroi", 5, 0, "Five security guards are killed when grenade-wielding gunmen burst into a government building intent on a political assassination."], ["2004.02.01", "Iraq", "Arbil", 117, 133, "Two Ansar al-Islam suicide bombers dresses as Muslim clerics kill more than one-hundred people and injure about one-hundred and thirty in attacks on two buildings housing Kurdish political officials."], ["2004.02.02", "India", "Srinagar", 1, 1, "A police officer is gunned down outside a mosque."], ["2004.02.03", "India", "Chewdara", 3, 0, "Hizbul Mujahideen terrorists invade a home and kill the couple inside, along with another family member."], ["2004.02.03", "Russia", "Vladikavkaz", 2, 10, "Two people, including a woman are killed, and at least ten others injured by a car bomb near the Chechen border."], ["2004.02.04", "Thailand", "Yarang", 1, 0, "Government employee is slashed to death in a machete attack similar to the manner in which three Buddhist monks were killed last month."], ["2004.02.05", "Algeria", "Tizi Ouzou", 5, 0, "Five police are murdered by armed Islamic extremists in the regional capital."], ["2004.02.05", "Chechnya", "Grozny", 7, 11, "Seven servicemen and police officers are killed in three separate incidents by Mujahideen rebels over a 24-hour period."], ["2004.02.05", "India", "Salar", 4, 7, "Four Indian security forces are killed by a landmine planted by Muslim rebels in Kashmir.  Seven others are injured."], ["2004.02.06", "Russia", "Moscow", 40, 134, "Forty people are murdered by a female Fedayeen suicide bomber as they were commuting to work on a Moscow subway.  About one-hundred and thirty-four are injured."], ["2004.02.07", "Egypt", "Cairo", 0, 3, "An Australian and two Norwegian tourists are injured in a knife attack by a man \"angered\" at Israel."], ["2004.02.08", "Algeria", "Miliana", 2, 0, "Two policemen are murdered at point blank range by two fundamentalist youth who stopped their car on the pretext of seeking information."], ["2004.02.08", "Iraq", "Sawaryah", 3, 11, "Bombing attack on the offices of a deputy police chief leaves three dead and eleven wounded."], ["2004.02.08", "Philippines", "Mangosatubig", 2, 1, "Moro Islamic Front terrorists attack a fishing village, killing two and injuring one."], ["2004.02.09", "Iraq", "Mosul", 2, 0, "Two Christian family members murdered by radical Jihadists."], ["2004.02.10", "Algeria", "Jijel", 4, 3, "Islamic extremists kill four patrons at a roadside cafe.  Three are shot and one has his throat slit."], ["2004.02.10", "Chechnya", "Grozny", 6, 0, "Six security forces are killed by Jihadist remote-controlled IED."], ["2004.02.10", "Chechnya", "Oktyabrsky", 3, 0, "Jihad fighters strip three Russian soldiers of their weapons then shoot them to death."], ["2004.02.10", "Iraq", "Baghdad", 4, 0, "Four police officers (two cousins and two brothers) are killed in drive-by shootings as they travel to work."], ["2004.02.10", "Iraq", "Iskandariya", 53, 150, "At least fifty-three people are killed by a massive truck bomb outside a police station.  Some one-hundred and fifty others are injured."], ["2004.02.10", "Thailand", "Narathiwat", 1, 0, "Buddhist official killed by Muslim gunmen."], ["2004.02.11", "Afghanistan", "Khost", 1, 0, "Suicide Taliban attacker kills senior Afghan intelligence official."], ["2004.02.11", "Iraq", "Baghdad", 47, 75, "Fedayeen suicide bomber kills forty-seven people waiting in line for jobs and injures nearly one-hundred."], ["2004.02.12", "Algeria", "Toudja", 7, 3, "Armed Islamic extremists ambush and kill seven policemen.  Three others are injured in the attack."], ["2004.02.13", "Afghanistan", "All Shaire", 2, 6, "A shopkeeper and Afghan soldier were killed by a Taliban terrorist bomb that also injured six others."], ["2004.02.13", "Afghanistan", "Bala Buluk", 4, 0, "Four Afghan aid employees, working to rid the countryside of landmines are shot to death by Taliban extremists."], ["2004.02.13", "Dagestan", "Bamnatbekyurt", 3, 4, "Three police officers were killed, and four wounded by Muslim rebels in a village ambush."], ["2004.02.14", "Iraq", "Fallujah", 21, 33, "'There is no god but Allah!' shout gunmen who storm a police prison, killing more than twenty and injuring at least thirty-three others."], ["2004.02.14", "Thailand", "Narathiwat", 2, 0, "Muslim gunmen on a motorcycle kill two workers as they are on their way to a job site."], ["2004.02.15", "Iraq", "Baghdad", 1, 4, "A Christian pastor is killed, and four others are injured when a vehicle pulls alongside their car and fires into the cabin."], ["2004.02.16", "India", "Budgam", 2, 0, "Muslim rebels kill two villagers."], ["2004.02.16", "India", "Hyderpora Chowk", 3, 0, "A political activist and two policemen are gunned down by Islamists."], ["2004.02.17", "India", "Dada", 2, 0, "Muslim terrorists invade a house and shoot a civilian and his son to death."], ["2004.02.17", "Sudan", "Anka", 15, 8, "Government troops and the Janjaweed attack and destroy a village, killing fifteen civilians. (2004)"], ["2004.02.18", "Iraq", "Hilla", 8, 106, "Eight Iraqis, including five children are killed and more than one-hundred others injured by twin Fedayeen suicide car bombers who were stopped by coalition forces."], ["2004.02.18", "Kosovo", "Staro", 2, 0, "Muslim terrorists shoot two civilians, a man and a woman, to death as they were sitting in their car."], ["2004.02.18", "Thailand", "Deage", 1, 0, "A man is murdered by Islamists."], ["2004.02.19", "Nigeria", "Jos", 4, 0, "Muslim gunmen ambush a police vehicle and kill the four passengers."], ["2004.02.19", "Philippines", "Jolo", 1, 1, "Abu Sayyaf gunmen abduct a 7-year old girl at a Roman Catholic school after killing her driver."], ["2004.02.20", "Iraq", "Baghdad", 2, 1, "In two separate attacks, a Muslim cleric and an Iraqi translator are gunned down by assassins."], ["2004.02.22", "Afghanistan", "Thalogan", 1, 1, "A Muslim gunman attacks a helicopter on a humanitarian mission, killing the Australian pilot and injuring an American woman helping to set up health clinics in the area."], ["2004.02.22", "Israel", "Jerusalem", 8, 61, "An al-Aksa suicide terrorist blows up another civilian bus during rush hour, killing eight passengers and injuring over sixty."], ["2004.02.23", "Chechnya", "Grozny", 1, 0, "The Mujahideen kill a traffic cop."], ["2004.02.23", "India", "Dadsara", 1, 4, "A 10-year old child is killed, and four others critically wounded when an Islamic militant throws a grenade onto a playground."], ["2004.02.23", "India", "Gagarsula", 2, 3, "One security force personnel is killed, and three injured by a remote-controlled bomb.  Elsewhere (Kremshore) a civilian is shot dead outside his shop."], ["2004.02.23", "Iraq", "Kirkuk", 8, 35, "Eight Iraqi policemen are killed in a Fedayeen suicide car bombing.  Thirty-five others, including two children were hurt."], ["2004.02.24", "Iraq", "Mosul", 3, 0, "Two Iraqi translators and a technician are shot to death by Sunni terrorists as they drove to work at a coalition military base."], ["2004.02.25", "Nigeria", "Yelwa", 49, 0, "Forty-nine members of a farming community are slaughtered by Muslim Fulanis after taking refuge in a local church.  Most of the Christians were brutally hacked to death.  The number of injured is unknown."], ["2004.02.26", "Afghanistan", "Sarobi", 5, 3, "Five aid workers, involved in a project to build roads and provide clean water, are ambushed and killed by the Taliban.  Three are injured."], ["2004.02.26", "Chechnya", "Assinovskaya", 14, 0, "Jihadis kill fourteen people with a roadside bomb."], ["2004.02.27", "Algeria", "Boukerdane", 2, 0, "Two off-duty soldiers are executed by Islamic extremists after being stopped at a fake checkpoint."], ["2004.02.27", "Bangladesh", "Dhaka", 0, 1, "An author and scholar barely survives a brutal assassination attempt by Islamists wielding machetes and knives."], ["2004.02.27", "India", "Beerwah", 1, 3, "Militant Muslims fire on a political rally with RPGs.  One woman is killed and two other women hurt."], ["2004.02.27", "Israel", "Lahav", 2, 0, "Palestinian gunmen open fire on a civilian vehicle, killing two young Jewish parents of a two-year old daughter."], ["2004.02.27", "Philippines", "Mariveles", 186, 12, "Abu Sayyaf, the Muslim extremist group, claims responsibility for an explosion on a ferry that kills nearly two-hundred people."], ["2004.02.28", "India", "Bijbehara", 0, 13, "Five security personnel and eight civilians are injured in a grenade attack."], ["2004.02.28", "Pakistan", "Islamabad", 0, 4, "Suicide bomber attacks a Shia mosque.  His is the only fatality, although he did manage to cause serious injury to two children."], ["2004.02.29", "India", "Srinagar", 0, 8, "Eight civilians are injured when militant Muslims stage grenade attack on a security camp."], ["2004.03.01", "Eritrea", "Teseney", 3, 12, "The Islamic Salvation Group plants two bombs at a hospital, killing three people and injuring a dozen others."], ["2004.03.01", "India", "Pulwama", 3, 0, "Militant Muslims kill a civilian and his son in their home.  They also return to the scene of an earlier murder and kill the victim's wife."], ["2004.03.01", "Thailand", "Mayoh", 1, 0, "Muslim separatists shoot a policeman to death as he is driving to work."], ["2004.03.02", "Iraq", "Baghdad", 58, 233, "Three Sunni Fedayeen suicide bombers kill themselves and about fifty-eight worshippers at a Shia shrine and injure more than two-hundred."], ["2004.03.02", "Iraq", "Karbala", 123, 340, "al-Qaeda bombers, including one Fedayeen, kill at least one-hundred and twenty Shias gathered for a religious festival.  About three-hundred others are injured."], ["2004.03.02", "Pakistan", "Quetta", 42, 160, "Sunni terrorists invade a Shia religious procession.  They throw grenades, then fire weapons into the crowd, and finish it off by blowing themselves up.  At least forty-two are killed and more than one-hundred and sixty injured."], ["2004.03.03", "India", "Jammu", 7, 12, "Lashker-e-Toiba ultras storm a high-security central jail in an effort to free other terrorists.  The dead include policemen and civilians."], ["2004.03.04", "Afghanistan", "Pakistani Border", 7, 0, "Seven Afghan troops are killed by a Taliban rocket and machine-gun attack on their post."], ["2004.03.04", "Iraq", "Baghdad", 3, 5, "Three members of a family are killed, and five others injured, by a rocket attack on their car."], ["2004.03.05", "Afghanistan", "Shay Joy", 2, 2, "Taliban gunmen kill an Afghan guard and a Turkish engineer.  They abduct two others."], ["2004.03.06", "Afghanistan", "Nokhaiz", 1, 0, "Taliban gunmen kill an aid worker driving home."], ["2004.03.06", "Israel", "Erez", 3, 9, "Three Palestinian policemen were killed, and nine injured in a botched attack by three terrorists against an Israeli border checkpoint."], ["2004.03.06", "Sudan", "Tawila", 75, 350, "Arabs kill seventy-five Africans, rape 100 women and then abduct about two-hundred children and a further one-hundred and fifty women."], ["2004.03.06", "Sudan", "al-Kureinik", 15, 0, "Government-supported militia group raids a refugee camp and kills fifteen Christian civilians, including a child."], ["2004.03.06", "Yemen", "Zammar", 5, 30, "Gunman tosses grenades and opens fire outside a mosque, killing five and injuring thirty."], ["2004.03.07", "Algeria", "Kabylie", 2, 4, "Bombing attack by Islamic extremists leaves two Algerian soldiers dead and four injured."], ["2004.03.07", "Dagestan", "Makhachkala", 1, 1, "An anti-terror official is gunned down by Muslim radicals."], ["2004.03.07", "Iraq", "Mosul", 2, 2, "Terrorist RPG attack on a police station kills two civilians and injures two more."], ["2004.03.08", "Chechnya", "Grozny", 9, 5, "Nine Russian soldiers are killed in separate Jihad attacks over a 24-hour period."], ["2004.03.08", "Sudan", "Aish Barra", 12, 0, "Twelve civilians, including three children are killed by a militia group supported by the Muslim government."], ["2004.03.09", "India", "Budgam", 3, 35, "Attempted abduction goes awry with a terrorist killing himself and three others with a grenade.  Thirty-five are injured."], ["2004.03.09", "Iraq", "Hilla", 3, 0, "Two American civilians, including a female human rights worker, along with an Iraqi translator are executed after being stopped at a phony checkpoint."], ["2004.03.09", "Turkey", "Istanbul", 2, 7, "Suspected al-Qaeda terrorists use an explosive device and weapons fire against the restaurant of a Masonic lodge."], ["2004.03.10", "Algeria", "El Harrach", 1, 0, "The Salafist group for Preaching and Combat gun down a local cleric."], ["2004.03.10", "Iraq", "Basra", 2, 0, "Two Iraqi women, on their way home from working laundry at a coalition base, are shot to death."], ["2004.03.11", "Afghanistan", "Khost", 2, 3, "Taliban bomb kills two Afghan soldiers and injures another three."], ["2004.03.11", "Indonesia", "Maranatha", 1, 5, "Brutal machete attack on a Christian village leaves a mother of two dead and five others injured."], ["2004.03.11", "Iraq", "Baghdad", 2, 1, "Shia cleric survives assassination attempt, but his son and son-in-law are killed in the shooting ambush"], ["2004.03.11", "Spain", "Madrid", 201, 1841, "Ten coordinated al-Qaeda bomb blasts on commuter trains during the rush hour leave over two-hundred people dead and some fifteen hundred injured."], ["2004.03.12", "Algeria", "Tebessa", 4, 0, "Four Algerian soldiers are killed in an attack by Islamic fundamentalists (Salafist Group for Preaching and Combat)."], ["2004.03.12", "India", "Pulwama", 13, 12, "Muslim militants hole up inside a girl's school after a gun battle with police.  Thirteen people are killed, and at least a dozen wounded in this and incidents in a 24-hour period."], ["2004.03.14", "Israel", "Ashdod", 10, 19, "Two 18-year old suicide bombers kill ten port workers, and injure about twenty more.  Al-Aqsa takes credit and says its intended target, chemical tanks, would have caused far greater civilian casualties."], ["2004.03.14", "Scotland", "Glasgow", 1, 0, "Five Pakistani immigrants abduct, torture and then burn alive a 15-year-old Scottish teen in a horrendous attack.  Three later flee the country."], ["2004.03.15", "Chechnya", "Grozny", 9, 22, "Nine Russian soldiers and police are killed in eighteen separate Jihad attacks over a two-day period."], ["2004.03.15", "Iraq", "Mosul", 4, 1, "Four Christian missionaries working on a humanitarian clean water project for Iraqis are gunned down by Fedayeen terrorists while riding in their vehicle."], ["2004.03.15", "Kosovo", "Pristina", 1, 0, "Serbian youth is killed in a drive-by shooting by Muslim terrorists."], ["2004.03.16", "Iraq", "Baghdad", 2, 11, "Two separate rocket attacks in Baghdad, leave two children dead and about eleven wounded."], ["2004.03.16", "Iraq", "Mosul", 1, 2, "An Iraqi translator is killed in a shooting ambush in the Sunni Triangle.  Two of his family members are injured."], ["2004.03.16", "Iraq", "Mussayib", 2, 0, "Two more humanitarian aid workers (German) on a clean water project are gunned down by Fedayeen (Holy Warriors)."], ["2004.03.16", "Russia", "Arkhangelsk", 58, 12, "Fifty-eight innocent people, including nine children are killed when Chechen terrorists remove the gas caps and cause an explosion in an apartment building."], ["2004.03.17", "Algeria", "Berrouaghia", 8, 2, "Armed Islamic Group (GIA) attack two ambulances in the desert with machine-gunfire, killing eight people and injuring two."], ["2004.03.17", "Iraq", "Baghdad", 3, 9, "Two separate mortar attacks on U.S. bases leave three dead and nine wounded."], ["2004.03.17", "Iraq", "Baghdad", 7, 51, "al-Qaeda car bomb rips through a hotel, killing seven and injuring over fifty."], ["2004.03.18", "Iraq", "Baghdad", 4, 1, "Muslims barge into a Christian home and kill the two children they find there.  There mother is also killed, as well as their grandfather."], ["2004.03.18", "Iraq", "Baqubah", 3, 10, "Sunni gunmen open fire on a bus carrying Iraqi journalists and crew of a local TV station funded by Americans.  Three are killed and ten injured."], ["2004.03.18", "Iraq", "Basra", 3, 1, "Fedayeen suicide bomber kills three other Iraqis and injures at least one outside a hotel."], ["2004.03.19", "Chechnya", "Achkoy-Martan", 2, 3, "Two people are killed and three injured when the Mujahideen fire on a car carrying utility workers."], ["2004.03.19", "Israel", "Jerusalem", 1, 0, "al-Aqsa Brigade apologizes after the jogger that it gunned down in cold blood turns out to be Arab."], ["2004.03.19", "Pakistan", "Karachi", 1, 6, "Islamic radicals spray a police car with automatic weapons fire, killing one and injuring six others, including four passersby."], ["2004.03.19", "Somalia", "Hergeysa", 2, 0, "Two aid workers shot to death in Somalia by anti-Western extremists."], ["2004.03.20", "India", "Manasbal", 2, 40, "Two soldiers were killed by a remote-controlled bomb.  Thirty-eight others, along with two civilians were injured in the terrorist attack."], ["2004.03.21", "India", "Tanka", 3, 4, "Hizb-ul-Mujahideen terrorists kill two children (ages 4 and 5) in their residence with an IED.  Four other family members are injured in the attack.  The same group also killed an off-duty policeman elsewhere in the Doda district."], ["2004.03.21", "Iraq", "Baghdad", 4, 12, "A rocket attack on a U.S. compound kills two Iraqi civilians.  Elsewhere a roadside bombing kills one civilian and one soldier."], ["2004.03.21", "Thailand", "Pattani", 3, 0, "A Buddhist policeman is hacked to death by militant Muslims.  One other policeman and a village chief are shot to death in separate attacks within a 24-hour span."], ["2004.03.22", "Iraq", "Baghdad", 2, 0, "Islamists bind and cut the throats of an Assyrian (Christian) couple in their home. (2004)"], ["2004.03.22", "Iraq", "Baghdad", 2, 0, "Two Finnish businessmen are shot and killed by Fedayeen terrorists."], ["2004.03.22", "Iraq", "Balad", 2, 25, "Car bomb inside a tunnel kills two Iraqi civilians and injures twenty-five others."], ["2004.03.22", "Pakistan", "Islamabad", 11, 12, "Two al-Qaeda ambushes claim the lives of eleven Pakistani soldiers."], ["2004.03.23", "Chechnya", "Grozny", 10, 13, "Ten servicemen and police officers are killed in several different terrorist attacks by Jihadists over a 24-hour period."], ["2004.03.23", "Iraq", "Hilla", 9, 2, "Sunni gunmen open up on a minibus carrying police and recruits with automatic weapons fire, killing nine and injuring at least two."], ["2004.03.23", "Iraq", "Kirkuk", 2, 2, "Drive-by shooting kills two police officers and injures two others."], ["2004.03.23", "Iraq", "Mosul", 2, 6, "Fedayeen rocket attack kills two civilians and injures six others."], ["2004.03.23", "Kosovo", "Kuzmin", 2, 1, "Albanian terrorists kill two police officers and injure and English translator in Kosovo."], ["2004.03.23", "Pakistan", "Bannu", 4, 4, "Package bomb and Russian-made rocket attack kill at least four."], ["2004.03.23", "Thailand", "Yala", 1, 0, "A policeman is murdered by Islamists."], ["2004.03.24", "India", "Rajouri", 1, 1, "Militant Muslims kill a 15-year-old girl in an IED attack that also injures her mother."], ["2004.03.24", "Iraq", "Baghdad", 3, 6, "Terrorists kill a 3-year-old boy, his grandmother, and another relative with a roadside bomb targeting infidels."], ["2004.03.25", "Iraq", "Mosul", 1, 0, "Sunni gunmen kill a Christian Assyrian police officer."], ["2004.03.26", "Iraq", "Fallujah", 8, 25, "Eight civilians, including three children are killed by Sunni extremists in gun battles and mortar attacks with U.S. troops."], ["2004.03.26", "Pakistan", "South Waziristan", 8, 0, "Eight injured soldiers, captured by al-Qaeda, are executed in cold blood.  Bodies are recovered by local tribesmen."], ["2004.03.26", "Pakistan", "Zam Cham", 2, 12, "Two civilians are killed, and more than a dozen injured when al-Qaeda remnants fire a rocket into their village."], ["2004.03.27", "Afghanistan", "Khost", 0, 6, "Six civilians, including a young child are injured by a Taliban rocket attack on a restaurant."], ["2004.03.27", "Indonesia", "Poso", 1, 0, "A 27-year-old Christian is gunned down by Muslim terrorists. (2004)"], ["2004.03.27", "Iraq", "Mosul", 2, 0, "Mujahideen gunmen shoot two British security guards at an oil well then set their vehicle on fire."], ["2004.03.27", "Iraq", "Mosul", 2, 19, "Rocket attack on a city hall kills two civilians and injures nearly twenty, including a child."], ["2004.03.27", "Thailand", "Sungai Kolok", 0, 28, "Twenty-eight people are injured when a bomb hidden on a motorcycle explodes outside a karaoke bar."], ["2004.03.28", "Afghanistan", "Deh Rawood", 2, 13, "Taliban attack on a military post leaves two people dead, three wounded and ten missing."], ["2004.03.29", "Uzbekistan", "Tashkent", 19, 49, "Nineteen people, including children, police officers and civilians are killed in a series of suicide bombings by Muslim extremists in central Uzbekistan.  Nearly fifty are injured."], ["2004.03.30", "Indonesia", "Tomura", 1, 1, "A Christian pastor is fatally wounded by Muslim gunmen in front of his wife at his church.  One other person is also injured in the attack."], ["2004.03.30", "Uzbekistan", "Tashkent", 4, 0, "A civilian and three police officers killed in a series of self-induced explosions and gun battles with terrorists."], ["2004.03.31", "Iraq", "Baqubah", 0, 10, "Six civilians and four police are injured by a car bomb in the Sunni Triangle."], ["2004.03.31", "Iraq", "Fallujah", 4, 0, "In a very brutal attack, a mob of Muslims stop two cars carrying American civilians escorting a food-providing convoy, kill the occupants, set their vehicles on fire, disfigure the bodies and then drag them through the streets."], ["2004.03.31", "Iraq", "Ramadi", 6, 5, "Six civilians killed by a car bomb.  Five injured."], ["2004.03.31", "Sudan", "Deleig", 120, 0, "Troops from the Muslim Republic descend on a village earlier in the month and haul away about one-hundred and twenty men selected for execution. (2004)"], ["2004.04.01", "Chechnya", "Gudermes", 2, 6, "Jihad warriors kill two people and injure another six in a landmine attack."], ["2004.04.02", "Iraq", "Baqubah", 3, 3, "Attackers yell \"Allah Akbar,\" then kill three policemen riding in a vehicle with a hand grenade.  Three others are injured."], ["2004.04.02", "Pakistan", "Lahore", 1, 0, "Christian pastor is gunned down by Muslim extremists in front of his wife and four children."], ["2004.04.02", "Uzbekistan", "Bukhara", 1, 0, "Female suicide bomber kills a policeman and critically injures herself."], ["2004.04.03", "India", "Kashmir", 8, 7, "Mujahideen militants kill two Indian soldiers and six civilians in separate attacks.  Some of the bodies are mutilated."], ["2004.04.03", "Israel", "Avnei Hefetz", 1, 0, "Father of six shot dead by a Hamas terrorist outside his home after spending the evening with his children."], ["2004.04.03", "Spain", "Madrid", 1, 11, "Seven terrorists responsible for the deaths of more than two-hundred train commuters, recite the Qur'an and then blow themselves up.  One policeman is killed."], ["2004.04.04", "Iraq", "Baghdad", 9, 24, "A mob of Shiite radicals storm through a neighborhood, killing nine coalition soldiers sent to protect citizens from violent attack.  Twenty-four others are injured."], ["2004.04.04", "Iraq", "Mahmudiyah", 2, 0, "Shooting ambush kills Iraqi police chief and his driver."], ["2004.04.04", "Pakistan", "Karachi", 5, 1, "Terrorists attack a Pakistani police station, force five captured officers to chant from the Qur'an, then execute them."], ["2004.04.05", "India", "Srinagar", 0, 60, "About sixty people, including women and children are injured when a militant Muslim hurls a grenade into a busy intersection."], ["2004.04.05", "Somalia", "Berbera", 1, 1, "Somaliland government admits that the killers of a Kenyan aid worker were from an al-Qaeda faction.  A German aid worker was seriously injured by the same terrorists."], ["2004.04.06", "Iraq", "Kut", 1, 0, "Radical Shiites enter a house and shoot a South African contractor to death."], ["2004.04.06", "Pakistan", "Karachi", 3, 0, "At least three people are shot to death by gunmen riding motorcycles."], ["2004.04.07", "India", "Choornar Forest", 4, 16, "Four security force personnel are killed, and sixteen injured when Lashkar-e-Toiba terrorists detonate an IED under their vehicles."], ["2004.04.07", "India", "Parigam", 1, 0, "Muslim terrorists enter a civilian's home and shoot his young daughter to death."], ["2004.04.08", "Afghanistan", "Tirin Kot", 1, 2, "The Taliban kidnap three men and brutally kill one in captivity."], ["2004.04.08", "India", "Uri", 11, 68, "Four people are killed immediately (seven others die in hospitals), and sixty-eight injured at a political rally by a Fedayeen suicide bomber."], ["2004.04.08", "Iraq", "Fallujah", 1, 5, "RPG fired from a mosque injures five Marines.  Another is killed in the ensuing gun battle."], ["2004.04.09", "Iraq", "Baghdad", 3, 0, "Three U.S. civilian truck drivers are killed in an attack on their convoy by Fedayeen gunmen.  Their bodies are subsequently mutilated."], ["2004.04.10", "Indonesia", "Poso", 0, 7, "Radical Muslims fire on a group of Christians gathered for Easter service."], ["2004.04.10", "Iraq", "Hit", 4, 12, "British security guard protecting electrical contractors is shot dead.  Elsewhere, an attack on a fuel convoy leaves three dead and twelve injured."], ["2004.04.10", "Pakistan", "Karachi", 1, 6, "The 'Harakat ul Mujahidin' group sets off a bomb at a golf club, killing one patron."], ["2004.04.10", "Thailand", "Had Yai", 1, 35, "Bomb planted by Muslim separatists at a railway station kills a 7-year-old boy and injures thirty-five others."], ["2004.04.11", "Indonesia", "Sulawesi", 0, 7, "Islamic gunmen open fire on an Easter church service, wounding seven worshippers."], ["2004.04.11", "Iraq", "Baghdad", 2, 0, "Helicopter shot down by Jihad militants.  Both crew members are killed."], ["2004.04.11", "Nigeria", "Rwang Doka and Jenkur", 3, 0, "Muslim militia attacks two Christian villages and kills three people, in addition to burning homes."], ["2004.04.11", "Pakistan", "Karachi", 1, 9, "Car bomb set by Islamists at a music concert kills a 23-year-old man and injures nine others."], ["2004.04.11", "Philippines", "Sabah", 3, 0, "Abu Sayyaf terrorists attack a tugboat and take three crew members hostage.  All three are later executed."], ["2004.04.12", "Chechnya", "Ishkhoi-Yurt", 7, 0, "At least seven policemen were killed in a terrorist attack by Jihad fighters on their vehicles."], ["2004.04.13", "Saudi Arabia", "Um Sedrah", 4, 2, "Militants gun down four Saudi police officers at a checkpoint."], ["2004.04.13", "USA", "Raleigh", 1, 4, "Mental health problems behind member of tight-knit Muslim community deliberately running down five strangers with a vehicle?  One died."], ["2004.04.14", "Afghanistan", "Khost", 2, 2, "Taliban elements ambush an Afghan military patrol, leaving two dead and two injured."], ["2004.04.14", "India", "Banihal", 2, 22, "Terrorist hurls grenade at a political rally, killing one and injuring twenty-two.  Another soul dies of injuries four days later."], ["2004.04.14", "Iraq", "Mosul", 4, 6, "Four civilians, including two women are killed and six others injured by a Fedayeen mortar attack on a crowded market."], ["2004.04.15", "Afghanistan", "Chinarto", 10, 0, "A local police chief and nine bodyguards are killed in a Taliban ambush on their vehicles."], ["2004.04.15", "Iraq", "Baghdad", 2, 0, "An Italian hostage is executed on videotape after being interviewed by an Arabic news crew.  Elsewhere, an Iranian diplomat is shot to death by Sunni extremists."], ["2004.04.15", "Sudan", "Darfur", 32, 0, "Thirty-two villagers are massacred by government-backed militias violating a cease-fire.  There were also several homes torched and people injured."], ["2004.04.15", "USA", "Scottsville, NY", 1, 2, "In an honor killing, a Muslim father kills his wife and attacks his two daughters with a knife and hammer because he feared that they had been sexually molested."], ["2004.04.16", "Afghanistan", "Del Aram Road", 8, 0, "Eight Afghan soldiers at a checkpoint are killed in an overnight rocket attack by Taliban miscreants."], ["2004.04.16", "Iraq", "Mosul", 8, 17, "Fedayeen mortar attack leaves eight Iraqi civilians dead and seventeen injured."], ["2004.04.17", "Algeria", "Baghlia", 2, 7, "Bomb planted by Islamic fundamentalists explodes on a road, killing two Algerian security personnel and injuring seven."], ["2004.04.17", "Israel", "Erez", 1, 3, "Hamas takes credit for a suicide bombing that kills a 20-year-old border guard then complains loudly when it's own leader is taken out with a missile a few hours later."], ["2004.04.17", "Kosovo", "Mitrovica", 2, 10, "Jordanian shoots two American women to death who were working as prison guards.  He also injures ten others in the attack."], ["2004.04.18", "Thailand", "Sungai Padi", 1, 0, "Railway worker shot and killed by Muslim separatists while he was on his way to work."], ["2004.04.19", "Afghanistan", "Spin Boldak", 1, 1, "Afghan driver is killed in a Taliban ambush on his oil truck."], ["2004.04.19", "Algeria", "Tipaza", 3, 0, "Three people killed by Islamic fundamentalists who set up a fake road block to snag the victims."], ["2004.04.19", "Chechnya", "Grozny", 3, 0, "A woman and her young son are gunned down by Jihadis, along with one other."], ["2004.04.20", "India", "Srinagar", 16, 24, "Militant Muslims kill at least sixteen, including a female journalist and a taxi driver, in an attempt to disrupt elections.  At least two dozen others are injured."], ["2004.04.20", "Iraq", "Baghdad", 22, 90, "Muslim terrorists mortar Abu Ghraib, killing twenty-two prisoners and injuring over ninety."], ["2004.04.21", "India", "Udhampur", 2, 2, "One civilian is killed in his home (Doda), another abducted and later shot dead.  Muslim militants also cut off the ears of two other people for participating in the elections."], ["2004.04.21", "Iraq", "Basra", 68, 100, "Five suicide bombings kill sixty-eight people, including eighteen children who burned to death in their school bus.  More than one-hundred other civilians were injured in the \"Holy Warrior\" blasts."], ["2004.04.21", "Saudi Arabia", "Riyadh", 6, 148, "al-Qaeda suicide bomber blasts his way to Allah, taking six others, including an 11-year-old girl, with him in the car bomb explosion.  One-hundred and forty-eight innocents are injured."], ["2004.04.22", "Afghanistan", "Sperah", 1, 0, "Taliban ambush kills an Afghan."], ["2004.04.22", "India", "Srinagar", 2, 6, "Two people are killed and six injured in grenade attacks by Islamists attempting to disrupt the elections."], ["2004.04.22", "Iraq", "Baghdad", 1, 0, "South African civilian is shot twice in the head and back while on his way to buy meat for a barbecue."], ["2004.04.22", "Thailand", "Rayang", 3, 0, "Muslim separatists set fire to fifty government buildings, then kill two firefighters trying to put out the blazes.  The next day they shoot an army officer dead in his driveway while he is washing his car."], ["2004.04.23", "India", "Srinagar", 0, 23, "Two separate grenade attacks on political offices leave at least twenty-three people injured, mostly civilians."], ["2004.04.23", "India", "Surankote", 1, 2, "Militants open fire on a police station, killing one officer and injuring two others."], ["2004.04.24", "India", "Bazipora", 2, 0, "Militant Muslims enter the home of a police officer while he is on duty and behead his wife and 8-year-old daughter."], ["2004.04.24", "Iraq", "Baghdad", 5, 6, "Five soldiers are killed in a rocket attack launched from a residential neighborhood.  Six are wounded."], ["2004.04.24", "Iraq", "Baghdad", 12, 25, "Twelve people in a market are killed when Jihadists launched mortar rounds into the crowded area."], ["2004.04.24", "Iraq", "Basra", 2, 4, "Two U.S. sailors were killed after a boat they boarded exploded.  Two other boats with suicide bombers were intercepted before they could do harm."], ["2004.04.24", "Iraq", "Iskandariya", 14, 11, "Fourteen passengers are killed when a bus hits a roadside bomb.  Another eleven are injured in the explosion."], ["2004.04.24", "Iraq", "Tikrit", 4, 16, "Roadside bomb kills four - two police and two civilians.  Sixteen others were injured."], ["2004.04.24", "Thailand", "Pattani", 2, 1, "Two village guards are murdered by Islamists."], ["2004.04.25", "India", "Kulgam", 3, 46, "Militant Muslims attempt to assassinate a female political figure in a grenade attack.  Three are killed and forty-six injured."], ["2004.04.25", "Indonesia", "Ambon", 38, 24, "Islamic radicals go on a rampage against Christians, killing more than thirty (some in sniper attacks) and then setting a UN building on fire."], ["2004.04.25", "Iraq", "Mosul", 2, 10, "Jihad rocket attack on a hospital kills two medics and injures ten other civilian workers."], ["2004.04.25", "Israel", "Migdal Oz", 1, 2, "Palestinian gunmen kill a border policeman and wound two others in a sniper attack from a residential section."], ["2004.04.26", "Afghanistan", "Panjwayi", 3, 2, "Taliban members walk into a humanitarian office and shoot several employees to death.  The office was established to help Afghanis with their basic needs."], ["2004.04.27", "Syria", "Damascus", 2, 0, "A female civilian and a policeman are killed in a shooting and bombing attack on the British embassy in Damascus by four Islamic radicals."], ["2004.04.28", "India", "Srinagar", 2, 55, "Two people are killed, and fifty-five others injured in a terrorist explosion at an election rally."], ["2004.04.28", "Iraq", "Kut", 2, 1, "Two Ukrainian soldiers are killed an RPG attack on their convoy while on security patrol."], ["2004.04.28", "Iraq", "Mosul", 9, 0, "Series of Sunni attacks in Mosul kills eight Iraqi policemen and one civilian."], ["2004.04.28", "Thailand", "Yala", 5, 15, "Thai Muslims storm 15 government buildings in a coordinated attack and kill at least five.  An unknown number are injured."], ["2004.04.28", "Turkey", "Istanbul", 1, 0, "Two family members are arrested after strangling a 14-year-old girl for having fallen victim to rape."], ["2004.04.29", "Afghanistan", "Thaloqan", 6, 0, "Six Afghan soldiers traveling on motorcycles are attacked by Taliban terrorists and killed."], ["2004.04.29", "Iraq", "Basra", 1, 0, "South African civilian is killed by Muslim extremists in a drive-by shooting."], ["2004.04.29", "Iraq", "Mahmudiyah", 8, 4, "A suicide car bombing kills eight U.S. soldiers and injures four others."], ["2004.04.30", "Algeria", "Relizane", 2, 0, "Two hunters fall victim to Islamic extremists in western Algeria."], ["2004.04.30", "Iraq", "Fallujah", 2, 6, "Suicide car bomber kills two U.S. soldiers and injures six."], ["2004.04.30", "Iraq", "Mosul", 2, 5, "Two foreign security guards are killed in a bomb attack.  Five others are injured."], ["2004.05.01", "Algeria", "Sabounet", 3, 1, "A mother and her two children are slaughtered by Islamic extremists in an attack on their village in the Algerian desert."], ["2004.05.01", "Saudi Arabia", "Yanbu", 7, 25, "Three Saudi employees of an oil company use their access to the building to systematically shoot as many Westerners as possible in a room-by-room attack.  At six are killed on the spot and a seventh man dies two weeks later in a Houston hospital."], ["2004.05.01", "Sudan", "Akobo", 204, 70, "Khartoum-backed militia kills over two-hundred people, many women and children in a raid on their camp.  Sudan recently criticized the U.S. for abusing prisoner rights."], ["2004.05.02", "Algeria", "Algiers", 2, 0, "Two police officers are gunned down by Islamists while on-duty."], ["2004.05.02", "Algeria", "Chrea Forest", 2, 4, "Two soldiers are killed when a bomb planted by Islamic extremists explodes under their car.  Four others are injured."], ["2004.05.02", "Algeria", "Medea", 3, 1, "Three community guards are killed by Islamists.  A fourth is kidnapped."], ["2004.05.02", "Chechnya", "Oktyabrskiy", 1, 2, "Islamic terrorists kill on person with a roadside bomb."], ["2004.05.02", "Iraq", "Ramadi", 6, 0, "Sunni mortar attack on a U.S. base kills five sailors and one soldier."], ["2004.05.02", "Israel", "Gush Katif", 5, 3, "Palestinian gunmen ambush a vehicle and kill four Jewish children and their pregnant mother who were in the process of entering their community.  Islamic Jihad takes credit for the brutal attack."], ["2004.05.03", "Afghanistan", "Zabul", 10, 0, "Separate Taliban attacks in southern Afghanistan leave ten security officers dead."], ["2004.05.03", "Pakistan", "Gawadar", 3, 11, "Pakistani radicals bomb a bus carrying Chinese engineers to a port project.  Three are killed and eleven injured."], ["2004.05.04", "Afghanistan", "Nuristan", 3, 0, "Two British civilians, working to register Afghans for upcoming elections, are killed along with their translator in a suspected Taliban ambush."], ["2004.05.04", "Indonesia", "Pekanbaru", 2, 4, "Jemaah Islamiya set a bomb at a grocery store, killing two people and injuring four others."], ["2004.05.05", "Egypt", "Taha al-Aamida", 3, 0, "Muslim police take three Christians, including a priest, into custody as they are repairing a church wall.  All three are then murdered."], ["2004.05.05", "India", "Anantnag Lok Sabha", 1, 2, "Militant Muslim lobs a grenade at a polling booth, killing one and injuring two."], ["2004.05.05", "Indonesia", "Maluku", 2, 3, "Muslim gunmen in a speedboat kill a Christian man and an 11-month-old baby.  Three others are also shot, but manage to survive."], ["2004.05.06", "Chechnya", "Oktyabrsky", 3, 1, "Islamic terrorists kill three police officers in an IED attack."], ["2004.05.06", "Iraq", "Baghdad", 6, 25, "Suicide car bomber kills five civilians and one soldier at a checkpoint.  Twenty-three other civilians injured in the blast."], ["2004.05.06", "Iraq", "Kirkuk", 2, 1, "Car carrying a government official is attacked by Sunni extremists, killing him and the driver, and wounding his wife."], ["2004.05.07", "Iraq", "Latifiya", 2, 1, "An award-winning Polish journalist is shot to death, along with an Algerian colleague by Sunni insurgents in a drive-by attack."], ["2004.05.07", "Iraq", "Mosul", 4, 1, "Roadside terrorist bombing kills four Iraqi policeman."], ["2004.05.07", "Pakistan", "Karachi", 13, 80, "Thirteen worshippers are killed, and more than eighty others injured when a suicide bomber detonates his explosives inside a Shiite mosque."], ["2004.05.07", "Pakistan", "Toba Tek Singh", 1, 0, "Catholic student abducted by Muslim school refuses to convert to Islam and is tortured to death."], ["2004.05.07", "Thailand", "Pattani", 2, 0, "Two people are gunned down in separate attacks by Islamic separatists, including a man riding home on a motorcycle."], ["2004.05.09", "Afghanistan", "Kabul", 2, 0, "Two foreigners, one a Swiss citizen, are stoned to death in a public park."], ["2004.05.09", "Chechnya", "Grozny", 24, 60, "Jihadists assassinate the Chechen President and at least twenty-three others in a stadium blast that leaves more than fifty, including elderly and children severely injured."], ["2004.05.09", "India", "Doda", 1, 15, "Militant Muslim lobs a grenade at a hospital, killing one and injuring fifteen others."], ["2004.05.09", "Iraq", "Baghdad", 7, 13, "Terrorists kill a child and six others by exploding a bomb in a crowded market.  Thirteen others are injured."], ["2004.05.09", "Philippines", "Zamboanga", 6, 0, "Islamic militants are suspected in an ambush that leaves six campaign workers dead."], ["2004.05.10", "Iraq", "Kirkuk", 3, 0, "Radicals shoot two foreign civilians and one Iraqi to death in front of their house."], ["2004.05.10", "Iraq", "Mosul", 1, 4, "Insurgents kill a four-year-old girl in a rocket strike."], ["2004.05.11", "Iraq", "Baghdad", 2, 3, "\"Allahu Akbar\" shout jubilant al-Qaeda members as they cut off the head of an American (civilian) prisoner on video.  Elsewhere in the city, a Russian contractor is killed and two others abducted."], ["2004.05.11", "Israel", "Gaza", 6, 0, "Hamas terrorists trigger a land mine blast under an APC, killing six young Israeli soldiers.  Hamas also takes the body parts to prevent their recovery."], ["2004.05.11", "Nigeria", "Kano", 11, 0, "At least eleven Christians are burned to death by a Muslim mob that also sets two churches on fire."], ["2004.05.12", "Iraq", "Balad", 1, 4, "Philippine warehouse worker is killed, and four other civilian employees injured in a mortar attack on a U.S. base from a residential neighborhood."], ["2004.05.12", "Israel", "Rafah", 5, 0, "Another remote-controlled landmine attack by Islamic Jihad on an APC kills five additional Israeli soldiers attempting to block off tunnel used by Palestinian terrorists."], ["2004.05.12", "Nigeria", "Kano", 30, 44, "Muslim rampage against Christians continues in Kano with at least another thirty people losing their lives."], ["2004.05.12", "Philippines", "Jolo", 1, 14, "Abu Sayyaf terrorists kill a fifteen-year-old Catholic girl with a grenade - fourteen others are also injured in the attack."], ["2004.05.14", "Israel", "Rafah", 2, 2, "Hamas snipers kill an Israeli soldier as he was in the process of bringing food to an elderly Palestinian woman's house.  A soldier attempting to help the first was killed as well."], ["2004.05.14", "Pakistan", "Lahore", 7, 0, "Seven members of a Shia' family, including two women and two children (one a 7-year-old girl) are bound and executed in their home with a bullet to each head.  'Shiites are Infidels' is found written on the wall."], ["2004.05.15", "Dagestan", "Makhachkala", 2, 0, "Terrorists gun down two police officers returning home from work."], ["2004.05.15", "Iraq", "Mosul", 4, 17, "Four civilians were killed, and seventeen others injured by a mortar attack on a recruitment office."], ["2004.05.16", "Iraq", "Baghdad", 3, 1, "Muslim radical opens fire on a minibus carrying Christian women, forcing them to the side of the road.  He then tosses an explosive in the vehicle, killing three, including the driver."], ["2004.05.16", "Iraq", "Mahmudiyah", 1, 1, "Iraqi woman working as a translator for the coalition is killed in her home."], ["2004.05.17", "Chechnya", "Grozny", 12, 3, "Three separate Jihad attacks leave twelve Russian servicemen dead and at least three injured or kidnapped."], ["2004.05.17", "Iraq", "Baghdad", 7, 8, "Fedayeen suicide bomber kills the Iraqi governing council president and at least six others.  Eight were reported to be injured in the blast."], ["2004.05.17", "Thailand", "Narathiwat", 1, 3, "Muslims bomb three Buddhist temples on Sunday, injuring two.  The next day they shoot a police officer in the head, as he is riding to work."], ["2004.05.18", "Algeria", "Setif", 2, 13, "Salafist Group for Preaching and Combat, an Islamic extremist group kills two Algerian soldiers and injures thirteen others in two bombing ambushes."], ["2004.05.18", "Israel", "Rafah", 2, 0, "Palestinian bombs take the lives of two Arab teenagers - a sixteen-year-old girl and her 13-year-old brother - who were washing clothes on the roof of their house when hit by the shrapnel."], ["2004.05.18", "Nigeria", "Gidan Sabo", 18, 0, "Muslim Nigerians kill eighteen Christian villagers - mostly farmers, women and children."], ["2004.05.18", "Pakistan", "Karachi", 4, 0, "Four members of Pakistan's Christian minority are targeted and killed by Islamists.  One was a kidnapped youth and two others were on their way to a picnic."], ["2004.05.19", "Nigeria", "Bakin Ciyawa", 24, 0, "Jihadists kill twenty-four Christian villagers."], ["2004.05.19", "Nigeria", "Sabo Gida", 10, 0, "Ten Christian villagers are killed by armed Muslims.  An unknown number are injured by the attackers, who also burned churches and houses."], ["2004.05.19", "Thailand", "Narathiwat", 3, 2, "Islamists fire indiscriminately into a crowd at a pavilion, killing three civilians and injuring two."], ["2004.05.20", "India", "Chadoura", 3, 22, "Hizb-ul-Mujahideen terrorists kill three, including two children, and injure about two dozen with a bomb planted on a bicycle."], ["2004.05.20", "Iraq", "Mosul", 1, 4, "Bomb blast kills one Iraqi civilian and injures four others."], ["2004.05.21", "Bangladesh", "Sylhet", 2, 50, "At least two people are killed by a bomb blast at a shrine.  Some fifty others, including a British diplomat are injured."], ["2004.05.21", "Iraq", "Baqubah", 4, 1, "Jihadists kill four Iraq security personnel manning a road block by driving up and then unloading with RPGs and weapons fire."], ["2004.05.21", "Nigeria", "Jiram", 15, 0, "Fifteen Christian villagers are massacred by Jihadists."], ["2004.05.21", "Nigeria", "Saminaka", 7, 0, "In the latest of a series of attacks on Christian villagers, seven more are killed by Nigerian Jihadists as they sought refuge in their homes."], ["2004.05.22", "Iraq", "Baghdad", 6, 10, "Fedayeen suicide bomber kills six other Iraqis and injures at least ten.  In addition to improving the bomber's afterlife, the blast was intended to kill a ministry official and his wife."], ["2004.05.22", "Israel", "Nablus", 0, 4, "A 19-year-old suicide bomber kills himself and injures four others at a checkpoint."], ["2004.05.22", "Saudi Arabia", "Riyadh", 1, 0, "A German caterer is shot in the head and body, execution-style, on the sidewalk outside a shopping mall."], ["2004.05.22", "Sudan", "Abga Rajil", 56, 24, "Arab militia kill fifty-six African villagers in a raid.  The government-supported terrorists targeted black civilians in their attack."], ["2004.05.22", "Thailand", "Narathiwat", 1, 0, "Muslim separatists shoot a police corporal to death as he is walking home."], ["2004.05.23", "Afghanistan", "Waza Khwa", 3, 1, "Three Afghan security personnel are killed in a Taliban ambush while they are escorting a food and medical supply shipment to an impoverished area."], ["2004.05.23", "Chechnya", "Grozny", 5, 6, "Five Russians are killed when Jihadists blow up their vehicle and then open fire with assault rifles."], ["2004.05.23", "India", "Srinagar", 33, 4, "Hizb-ul-Mujahideen militants trigger a bomb under a bus carrying security personnel and their families.  Thirty-three people, including six women and three children are killed."], ["2004.05.23", "Iraq", "Baqubah", 2, 1, "Terrorists fire on a vehicle, killing a university student and a police official."], ["2004.05.23", "Iraq", "Basra", 5, 0, "Five members of a family, including two children (ages 4 and 7), are killed in an insurgent mortar attack."], ["2004.05.24", "Iraq", "Baghdad", 2, 1, "Islamic terrorists kill two British civilians in a rocket attack on their vehicle."], ["2004.05.25", "Indonesia", "Ambon", 1, 13, "Bomb blast in the Christian sector of the city kills one and injures thirteen.  A second bomb is found near a church and defused."], ["2004.05.25", "Iraq", "Baghdad", 1, 4, "An Iraqi boy is killed, and four other civilians injured when a car bomb explodes outside a hotel, near the Australian consul's office."], ["2004.05.26", "Chechnya", "Vedeno", 4, 4, "Four policemen are killed, and four others injured in an attack by Muslim rebels."], ["2004.05.26", "Iraq", "Baghdad", 5, 6, "Two Russian civilian contractors and two Iraqi civilians are killed in a shooting attack on their bus as it is pulling out from a power plant.  This follow the 5/10 beating death of another Russian civilian."], ["2004.05.26", "Nigeria", "Wase", 3, 6, "Fulani militia attacks a government building, killing three workers and injuring at least six.  They also burned houses."], ["2004.05.26", "Pakistan", "Karachi", 1, 22, "Twin Jihadist car bombings outside the Pakistan-American cultural center kill one and injure at least twenty-two others."], ["2004.05.27", "India", "Jammu", 5, 2, "In five separate attacks in the J&K;, militant Muslims assassinate four civilians and one former SP officer.  Two others are abducted and missing."], ["2004.05.27", "Iraq", "Najaf", 2, 0, "Fedayeen insurgents attack a vehicle carrying a member of the Iraqi governing council.  Her son and bodyguard are killed."], ["2004.05.27", "Uzbekistan", "Isfara", 1, 0, "A Baptist pastor gunned down by members of the Islamist group, Bayrat."], ["2004.05.28", "Eritrea", "Barentu", 7, 88, "At least seven people are killed, and more than eighty injured in a bomb blast.  The government in neighboring Sudan is suspected of funding the Islamic groups responsible for these attacks."], ["2004.05.28", "India", "Beerwah", 3, 0, "Five Islamic terrorists invade a home and kill an elderly man, a 2-year-old boy, and the boys mother.  All are shot to death."], ["2004.05.28", "Iraq", "Mahmudiyah", 2, 0, "Two Japanese journalists on their way to pick up a 10-year-old blinded child for treatment in Japan are attacked by a Muslim mob, dragged out of their car and beaten to death."], ["2004.05.28", "Nigeria", "Langtang", 3, 0, "Assault by armed Muslims leaves three Christians dead and several hundred homeless after their village is burned."], ["2004.05.28", "Pakistan", "Lahore", 1, 0, "Pakistani Christian who was attacked with a hammer by a policeman for violating the State's blasphemy laws dies of his injuries.  The killer claimed he wanted to \"earn a spot in Paradise.\""], ["2004.05.28", "Sudan", "Tabit", 20, 17, "Sudanese warplanes bomb a Christian village, killing at least twenty."], ["2004.05.29", "Indonesia", "Palu", 1, 0, "A Christian prosecutor, working to keep three Bali bombers in jail, is assassinated by Jemaah Islamiah extremists in his car."], ["2004.05.29", "Saudi Arabia", "Khobar", 22, 45, "\"Are you Christian or Muslim,\" ask al-Qaeda militants as they shoot twenty-two infidels to death, including a 10-year-old boy, and take over forty-five hostages in an attack on an office complex."], ["2004.05.29", "Thailand", "Pattani", 1, 0, "Muslim radicals kidnap a Buddhist civilian and decapitate him.  They leave the body with a note attached, warning other Buddhists of the same fate."], ["2004.05.30", "Afghanistan", "Musa Qala", 4, 8, "Taliban assassins riding motorbikes swoop into a town and shoot up a government building, killing four and injuring eight."], ["2004.05.30", "Pakistan", "Karachi", 1, 4, "Senior Sunni cleric, age 72, is assassinated in an ambush by Shia radicals."], ["2004.05.31", "Iraq", "Baghdad", 4, 25, "Four Iraqis are killed in a car bombing.  Another twenty-five are injured."], ["2004.05.31", "Pakistan", "Karachi", 19, 35, "Sunni suicide bomber targets a Shia mosque.  Nineteen worshippers are killed and at least thirty-five others injured."], ["2004.05.31", "Pakistan", "Turbat", 1, 12, "Fundamentalists target a Minster of Education who proposed reduced Islamist influence in a new curriculum.  She survives the rocket attack, but a 14-year-old boy is killed and a dozen others injured."], ["2004.06.01", "Algeria", "Theniet El-Abed", 3, 11, "Islamic fundamentalists ambush a security patrol, killing three Algerians and wounding eleven."], ["2004.06.01", "Iraq", "Baghdad", 3, 20, "Three are killed, and more than twenty injured by a car bombing targeting the minority Kurds, who are seen as infidels by the other Muslim sects."], ["2004.06.01", "Iraq", "Baiji", 11, 26, "Car bombing by Sunni terrorists kills eleven Iraqis and injures twenty-six."], ["2004.06.02", "Afghanistan", "Khair Khana", 5, 0, "Five members of Doctors Without Borders, the international aid group that provides medical assistance to the impoverished are killed by the Taliban in an ambush on their vehicle."], ["2004.06.02", "Algeria", "Bejaia", 11, 44, "The Islamic Salafist Group for Preaching and Combat attack an Algerian security convoy, killing at least eleven."], ["2004.06.02", "Iraq", "Baghdad", 5, 37, "Five people rushing to help an injured woman are killed by a car bomb.  Thirty-seven others are injured in the terrorist blast."], ["2004.06.02", "Syria", "Damascus", 2, 0, "Attack by gunmen on the former UN headquarters leaves a policeman and a civilian dead."], ["2004.06.03", "India", "Kellar Pahalgam", 2, 0, "A political activist is assassinated by militant Muslims.  Another civilian his killed in his home in a separate attack (Kishtwar)."], ["2004.06.03", "Pakistan", "North Waziristan", 1, 2, "al-Qaeda suicide bomber kills a border guard and injures two others."], ["2004.06.04", "Chechnya", "Grozny", 1, 1, "Islamic fundamentalists explode a bomb outside a movie theater."], ["2004.06.04", "Chechnya", "Itum-Kalinskiy", 4, 5, "Jihadists attack a Russian convoy, killing four and injuring five with grenades and automatic weapons."], ["2004.06.04", "Russia", "Samara", 10, 39, "Ten people are killed in a bomb explosion in an outdoor market.  Another forty are injured by the blast, which is attributed to militant Muslims."], ["2004.06.05", "Algeria", "Jijel", 3, 0, "Islamic extremists ambush and kill a policeman and two village guards."], ["2004.06.05", "Bangladesh", "Dhaka", 9, 25, "At least nine people, including an infant and two women are killed when a state bus is set on fire by organized Islamic terrorists.  About thirty others are hospitalized for serious burns."], ["2004.06.05", "India", "Mawar", 2, 0, "Hezb-ul-Mujahedeen gunmen invade a home and kill a 55-year-old woman and her daughter."], ["2004.06.05", "Iraq", "Baghdad", 4, 1, "Mujahideen gunmen kill four civilian contractors in an ambush - two Americans and two Poles."], ["2004.06.05", "Iraq", "Mosul", 0, 17, "Militants fire RPGs at jobseekers lining up outside a recruitment office.  Seventeen are injured."], ["2004.06.05", "Iraq", "Musayyib", 7, 0, "Jihadists disguise themselves as police officers to gain entrance to a police station, then proceed to kill seven officers in cold blood."], ["2004.06.06", "Iraq", "Baghdad", 9, 48, "Two suicide bombers, belonging to a group calling itself the 'Unification and Jihad Group' kill nine Iraqis and injure forty-eight others."], ["2004.06.06", "Kosovo", "Gracanica", 1, 0, "17-year-old Christian teenager is shot to death in a restaurant by Muslim terrorists."], ["2004.06.06", "Pakistan", "Dera Ghazi Khan", 1, 1, "Female Shia doctor is gunned down by Sunni radicals outside a hospital.  Her driver is seriously wounded in the attack."], ["2004.06.06", "Saudi Arabia", "Riyadh", 1, 1, "Islamist shoots a Briton to death on the sidewalk.  One other is injured in the attack."], ["2004.06.07", "Afghanistan", "Logar", 2, 0, "Two policemen are killed in a Taliban attack on their station."], ["2004.06.07", "Iraq", "Baghdad", 4, 0, "In the same Christian neighborhood as the morning drive-by, Islamic extremists murder four, including three women returning from work."], ["2004.06.07", "Iraq", "Baghdad", 4, 3, "Islamic terrorists target Christian workers in a morning shooting attack that leaves four dead and several wounded."], ["2004.06.07", "Thailand", "Pattani", 2, 0, "Muslim gunmen shoot a Buddhist teacher to death on the street, one of two Buddhist civilians killed in separate attacks."], ["2004.06.08", "Iraq", "Baqubah", 6, 24, "A Fedayeen suicide bomber kills six, including five civilians, and injures over two dozen with his attack, which took place on a busy road at rush hour."], ["2004.06.08", "Iraq", "Mosul", 10, 58, "Ten Iraqis are killed by a car bombing.  Dozens of others are injured in the terrorist attack."], ["2004.06.08", "Iraq", "Suwayrah", 6, 0, "Six European coalition troops are killed by a mortar fired at their base."], ["2004.06.08", "Saudi Arabia", "Riyadh", 1, 0, "American civilian gunned down by Islamists at his home in Saudi Arabia."], ["2004.06.09", "Chechnya", "Grozny", 10, 5, "Jihad attacks leave nine Russian soldiers and one policeman dead over a 24-hour period."], ["2004.06.09", "England", "Brixton", 1, 0, "A 21-year-old man is stabbed to death by Muslim gang members for refusing to convert to Islam."], ["2004.06.10", "Afghanistan", "Kunduz", 11, 4, "Taliban attack a construction site and shoot to death eleven Chinese nationals working there. Four others are injured."], ["2004.06.10", "India", "Udhampur", 4, 0, "Militant Muslims shoot four members of a family to death, including two women and a 6-year-old child."], ["2004.06.10", "Iraq", "Baghdad", 1, 0, "A Christian man is attack and murdered by Islamists in his home."], ["2004.06.10", "Pakistan", "Karachi", 11, 10, "Islamic militants ambush a convoy in a busy residential neighborhood.  The intended target escapes the shooting attack, but eleven others are killed."], ["2004.06.10", "USA", "Atlanta, GA", 0, 4, "A man riding on an Atlanta commuter train mutters Qur'anic verses then attacks an army officer for no other apparent reason.  An elderly woman and two arresting officers are hurt as well."], ["2004.06.11", "Chechnya", "Grozny", 3, 1, "Jihadis explode a bomb under a police vehicle, killing three occupants."], ["2004.06.11", "Iraq", "Fallujah", 3, 0, "al-Qaeda members kill three hostages kidnapped the day before by cutting their throats.  The three were employees of a telecommunications company."], ["2004.06.12", "Algeria", "Skikda", 1, 3, "Islamic fundamentalists detonate an IED as four civilians walking by."], ["2004.06.12", "Chechnya", "Grozny", 2, 1, "Two policemen are killed in a Jihad bombing attack."], ["2004.06.12", "India", "Pahalgam", 5, 28, "Islamist kills five tourists, including two children with a grenade lobbed inside a crowded hotel.  Twenty-eight others are injured."], ["2004.06.12", "Philippines", "Jolo", 1, 2, "Abu Sayyaf place a bomb outside a restaurant which kills one person."], ["2004.06.12", "Saudi Arabia", "Riyadh", 1, 1, "al-Qaeda kills an American civilian as he is parking his car outside his home and kidnaps another American."], ["2004.06.13", "India", "Baramulla", 2, 1, "Islamic militant hurls a grenade at the house of a retired government official, killing the man, his sister and seriously injuring his son."], ["2004.06.13", "India", "Handwara", 1, 22, "Twenty-two civilians are injured, four critically by an Islamist who threw a grenade into a busy street.  One victim later dies in the hospital (6/14/04)."], ["2004.06.13", "Iraq", "Baghdad", 2, 0, "Extremists assassinate two government officials in separate shooting attacks."], ["2004.06.13", "Iraq", "Baghdad", 13, 12, "A Fedayeen suicide bomber kills thirteen Iraqis and injures at least a dozen with a car bomb."], ["2004.06.14", "India", "Rajouri", 2, 0, "A father and son are shot to death in their home by Muslim terrorists."], ["2004.06.14", "Iraq", "Baghdad", 13, 61, "A suicide bomber targets foreign civilian contractors working to restore the country's power plants.  Thirteen people, other than this religious man, were killed immediately and more than sixty injured."], ["2004.06.15", "Iraq", "Kirkuk", 4, 1, "Four people assassinated in as many days by Fedayeen.  The civilian victims are an oil company executive, a cleric, district mayor and the father of a policeman."], ["2004.06.15", "Thailand", "Yala", 1, 0, "A rubber farmer is murdered by Muslim terrorists while riding in his truck."], ["2004.06.16", "Afghanistan", "Kanduz", 4, 1, "Four citizens, including two children and an elderly man are killed by a Taliban remote-control bomb."], ["2004.06.16", "Thailand", "Narathiwat", 3, 7, "Muslim separatists kill an 18-year-old college student, a school janitor and a police officer in a drive-by shooting attacks.  They also bomb a police check-point, injuring five."], ["2004.06.17", "Iraq", "Baghdad", 35, 145, "'Holy Warrior' suicide bomber kills at least thirty-five Iraqi civilians and injures nearly one-hundred and fifty other innocents who happened to be on a busy street near a recruiting center.  The vehicle used was apparently packed with artillery rounds."], ["2004.06.17", "Iraq", "Balad", 6, 4, "Car bombing by Sunni insurgents kills six member of the Iraqi Defense Forces and injures four."], ["2004.06.18", "Saudi Arabia", "Riyadh", 1, 0, "Family members of captured hostage appeal to kidnappers humanity with children and grandchildren.  Islamists quote from the Qur'an, praise Allah and then cut the victim's head off."], ["2004.06.18", "Sudan", "Babanousa", 3, 12, "The Islamic government kills two student demonstrators, along with a 50-year-old shop owner."], ["2004.06.19", "Iraq", "Basra", 3, 0, "Remote-controlled bomb kills two oil workers and one Iraqi security personnel."], ["2004.06.19", "Thailand", "Pattani", 1, 4, "Militant Muslims spray a police car with an AK-47, killing the driver.  The same group injures four others with a bomb."], ["2004.06.19", "Thailand", "Yala", 1, 3, "A Buddhist teacher is shot to death by Muslim extremists."], ["2004.06.20", "Iraq", "Diyala", 2, 0, "Husband and wife are killed when \"holy\" warriors fire rocket into their home."], ["2004.06.21", "Afghanistan", "Kandahar", 1, 3, "A policeman is killed and an election worker, along with four others are injured in a Taliban motorcycle attack."], ["2004.06.21", "Algeria", "Algiers", 0, 11, "Eleven are injured in a fundamentalist car bombing of a power plant."], ["2004.06.21", "Ingushetia", "Nazran", 57, 60, "Jihad fighters rampage through a town, shooting in cold blood or burning to death at least fifty-seven people and injuring another sixty."], ["2004.06.21", "Iraq", "Baghdad", 10, 0, "Sunni extremists kill ten civilians and police in a mortar attack."], ["2004.06.21", "Israel", "Kfar Darom", 1, 0, "Palestinian terrorists attack a Jewish settlement, killing a greenhouse worker from Thailand."], ["2004.06.21", "Sudan", "Golo", 6, 0, "Government-backed militia burns several villages and kill six civilians.  More than a thousand are displaced."], ["2004.06.22", "Iraq", "Baghdad", 1, 0, "al-Qaeda group \"Monotheism and Jihad\" beheads a Korean hostage in front of a banner praising Allah."], ["2004.06.22", "Iraq", "Baghdad", 3, 6, "Car bomb explodes in a residential neighborhood, killing three, including a 3-year-old girl and injuring another six civilians."], ["2004.06.22", "Iraq", "Mosul", 2, 0, "Islamists stab a female law professor to death on her doorstep.  Her husband is killed in the same manner."], ["2004.06.22", "Thailand", "Narathiwat", 1, 0, "A religious teacher is gunned down by Islamic separatists in his home."], ["2004.06.23", "Afghanistan", "Spin Boldak", 5, 2, "Taliban extremists shoot a rocket at an Afghan military vehicle on security patrol.  Five killed, two injured."], ["2004.06.23", "Ingushetia", "Nazran", 35, 58, "Thirty-five more bodies are found from the attack on a town by Jihad terrorists.  The number injured doubles to one-hundred nineteen."], ["2004.06.23", "Iraq", "Baghdad", 3, 2, "A mother and her child are among three killed by a roadside bomb.  Two other civilians are wounded in the blast."], ["2004.06.23", "Iraq", "Basra", 2, 0, "As their father waited at home for their return, two Christian sisters are gunned down by Muslim extremists in a particularly heinous and senseless murder."], ["2004.06.24", "Algeria", "Medea", 5, 0, "Islamic fundamentalists stop a car on a remote road carrying members of a family and slit the throats of all five - ages 8 to 50."], ["2004.06.24", "Iraq", "Mosul", 112, 320, "Series of coordinated terrorist attacks, including suicide bombings and other Fedayeen tactics kill over one-hundred Iraqis and injure hundreds more across the country.  Recorded message says 'killings will continue until Islamic rule back on earth.'"], ["2004.06.24", "Thailand", "Cho Airong", 1, 2, "Muslim separatists attack an army base, killing one Thai soldier and injuring two others."], ["2004.06.25", "Afghanistan", "Zabul", 16, 0, "The Taliban stops a bus in a remote area, kidnaps sixteen people carrying voter registration cards, then kills them in brutal fashion."], ["2004.06.25", "Chechnya", "Grozny", 1, 1, "Government official shot to death as he left a restaurant with his wife, who was badly injured in the assassination."], ["2004.06.25", "India", "Tiali Kathamara", 12, 12, "Twelve people, including a woman and five children are killed by militant Muslim gunmen who enter a remote village and force the people out of their homes.  Ethnic cleansing appears to be the motive."], ["2004.06.26", "Afghanistan", "Jalalabad", 3, 11, "Two female election workers and one child are killed, and nine other women and two children are badly injured when a Taliban-planted bomb explodes on a bus."], ["2004.06.26", "India", "Zainapora", 2, 0, "Lashkar-e-Toiba terrorists kidnap two Hindus (a railway engineer and his brother) on Wednesday, then slit their throats."], ["2004.06.26", "Iraq", "Baqubah", 3, 20, "Car bombing kills one, injures twenty.  In Erbil, a shooting and grenade attack on a Shiite political office leaves two guards dead."], ["2004.06.26", "Iraq", "Hilla", 23, 58, "Twenty-three civilians are killed by two car bombings near a Shiite mosque in Hilla.  About sixty others are injured in the blasts."], ["2004.06.27", "Algeria", "Blida", 3, 0, "Islamic fundamentalists kidnap two civilians, then kill them by cutting their throats.   They place a bomb under one of the bodies that kills an investigating medical worker."], ["2004.06.27", "Chechnya", "Grozny", 1, 3, "Islamic terrorist explode a bomb near a roadside cafe, killing one civilian."], ["2004.06.27", "Iraq", "Baghdad", 2, 8, "Insurgents drop a mortar on a soccer field, killing two children and injuring another eight."], ["2004.06.27", "Iraq", "Baqubah", 6, 4, "Sunni extremists attack a checkpoint with automatic weapons and rockets, killing six Iraqi guardsmen."], ["2004.06.27", "Israel", "Gaza", 1, 5, "al-Aqsa terrorist group digs a 350-meter tunnel under an Israeli guard post, detonates explosives, then uses assault rifles to prevent ambulance crews from rescuing the victims."], ["2004.06.27", "Thailand", "Narathiwat", 1, 6, "Muslim group plants a bomb under a soccer field to kill off-duty policemen, who were inaugurating a youth league."], ["2004.06.28", "Israel", "Sderot", 2, 12, "Palestinian militants fire a rocket into a residential area, killing two, including a 3-year-old boy.  The murdered child's mother was among a dozen injured."], ["2004.06.29", "Iraq", "Baghdad", 1, 0, "al-Jazeera airs a videotape of a U.S. hostage being executed by al-Qaeda."], ["2004.06.29", "Iraq", "Mahmudiyah", 2, 0, "Extremists cite Qur'anic verses then attack a police station with assault rifles, killing an officer and a civilian."], ["2004.06.29", "Israel", "Beit Rima", 1, 0, "Palestinian sniper guns down a 63-year-old Israel truck driver.  Arafat's al-Aqsa takes credit."], ["2004.06.29", "Thailand", "Pattani", 1, 0, "Muslim terrorists on motorcycles shoot a Buddhist policeman to death as he is driving to work."], ["2004.06.30", "Afghanistan", "Ghazni", 1, 0, "A convert to Christianity (and father of four daughters) is dragged out of his home by the Taliban, who then slit his throat."], ["2004.06.30", "Afghanistan", "Jalalabad", 1, 26, "One man was killed and twenty-six others, including five children, were injured by two Taliban bombs hidden in fruit carts."], ["2004.06.30", "India", "Pulwama", 1, 0, "Islamists kill a schoolteacher with a grenade."], ["2004.07.01", "Chechnya", "Grozny", 2, 0, "Two civilians are murdered by the Mujahideen."], ["2004.07.01", "Ingushetia", "Malgobek", 2, 1, "Two policemen are killed, and one injured, as the were attempting to arrest the terrorists behind the 6/23 attacks that left over ninety people dead."], ["2004.07.01", "Iraq", "Baghdad", 2, 3, "Two civilians are killed, and three badly injured, as Sunni extremists detonate a bomb near a hospital."], ["2004.07.01", "Iraq", "al-Khadra'a", 3, 2, "Three civilians are killed as they pass over a bomb in their vehicle."], ["2004.07.01", "Thailand", "Pattani", 1, 1, "Muslim separatists kill a police informer and, in a separate attack, shoot a food vendor several times in the back."], ["2004.07.02", "India", "Mughal Maidan", 5, 15, "Pakistani-backed Islamic militants bomb a string of police cars, killing at least five and injuring over fifteen."], ["2004.07.03", "Afghanistan", "Jalalabad", 1, 0, "Third woman dies from injuries sustained in the Taliban grenade attack against election workers."], ["2004.07.03", "India", "Srinagar", 2, 66, "Two citizens are killed, and more than sixty injured by two Islamist planted bombs, hidden handcarts, near a tourist center."], ["2004.07.03", "Iraq", "Mahmudiyah", 7, 5, "Seven Iraqi National Guardsmen are gunned down at a checkpoint by Sunni extremists."], ["2004.07.04", "Iraq", "Baqubah", 3, 1, "Fedayeen \"holy warrior\" suicide car bombing leaves three dead."], ["2004.07.04", "Israel", "Yabad", 1, 1, "Palestinian gunmen stop a car, confirm that the occupants are Jewish civilians, then open up with automatic weapons, killing a man and injuring his wife."], ["2004.07.04", "Pakistan", "Mata Banda", 3, 7, "Three people, including a woman are killed, and seven injured when armed militants fire on a passenger bus."], ["2004.07.06", "Iraq", "Baqubah", 14, 25, "Fourteen mourners at a funeral for a man killed by terrorists are themselves victims of a Fedayeen suicide car bombing.  Dozens of others are injured."], ["2004.07.07", "Iraq", "Baghdad", 0, 6, "Extremists fire mortars at the residence of the new Iraqi Prime Minister, injuring six."], ["2004.07.08", "Afghanistan", "Chakaw", 6, 4, "Taliban ambush kills six Afghan soldiers and injures another four."], ["2004.07.08", "Bangladesh", "Harinakundu Bazaar", 1, 1, "Bangladeshi terrorists kill a policeman (father of two) returning to the station after patrol."], ["2004.07.08", "Iraq", "Ramadi", 3, 0, "An Iraqi civilian and two policemen are shot at point-blank range after their car is stopped by extremists."], ["2004.07.08", "Iraq", "Samarrah", 7, 30, "al-Qaeda use a residential neighborhood as a staging area for firing mortars, killing five U.S. soldiers and two Iraqis."], ["2004.07.08", "Thailand", "Pattani", 1, 0, "A hospital worker is murdered by Islamists."], ["2004.07.09", "Afghanistan", "Nangarhar", 1, 2, "The Taliban continues to target women who work to register voters for the election.  One is killed in the blast, and two others badly injured."], ["2004.07.09", "Chechnya", "Znamenskoye", 11, 10, "A village elder, who opposed Jihadist attempts to recruit young men, was executed by them.  Jihad terrorist attacks also killed ten others (mostly Russian servicemen)."], ["2004.07.09", "Iraq", "Baghdad", 1, 3, "Sunni militants kill a child and injure three others in a mortar attack on a hotel."], ["2004.07.09", "Russia", "Moscow", 1, 0, "An American journalist of Forbes magazine is assassinated by Islamic separatists."], ["2004.07.10", "Chechnya", "Goity", 1, 0, "The Mujahideen murder the wife of a police officer."], ["2004.07.10", "India", "Mattan Adda", 0, 34, "Thirty-four people are injured when a militant Muslim tosses a grenade onto a crowded road."], ["2004.07.10", "Iraq", "Baqubah", 1, 0, "Islamists bomb five shops selling alcohol.  A passing taxi driver is killed in one of the explosions."], ["2004.07.10", "Israel", "Gaza", 1, 0, "Three members of a Palestinian \"resistance\" group (billing itself as non-violent) are killed when the bomb they are transporting goes off earlier than expected.  A passerby is also killed."], ["2004.07.11", "Afghanistan", "Herat", 5, 33, "Five people, including a 12-year-old boy are killed in a packed marketplace by a Taliban terrorist bombing.  More than thirty others are injured."], ["2004.07.11", "Iraq", "Baghdad", 2, 0, "In a particularly senseless attack, Islamic fundamentalists enter the home of a Christian family and stab two girls (ages 16 and 6) to death."], ["2004.07.11", "Israel", "Tel Aviv", 1, 34, "A woman waiting for a bus is murdered in an al-Fatah bombing.  Thirty-four others are injured.  The bomb was packed with metal bolts."], ["2004.07.11", "Thailand", "Yala", 2, 1, "Islamic separatists kill two more civilians in southern Thailand."], ["2004.07.12", "Afghanistan", "Kandahar", 4, 5, "Taliban members attack and burn a district police headquarters, killing four and injuring five."], ["2004.07.12", "Chechnya", "Avtury", 8, 12, "Jihad fighters kill eight Chechen security personnel and take another dozen hostage.  Hostages are typically executed after a reading from the Qur'an."], ["2004.07.12", "Iraq", "Musayyib", 1, 0, "Regional Shiite political leader is assassinated by extremists."], ["2004.07.12", "Pakistan", "Shakai", 2, 0, "Two children die of injuries suffered from an al-Qaeda attack in the west Pakistani mountains."], ["2004.07.12", "Philippines", "Buldon", 2, 0, "Moro Islamic Front members kill two farmers on their land with automatic weapons."], ["2004.07.12", "Sudan", "Donki Dereisa", 150, 90, "Arab militia, supported by the Islamic government's fixed-wing aircraft raid a village and kill one-hundred and fifty civilians, including six children.  The children were captured during the assault and burned alive the next day."], ["2004.07.13", "Chechnya", "Grozny", 1, 3, "Jihad terrorists attempt to assassinate the acting President in a motorcade bombing, killing a guard and injuring three others."], ["2004.07.13", "India", "Bhaderwah", 3, 1, "Islamic terrorists kill three construction workers and injure another in a senseless terrorist attack on a road-building project."], ["2004.07.13", "India", "Srinagar", 2, 12, "Militant Muslims kill two persons and injure twelve in a street bombing."], ["2004.07.13", "Iraq", "Mosul", 1, 0, "al-Qaeda militants execute a Bulgarian truck driver that they had taken hostage."], ["2004.07.13", "Sudan", "Tabaldiat", 80, 39, "Another raid by armed Arab militias leave eighty villagers dead - including children - and their homes burned to the ground."], ["2004.07.14", "Iraq", "Baghdad", 10, 41, "Ten people, mostly civilians, are killed and more than forty injured when a Fedayeen suicide car bomber detonates his explosives along a busy road."], ["2004.07.14", "Iraq", "Mosul", 3, 0, "Militants ambush a car carrying a government official, killing three."], ["2004.07.14", "Thailand", "Narathiwat", 1, 1, "Muslim motorcycle attack kills a police officer as he is driving to work.  Another is injured."], ["2004.07.15", "Afghanistan", "Kabul", 1, 0, "A Christian is beaten to death for studying the Bible."], ["2004.07.15", "India", "Mendhar", 2, 1, "Islamic militant kills two policeman with a grenade and injures a third."], ["2004.07.15", "Iraq", "Haditha", 10, 27, "Ten Iraqis, including seven civilians are killed in a Fedayeen car bombing.  Another twenty-seven innocents are injured."], ["2004.07.16", "Pakistan", "South Waziristan", 3, 4, "Three civilians are killed, and four others suffer injury after an al-Qaeda attack on a fortified structure."], ["2004.07.17", "Iraq", "Baghdad", 4, 7, "'Jihad and Unification' terrorist group uses a car bomb to kill four and injure seven in an attempted assassination of an Iraqi minister."], ["2004.07.17", "Iraq", "Mahmudiyah", 2, 22, "Fedayeen bomber blows himself to Allah, taking the lives of two people and injuring another twenty-two who were waiting in line for jobs."], ["2004.07.18", "Afghanistan", "Kabul", 1, 1, "Taliban terrorists fire a rocket into the city, killing a local."], ["2004.07.18", "Afghanistan", "Kabul", 1, 1, "The Taliban fire a rocket into the city center, killing a woman and injuring a man."], ["2004.07.18", "Chechnya", "Shali", 1, 0, "A woman is murdered in her home by Islamic radicals."], ["2004.07.18", "Indonesia", "Palu", 1, 4, "Radical Muslims fire into a church service, killing a female pastor and injuring four Christian worshippers."], ["2004.07.18", "Iraq", "Mosul", 1, 2, "A political figure is assassinated in a drive-by shooting.  His 7-year-old son was shot as well, but survived."], ["2004.07.19", "India", "Kapran", 6, 50, "Six people, including two women were killed, and more than fifty others sustained injuries when Muslim terrorists attacked a political rally with grenades."], ["2004.07.19", "Indonesia", "Palu", 2, 3, "Islamic gunmen enter a church and kill the female pastor and a 17-year-old girl.  Three other teenage worshipers were also shot."], ["2004.07.19", "Iraq", "Baghdad", 9, 62, "Religious fanatic kills himself and nine others by blowing up a truck filled with fuel on a busy street.  Sixty-two others are injured, including many who are badly burned."], ["2004.07.19", "Iraq", "Mosul", 1, 1, "Islamists kill the Christian owner of a restaurant selling food to Americans.  They also blind and cut off both hands of his Muslim business partner."], ["2004.07.19", "Israel", "Tel Aviv", 1, 0, "Arafat's al-Aqsa Martyrs Brigade takes credit for killing an Israeli judge at close range as he was driving home."], ["2004.07.19", "Russia", "Voronezh", 2, 5, "Islamic terrorists blow up a bus stop, killing two civilians and injuring five more."], ["2004.07.20", "India", "Koti", 4, 0, "Lashkar-e-Taiba militants kill four policemen as they are investigating a previous crime in a remote village."], ["2004.07.20", "India", "Rajauri", 5, 0, "Islamists wipe out five members of a family, after invading their home in the middle of the night.  Two women and a 3-year-old boy were among those murdered."], ["2004.07.20", "Iraq", "Basra", 3, 1, "Sunni extremists assassinate a council member, along with two others."], ["2004.07.20", "Israel", "Syrian Border", 2, 0, "Hezbollah snipers kill two IDF members as they are repairing an antennae."], ["2004.07.21", "Afghanistan", "Helmand", 11, 0, "Taliban ambush a convoy of cars with rockets.  Eleven are killed."], ["2004.07.21", "Iraq", "Ramadi", 4, 14, "At least four people, including three brothers are killed by a car bombing.  Fourteen others are injured."], ["2004.07.21", "Sudan", "Kalma", 11, 0, "Eleven more villagers killed by an Arab militia supported by the Islamic government."], ["2004.07.22", "Iraq", "Baghdad", 2, 4, "Sunni extremists fire a missile into a hospital, killing two."], ["2004.07.22", "Iraq", "Baghdad", 3, 2, "Muslim insurgents car bomb a residential neighborhood, killing at least three and hurting at least two others."], ["2004.07.23", "Afghanistan", "Kabul", 1, 0, "A Christian is stabbed to death by the Taliban over praying in the name of Jesus."], ["2004.07.23", "Chechnya", "Grozny", 1, 3, "A civilian is killed in a marketplace bombing by Islamic separatists."], ["2004.07.23", "Iraq", "Baiji", 1, 0, "al-Qaeda members kill a Bulgarian truck driver, taken hostage several weeks earlier, by cutting off his head."], ["2004.07.23", "Israel", "Beit Hanun", 1, 3, "al-Aqsa militants shoot a 16-year old boy to death and injure other three members of his family who object to the terrorists using their backyard for launching missiles into Israel."], ["2004.07.24", "Dagestan", "Makhachkala", 1, 2, "Islamic militants thought responsible for a bombing that leaves one person dead."], ["2004.07.24", "Iraq", "Latifiya", 2, 1, "Group calling itself 'Lion of God' takes an Egyptian hostage.  Elsewhere gunmen stage an assassination attempt that kills two bodyguards."], ["2004.07.24", "Pakistan", "Karachi", 1, 7, "Bus bombing kills at least one and injures seven.  Bus was carrying teachers and an electrician."], ["2004.07.25", "Chechnya", "Grozny", 1, 1, "Islamists kill a man and injure his wife with a bomb."], ["2004.07.25", "Chechnya", "Samashki", 3, 1, "Three cannery workers are killed, and another wounded in a terrorist bombing on their vehicle."], ["2004.07.25", "India", "Daraj", 3, 1, "Militant Muslims invade a home and cut off the heads of a 65-year-old man and his two children, one a teenage girl.  They attempt to cut the head off his wife, but she survives the attack."], ["2004.07.25", "Pakistan", "Ghuzdarra", 2, 0, "al-Qaeda attack on a remote border post leaves two dead."], ["2004.07.26", "India", "Baramulla", 1, 29, "One citizen is killed, and nearly thirty others injured when militant Muslim throws grenade into the street outside a hospital."], ["2004.07.26", "Iraq", "Basra", 2, 3, "Muslim extremists open fire on a private vehicle carrying workers.  Two women are killed and another three injured."], ["2004.07.26", "Iraq", "Mosul", 3, 5, "Fedayeen suicide bomber kills three, including two civilians and causes another five to suffer critical burns."], ["2004.07.27", "Afghanistan", "Ghazni", 6, 2, "The Taliban bombs an election station at a mosque, killing six workers and injuring two."], ["2004.07.27", "Chechnya", "Dyshni-Vedeno", 1, 0, "Islamic militants kill a police officer at sunrise."], ["2004.07.27", "India", "Dal Lake", 5, 2, "Fedayeen militants kill five Indian security force personnel and injure two in an attack on a resort."], ["2004.07.27", "India", "Satoora", 2, 0, "Police recover the body of a woman abducted by Lashkar-e-Toiba terrorists.  Her husband had also been killed by the same group."], ["2004.07.27", "Iraq", "Baghdad", 2, 0, "Group calling itself the 'Islamic Army' brutally executes two Pakistani civilians taken hostage."], ["2004.07.28", "Afghanistan", "Kabul", 1, 0, "A married father is stabbed to death after being discovered associating with other Christians."], ["2004.07.28", "Chechnya", "Grozny", 2, 0, "Two police officers are murdered in a landmine attack by Muslim separatists."], ["2004.07.28", "Iraq", "Baqubah", 68, 56, "An Islamist kills himself and sixty-eight others, including twenty-one passengers on a passing bus, and injures dozens more in a suicide bombing at a marketplace."], ["2004.07.28", "Iraq", "Fallujah", 4, 1, "Four policemen are killed by a homemade bomb while on routine patrol."], ["2004.07.29", "India", "Bafliaz", 2, 1, "Mujahideen invade a home, kill a mother and father and injure their young child in the process."], ["2004.07.30", "Pakistan", "Fateh Jang", 6, 25, "Fedayeen suicide bomber kills six and injures at least twenty-five others.  Pakistani finance minister was the target."], ["2004.07.30", "Uzbekistan", "Tashkent", 3, 5, "Three suicide bombers kill three others and injure five in synchronized attacks on the U.S and Israeli embassies."], ["2004.07.31", "Afghanistan", "Helmand", 5, 2, "A local Afghan official and four bodyguards are shot to death by the Taliban."], ["2004.07.31", "Pakistan", "Karachi", 2, 0, "Hard-line fundamentalists bomb car dealership, killing two people."], ["2004.07.31", "Thailand", "Narathiwat", 1, 5, "Muslim gunmen on motorcycles shoot a 39-year-old woman four times in the chest.  In a separate attack, a bomb hidden under a street bench, injures five."], ["2004.08.01", "Afghanistan", "Baraki Barak", 3, 0, "Three children are blown up by a bicycle bomb placed by religious extremists."], ["2004.08.01", "Algeria", "Ziama Mansouria", 3, 1, "Bombing by the Salafist Group for Preaching and Combat leaves three security company employees dead and one critically injured."], ["2004.08.01", "Iraq", "Baghdad", 2, 2, "Terrorist bombing near a hotel kills two civilians and badly injures two others."], ["2004.08.01", "Iraq", "Baghdad", 11, 61, "Islamic radicals bomb five Catholic churches, murdering nearly a dozen Christians and injuring close to one-hundred people."], ["2004.08.01", "Iraq", "Mosul", 4, 32, "A suicide bomber kills at least four people and injures between thirty and fifty in a residential neighborhood."], ["2004.08.01", "Pakistan", "Khuzdar", 6, 2, "Islamists use automatic weapons at point-blank range to ambush a car carrying soldiers and civilians, killing six."], ["2004.08.02", "Iraq", "Baghdad", 1, 0, "al-Qaeda members place a hood over the head of a cleaner taken hostage, then shoot him three times while praising Allah."], ["2004.08.02", "Pal. Auth.", "Gaza", 3, 0, "Palestinian terrorists shoot three suspected informants to death in their hospital beds."], ["2004.08.03", "Iraq", "Baqubah", 4, 6, "Suicide bomber kills four Iraqi National Guardsmen at a roadside checkpoint.  Six others are injured."], ["2004.08.03", "Israel", "Rafah", 3, 10, "Attempted bombing of an Israeli bulldozer backfires.  Three Palestinian bystanders are killed and ten others, including journalists, are injured."], ["2004.08.03", "Saudi Arabia", "Riyadh", 1, 0, "Two al-Qaeda gunmen shoot an Irish engineer four times in the chest at his office."], ["2004.08.04", "Afghanistan", "Gardez", 2, 0, "Taliban radicals ambush and murder two charity workers."], ["2004.08.05", "Bangladesh", "Sylhet", 1, 15, "Fundamentalists bomb two cinemas, killing a 13-year-old boy."], ["2004.08.05", "England", "West Bromwich", 1, 0, "Shopkeeper is brutally beaten to death by members of a Muslim family upset over the presumed \"taboo\" relationship between his son and their Pakistani daughter."], ["2004.08.05", "India", "Srinagar", 9, 8, "Muslim terrorists attack a police building in the heart of Srinagar, killing eight officers."], ["2004.08.05", "Iraq", "Filfil", 1, 0, "Gunmen stop a truck convoy and kill a Turkish father of three who is unable to recite prayers on command."], ["2004.08.05", "Iraq", "Mahawil", 5, 18, "Islamic extremists kill five policemen in a shooting attack followed minutes later by a suicide minibus bombing."], ["2004.08.06", "Afghanistan", "Uruzgan", 2, 1, "The Taliban kill two humanitarian election workers and take another hostage in an attack on their convoy."], ["2004.08.06", "Chechnya", "Grozny", 2, 0, "Two police officers manning a checkpoint are cut to pieces by Islamists with automatic weapons."], ["2004.08.06", "Chechnya", "Kargalinskaya", 1, 1, "Islamic gunmen fire into a building, killing a police officer."], ["2004.08.06", "India", "Gundana", 1, 0, "Suspected Jaish-e-Mohammed terrorists invade a woman's home and kill her in cold blood."], ["2004.08.07", "Afghanistan", "Awdand", 1, 0, "Islamic radicals murder a 40-year-old 'well-educated' man for converting to Christianity."], ["2004.08.08", "Algeria", "Boukaid", 2, 0, "Two local security guards are shot to death by Islamic fundamentalists."], ["2004.08.08", "Iraq", "Baghdad", 1, 16, "A 10-year-old boy is killed, and sixteen others, including a 13-year-old girl, badly injured when Sunnis mortar-bomb a pickup truck in a residential neighborhood."], ["2004.08.08", "Iraq", "Kirkuk", 1, 3, "Roadside bomb kills a 7-year-old child and injures three others."], ["2004.08.08", "Pakistan", "Karachi", 8, 42, "Two bombs, staggered to cause maximum casualties, rip through a Pakistani restaurant near a Sunni school leaving at least eight dead and dozens injured."], ["2004.08.09", "Chechnya", "Grozny", 1, 2, "Jihadis use a landmine to kill a policeman."], ["2004.08.09", "Iraq", "Balad Ruz", 7, 14, "In another case of \"killing for Allah,\" a Fedayeen suicide bomber destroys seven Iraqi policemen and injures another fourteen people."], ["2004.08.09", "Iraq", "Khaldiya", 4, 4, "Civilian minibus is the target of another Fedayeen bombing.  Four are killed and four injured."], ["2004.08.10", "Philippines", "North Cotabato", 3, 0, "MILF terrorists murder three farmers in a rocket attack."], ["2004.08.11", "Iraq", "Khan Bani Saad", 6, 10, "Muslim terrorists bomb a busy marketplace in a small town, killing six people and injuring at least 10 others."], ["2004.08.11", "Iraq", "Mosul", 4, 0, "Islamic insurgents spray a car with machine-gun fire, killing four occupants, including a woman and child."], ["2004.08.11", "Israel", "Jerusalem", 2, 16, "Unsuccessful suicide car bombing at an Israeli checkpoint kills two Palestinians and injures sixteen."], ["2004.08.12", "India", "Watapora Beerwah", 2, 0, "Mujahideen abduct and later shoot dead two civilians from a remote village."], ["2004.08.13", "Israel", "Itamar", 1, 1, "Palestinian gunman murders an Israeli driver outside a settlement."], ["2004.08.14", "India", "Galothi", 2, 0, "Mujahideen terrorists shoot a young couple to death as they beg for their lives."], ["2004.08.15", "Afghanistan", "Maiwand", 6, 0, "Taliban extremists attack an Afghan army post and kill six soldiers."], ["2004.08.15", "Iran", "Neka", 1, 0, "Iranian Mullah publicly hangs a 16-year-old girl for having a 'sharp tongue.'"], ["2004.08.15", "Iraq", "Baghdad", 1, 5, "Bus station bombed with mortars - at least one killed and five injured."], ["2004.08.16", "Iraq", "Baqubah", 5, 4, "Mortar attack kills two civilians and injures four.  In the same city, a roadside bomb kills three Iraqi Guardsmen."], ["2004.08.17", "Algeria", "Bouira", 2, 0, "Two Algerian village guards are killed by Islamic fundamentalists in separate bombings."], ["2004.08.17", "Dagestan", "Makhachkala", 3, 2, "Two separate terrorist attacks staged by Muslim rebels leave a civilian and two anti-terrorist agents dead."], ["2004.08.17", "Iraq", "Baghdad", 6, 32, "Islamic insurgents fire a mortar round into a crowded street outside a barbershop, killing six, including two children, and injuring at least thirty others."], ["2004.08.18", "India", "Rajouri", 2, 0, "Mujahideen militants - led by a Pakistani national - abduct and then cut off the heads of a man and his son."], ["2004.08.18", "India", "Udhampur", 4, 0, "Islamic separatists invade a family's home and then massacre the father, his daughter and two sons."], ["2004.08.19", "Afghanistan", "Farah", 0, 7, "Seven people are hurt when the Taliban detonate several bombs inside an electoral commission building."], ["2004.08.19", "Iraq", "Najaf", 8, 30, "Radical Shiites kill eight and injure thirty in the Holy City of Najaf in a mortar attack on a police station."], ["2004.08.19", "Pakistan", "Lahore", 1, 0, "Muslim mob takes 26-year-old Christian from his home then tortures him to death."], ["2004.08.21", "Bangladesh", "Dhaka", 19, 300, "Nineteen people are killed and over 300 injured when Islamists throw more than a dozen grenades into an opposition political rally."], ["2004.08.21", "Chechnya", "Grozny", 66, 11, "Sixty-six people, including policemen and other civilians are killed in several terrorist attacks by Muslim separatists in the capital city and across the country."], ["2004.08.21", "Thailand", "Pattani", 1, 0, "Islamic radicals kill a high-ranking security official."], ["2004.08.22", "Iraq", "Baqubah", 2, 4, "Fedayeen suicide bomber attempts a political assassination.  Two guards are killed."], ["2004.08.23", "Algeria", "Boumerdes", 7, 13, "Seven security force members are killed in an ambush by Islamic fundamentalists, who lured them by setting fire to a children's center.  Several children were injured."], ["2004.08.23", "Yemen", "Saada", 11, 0, "Eleven Yemeni soldiers are killed in an ambush by followers of a radical Shiite cleric in that country."], ["2004.08.24", "India", "Kara", 2, 0, "In a heinous attack, a Muslim \"freedom fighter\" hurls a grenade at two children in a remote village, killing the 3-year-old girl and her 5-year-old brother."], ["2004.08.24", "India", "Safarwaw Gund", 4, 0, "Four civilians are gunned down by the Mujahideen, two at a picnic spot and two others in Pulwama, after abducting them from their homes."], ["2004.08.24", "Iraq", "Baghdad", 5, 15, "'Holy Warrior' suicide bombers kill themselves and five others in twin blasts.  More than a dozen Iraqi civilians are injured."], ["2004.08.24", "Russia", "Moscow", 89, 0, "Militant Muslims hijack two Russian passenger airliners, then murder all eighty-nine people, including women and children on board the two planes.  The terrorist group Islambouli Brigade claims responsibility."], ["2004.08.25", "Thailand", "Narathiwat", 1, 30, "Muslim separatists bomb a food market, killing one and injuring at least thirty others."], ["2004.08.26", "Algeria", "Zemmouri", 1, 2, "Two members of the Salafist Group for Preaching and Combat sneak up to two guards at a beach.  They shoot one to death and severely injure another, along with a female bather."], ["2004.08.26", "Iraq", "Kufa", 75, 376, "Clashes between supporters of rival Shiite clerics results in at least seventy-five deaths and more than three-hundred injuries."], ["2004.08.26", "Iraq", "Mosul", 1, 0, "A Christian man is murdered by Muslim terrorists."], ["2004.08.26", "Sudan", "Yassin", 64, 156, "Arab militia, supported by the Islamic government, burn down an African village and kill sixty-four civilians.  Some one-hundred and fifty-six others survive with injuries."], ["2004.08.27", "Dagestan", "Khasavyurt", 2, 0, "Two civilians, including a child, are killed in a bombing attack."], ["2004.08.27", "Iraq", "Najaf", 1, 0, "In a crime so barbaric that even al-Jazeera declined to air the video, an Italian journalist, pacifist, and father of two is taken hostage and murdered by an Islamic group."], ["2004.08.28", "Afghanistan", "Zormat", 10, 15, "A bomb planted by the Taliban at a school kills nine children and one adult.  Fifteen other youngsters were injured in the attack."], ["2004.08.29", "Afghanistan", "Kabul", 9, 24, "The Taliban kill at least nine people, including one child with a remote-controlled truck bomb on a busy street in the capitol city."], ["2004.08.29", "Iraq", "Baqubah", 6, 11, "Six police officers manning a checkpoint are gunned down by Islamic terrorists in two minibuses."], ["2004.08.30", "Pakistan", "Qalat", 3, 10, "Three are killed and ten injured by a bomb planted near a food stand."], ["2004.08.31", "India", "Pulwama", 1, 26, "Muslim militant hurls a grenade into a road, killing a school teacher and injuring twenty-six other people."], ["2004.08.31", "Iraq", "Baghdad", 12, 0, "An Islamist group called Jaish Ansar al-Sunna slowly beheads a Nepali hostage while eleven other hostages are shot through the back of the head in front of a Qur'anic banner."], ["2004.08.31", "Iraq", "Bartella", 3, 0, "Three young Christian women are slaughtered by Islamic extremists in a small Iraqi village."], ["2004.08.31", "Israel", "Be'er Sheva", 16, 98, "Hamas (Islamic Resistance) suicide bombers murder sixteen people, including a 3-year-old child riding two passenger buses.  About one-hundred others are injured in the explosions."], ["2004.08.31", "Russia", "Moscow", 11, 51, "A female suicide bomber kills eleven rush-hour commuters at a subway station in Moscow.  Fifty-one others are injured."], ["2004.09.01", "Iraq", "Baghdad", 1, 0, "A 43-year-old Christian man is killed by Jihadists just after leaving a hospital where he was treated for injuries following an earlier attack."], ["2004.09.01", "Russia", "Beslan", 16, 14, "At least sixteen people are killed as Mujahideen terrorists invade a school, taking more than a hundred children hostage.  Children are made to stand in windows with suicide bombers behind them."], ["2004.09.02", "India", "Barhi Draman", 1, 3, "Mujahideen kill a young boy and injure three members of his family for their refusal to send the boy to a terrorist training camp."], ["2004.09.02", "Iraq", "Baghdad", 3, 0, "The Tawhid wal Jihad (Unity and Holy War ) Islamic group forces three Turkish hostages to kneel before a video camera, then shoots each in the chest."], ["2004.09.02", "Iraq", "al-Mayasa", 2, 0, "Islamic terrorists gun down two Christian brothers, known for advocating the rights of minorities."], ["2004.09.03", "Afghanistan", "Kandahar", 2, 4, "Two people, including a teenager are killed by a bomb, placed by the Taliban under a truck."], ["2004.09.03", "Russia", "Beslan", 344, 600, "Islamic militants shoot fleeing children in the back, then blow them up, along with their mothers and teachers with nail-packed bombs.  Others are crushed or burned to death from the effects of the bombs.  More than three-hundred  innocents slaughtered."], ["2004.09.03", "Thailand", "Yala", 1, 2, "Islamists shoot and kill a hospital employee in a drive-by."], ["2004.09.04", "Iraq", "Kirkuk", 15, 41, "Fedayeen suicide bomber kills at least fifteen people and injures another forty with a car bomb."], ["2004.09.05", "Saudi Arabia", "Buraida", 3, 0, "Islamic extremists walk up to a police car and shoot three officers to death."], ["2004.09.06", "Iraq", "Fallujah", 10, 6, "Seven U.S. Marines and three Iraqis are killed by a Fedayeen ('Holy Warrior') suicide car bomber who plowed right into their convoy."], ["2004.09.08", "Iraq", "Baghdad", 3, 2, "Three Iraqis are killed by a roadside bomb."], ["2004.09.09", "India", "Futlipora", 1, 0, "Suspected Harkat-ul-Jehadi-e-Islami members abduct a 52-year-old man from his orchard, then march him to the top of a nearby hill where he is executed."], ["2004.09.09", "Indonesia", "Jakarta", 9, 173, "At least nine are killed when the Jemaah Islamiyah terrorist group detonates a suicide car bomb outside the Australian embassy in a business district.  More than one-hundred and seventy others are treated for injuries."], ["2004.09.09", "Pakistan", "Somyani", 2, 1, "Two are killed, and one injured when militants bomb a State-run space research center."], ["2004.09.10", "Pakistan", "Quetta", 1, 0, "Two Sunni gunmen on a motorcycle kill a prominent Shiite academic as he is driving home."], ["2004.09.11", "India", "Kupwara", 1, 20, "Mujahideen militants toss a grenade into a crowded marketplace, killing one civilian and injuring twenty others."], ["2004.09.11", "India", "Srinagar", 3, 7, "Suicide attack on a heavily-guarded tourist hotel leaves three security personnel dead and seven others injured."], ["2004.09.12", "Iraq", "Hilla", 3, 3, "In a senseless attack, terrorists kill three Polish sappers who were working to clear the country of landmines."], ["2004.09.13", "India", "Kalmund-Bachana", 3, 0, "Lashker-e-Toiba members, invade a house, torture three family members with sharp instruments, then shoot them to death."], ["2004.09.13", "Iraq", "Baghdad", 1, 2, "Group \"Unification and Jihad\" beheads a Turkish truck driver in front of a video camera.  Elsewhere, two Italian women are taken hostage."], ["2004.09.13", "Pakistan", "Gilgit", 2, 0, "Two people, including a seminary teacher are killed in Muslim sectarian violence."], ["2004.09.14", "Iraq", "Baghdad", 2, 0, "Two Canadian (Arab) Christians are chased by a mob of Muslims and beaten to death."], ["2004.09.14", "Iraq", "Baghdad", 47, 114, "A Fedayeen suicide bomber fervently practices his religion by killing himself and forty-seven others in a car bombing on a busy street next to a line of police recruit hopefuls.  Over one-hundred others are injured in the attack."], ["2004.09.14", "Iraq", "Baqubah", 12, 3, "Sunni insurgents spray a police van, carrying officers and civilians, with automatic weapons, killing twelve and injuring three."], ["2004.09.15", "Iraq", "Al Dijail", 3, 0, "The headless bodies of three people, two of who were Assyrian Christians, are found in a field with Qur'anic inscriptions carved into them."], ["2004.09.15", "Iraq", "Kirkuk", 4, 13, "Two Iraqi workers are ambushed and shot to death in Kirkuk.  A car bombing in Baghdad kills two and injures ten.  Three Western civilians there are also kidnapped."], ["2004.09.15", "Saudi Arabia", "Riyadh", 1, 0, "British man gunned down by terrorists in the parking lot of a shopping center."], ["2004.09.16", "Algeria", "Tebessa", 4, 0, "Islamic fundamentalist plant a bomb that kills four village guards."], ["2004.09.17", "Iraq", "Baghdad", 8, 41, "Fedayeen suicide bomber murders eight people in a shopping district.  Forty-one others survive with injuries."], ["2004.09.17", "Thailand", "Pattani", 1, 0, "A Buddhist judge is shot to death by Muslim gunmen after dropping his children off at school."], ["2004.09.18", "Algeria", "Kalous", 4, 1, "Armed Islamic extremists set up a fake road block on a remote road.  They shoot to death four people that stop there and also abduct a woman."], ["2004.09.18", "Bangladesh", "Jamalpur", 1, 0, "A Christian convert from Islam has his throat slashed by Muslim fundamentalists."], ["2004.09.18", "Iraq", "Kirkuk", 19, 39, "Nineteen people waiting in line for jobs are blown to bits by a Fedayeen suicide car bomber."], ["2004.09.18", "Iraq", "Mosul", 5, 4, "Gunmen pull beside two cars carrying oil executives.  Five are shot to death, four wounded."], ["2004.09.18", "Thailand", "Pattani", 1, 0, "A cleric is gunned down by Muslim radicals."], ["2004.09.19", "Iraq", "Samarrah", 6, 7, "Three young Kurdish party members are captured by 'Ansar al-Sunna' terrorists and beheaded.  Elsewhere, a suicide car bombing kills three."], ["2004.09.20", "Afghanistan", "Zabul", 3, 0, "Taliban militants stop a taxi carrying three unarmed Afghan soldiers (out of uniform).  They pull them out of the car and behead all three on the side of the road."], ["2004.09.20", "Nigeria", "Bama", 10, 0, "Armed Nigerian militants, shouting 'Allahu Akbar' invade two towns and kill ten people, including seven civilians."], ["2004.09.21", "Iraq", "Baghdad", 2, 0, "Two American civilians are beheaded on videotape by an al-Qaeda group called 'Jihad and Unification.'"], ["2004.09.21", "Pakistan", "Ratta Kalachi", 3, 1, "Three members of a Shia family are slaughtered in a sectarian attack.  One young girl survived with injuries."], ["2004.09.22", "Iraq", "Baghdad", 6, 54, "Six people are murdered by an Islamic suicide bomber outside a photocopy shop.  Nearly sixty others are admitted to the hospital."], ["2004.09.23", "Chechnya", "Katyr-Yurt", 1, 0, "A government employee is killed by Islamic terrorists."], ["2004.09.23", "Chechnya", "Mairtup", 2, 0, "Two people are killed in a Mujahideen automatic-weapons attack on their vehicle."], ["2004.09.23", "Israel", "Morog", 3, 1, "Palestinian gunmen attempt to infiltrate a Jewish settlement.  They are stopped by Israeli troops, but manage to kill three."], ["2004.09.24", "Iraq", "Baghdad", 3, 20, "Jihad militants mortar bomb a city street, killing three civilians and injuring fourteen.  Elsewhere, six Egyptian mobile-phone company workers are kidnapped."], ["2004.09.24", "Israel", "Neve Dekalim", 1, 0, "Palestinians fire a mortar into a Jewish residential neighborhood, killing a 22-year-old woman."], ["2004.09.25", "Afghanistan", "Helmand", 9, 0, "Nine Afghan soldiers are killed by Taliban militants who ambush their SUV convoy."], ["2004.09.25", "Chechnya", "Alleroi", 0, 2, "Heavily-armed Mujahideen attack a village, burning residences and badly injuring an 8-year-old girl and at least one other."], ["2004.09.25", "Chechnya", "Grozny", 4, 0, "Four Russian police are killed at a traffic stop by Jihad terrorists."], ["2004.09.25", "India", "Anantnag", 1, 5, "Victim of the 9/22 grenade attack - a man waiting for a bus - succumbs to his injuries."], ["2004.09.25", "Iraq", "Baghdad", 6, 0, "In a tragic and senseless attack, Islamic insurgents kill murder six young men in a minivan who had just signed up as police recruits."], ["2004.09.25", "Pakistan", "Quetta", 3, 3, "Lashkar-e-Jhangvi radicals ambush a policeman near his home, killing him and two others."], ["2004.09.25", "Saudi Arabia", "Jedda", 1, 0, "Islamists shoot a French resident to death as he is walking to his car in a supermarket parking lot."], ["2004.09.26", "Afghanistan", "Charchino", 1, 3, "A local official is killed and three other people injured when the Taliban attacks their vehicle in a remote area."], ["2004.09.26", "Thailand", "Yala", 1, 9, "Islamic separatists kill the owner of a fruit orchard.  Elsewhere, a grenade attack leaves nine injured."], ["2004.09.27", "Chechnya", "Grozny", 1, 1, "A judge is gunned down by Jihadis."], ["2004.09.27", "Iraq", "Fallujah", 7, 7, "Two explosions, at least one a Fedayeen suicide bombing, is responsible for the deaths of seven Iraqi Guardsmen in Fallujah and Mosul."], ["2004.09.27", "Pakistan", "Sarokai", 3, 6, "al-Qaeda militants use an IED to kill three Pakistani soldiers riding in a convoy."], ["2004.09.27", "Thailand", "Pattani", 2, 0, "Muslims use motorbikes to stage two shooting attacks that leave a government official and one police officer dead."], ["2004.09.28", "Algeria", "Ain Defla", 6, 0, "Islamic fundamentalists slaughter six civilian village defense force volunteers."], ["2004.09.28", "Chechnya", "Grozny", 1, 4, "Islamic gunmen ambush a police vehicle, killing one officer."], ["2004.09.28", "Iraq", "Basra", 2, 0, "Shia gunmen prevent the rescue of two injured British soldiers, who later die from wounds suffered in a terrorist ambush."], ["2004.09.28", "Philippines", "Lamitan", 2, 0, "Abu Sayyaf terrorists shoot two policemen to death as they ride by on a motorcycle."], ["2004.09.29", "Afghanistan", "Zabul", 12, 0, "Taliban terrorists attack a government post, killing twelve Afghan soldiers."], ["2004.09.29", "India", "Anantnag", 2, 0, "Muslim militants shoot a government official and bodyguard to death as they are waiting at a traffic light."], ["2004.09.29", "Iraq", "Tal Afar", 4, 16, "An Islamic insurgent car bombing kills four civilians and injures at least sixteen others."], ["2004.09.29", "Philippines", "Cotabato", 1, 3, "Islamic militants are thought responsible for a grenade attack on a residential area that kills a child."], ["2004.09.30", "Iraq", "Baghdad", 51, 230, "At least fifty people, including thirty-five children are killed by a series of car bombings.  More than two-hundred others are injured.  The main target was a ceremony marking the opening of a new sewage system."], ["2004.09.30", "Israel", "Eley Sinai", 2, 0, "Palestinian gunmen kill a female jogger - and the medic trying to save her life."], ["2004.09.30", "Israel", "Sderot", 2, 15, "Two small children (ages 2 and 4) are killed by a Palestinian rocket while playing in the front yard of their home.  Hamas (Islamic Resistance) claims responsibility."], ["2004.10.01", "Lebanon", "Beirut", 1, 5, "Pro-Syrian terrorists use a car bomb in an attempted political assassination."], ["2004.10.01", "Pakistan", "Bangashwala", 4, 1, "A homemade al-Qaeda bomb kills four teenagers between the ages of 15 and 18."], ["2004.10.01", "Pakistan", "Sialkot", 31, 50, "Sunni suicide bomber kills at least thirty-one worshippers at a Shia mosque.  More than fifty others injured in the blast."], ["2004.10.03", "India", "Baramulla", 1, 3, "Grenade attack injures three civilians and one policeman.  A civilian later dies of injuries (10/6/04)"], ["2004.10.03", "Iraq", "Yusufiyah", 2, 0, "Islamists tie a man up and cut off his head.  Another hostage, female, is shot through the head.  Both bodies dumped in the same area."], ["2004.10.04", "Iraq", "Baghdad", 24, 96, "Three suicide car bombings, two in Baghdad and one in Mosul, kill at least twenty-four and injure nearly one-hundred.  The casualties are mostly civilians as the attacks occurred on city streets."], ["2004.10.05", "Iraq", "Baqubah", 4, 5, "Ansar al-Sunna radicals kill four Kurds in a shooting attack on their minivan."], ["2004.10.05", "Iraq", "Mosul", 1, 0, "Jihadists kidnap and then behead a 15-year-old Christian boy.  They then burn his body."], ["2004.10.05", "Iraq", "Mosul", 3, 0, "Jihadists kill three more hostages by means of decapitation.  Bodies found with hands bound."], ["2004.10.05", "Iraq", "Ramadi", 4, 2, "Sunni car bombing kills four and injures at least two."], ["2004.10.05", "Iraq", "al-Mahmodeyah", 10, 1, "Ten policemen are killed by Jihad fighters in three separate attacks.  One is bound and beheaded."], ["2004.10.06", "Afghanistan", "Faizabad", 2, 5, "The Taliban kills two people with a bomb at an election rally.  Five others sustain injuries."], ["2004.10.06", "Afghanistan", "Kandahar", 7, 0, "Taliban militants kill seven Afghan policemen with a landmine."], ["2004.10.06", "Afghanistan", "Zabol", 6, 0, "The Taliban plant a bomb in a car, killing six civilians."], ["2004.10.06", "Chechnya", "Grozny", 1, 0, "Islamists gun down a policeman standing guard at a market."], ["2004.10.06", "Iraq", "Anah", 12, 25, "Suicide bomber blows himself to Allah, taking twelve Iraqi Guardsmen at a checkpoint with him.  Twenty-five others are injured."], ["2004.10.06", "Pakistan", "Karachi", 2, 1, "Two constables are killed outside a mosque in a shooting attack by Islamists."], ["2004.10.06", "Thailand", "Southern Provinces", 2, 7, "A series of attacks by Islamic militants leaves two government workers dead."], ["2004.10.07", "Egypt", "Ras a-Satan", 4, 40, "Two explosions kills three Israelis and one Egyptian.  \"Brotherhood of International Islamists\" takes responsibility."], ["2004.10.07", "Egypt", "Taba", 33, 149, "At least thirty-three people, most of them Jewish tourists, are killed by a massive suicide car bombing at an Egyptian resort hotel.  About one-hundred and fifty others are among the injured.  Several Muslim groups scramble to claim responsibility."], ["2004.10.07", "Iraq", "Baghdad", 1, 0, "In front of a banner proclaiming \"One God and Jihad\" kidnappers slice the head off of a 62-year-old British engineer."], ["2004.10.07", "Pakistan", "Multan", 41, 100, "Forty-one Sunnis are targeted by rival Shiites in two car bomb blasts as the victims are holding a rally."], ["2004.10.08", "France", "Paris", 0, 10, "An Islamic extremist group plants a bomb outside the Indonesian embassy in Paris, injuring ten."], ["2004.10.08", "Nigeria", "Kala-Balge", 3, 0, "Three police officers are killed by the Nigerian 'Taliban.'  Twelve others were taken prisoner."], ["2004.10.08", "Thailand", "Pattani", 1, 0, "Muslims kill a 38-year old Buddhist soldier with an assault rifle as he is walking home."], ["2004.10.09", "India", "Pattan", 5, 45, "Jaish-e-Mohammad militants use a suicide car bombing against a mini-bus, killing five and injuring some forty-five civilians and soldiers."], ["2004.10.09", "Pakistan", "Karachi", 2, 0, "Two Sunni clerics are gunned down by Shia terrorists in the street."], ["2004.10.09", "Thailand", "Pattani", 1, 0, "In another motorcycle attack, Muslims shoot a 23-year old Buddhist student to death."], ["2004.10.10", "Iran", "Mahabad", 2, 0, "A militant Shiite group called Ali-Ilahi opens fire on a police station."], ["2004.10.10", "Iraq", "Baghdad", 11, 16, "Two suicide bombers kill at least eleven (mostly Iraqi women) and injure sixteen."], ["2004.10.10", "Pakistan", "Lahore", 3, 6, "A suicide bomber walks up to a Shiite mosque and kills a young boy and two guards who intercepted him before he could kill other worshippers."], ["2004.10.11", "Chechnya", "Grozny", 1, 0, "A policeman is murdered by Islamic militants."], ["2004.10.11", "Iraq", "Mosul", 3, 24, "Two civilians and one American soldier are killed in a Fedayeen suicide car bombing."], ["2004.10.12", "Iraq", "Baghdad", 1, 0, "Ansar al-Sunnah takes a Shiite hostage then cuts off his head on video."], ["2004.10.12", "Thailand", "Narathiwat", 2, 0, "Two people are brutally gunned down by Islamists while shopping at a market."], ["2004.10.12", "Thailand", "Pattani", 2, 9, "Muslim gunmen storm a police station with firearms and grenades.  An officer and a civilian are killed."], ["2004.10.13", "Bangladesh", "Bagerhat", 2, 0, "Muslim invaders kill a Hindu husband and wife in their home."], ["2004.10.13", "India", "Poonch", 1, 2, "A 23-year-old is killed by the Mujahideen.  Elsewhere in the district a mother and her son are abducted.  Their fate is unknown."], ["2004.10.13", "Indonesia", "Jono Oge", 2, 0, "Sword-wielding Muslim mob kills two Christians on a busy street in an Indonesian province.  One dies at the scene, another at the hospital."], ["2004.10.13", "Indonesia", "Sulawesi", 1, 2, "Lashkar Jihad gunmen kill a Hindu woman and injure two Christian men by opening fire on their houses."], ["2004.10.13", "Iraq", "Mosul", 2, 5, "Suicide car bombing leave two U.S. soldiers dead and five injured."], ["2004.10.13", "Pakistan", "Jalala", 4, 35, "Islamist throws a grenade at a wedding party in an Afghan refugee camp, because they were listening to music, which was forbidden under the Taliban."], ["2004.10.14", "Iraq", "Baghdad", 1, 0, "Small Christian girl kidnapped and killed by Muslims who had demanded ransom from her family."], ["2004.10.14", "Iraq", "Baghdad", 5, 0, "A female reporter, Iraqi judge and two South African civilian contractors are murdered in three separate shooting attacks.  A Chinese hostage is also shot to death by al-Qaeda terrorists.."], ["2004.10.14", "Iraq", "Baghdad", 5, 18, "A suicide bomber kicks off the Muslim holy month of Ramadan by killing five civilians at a cafe.  Eighteen others are injured."], ["2004.10.14", "Pakistan", "Jandola", 1, 1, "Uzbeki militants affiliated with an Islamic terror cell kidnap two Chinese engineers and execute one."], ["2004.10.15", "Afghanistan", "Kunar", 4, 0, "The Taliban sets a truck on fire, then detonates a remote-controlled bomb after a crowd gathers.  Three children are among the dead."], ["2004.10.15", "Iraq", "Baghdad", 10, 4, "Jihad car bombing kills four palm grove laborers and a family of four that was passing by in a car.  Two other bystanders were killed as well."], ["2004.10.16", "Iraq", "Latifiya", 9, 0, "Jihadists ambush a minivan carrying nine police recruits traveling from Jordan.  All are shot to death."], ["2004.10.16", "Iraq", "Qaim", 4, 0, "Suicide car bomber kills one civilian and three Americans."], ["2004.10.16", "Syria", "Hasaka", 2, 0, "An Assyrian Christian is beaten and killed by Muslim attackers, who then mutilate his body and dump it in the Christian quarter of town.  A friend coming to help is shot and killed."], ["2004.10.17", "Chechnya", "Grozny", 1, 6, "The Mujahideen detonate a car-bomb outside a hospital, killing at least one person."], ["2004.10.17", "India", "Mandli", 1, 14, "An Islamic terrorist lobs a grenade at a village defense committee trying to guard a bus station."], ["2004.10.17", "India", "Mohammadpora", 1, 5, "The Mujahideen kill a 22-year-old man and badly injure five members of his family who were trying to prevent his murder."], ["2004.10.17", "Iraq", "Baghdad", 6, 26, "Car bombing near a cafe kills six and injures twenty-six.  Police and civilians among the casualties."], ["2004.10.18", "Afghanistan", "Paktika", 5, 0, "Religious fundamentalists kill five, including an election worker, in a landmine attack."], ["2004.10.19", "Iraq", "Baghdad", 6, 80, "Jihadists behead two Macedonian hostages on video.  They also kill four Iraqi Guardsmen standing in formation and injure more than eighty with a mortar attack."], ["2004.10.19", "Pakistan", "Spin Kairakzai", 3, 9, "Three security officials are killed in an attack by the same religious fundamentalists that recently massacred eleven Chinese workers."], ["2004.10.20", "Iraq", "Samarrah", 4, 20, "Islamic insurgents kill four children with a car bomb.  Twenty others are injured."], ["2004.10.21", "Afghanistan", "Uruzgan", 1, 2, "An election official is murdered by the Taliban, who injure his two sons as well."], ["2004.10.21", "Indonesia", "Poso", 1, 0, "Muslim gunmen kill the security guard at a Catholic church."], ["2004.10.21", "Iraq", "Baghdad", 2, 1, "Two women and their driver are shot to death by Muslim insurgents as they are driving to work."], ["2004.10.21", "Iraq", "Baghdad", 4, 11, "Islamists stage a shooting ambush a bus carrying airline workers, killing four women, and injuring at least eleven others."], ["2004.10.22", "Algeria", "Medea", 16, 13, "Armed Islamic extremists stop cars carrying young people to a soccer game at a phony roadblock.  They then use knives and small-arms to kill sixteen.  Thirteen others are missing."], ["2004.10.22", "India", "Anantnag", 1, 1, "The Mujahideen assassinate a prominent moderate politician and critically injure his bodyguard."], ["2004.10.23", "Afghanistan", "Kabul", 2, 6, "A Taliban extremist straps six grenades to his body then detonates them on a city street, killing a 12-year-old Afghan girl and an American woman."], ["2004.10.23", "Iraq", "Baghdad", 10, 48, "Muslim zealot kills ten policemen and injures forty-eight people in a powerful suicide bombing."], ["2004.10.24", "Algeria", "Boumerdes", 1, 1, "Armed Islamists kill a security guard and injure a civilian in eastern Algeria."], ["2004.10.24", "India", "Anantnag", 1, 1, "Mujahideen attempt another political assassination at a funeral.  A passerby is killed in the mine attack."], ["2004.10.24", "India", "Salbala", 3, 2, "Mujahideen terrorists invade a home.  They shoot two members of a family to death and kidnap another member, whom they later behead."], ["2004.10.24", "Iraq", "Basra", 48, 0, "A very heinous attack by \"Unification and Jihad\" leaves forty-eight unarmed police recruits dead.  Their three minibuses were stooped by the Jihadists, who forced the men out by the side of the road and executed each with a shot to the head."], ["2004.10.25", "Iraq", "Mosul", 1, 0, "An Assyrian Christian woman, mother of three children, is murdered in her home by Jihad warriors."], ["2004.10.25", "Iraq", "Mosul", 6, 12, "A series of Fedayeen suicide bombings in Mosul and Baghdad kill six Iraqi civilians and leave at least a dozen injured."], ["2004.10.26", "Algeria", "Tizi Ghenif", 5, 2, "Algerian Islamists kill five more people at fake roadblocks in two remote areas.  Three are beheaded."], ["2004.10.26", "India", "Senabathi", 1, 1, "The Mujahideen invade another house and kill two teenagers, including an 18-year-old girl."], ["2004.10.26", "Pakistan", "Spinkai Raghazai", 9, 5, "al-Qaeda kill nine tribesmen with rockets in western Pakistan.  At least five others are critically injured."], ["2004.10.27", "Pakistan", "Karachi", 6, 2, "A vicious killing by Islamists, who barge into a Christian charity office, tie up six men, then execute six by shooting them in the back of the head."], ["2004.10.28", "Iraq", "Hilla", 11, 0, "Eleven Iraqi Guardsmen are taken hostage by Ansar al-Sunnah.  All eleven are bound and then executed, some with a shot to the head others with a slow beheading.  The killers admonish the video audience to \"Repent to Allah.\""], ["2004.10.28", "Thailand", "Sungai Kolok", 3, 20, "Local Muslims gun down a Buddhist orchard owner and bomb a bar.  The bomb kills two people and injures twenty others."], ["2004.10.29", "India", "Kukurgaon", 2, 3, "Two Muslim clerics are killed by the other's followers in a religious dispute.  Woman and two young girls injured."], ["2004.10.29", "Thailand", "Yala", 1, 24, "A remote-controlled bomb is set off by Islamic extremists near a tea shop, killing one person and injuring twenty-four others."], ["2004.10.30", "India", "Mahore", 2, 1, "Mujahideen assassinate a politician and his 12-year-old son after invading their home.  The dead boy's mother is severely injured in the attack."], ["2004.10.30", "Iraq", "Anbar", 8, 10, "'Holy Warrior' suicide car bomber kills eight U.S. Marines and injures ten others on routine patrol."], ["2004.10.30", "Iraq", "Baghdad", 8, 19, "Fedayeen car bombing on an Arabic TV station leaves seven dead and nineteen badly injured."], ["2004.10.31", "Iraq", "Baghdad", 1, 0, "Qur'anic quoting militants bound a Japanese hostages arms then cut off his head."], ["2004.10.31", "Iraq", "Tikrit", 15, 8, "Jihadists fire a rocket at a hotel, killing fifteen civilians and injuring eight others."], ["2004.10.31", "Sudan", "Mallaga", 18, 6, "The Janjaweed attack an African village earlier in the month, killing eighteen civilians and injuring another six."], ["2004.10.31", "Thailand", "Narathiwat", 5, 0, "Muslim separatists kill a Buddhist construction worker, a police officer, two agricultural workers, and one other civilian."], ["2004.11.01", "India", "Shopian", 0, 21, "Harkat-ul-Ansar terrorist hurls a grenade into a busy market, injuring over twenty people."], ["2004.11.01", "Iraq", "Baqubah", 2, 1, "Two high-ranking government officials are assassinated in separate ambushes."], ["2004.11.01", "Israel", "Tel Aviv", 3, 38, "Two Jewish women and a man are murdered at a cheese deli in an open market by a 16-year-old who let the Abu Ali Mustafa terrorist network strap explosives to his chest."], ["2004.11.02", "Iraq", "Baghdad", 2, 2, "A Christian family is ambushed in their car by Muslim gunmen, who manage to kill the father and his 10-year-old son."], ["2004.11.02", "Iraq", "Baghdad", 6, 29, "Terrorists kill six people outside a Ministry of Education building with a car bombing."], ["2004.11.02", "Netherlands", "Amsterdam", 1, 1, "Dutch filmmaker (Grandnephew of painter Van Gogh) shot to death by a 26-year-old Moroccan after making a film critical of Islam."], ["2004.11.02", "Thailand", "Mamong", 1, 0, "Muslim agitators murder a 58-year-old Buddhist village chief by cutting off his head."], ["2004.11.03", "Iraq", "Baghdad", 4, 0, "Four more Iraqis kidnapped and beheaded."], ["2004.11.03", "Pakistan", "Karachi", 1, 2, "Shia gunmen open fire on a Sunni mosque, killing one and injuring two."], ["2004.11.04", "Afghanistan", "Orgun", 4, 1, "Four civilians are killed by a homemade Taliban bomb as they were passing by in their vehicle."], ["2004.11.04", "Indonesia", "Poso", 1, 0, "The Mujahideen kidnap and decapitate the Christian leader of an Indonesian village."], ["2004.11.04", "Iraq", "Baghdad", 4, 8, "'Holy Warrior' suicide bomber kills three British soldiers manning a checkpoint, along with their translator."], ["2004.11.04", "Iraq", "Dujail", 3, 7, "Car bombing kills three Iraqis and injures seven."], ["2004.11.04", "Thailand", "Pattani", 9, 2, "Muslim terrorists kill nine Buddhists over a 24-hour period in separate attacks.  At least one monk survived with injuries, as well as a young boy."], ["2004.11.05", "Algeria", "Relizane", 2, 0, "Algerian Islamists ambush and kill two policemen.  The fundamentalists have killed about thirty civilians thus far during Ramadan."], ["2004.11.05", "Iraq", "al-Muqdadiya", 2, 4, "Jihadists kill a 3-year-old boy and a 12-year-old girl with a rocket."], ["2004.11.06", "India", "Srinagar", 2, 2, "Mujahideen terrorists throw a grenade at two off-duty soldiers shopping in a retail district, killing them and injuring two civilians."], ["2004.11.06", "Iraq", "Samarrah", 34, 66, "Thirty-four people, mostly civilians, are blown up by Fedayeen suicide bombers [looking to curry favor with Allah] in several coordinated attacks."], ["2004.11.06", "Thailand", "Narathiwat", 2, 0, "Two Buddhists, one a grocery store owner, are gunned down by militant Muslims."], ["2004.11.07", "Iraq", "Basra", 2, 0, "Two Scottish civilians are killed by Shia militants.  One of them is a father of two."], ["2004.11.08", "Afghanistan", "Arghandab", 3, 2, "Taliban extremists machine-gun Afghan soldiers at a checkpoint, killing three and injuring two."], ["2004.11.08", "Indonesia", "Sulawesi", 1, 0, "Laskar Jihad terrorists kill the driver of a public minibus."], ["2004.11.08", "Iraq", "Baghdad", 3, 45, "Muslim extremists bomb two Christian churches, killing three and injuring over forty, including women and children."], ["2004.11.08", "Iraq", "Baghdad", 13, 60, "Jihadists car bomb the emergency unit of a hospital, killing thirteen civilians and injuring at least sixty."], ["2004.11.08", "Iraq", "Samarrah", 6, 0, "Ansar al-Islam terrorists set two tanker trucks on fire, burning the Turkish drivers alive.  Elsewhere, four Iraqi civilians are killed when gunmen ambush their car and set it on fire."], ["2004.11.08", "Iraq", "Zubayr", 2, 0, "Car bombing kills two British and South African civilians."], ["2004.11.09", "India", "Wagora", 2, 1, "The Mujahideen stage an attack on the home of a politician.  A neighbor and a security guard are killed."], ["2004.11.09", "Russia", "Aul Kumysh", 7, 0, "Local Islamists are tied to the burned bodies of seven missing persons."], ["2004.11.09", "Russia", "Moscow", 2, 1, "Islamic terrorists set off a car-bomb on a city street, killing two civilians."], ["2004.11.09", "Thailand", "Narathiwat", 1, 0, "Thai Muslims cut the head off of a 60-year-old Buddhist plantation worker."], ["2004.11.09", "Thailand", "Yala", 1, 0, "A teacher is murdered by terrorists."], ["2004.11.10", "Iraq", "Fallujah", 5, 0, "Group calling itself the \"Islamic Secret Army\" takes five civilians hostage to use as human shields, then summarily executes them when no longer needed."], ["2004.11.11", "Iraq", "Baghdad", 19, 24, "A Fedayeen blows himself to Allah, taking at least nineteen people with him that happened to be passing by on a packed city street.  Women and children are among the victims."], ["2004.11.12", "Iraq", "Baghdad", 2, 0, "Sunni gunmen kill two American civilians in an ambush."], ["2004.11.12", "Thailand", "Narathiwat", 1, 14, "A Buddhist teacher is gunned down by Islamic militants.  They also plant a bomb in a restaurant, which injures fourteen."], ["2004.11.13", "Algeria", "Algiers", 2, 3, "Armed fundamentalists kill two Algerian soldiers in separate terror attacks."], ["2004.11.13", "England", "London", 1, 0, "A 30-year-old computer worker is brutally assaulted and slain by three Pakistanis."], ["2004.11.13", "India", "Malikpora Bandipora", 2, 2, "The Mujahideen invade two houses, killing the wife of one occupant.  The owner of the other house is kidnapped and then has his throat slit."], ["2004.11.13", "Indonesia", "Sulawesi", 5, 4, "Muslim terrorists kill five and injure four with a bomb hidden on a public bus.  Two of the dead are women."], ["2004.11.13", "Thailand", "Tharnto", 1, 6, "Militant Muslims explode a bomb in the middle of a marketplace, killing one person instantly and leaving at least six others critically injured."], ["2004.11.13", "Thailand", "Yala", 2, 0, "Muslims gun down two civilians - one in his home and another who happened on the attack."], ["2004.11.14", "India", "Chakarbathi Bala", 3, 0, "Three people, including a husband and wife, are burned to death when the Mujahideen set fire to their home."], ["2004.11.14", "India", "Nadimarg", 3, 0, "Jaish-e-Mohammed militants kill three policemen assigned to protect a minority Indian ethnic group after a horrific massacre last year."], ["2004.11.14", "Pal. Auth.", "Gaza", 2, 6, "Palestinian extremists kill two people guarding the new PA leader.  Six bystanders are wounded."], ["2004.11.15", "India", "Patnazi", 2, 1, "Two civilians are gunned down by the Mujahideen while collecting wood in a forest."], ["2004.11.15", "Iraq", "Fallujah", 1, 0, "Body of a Polish female kidnapped by Islamists is found.  Her throat had been slit and she had been disemboweled with a knife.  She was identified by her long blond hair."], ["2004.11.15", "Thailand", "Krong Pinang", 2, 0, "Militants attack a home, killing a retired man and a teenage family member."], ["2004.11.16", "Afghanistan", "Deh Rawood", 4, 6, "The Taliban kill four policemen in a landmine attack.  Six others are injured."], ["2004.11.16", "Afghanistan", "Kajaki", 6, 0, "The Taliban attack a remote outpost near a hydro-power dam, killing six guards."], ["2004.11.16", "Bangladesh", "Chittagong", 1, 0, "Hindu minority leader gunned down in his home."], ["2004.11.16", "India", "Budgam", 6, 0, "Militant Muslims invade a residence and kill six members of a family, including two women."], ["2004.11.16", "Iraq", "Baghdad", 1, 0, "A 59-year-old humanitarian aid worker, kidnapped by Islamists last month, is executed on video with a bullet to the back of her head."], ["2004.11.17", "Iraq", "Baiji", 15, 22, "Suicide car bomber kills fifteen, including six women and six children.  The attack took place in the middle of a crowded street."], ["2004.11.17", "Pakistan", "Mingora", 2, 29, "Bomb explodes in the back of a cinema, killing two people and injuring about thirty."], ["2004.11.17", "Philippines", "Zamboanga", 0, 1, "24-year-old Christian man is attacked by Muslim activists, badly beaten and left for dead."], ["2004.11.18", "Algeria", "Mahrane", 1, 0, "A civilian is killed in a Salafist Group landmine attack."], ["2004.11.18", "Belgium", "Antwerp", 1, 0, "Synagogue worker gunned down on the streets of Antwerp."], ["2004.11.18", "Iraq", "Baghdad", 4, 4, "Jihadists kill three Iraqis, including a woman, with a suicide car bombing.  In Balad they kidnap and behead a native contractor."], ["2004.11.18", "Iraq", "Baiji", 4, 0, "The Fedayeen kill two women, a man and a child in a bombing attack on their car."], ["2004.11.19", "India", "Surankote", 3, 1, "Three people are killed when the Mujahideen bomb their vehicle."], ["2004.11.19", "Indonesia", "Sulawesi", 5, 5, "Jemaah Islamiyah set off a bomb on a minibus outside a market, killing five people and injuring five others."], ["2004.11.20", "England", "Oxford", 1, 0, "A Bangladeshi man and his two sons stab a 19-year-old to death in his car in an honor killing after an affair with their daughter."], ["2004.11.20", "Iraq", "Baghdad", 4, 0, "Jihadists chase down a car carrying public works employees on their way to work and machine-gun all four to death."], ["2004.11.20", "Iraq", "Mosul", 2, 0, "Two Iraqi Kurds are captured by Ansar Al-Sunna, tortured for seven days and then executed."], ["2004.11.20", "Iraq", "Mosul", 9, 0, "Nine policemen are captured by Islamists, then murdered with bullets to the back of the head."], ["2004.11.21", "Iraq", "Ramadi", 8, 15, "Sunni terrorists kill eight policemen and injure fifteen in a shooting ambush."], ["2004.11.23", "Afghanistan", "Totai", 3, 0, "Taliban gunmen murder three persons in a shooting attack."], ["2004.11.23", "India", "Kashmir", 3, 3, "Muslim militants stage two attacks against border guards, killing three and injuring three."], ["2004.11.23", "Nigeria", "Jigawa", 2, 10, "Muslim extremists attack a group of Christian evangelists.  Two people are beaten to death and at least ten others injured."], ["2004.11.23", "Sudan", "Adwa", 30, 100, "More than thirty civilians, including women and children are killed by the government in a ground attack on their village.  More than a hundred others are raped or injured."], ["2004.11.24", "Iraq", "Baghdad", 2, 3, "Suicide car bomber kills at least two civilians, including one woman."], ["2004.11.24", "Pakistan", "Islamabad", 2, 2, "Pakistani Islamists attack a police vehicle, killing two occupants."], ["2004.11.26", "India", "Doda", 3, 0, "Hizb-ul-Mujahideen kill two Hindu travelers on a road, along with a college student dragged of his house."], ["2004.11.27", "Chechnya", "Grozny", 1, 3, "An Islamic militant attacks a cafe, killing one person."], ["2004.11.27", "Iraq", "Baghdad", 7, 30, "Sunni extremists kill three Iraqi and four British civilians with three bombings over a 24-hour period."], ["2004.11.27", "Iraq", "Mosul", 15, 0, "Fifteen more bodies of executed hostages are found in Mosul."], ["2004.11.27", "Sudan", "Kossa", 15, 6, "Attack by Arab militias leaves fifteen African villagers dead and six injured."], ["2004.11.28", "Afghanistan", "Delaram", 3, 3, "The Taliban attack an NGO office and machine-gun three aid workers to death.  Three others are injured."], ["2004.11.28", "Algeria", "Mascara", 1, 3, "In a brutal attack, a civilian is killed and three others injured by members of the Salafi Daawa terrorist group."], ["2004.11.28", "Iraq", "Samarrah", 5, 4, "Five civilians are killed in a roadside bomb attack by Jihadists."], ["2004.11.29", "India", "Srinagar", 0, 12, "Mujahideen hurl a grenade into the center of a commercial district, injuring a dozen civilians."], ["2004.11.29", "Iraq", "Baghdad", 7, 9, "Seven policemen, lining up for pay, are killed in a suicide bombing by Sunni extremists."], ["2004.11.30", "Iraq", "Baghdad", 4, 19, "Fedayeen suicide bomber takes four civilians on to Allah with him.  Nineteen others are injured in the attack."], ["2004.11.30", "Pakistan", "Quetta", 0, 10, "Chechen Mujahideen hurls two grenades at Pakistani police attempting an arrest.  Ten are injured."], ["2004.11.30", "Sudan", "Itou", 65, 0, "Sixty-five civilians are reported dead after an air force bombing of their village by the Islamic government.  An unknown number are injured."], ["2004.11.30", "Thailand", "Yala", 1, 2, "Two separate shooting attacks by Muslim missionaries from the back of a motorcycle leave a teacher dead and two other civilians injured."], ["2004.12.01", "Iraq", "Iskandariya", 1, 7, "Another suicidal extremist kills one civilian and injures seven others with a car bombing."], ["2004.12.02", "Iraq", "Baqubah", 3, 5, "Extremists lob an explosive into a house, killing three children and injuring another five.  All of the kids were from the same family."], ["2004.12.02", "Iraq", "Mosul", 1, 0, "Islamic terrorists kidnap and decapitate a 29-year-old Christian man."], ["2004.12.03", "India", "Sopore", 5, 5, "al-Mansoorain terrorists stage a suicide attack on a police camp.  At least five officers are killed."], ["2004.12.03", "Iraq", "Baghdad", 14, 19, "Four suicide bombers drive a minibus loaded with explosives into a Shiite mosque.  Fourteen civilians are killed and at least nineteen others critically injured."], ["2004.12.03", "Iraq", "Baghdad", 16, 5, "al-Qaeda militants attack a police station with RPGs and small arms, killing sixteen officers and injuring five."], ["2004.12.03", "Jordan", "Border", 2, 0, "A suicide bomber kills two Americans near the Jordanian-Iraqi border."], ["2004.12.04", "Chechnya", "Tazen-Kale", 1, 2, "Jihadis kill a civilian with an IED."], ["2004.12.04", "Iraq", "Baghdad", 16, 38, "Sunni extremists murder sixteen people and injure thirty-eight with two suicide car bomb blasts on a commercial street in the heart of the city."], ["2004.12.05", "India", "Pulwama", 11, 0, "Eleven people are blown to bits by the Hizbul Mujahideen terrorist group on a road, while traveling to a security camp."], ["2004.12.05", "Iraq", "Tikrit", 17, 13, "Islamic insurgents pull aside two buses carrying civilians and open fire at point-blank range, machine-gunning seventeen to death and injuring at least thirteen others."], ["2004.12.05", "Thailand", "Pattani", 1, 0, "A public prosecutor is killed by Islamists while working his farm."], ["2004.12.06", "Afghanistan", "Balabolok", 1, 2, "The Taliban gun down a police officer in a heinous attack."], ["2004.12.06", "Saudi Arabia", "Jedda", 5, 2, "al-Qaeda members attack the U.S. consulate in Saudi Arabia with grenades, killing at least five international contractors and injuring several Americans."], ["2004.12.07", "Chechnya", "Grozny", 6, 9, "Muslim separatists murder four civilians, including a teenager in separate attacks that also claim the lives of two Russian soldiers.  Seven others are injured and two taken hostage."], ["2004.12.07", "Israel", "Karni", 1, 4, "One Israeli soldier is killed by a bomb at a border crossing.  Four are others injured."], ["2004.12.08", "Dagestan", "Semender", 0, 21, "Twenty-one people are injured when Islamic rebels bomb a gas pipeline."], ["2004.12.08", "India", "Anantnag", 0, 36, "Thirty-six people are injured by a grenade thrown by the Mujahideen on a busy street."], ["2004.12.08", "Iraq", "Baghdad", 3, 0, "Three Shia election workers are gunned down by Sunni activists."], ["2004.12.08", "Iraq", "Ramadi", 1, 0, "Islamic terrorists kill a Christian doctor as he is attending to (Muslim) patients in a hospital."], ["2004.12.08", "Iraq", "Samarrah", 4, 5, "Sunni insurgents kill four civilians and injure several more with a terrorist bombing in the city center."], ["2004.12.08", "Iraq", "Taji Camp Road", 2, 0, "Two American civilians are gunned down by a group calling itself the \"Jihad Brigade.\""], ["2004.12.08", "Nigeria", "Bauchi", 1, 0, "Muslim students at an African university abduct and kill a Christian student."], ["2004.12.09", "India", "Shopian", 2, 5, "Mujahideen murder two cops in an ambush.  Five others are injured."], ["2004.12.09", "Iraq", "Baghdad", 3, 5, "Three civilians are killed and five injured when Jihadists lob mortar bombs into a residential neighborhood."], ["2004.12.10", "Chechnya", "Grozny", 1, 3, "Islamic gunmen fire on a civilian vehicle, killing at least one occupant."], ["2004.12.10", "India", "Magani", 4, 0, "Heavily-armed Mujahideen ambush on a police patrol and slaughter all four Indian cops."], ["2004.12.10", "Pakistan", "Quetta", 11, 27, "Bomb attached to a bicycle rips through a marketplace, killing more than ten people and injuring about two dozen."], ["2004.12.11", "Israel", "Neveh Dekalim", 0, 4, "Hamas (Islamic Resistance) lobs several rockets into an Israeli neighborhood.  Four, including three children, are seriously injured."], ["2004.12.11", "Philippines", "Jolo", 1, 0, "Abu Sayyaf gunmen assassinate a government official."], ["2004.12.12", "Indonesia", "Sulawesi", 0, 3, "Muslims open fire on churches in Indonesia, injuring three Christians."], ["2004.12.12", "Israel", "Rafah", 5, 6, "Five Israeli soldiers are killed when Hamas terrorists set off a bomb under a checkpoint.  Six others hospitalized."], ["2004.12.12", "Philippines", "General Santos", 15, 59, "Abu Sayyaf suspected of a mall bombing that kills fifteen Christmas shoppers.  Nearly sixty others are injured."], ["2004.12.13", "Chechnya", "Grozny", 1, 2, "Islamists ambush a security patrol, killing at least one member."], ["2004.12.13", "Iraq", "Baghdad", 13, 15, "Fedayeen suicide car bomber murders more than a dozen civilians and seriously injures another fifteen in a blast designed to maximize human casualty."], ["2004.12.14", "Chechnya", "Grozny", 2, 0, "Two policemen manning a checkpoint are cut to pieces by Islamic gunmen."], ["2004.12.14", "Iraq", "Baghdad", 7, 13, "Another Muslim takes his life in a suicide car blast that also kills seven civilians and injures at least thirteen."], ["2004.12.14", "Kabardino-Balk.", "Nalchik", 4, 0, "Wahhabi terrorists attack a government building and kill the four security staff members on duty."], ["2004.12.14", "Thailand", "Narathiwat", 1, 1, "A Buddhist teacher is gunned down by two Muslims in a motorcycle attack.  His wife is injured."], ["2004.12.15", "Iraq", "Baghdad", 17, 20, "Sunni insurgents ambush a police convoy, killing four people on the spot.  Thirteen officers are taken prisoner and subsequently executed."], ["2004.12.15", "Iraq", "Karbala", 10, 40, "Sunni extremists bomb a Shia mosque, eventually killing ten and injuring forty people in the mosque and on the street."], ["2004.12.15", "Israel", "Khan Yunis", 1, 2, "Hamas militants kill a foreign agriculture worker at an Israeli settlement and injure two more with mortars."], ["2004.12.15", "Thailand", "Narathiwat", 2, 0, "Two more Buddhist civilians, both in their 50's, are shot to death by Muslim extremists.  One was selling ice-cream from his vending bike at the time."], ["2004.12.15", "Thailand", "Songkhla", 1, 0, "Muslims gun down a civilian as he is on his way to pick up his wife."], ["2004.12.16", "Afghanistan", "Khost", 4, 2, "Religious extremists murder four policemen with a car-bomb."], ["2004.12.17", "Iraq", "Mosul", 4, 0, "Grisly murder of four men traveling in a car through Mosul (three are foreigners).  Bodies are mutilated and set aflame."], ["2004.12.18", "India", "Shingru", 2, 0, "Muslim terrorists shoot and kill a 70-year-old political activist and abduct and kill a youth (Kanir)."], ["2004.12.18", "Iraq", "Baghdad", 5, 1, "Three people are dragged from a car, forced to kneel, and then shot by \"holy warriors.\"  Elsewhere, a husband and wife are shot to death in their homes for supporting \"infidels.\"  (Son is kidnapped as well)."], ["2004.12.19", "Iraq", "Baghdad", 2, 0, "Two Christians are kidnapped and then murdered by Jihadists."], ["2004.12.19", "Iraq", "Karbala", 16, 37, "Sixteen people are killed by Fedayeen suicide car bomber and about forty injured in the attack on a Shia holy site."], ["2004.12.19", "Iraq", "Najaf", 52, 142, "An Islamic extremist plows his car into a Shia funeral procession and detonates it near a mosque.  Over fifty people are killed and about one hundred and fifty injured in the suicide attack."], ["2004.12.20", "Afghanistan", "Maywand", 4, 4, "Taliban insurgents ambush a security checkpoint, killing four policemen."], ["2004.12.21", "Iraq", "Mosul", 22, 69, "Twenty-two people, including several civilians are killed and about seventy injured when an Ansar al-Sunnah terrorist blows himself up in the middle of the lunch hour at a mess hall."], ["2004.12.21", "Israel", "Moshov", 1, 0, "A 39-year-old Israeli woman is stabbed to death by Palestinian terrorists."], ["2004.12.22", "India", "Sangam", 1, 14, "One person is killed and fourteen others, mostly civilians are injured when Mujahideen militant hurls a grenade into the road."], ["2004.12.22", "Israel", "Hebron", 1, 0, "Palestinians snatch a rifle from an Israeli guard and then shoot him to death with it."], ["2004.12.22", "Thailand", "Pattani", 1, 0, "A village chief is murdered by Islamists."], ["2004.12.24", "Bangladesh", "Dhaka", 1, 0, "Religious fundamentalists finally murder an economics professor on campus after several unsuccessful attempts"], ["2004.12.24", "Iraq", "Baghdad", 9, 19, "An explosives-rigged fuel truck detonates in a residential neighborhood, killing nine, including seven members of the same family.  \"Shahid\" suicide bombing."], ["2004.12.24", "Thailand", "Narathiwat", 2, 7, "Islamic separatists plant a bomb on a motorcycle, outside a bank, and kill two people, injuring at least seven."], ["2004.12.25", "India", "Pakherpora", 2, 28, "Islamic separatists kill two and injure twenty-eight in a grenade attack on a busy street."], ["2004.12.25", "Pakistan", "Chitral", 2, 0, "Armed fundamentalists kill two employees of an international aid foundation and set fire to vehicles."], ["2004.12.26", "Thailand", "Chana", 3, 1, "Three Thai policemen are killed by Muslims in a motorcycle terror attack as they are passing by."], ["2004.12.27", "Iraq", "Baghdad", 15, 48, "A 'Holy Warrior' detonates explosives in front of a Shia party headquarters, killing himself and at least fifteen other.  Several dozen are injured, many suffering burns and missing limbs."], ["2004.12.28", "Algeria", "Algiers", 7, 0, "Seven Algerian civilians are gunned down by al-Salafeyah extremists."], ["2004.12.28", "Iraq", "Muradiya", 5, 31, "Five civilians are killed by a Sunni car bomb.  About thirty more are injured."], ["2004.12.28", "Iraq", "Tikrit", 17, 26, "In two attacks (Tikrit and Baqubah), Jihadists slaughter twelve Iraqi police officers by slitting their throats and murder five National Guardsmen a bomb."], ["2004.12.28", "Thailand", "Yala", 1, 0, "Islamic extremists kill a school teacher in front of a market."], ["2004.12.29", "Algeria", "Algiers", 3, 0, "A man and his two teenage daughters bleed to death after their throats are cut by Islamic fundamentalists in their home."], ["2004.12.29", "India", "Kashmir", 9, 0, "The Mujahideen shoot nine people to death in separate attacks.  One is the leader of the youth wing of a political party."], ["2004.12.29", "Iraq", "Baghdad", 29, 58, "At least twenty-nine, including two dozen civilians are killed when Islamic radicals blow up several houses near one being searched by police with a massive bomb."], ["2004.12.29", "Pakistan", "Wana", 1, 0, "al-Qaeda members assassinate a local political figure in a drive-by with ties to the Afghan President."], ["2004.12.29", "Saudi Arabia", "Riyadh", 1, 0, "Islamic extremists kill a civilian with a car-bomb."], ["2004.12.29", "Saudi Arabia", "Riyadh", 1, 2, "Saudi militants kill one person in two car bomb blasts."], ["2004.12.29", "Thailand", "Yala", 1, 0, "A second teacher is gunned down in as many days by Muslim separatists."], ["2004.12.30", "Dagestan", "Makhachkala", 3, 0, "Three people, including a man and his wife, are slaughtered at point-blank range by Islamic gunmen."], ["2004.12.30", "India", "Waspora", 2, 1, "Two citizens are shot dead in their home after the Mujahideen barge in.  Another relative is injured."], ["2004.12.30", "Philippines", "Malisbong", 1, 0, "Abu Sayyaf terrorists kill a 68-year-old man execution style."], ["2004.12.31", "Iraq", "Baiji", 7, 0, "Suicide bomber kills seven and injures an unknown number of people."]], "columns": ["Date", "Country", "City", "Killed", "Injured", "Description"], "year": 2004}