{"rows": [["2005.01.01", "Ingushetia", "Vezhariy-Yurt", 1, 0, "An off-duty policeman is murdered by Islamic rebels."], ["2005.01.02", "Iraq", "Balad", 23, 6, "Fedayeen suicide bomber kills twenty-three people, mostly Iraqi National Guardsmen in a terrorist attack."], ["2005.01.02", "Iraq", "Samarrah", 4, 1, "Radical Sunnis machine-gun four cops to death as they sit in their car."], ["2005.01.02", "Israel", "Erez", 1, 2, "Hamas rockets kill a 25-year-old man working in the industrial zone. Two others are injured."], ["2005.01.03", "Algeria", "Biskra", 18, 0, "Algeria's Salafist Group for Preaching and Combat bombs a convoy then rakes it with machine-gun fire, killing eighteen people and injuring an unknown number."], ["2005.01.03", "Iraq", "Mosul", 2, 2, "Ansar al-Sunna Islamists kidnap and decapitate an Iraqi, then booby-trap the headless body with a bomb that kills a police officer."], ["2005.01.03", "Iraq", "Tikrit", 16, 43, "Three suicide bombers blow themselves to Allah in separate attacks, taking sixteen other souls with them.  Over forty others sustain burns, open wounds and lost limbs."], ["2005.01.04", "Iraq", "Baghdad", 7, 0, "Iraqi governor, an advocate for democracy, is gunned down along with six of his guards by Islamic theocrats."], ["2005.01.04", "Iraq", "Baghdad", 10, 60, "Fedayeen 'Holy Warrior' rams a checkpoint with a truck full of explosives, killing ten and injuring at least sixty, including women and children."], ["2005.01.04", "Pakistan", "Vinnoi", 5, 0, "A husband and wife, their son and two other relatives are murdered in their home in an 'honor killing' by a group of armed men."], ["2005.01.04", "Thailand", "Narathiwat", 1, 0, "Muslims murder a Thai village official from the back of a motorcycle as he is driving to work."], ["2005.01.05", "Chechnya", "Grozny", 17, 25, "A series of Mujahideen attacks across the country leaves seventeen dead, nineteen wounded and six others, including two college students kidnapped."], ["2005.01.05", "India", "Srinagar", 0, 6, "Four civilians and two Indian police suffer injuries when the Mujahideen hurl a grenade into a city street."], ["2005.01.05", "Iraq", "Hilla", 20, 44, "Fedayeen suicide car bomber kills at least twenty outside a police graduation ceremony.  About four dozen others are badly hurt."], ["2005.01.06", "Iraq", "Baqubah", 6, 13, "al-Qaeda group sends a suicide bomber into a security point.  Six dead and thirteen injured."], ["2005.01.07", "India", "Srinagar", 3, 2, "Fedayeen militants from the al-Mansoorian outfit storm a government building with grenades, leaving at least four dead."], ["2005.01.07", "Iraq", "Mosul", 18, 0, "The bodies of eighteen Shia laborers abducted and shot execution style by Sunni radicals are unearthed in a field."], ["2005.01.07", "Israel", "Nablus", 1, 3, "An Israeli motorist is killed by a Palestinian sniper.  Three others are injured, two critically."], ["2005.01.07", "Thailand", "Yala", 1, 0, "Terrorists assassinate a shop owner in a bloody attack."], ["2005.01.08", "Pakistan", "Gilgit", 2, 2, "Sunni attack on the vehicle of a Shia cleric leaves two of his guards dead."], ["2005.01.09", "Israel", "Shebaa Farms", 1, 3, "An Israeli officer is killed, and three others injured, in a Hezbollah rocket attack along the Lebanese border."], ["2005.01.09", "Pakistan", "Gilgit", 6, 0, "Shia burn six Sunnis alive after herding them into a house in a revenge for an earlier attack on a Shiite leader."], ["2005.01.10", "Iraq", "Suwayrah", 9, 10, "Eight Ukrainian bomb sappers, and one Kazakh are killed by the 'Islamic Army' in a terrorist bombing attack."], ["2005.01.10", "Iraq", "Tikrit", 8, 12, "Fedayeen suicide bombing leave six police dead and a dozen injured.  Police chief also assassinated in Baghdad, along with his son."], ["2005.01.10", "Kuwait", "Kuwait City", 2, 2, "Islamic gunmen kill two security guards outside a government building."], ["2005.01.10", "Philippines", "Mamasapano", 8, 5, "Moro Islamic Front stages a surprise attack on government post, killing eight Philippine soldiers."], ["2005.01.10", "Thailand", "Yala", 1, 0, "A school security guard is murdered by Islamists."], ["2005.01.11", "Chad", "Goz Beida", 15, 1, "Janjaweed militias murder fifteen villagers in a raid."], ["2005.01.11", "Iraq", "Yusufiyah", 7, 0, "Seven Iraqi civilians are killed when militants destroy their minibus with a roadside bomb."], ["2005.01.12", "Afghanistan", "Helmand", 6, 0, "Six Afghan soldiers are kidnapped and executed by the Taliban."], ["2005.01.12", "Chechnya", "Vedeno", 4, 0, "Mujahideen attack on a government car leaves four civilians dead."], ["2005.01.12", "Iraq", "Salman", 6, 0, "Radical Sunnis shoot a Shia cleric and his son to death on the street, along with four of their bodyguards."], ["2005.01.12", "Israel", "Morag", 1, 3, "Palestinians use explosives and arms fire to murder an Israeli officer in the process of constructing a security fence."], ["2005.01.12", "Somalia", "Mogadishu", 4, 9, "Islamic fundamentalists throw a hand grenade into a cinema showing a soccer game, killing four innocents."], ["2005.01.13", "Iraq", "Baghdad", 5, 1, "Islamic gunmen riddle a civilian minivan with machine-gun fire as it is picking up a Turkish businessman."], ["2005.01.13", "Iraq", "Khan Bani Saad", 7, 30, "A car bomb outside a Shia mosque kills seven people and injures another thirty, some critically."], ["2005.01.13", "Israel", "Karni Crossing", 6, 4, "Three Palestinian suicide bombers infiltrate the security wall, via an explosion, and murder six Israelis.  Four others are wounded."], ["2005.01.13", "Kosovo", "Prizren", 1, 0, "Muslim militants thought responsible for the bombing of a bus station."], ["2005.01.13", "Thailand", "Yala", 2, 1, "Terrorists kill two civilians and severely injure a 5-year-old girl."], ["2005.01.14", "India", "Yarbug Panzla", 1, 0, "The Mujahideen enter a civilian's house and kill his 20-year-old daughter."], ["2005.01.15", "Bangladesh", "Natore", 3, 89, "Islamic militants set off bombs at two different carnivals killing three and injuring about ninety others, including stage performers."], ["2005.01.15", "Dagestan", "Kaspiisk", 4, 1, "Islamic terrorists kill four policemen in two separate shootouts in Dagestan (Kaspiisk & Makhachkala)."], ["2005.01.15", "India", "Srinagar", 2, 0, "Al-Mansoorian terrorists storm a passport office and kill two government employees."], ["2005.01.15", "India", "Srinagar", 2, 17, "Grenade thrown into an election rally by the Mujahideen kills two people and injures seventeen."], ["2005.01.16", "Thailand", "Yala", 1, 59, "Muslims plant a bomb in a Thai restaurant, killing the owner and injuring sixty others."], ["2005.01.17", "Iraq", "Baiji", 8, 25, "Eight people are killed by a suicide bomber, with another 25 injured, some critically."], ["2005.01.17", "Iraq", "Buhriz", 8, 4, "Jihadists attack a police checkpoint with machine-guns, killing eight."], ["2005.01.17", "Iraq", "Ramadi", 3, 9, "Three civilians are killed as a dedicated Muslim blows himself to Allah.  Nine others injured."], ["2005.01.17", "Iraq", "Ramadi", 4, 0, "The bodies of three civilians and one soldier are found in a field, brutally slain, with handwriting declaring them to be traitors to the cause of Allah."], ["2005.01.17", "Thailand", "Pattani", 1, 0, "A civilian is gunned down by Muslim militants."], ["2005.01.18", "Iraq", "Baghdad", 2, 9, "Sunni takes two members of a Shia political party with him to 'paradise.'  Car bombing injures nine others as well."], ["2005.01.18", "Israel", "Gush Katif", 1, 7, "Palestinian suicide bomber murders a father of three and injures seven others."], ["2005.01.18", "Israel", "Sderot", 1, 1, "17-year-old Israeli girl dies trying to protect her 10-year-old brother from a Hamas rocket attack (on 1-15)."], ["2005.01.18", "Thailand", "Narathiwat", 3, 0, "At least three killed as militant Muslims go on a wild shooting and arson spree."], ["2005.01.19", "Algeria", "Adekar Kebouche", 1, 0, "Salafists slit the throat of a motorist stopped at a phony roadblock."], ["2005.01.19", "Sudan", "Hamada", 105, 0, "The Islamic government bombs a village in Darfur, killing more than a hundred people, mostly women and children.  An unknown number are wounded."], ["2005.01.20", "Afghanistan", "Spin Boldak", 3, 0, "Pakistani fuel truck driver and two assistants are murdered by the Taliban in a senseless attack."], ["2005.01.20", "Iraq", "Baghdad", 26, 25, "Three al-Qaeda suicide bombings leave more than two dozen dead and scores of civilians badly injured.  One of the targets was the Australian embassy."], ["2005.01.21", "Algeria", "Blida", 3, 5, "Three people are killed by Islamic fundamentalists in a cemetery.  Five others are injured."], ["2005.01.21", "India", "Anantnag", 1, 3, "The Mujahideen kidnap three civilians and torture two of them, eventually killing one."], ["2005.01.21", "Iraq", "Baghdad", 14, 42, "Radical Sunnis car bomb a Shia mosque as the victims celebrate a religious holiday.  Fourteen are killed, and about forty injured."], ["2005.01.21", "Iraq", "Yusufiyah", 12, 38, "Suicide bomber drives an ambulance full of explosives into a Shia wedding party, slaughtering a dozen, including women and children and injuring dozens more including the bride and groom."], ["2005.01.22", "Afghanistan", "Uruzgan", 4, 0, "Four people, including a police chief and two relatives, are killed by a Taliban roadside bomb."], ["2005.01.22", "Iraq", "Baghdad", 2, 0, "Two truck drivers are kidnapped and beheaded on a public street as executioners chant 'Allah Akbar.'"], ["2005.01.23", "Algeria", "Tizi Ghenif", 2, 1, "Islamic fundamentalists attack a security patrol killing two police and injuring one civilian."], ["2005.01.23", "Sudan", "Darfur", 12, 0, "Janjaweed militia attack several villages, burning houses and killing a dozen innocents."], ["2005.01.24", "India", "Kulgam", 2, 6, "The Mujahideen gun down an orchard worker (Shopian) and toss a grenade into a bus stop."], ["2005.01.24", "Thailand", "Narathiwat", 1, 0, "Muslim gunmen kill a policeman."], ["2005.01.24", "Thailand", "Yala", 1, 0, "A government worker is murdered by Islamists."], ["2005.01.25", "Iraq", "Baghdad", 16, 12, "Islamic insurgents kill sixteen people in various shooting attacks, including the 5-year-old daughter of a policeman."], ["2005.01.26", "Iraq", "Kirkuk", 7, 3, "Seven Iraqis are killed by two Jihad car bombings."], ["2005.01.26", "Iraq", "Sinjar", 15, 31, "Sunni radicals pack a tractor with explosives and detonate it outside a Kurdish political office, killing at least a dozen."], ["2005.01.27", "Bangladesh", "Habiganj", 4, 0, "Four people, including a 73-year-old man are assassinated by Muslim radicals in a grenade attack as they leave a public meeting."], ["2005.01.27", "Bangladesh", "Habiganj", 5, 100, "Islamic fundamentalists lob a grenade into an opposition political rally, killing a former finance minister and at least four others.  About one hundred people are injured, some badly."], ["2005.01.27", "India", "Kremshora", 2, 0, "The Mujahideen abduct and kill an Indian government employee and his son."], ["2005.01.27", "India", "Pampore", 0, 26, "Two grenades tossed by the Mujahideen at an election office injure twenty-six people, almost all civilians."], ["2005.01.27", "Iraq", "Mahmudiyah", 3, 7, "Three civilians are killed, and seven injured by a Sunni bomber."], ["2005.01.27", "Iraq", "Samarrah", 3, 0, "Three civilians, including two women, are killed in a Jihad bombing attack."], ["2005.01.27", "Nigeria", "Numan", 1, 0, "A Christian woman is shot to death by Muslim troops in the troubled African province."], ["2005.01.27", "Philippines", "Bitaras", 1, 0, "A civilian is brutally tortured to death by MILF terrorists."], ["2005.01.28", "Chechnya", "Alkhan-Yurt", 9, 0, "Jihad suicide bomber kills nine Chechen policemen after crashing his car into theirs at full speed."], ["2005.01.28", "Iraq", "Baghdad", 4, 4, "Four Iraqis are killed by a Fedayeen suicide car bomber."], ["2005.01.29", "Afghanistan", "Spin Boldak", 9, 1, "Nine Afghan soldiers are blown to bits by the Taliban while riding in a pickup truck near the Pakistani border."], ["2005.01.29", "Iraq", "Baghdad", 2, 4, "Islamic militants hit the U.S. embassy with a rocket, killing two Americans."], ["2005.01.30", "Iraq", "Baghdad", 44, 67, "A string of suicide attacks by theocratic fanatics kill over forty Iraqis in an effort to prevent the citizenry from exercising their right to vote in elections."], ["2005.01.30", "Kuwait", "Kuwait City", 2, 4, "Islamic militants kill two people in a shootout."], ["2005.01.31", "Bangladesh", "Chittagong", 1, 0, "Jamaat-e-Islami terrorists kill a business man with a bomb in a shopping center."], ["2005.01.31", "India", "Anantnag", 2, 1, "The Mujahideen break into a house and kill a woman, then kidnap and hang her student son."], ["2005.01.31", "India", "Nathali-Bagwa", 4, 3, "Four members of a family, including three children and their mother, are killed when the Mujahideen hurl a grenade into a house after knocking down the door."], ["2005.01.31", "Thailand", "Narathiwat", 1, 0, "Muslims kill a civilian in front of his home."], ["2005.02.01", "Philippines", "Datu Paglas", 4, 0, "MILF terrorists attack a security patrol, killing four members."], ["2005.02.01", "Somalia", "Mogadishu", 1, 0, "A former school administrator is gunned down by Islamic militants."], ["2005.02.02", "Dagestan", "Makhachkala", 4, 0, "Dagestani Islamists kill a high-ranking government official and three others in a shooting ambush on their vehicle."], ["2005.02.02", "Iraq", "Kirkuk", 12, 2, "Takfir wa Hijra (Islamist) terrorists stop a bus full of unarmed Iraqi recruits.  Twelve are dragged off and shot execution-style."], ["2005.02.02", "Thailand", "Yala", 3, 0, "A school teacher is one of three civilians killed in three separate shooting attacks by Islamic terrorists."], ["2005.02.03", "Iraq", "Balad", 2, 0, "Two people are shot to death by Sunni radicals for voting in the election."], ["2005.02.04", "India", "Taryath", 1, 2, "Two people escape after being kidnapped from their village by the Mujahideen, but another is executed."], ["2005.02.04", "Nigeria", "Demsa", 36, 0, "Militant Muslims attack a Christian village in Nigeria, killing at least three dozen and displacing some three thousand others."], ["2005.02.07", "Germany", "Berlin", 1, 0, "A 23-year-old woman is killed by her youngest brother at a bus stop because she 'dishonored' the family by refusing to marry her cousin."], ["2005.02.07", "Iraq", "Baqubah", 15, 17, "Fedayeen suicide bomber kills himself and at least fifteen others who were seeking jobs outside a police station."], ["2005.02.07", "Iraq", "Mosul", 12, 4, "Suicidal extremist kills a dozen police who were guarding a teaching hospital, by pretending to need assistance from the officers."], ["2005.02.07", "Pakistan", "Wana", 2, 2, "al-Qaeda militants ambush four journalists riding in a car.  Two are murdered."], ["2005.02.07", "Philippines", "Panamao", 12, 15, "Muslim separatists attack Philippine troops, killing a dozen."], ["2005.02.07", "Thailand", "Narathiwat", 1, 0, "A defense volunteer is murdered by Islamic extremists."], ["2005.02.08", "Iraq", "Baghdad", 21, 27, "Shaheed suicide bomber blows himself to paradise, along with nearly two dozen others.  About thirty are seriously wounded in the street attack."], ["2005.02.09", "Iraq", "Basra", 2, 0, "Shiite radicals gun down an Iraqi journalist and his 3-year-old son in front of their home."], ["2005.02.09", "Somalia", "Mogadishu", 1, 0, "A BBC director dies of her wounds suffered in an attack by Islamic gunmen."], ["2005.02.09", "Thailand", "Narathiwat", 1, 2, "Thai Islamists set off a bomb in a market stall, killing one villager and injuring two others."], ["2005.02.10", "Iraq", "Suwayrah", 21, 0, "The decomposing bodies of twenty-one Iraqi truck drivers hauling food are found two days after their convoy was ambushed by Islamic radicals.  They had all been burned inside their vehicles."], ["2005.02.11", "Iraq", "Baghdad", 11, 0, "Sunni gunmen block off a street with their cars and then mow down Shia patrons at a bakery, killing eleven and injuring a unknown number of others."], ["2005.02.11", "Iraq", "Balad Ruz", 13, 40, "Suicidal fanatic detonates a massive bomb using a vegetable truck outside a Shia mosque, killing over a dozen and injuring more than forty."], ["2005.02.11", "Thailand", "Yala", 2, 24, "Thai Muslims shoot a Buddhist shopkeeper to death, then trigger a bomb that kills another person and injures two dozen."], ["2005.02.12", "Thailand", "Yala", 1, 0, "A policeman is gunned down by Islamists."], ["2005.02.13", "Iraq", "Nasiriyah", 2, 0, "An Iraqi translator and his son are gunned down by Islamists near their home."], ["2005.02.14", "India", "Shopian", 0, 25, "Twenty-five people are injured when the Mujahideen toss a grenade into a crowded street."], ["2005.02.14", "Iraq", "Baghdad", 3, 0, "Sunni extremists spray the inside of a passenger car with automatic weapons, killing an Iraqi officer and two companions."], ["2005.02.14", "Lebanon", "Beirut", 15, 120, "A powerful Hezbollah suicide bomb blast kills the former Lebanese Prime Minister and fourteen others.  One-hundred and twenty are injured in the blast."], ["2005.02.14", "Philippines", "Davao", 1, 8, "A 12-year-old boy is killed in an Abu Sayyaf bombing at a bus stop.  Eight others are injured."], ["2005.02.14", "Philippines", "General Santos", 5, 36, "An bomb outside a shopping mall kills five shoppers and injures at least three dozen others.  Abu Sayyaf claims responsibility."], ["2005.02.14", "Philippines", "Manila", 3, 79, "The Abu Sayyaf terrorist group detonates a bomb in the Philippine capital outside a crowded bus terminal, setting three buses on fire and killing at least three."], ["2005.02.14", "Thailand", "Narathiwat", 1, 1, "Muslim separatists shoot a 48-year-old man off of a motorcycle, injuring his wife as well."], ["2005.02.15", "Indonesia", "Ambon", 2, 2, "Muslims shoot two people, including a teenage girl, to death in an attack on a karaoke club."], ["2005.02.15", "Pakistan", "Noorpur Shahan", 3, 14, "Sectarian shooting attack leaves three dead Sunnis and fourteen others injured."], ["2005.02.16", "Dagestan", "Kizlyar", 3, 4, "Three people are killed in an IED attack by Islamic separatists."], ["2005.02.16", "India", "Kishtwar", 2, 7, "Mujahideen toss a grenade into a bus stop, killing one and injuring seven.  Elsewhere (Rajouri) they kidnap and kill a 60-year-old man."], ["2005.02.17", "Iraq", "Zakho", 1, 0, "Christian taxi driver gunned down after refusing to convert back to Islam."], ["2005.02.17", "Jordan", "Al Karamah", 3, 0, "Three truck drivers are murdered by Islamic terrorists."], ["2005.02.17", "Somalia", "Mogadishu", 2, 5, "Bombing kills two and injures five near a hotel."], ["2005.02.18", "Chechnya", "Kurchaloi", 5, 0, "Three civilians are among five people murdered at point-blank range by Jihad gunmen."], ["2005.02.18", "Iraq", "Baghdad", 2, 8, "Two people in a religious procession are killed by a Fedayeen suicide bomber on a city street."], ["2005.02.18", "Iraq", "Baghdad", 10, 20, "Another suicide bomber blows himself to Allah outside a Shia mosque, taking at least ten others with him."], ["2005.02.18", "Iraq", "Baghdad", 15, 23, "Suicide bomber kills fifteen Shia worshippers inside a mosque just as Friday prayers are beginning.  Another two dozen are injured."], ["2005.02.18", "Lebanon", "al-Shuwayfat", 2, 0, "Islamists bomb a Christian-owned gas station, killing two people."], ["2005.02.18", "Thailand", "Sungai Kolok", 6, 44, "Muslim separatists kill six people near a hotel hosting a wedding reception with a powerful car bomb."], ["2005.02.19", "Algeria", "Batna", 4, 0, "The Salafist Group for Preaching and Combat ambush and kill four soldiers in remote Algeria."], ["2005.02.19", "Iraq", "Baqubah", 42, 91, "Eight suicide attacks by Fedayeen 'Holy Warriors' (including one on a bicycle), along with a bus explosion kill at least forty innocent people and injure over one-hundred."], ["2005.02.20", "Thailand", "Narathiwat", 1, 0, "Militants gun down a civilian outside a hospital."], ["2005.02.21", "Chechnya", "Grozny", 9, 2, "Nine Russian servicemen are killed in an attack by the Mujahideen in the capital's suburbs."], ["2005.02.21", "Thailand", "Narathiwat", 1, 2, "A village head is murdered by Islamists."], ["2005.02.21", "Thailand", "Yala", 1, 0, "A school headmaster is murdered by Islamists."], ["2005.02.22", "Afghanistan", "Sangin", 2, 0, "The Taliban stop a vehicle carrying two humanitarian aid workers then execute each with a shot to the back of the head."], ["2005.02.22", "Iraq", "Baghdad", 4, 30, "Suicide bomber rams his car into a police convoy, killing four and injuring about thirty."], ["2005.02.23", "Iraq", "Mosul", 2, 14, "Jihad car bombing kills two Iraqis and leaves fourteen others injured."], ["2005.02.24", "Afghanistan", "Chakul", 9, 0, "The Taliban ambush and murder nine Afghan police officers."], ["2005.02.24", "Dagestan", "Untsukul", 2, 0, "Two men sitting in a car are machine-gunned to death by Islamic separatists."], ["2005.02.24", "India", "Sopore", 0, 12, "Militant Islamist hurls a grenade into a crowd of people, injuring at least ten civilians."], ["2005.02.24", "India", "Srinagar", 5, 2, "The Mujahideen kill five people and injure at least two others in a suicide assault on a government building in the region's capital."], ["2005.02.24", "Iraq", "Iskandariya", 3, 8, "A young girl is among the three people killed by a Sunni car bombing.  Eight others are injured, two critically."], ["2005.02.24", "Iraq", "Tikrit", 15, 22, "Islamic suicide bomber drives an explosive-packed vehicle into a police compound, killing fifteen and leaving another two dozen in various stages of agony."], ["2005.02.24", "Thailand", "Yala", 7, 0, "Muslim terrorists kill seven people over a two day stretch that includes a Buddhist grocery store owner and a village chief."], ["2005.02.25", "Israel", "Tel Aviv", 5, 49, "Three weeks after a truce-signing, a Palestinian suicide bomber kills five Israelis outside a nightclub.  Forty-nine others in line are injured."], ["2005.02.25", "Nigeria", "Sokoto", 3, 0, "Shia extremists kill three Sunnis as they are walking out of a mosque."], ["2005.02.25", "Thailand", "Narathiwat", 1, 0, "Islamists murder a civilian in a coconut plantation."], ["2005.02.26", "Thailand", "Narathiwat", 1, 0, "A man is gunned down as he is walking to a local market."], ["2005.02.27", "Algeria", "Souk El-Khemis", 2, 0, "Two people in a small Algerian town are killed when religious fundamentalists set off a bomb."], ["2005.02.27", "Iraq", "Mosul", 12, 2, "Car bomber kills eight people and Jihad gunmen kill another four in a separate incident, also in Mosul."], ["2005.02.28", "Afghanistan", "Takhar", 2, 0, "Two Afghan cops are gunned down by the Taliban."], ["2005.02.28", "India", "Matribugh", 2, 0, "Hizb-ul-Mujahideen terrorists capture, disarm and then execute two Indian soldiers."], ["2005.02.28", "India", "Surankote", 1, 0, "The Mujahideen kidnap a 17-year-old boy from his home and then kill him."], ["2005.02.28", "Iraq", "Hilla", 135, 141, "A Fedayeen suicide car bomber blows his way to paradise by driving into a crowd of unemployed Iraqis, taking the lives of more than one-hundred souls, most of whom were Christian."], ["2005.02.28", "Sudan", "Toray", 17, 14, "Arab militias with the support of the Islamic government attack a village and kill seventeen civilians and injure a dozen others including several women who were raped."], ["2005.03.01", "Chechnya", "Sernovodskiy", 1, 16, "One policeman is killed, and sixteen others injured when the Mujahideen attack their station."], ["2005.03.01", "Thailand", "Pattani", 1, 1, "A government official is killed in a shooting attack by militant Muslims."], ["2005.03.01", "Thailand", "Pattani", 3, 1, "Muslim terrorists murder three civilians in separate random shooting attacks."], ["2005.03.02", "Bangladesh", "Narsingdi", 0, 10, "Militant Muslims injure ten people with a bomb outside a shrine."], ["2005.03.02", "Iraq", "Baghdad", 13, 30, "Two suicide car bombings kills thirteen Iraqis and wound thirty.  In a separate attack, a judge and his son are gunned down."], ["2005.03.02", "Thailand", "Narathiwat", 1, 3, "Islamic terrorists fire on a pickup carrying four people, killing one."], ["2005.03.03", "Iraq", "Baghdad", 5, 7, "Five people are killed by two Fedayeen suicide bombers outside a government building."], ["2005.03.03", "Iraq", "Baqubah", 1, 3, "Jihad car bombing kills one civilian and injures three."], ["2005.03.03", "Thailand", "Narathiwat", 1, 1, "A man is shot off of his motorcycle by Muslim militants."], ["2005.03.06", "Thailand", "Narathiwat", 2, 0, "Gema’ah Islamiyah terrorists, disguised as fully-veiled Muslim women open fire on a police checkpoint, killing two Thai officers."], ["2005.03.06", "Thailand", "Narathiwat", 2, 0, "Two young civilians are gunned down by Islamic militants in a motorcycle attack."], ["2005.03.07", "Afghanistan", "Kabul", 1, 0, "British national gunned down by a Taliban terrorist while waiting at a traffic light."], ["2005.03.07", "Iraq", "Balad", 12, 21, "Jihadists murder a dozen people, mostly civilians with a car bombing in a residential neighborhood."], ["2005.03.07", "Iraq", "Baqubah", 15, 17, "al-Qaeda suicide bomber accounts for most of the fifteen people dead in four attacks.  At least twenty-six others are injured."], ["2005.03.07", "Israel", "Hebron", 0, 2, "Two Israelis are wounded by a Palestinian sniper."], ["2005.03.07", "Thailand", "Pattani", 3, 0, "Three people, including two Buddhists and a businesswoman are murdered in three separate attacks by Muslim terrorists."], ["2005.03.08", "Bangladesh", "Jalalpur", 1, 0, "Christian pastor attacked and beheaded by Muslim extremists as he is returning home from work."], ["2005.03.08", "Pakistan", "Danyore", 1, 0, "Sunni government official shot to death by Shia militants while waiting for a bus."], ["2005.03.09", "Iraq", "Al-Rumana", 41, 0, "The bodies of forty-one people, massacred by Jihadists, are found.  All had been executed, many were beheaded, including several women and young children."], ["2005.03.09", "Iraq", "Baghdad", 2, 40, "Two suicide bombers drive a garbage truck packed with explosives into a hotel, killing two others and injuring several dozen."], ["2005.03.10", "Iraq", "Mosul", 50, 86, "Devout Sunni blows himself up inside a Shiite mosque, taking fifty lives and leaving about a hundred other people badly injured."], ["2005.03.11", "Philippines", "Sulu", 5, 4, "The Moro Islamic Front attacks a military patrol, killing five and injuring four."], ["2005.03.12", "Algeria", "Bouira", 2, 2, "Islamic extremists set up a fake roadblock, then machine-gun two policemen to death in their vehicle."], ["2005.03.13", "Iraq", "Hilla", 2, 1, "Muslims kill two American security contractors with a roadside bomb."], ["2005.03.13", "Iraq", "Mosul", 6, 1, "Sunni Jihadists kill a police officer's wife and two young children then shoot three other policemen attending the funeral a day later."], ["2005.03.14", "India", "Baramulla", 2, 0, "The Mujahideen ambush a search party, killing at least one person.  They also kill a civilian at his home (Gagrot Piri)."], ["2005.03.14", "Iraq", "Baghdad", 6, 10, "Three car bombings kill a total of four civilians, including two farmers."], ["2005.03.14", "Philippines", "Manila", 3, 3, "Abu Sayyaf militant grabs a gun and shoots three prison guards to death."], ["2005.03.15", "India", "Poonch", 0, 7, "Seven people standing outside a bank are injured when the Mujahideen hurl a grenade at them."], ["2005.03.15", "India", "Tangmarg", 2, 0, "A leader of the terrorist group, Hizb-ul-Mujahideen, kills two people in making an escape from jail."], ["2005.03.15", "Iraq", "Baghdad", 1, 4, "Suicide bomber successfully kills a young child and injures four others."], ["2005.03.15", "Iraq", "Baghdad", 4, 7, "Jihad car bombing kills four civilians and injures seven."], ["2005.03.15", "Thailand", "Yala", 1, 3, "A policeman is killed and three other people injured when Muslim separatists set off a bomb at a railway station."], ["2005.03.16", "Iraq", "Baqubah", 3, 8, "al-Qaeda suicide bomber kills three soldiers and injures eight other people, including civilians."], ["2005.03.17", "Afghanistan", "Kandahar", 5, 32, "The Taliban detonate a roadside bomb targeting a humanitarian convoy that kills two women, two men and one Afghan child.  Thirty-two others are injured."], ["2005.03.17", "India", "Rajouri", 3, 24, "Three people are killed when the Mujahideen hurl a grenade at a restaurant."], ["2005.03.17", "Nigeria", "Benue", 1, 0, "Two Muslim men rape a Christian girl and then poison her."], ["2005.03.17", "Thailand", "Pattani", 1, 0, "A school principal is gunned down by Islamic radicals."], ["2005.03.18", "India", "Bandipore", 1, 6, "The Mujahideen kill an 8-year-old boy by tossing a grenade into a school.  Six of his classmates sustain critical injuries."], ["2005.03.19", "Iraq", "Kirkuk", 4, 5, "Jihad insurgents gun down a police officer, then kill three others at his funeral procession."], ["2005.03.19", "Lebanon", "Beirut", 2, 11, "Syrian-backed terrorists set off a car bomb in a Christian neighborhood, killing two innocents."], ["2005.03.19", "Qatar", "Doha", 1, 16, "Egyptian suicide bomber slams his car into a theatre, killing a British national and injuring sixteen others in the Qatari capital."], ["2005.03.19", "Thailand", "Narathiwat", 2, 2, "Three separate shooting attacks by Islamic militants leave at least two villagers dead, including a Buddhist man shot in the back of the head while sitting in his tea shop."], ["2005.03.20", "Afghanistan", "Khost", 2, 0, "Two civilians are murdered in a Taliban attack."], ["2005.03.20", "Iraq", "Mosul", 5, 14, "A suicide bomber walks into a government building and kills three others.  Jihadists then open fire on the subsequent funeral, killing two others."], ["2005.03.20", "Pakistan", "Fatehpur", 39, 55, "Radical Sunni suicide bomber blows up a Shia religious festival near a Pakistani shrine, killing about three dozen and injuring many more."], ["2005.03.20", "Thailand", "Yala", 1, 13, "One civilian is killed, and thirteen other people injured by two bombs placed by Islamic separatists, one near a river pavilion."], ["2005.03.21", "Iraq", "Aziziyah", 7, 0, "A roadside bombing rips through the bodies of four women and three children riding in a vehicle."], ["2005.03.21", "Iraq", "Sammarah", 3, 6, "Three people, including two women, are murdered in a Jihad car bombing."], ["2005.03.21", "Thailand", "Songkhla", 1, 3, "Islamic separatists open fire on a restaurant, killing one customer and injuring three others."], ["2005.03.22", "Chechnya", "Grozny", 1, 0, "A guard is killed by Islamic militants."], ["2005.03.22", "Iraq", "Mosul", 10, 0, "Roadside blast kills four civilians.  Elsewhere (in Kut), the bodies of six captured soldiers are found bound and executed."], ["2005.03.23", "Afghanistan", "Gereshk", 2, 1, "Two government employees are shot to death by the Taliban."], ["2005.03.23", "India", "Srinagar", 1, 5, "The Mujahideen kill a civilian and injure several other people with a car bomb in a shopping district."], ["2005.03.23", "Lebanon", "Jounieh", 3, 3, "Three people are killed when Muslim terrorists detonate an 80kg bomb in a shopping center in a Christian area north of Beirut."], ["2005.03.23", "Thailand", "Narathiwat", 1, 0, "A rubber plantation owner has his life cut short by Islamic radicals."], ["2005.03.23", "Thailand", "Pattani", 1, 0, "A former village headsman is assassinated by terrorists."], ["2005.03.24", "Chechnya", "Petropavlovskaya", 1, 0, "Islamic terrorists assassinate a government official."], ["2005.03.24", "India", "Bakhipora", 2, 0, "Hizb-ul-Mujahideen invade a civilian's home, kidnap his son and nephew then execute them in captivity."], ["2005.03.24", "Iraq", "Baghdad", 5, 0, "Jihad gunmen open up on a van carrying cleaning women from their job at an American base.  Five women are shot to death."], ["2005.03.24", "Iraq", "Basra", 2, 0, "A female Christian college student is kidnapped and beaten to death by Shiite radicals.  A man coming to her rescue is murdered as well."], ["2005.03.24", "Thailand", "Yala", 0, 4, "Four people, including an elderly Buddhist monk are injured by a bomb that Islamic militants trigger with a cell phone."], ["2005.03.25", "Afghanistan", "Oruzgan", 2, 0, "A judge is one of two people murdered by religious extremists in separate attacks."], ["2005.03.25", "Chechnya", "Proletarskiy", 2, 0, "Two civilian, including an elderly man, are beaten and shot to death in their home by Islamic rebels."], ["2005.03.25", "India", "Manwa-Dangal", 1, 0, "Muslim terrorists abduct a civilian then slit his throat a day later."], ["2005.03.25", "Iraq", "Karbala", 2, 19, "Two Shia pilgrims are killed, and nineteen others injured by a Sunni suicide bomber as they are marching to the shrine city."], ["2005.03.25", "Iraq", "Ramadi", 11, 14, "Fedayeen suicide bomber kills eleven police officers at a checkpoint and injures another fourteen."], ["2005.03.26", "India", "Srinagar", 1, 16, "Sixteen people are injured and one killed when the Mujahideen lob a grenade near a crowded bus stop."], ["2005.03.26", "Iraq", "Tal Afar", 4, 6, "Four policemen are killed, and six wounded, in an attack on their station by radical Sunni."], ["2005.03.26", "Lebanon", "Beirut", 0, 5, "Bomb in a predominately Christian suburb injures five."], ["2005.03.26", "Thailand", "Narathiwat", 2, 0, "Two railway worker are murdered by Muslim radicals as they are taking a break."], ["2005.03.27", "Afghanistan", "Laghman", 4, 0, "Four Afghan military guards are blown to bits in a Taliban rocket attack on a government building."], ["2005.03.27", "India", "Udhampur", 4, 0, "Mujahideen militants set fire to a civilian's house after killing his mother, wife and infant daughter.  They also murder a neighbor."], ["2005.03.27", "Iraq", "Abu Tamir", 6, 3, "Six Iraqis are killed by Jihadists in and around Baqubah in several shooting attacks."], ["2005.03.27", "Iraq", "Baghdad", 2, 2, "Religious fanatic blows himself up, also killing two U.S. soldiers."], ["2005.03.27", "Pakistan", "Khambay", 1, 6, "Four Islamic militants open fire on an church Easter service, killing at least one Christian and injuring six other worshippers."], ["2005.03.27", "Thailand", "Narathiwat", 0, 15, "Bombing and shooting attack on a train by Muslim separatists results in more than a dozen casualties."], ["2005.03.28", "India", "Machan", 2, 8, "Muslim terrorists ambush a local security patrol, killing two and injuring eight."], ["2005.03.28", "Iraq", "Karbala", 7, 9, "Sunni extremist kills seven Shia pilgrims at a religious event with a suicide car bombing.  At least nine others are injured."], ["2005.03.28", "Yemen", "Saada", 4, 0, "Islamic extremists ambush and kill four Yemeni policemen."], ["2005.03.29", "Afghanistan", "Anar Darah", 4, 0, "The Taliban ambush and kill four policemen in a remote area."], ["2005.03.29", "Algeria", "Thenia", 1, 0, "The Salafist Group for Preaching and Combat kidnaps a 32-year-old man then slits his throat."], ["2005.03.29", "India", "Biwilian", 1, 0, "Lashkar-e-Toiba terrorists kill a boy who refuses to courier money for them."], ["2005.03.29", "Iraq", "Mussayib", 5, 5, "Suicide bicycle bomber pedals his way to Paradise, taking five other souls with him including three civilians."], ["2005.03.30", "Iraq", "Mahawil", 1, 2, "Sunni extremists open fire on Shiite pilgrims making their way to a religious festival, killing at least one person."], ["2005.03.30", "Iraq", "Mosul", 6, 8, "Four Jihadi gunmen open fire on a street, killing six people and injuring another eight in what appeared to be a suicide attack."], ["2005.03.31", "India", "Sonabrari", 3, 0, "The bodies of three shepherds abducted and executed by the Mujahideen two days earlier are found."], ["2005.03.31", "India", "Thanna Mandi", 5, 5, "The Mujahideen kidnap and kill two villagers from their home.  Elsewhere in Kashmir three other civilians are killed in separate attacks."], ["2005.03.31", "Iraq", "Tuz Khormato", 5, 14, "Fedayeen suicide bomber murders five others, including a child, outside a shrine."], ["2005.04.01", "Afghanistan", "Peyazkar", 2, 0, "Civilians standing near a tractor are murdered in a Taliban bombing."], ["2005.04.01", "Afghanistan", "Spin Boldak", 3, 0, "Taliban extremists kill three truck drivers and then burn their vehicles."], ["2005.04.01", "Lebanon", "Broummana", 0, 12, "Bomb placed outside a shopping center in a Christian resort village by Syrian-backed terrorists injures a dozen."], ["2005.04.01", "Pakistan", "Lahore", 1, 3, "Sunni gunmen kill a Shiite cleric in his car in an attack that also injures his young daughter and two of her friends."], ["2005.04.02", "Afghanistan", "Kandahar", 4, 5, "The Taliban kill four people, including two children, in two bomb attacks (the second in Mazar-i-Sharif)."], ["2005.04.02", "Iraq", "Baghdad", 6, 5, "Car bomb kills five Iraqis and injures another five.  A government minister of education is gunned down in a separate attack."], ["2005.04.02", "Thailand", "Narathiwat", 1, 0, "A Buddhist man is murdered by Muslims while sitting in his pick-up truck with his children."], ["2005.04.03", "Afghanistan", "Helmand", 9, 3, "Muslim extremists attack a government building, killing nine Afghan soldiers."], ["2005.04.03", "Algeria", "Boumerdes", 3, 2, "Three farmers are killed when Islamic fundamentalists with suspected ties to al-Qaeda set off a roadside bomb in Algeria."], ["2005.04.03", "Algeria", "Chlef", 1, 0, "The Salafist Group for Preaching and Combat stab and shoot a shepherd to death."], ["2005.04.03", "Chechnya", "Sernovodsk", 3, 1, "One man is murdered in an IED attack by Muslim separatists. Two sappers are blown apart in a separate bombing."], ["2005.04.03", "Thailand", "Songkhla", 5, 86, "Islamic militants set off three bombs, killing five and injuring at least eighty.  The fatalities were from the bomb set at the airport.  The other two bombs were at a hotel and a department store."], ["2005.04.04", "Algeria", "Boumerdes", 5, 11, "Islamic fundamentalists stage an ambush on a police convoy, massacring five officers."], ["2005.04.05", "India", "Jammu", 2, 3, "Pakistani Fedayeen take Indian border guards by surprise, killing two Hindus and injuring three before fleeing."], ["2005.04.05", "Thailand", "Narathiwat", 2, 0, "Two village guards are murdered by Islamic radicals while riding in their truck."], ["2005.04.06", "Afghanistan", "Charchino", 3, 0, "Three civilians are murdered by the Taliban."], ["2005.04.06", "India", "Hanjivira", 0, 7, "Mujahideen bomb intended for a passenger bus explodes early, injuring seven civilians."], ["2005.04.06", "Iraq", "Mosul", 2, 0, "Video posted on the Internet showing two young men brutally stabbed to death as assailants yell \"Allah Akbar.\""], ["2005.04.06", "Thailand", "Pattani", 1, 0, "Islamists kill a village headsman."], ["2005.04.07", "Algeria", "Oued Djerma", 14, 0, "Algerian fundamentalists set up a fake roadblock then slaughter the trapped victims and set fire to their cars."], ["2005.04.07", "Egypt", "Cairo", 3, 18, "Islamist detonates a nail-packed bomb in a shopping area, killing a French woman and two others, including an American tourist.  Eighteen others are injured."], ["2005.04.07", "India", "Srinagar", 0, 7, "Fedayeen suicide attack on the bus terminal housing elderly 'freedom riders' is largely unsuccessful.  Two attackers are killed."], ["2005.04.07", "Pakistan", "Peshawar", 2, 0, "A priest and his Christian driver are detained then stabbed to death by Muslim extremists, who also cut off the hands, noses and ears of the victims."], ["2005.04.07", "Sudan", "Khor Abeche", 17, 0, "Arab militia raids an African village, killing at least seventeen and torching homes.  A small mosque was one of only two structures spared."], ["2005.04.08", "Algeria", "Jijel", 2, 0, "Two civilians are shot to death by Islamic fundamentalists."], ["2005.04.08", "Iraq", "Baghdad", 4, 0, "Roadside bomb kills four children."], ["2005.04.08", "Iraq", "Baqubah", 10, 0, "The bodies of ten civilians, abducted, bound and executed by Jihadis are found."], ["2005.04.08", "Iraq", "Latifiya", 15, 0, "In a senseless killing, members of the \"Islamic Army\" stop a vehicle carrying non-uniformed Iraqi soldiers and machine-gun them to death."], ["2005.04.09", "Afghanistan", "Qalat", 1, 0, "The Taliban murder a government official taken hostage two days earlier."], ["2005.04.09", "Iraq", "Mosul", 2, 13, "Islamic insurgents detonate a roadside bomb, killing two civilians and injuring thirteen others."], ["2005.04.09", "Thailand", "Yala", 1, 0, "Muslim separatists kill a policeman."], ["2005.04.10", "India", "Shopian", 2, 20, "Islamic militant hurls a grenade into a group of pedestrians, killing two and injuring twenty."], ["2005.04.10", "India", "Srinagar", 4, 3, "The Mujahideen kill four people in four separate shooting attacks across the region and take three policemen hostage."], ["2005.04.10", "Nigeria", "Benue", 14, 4, "Fourteen Christians are killed in an attack on their villages by Muslim militants in the large African nation."], ["2005.04.11", "Iraq", "Qaim", 0, 0, "Three remarkably inefficient suicide bombers manage to send themselves to Allah, but not anyone else."], ["2005.04.11", "Iraq", "Samarrah", 3, 22, "Fedayeen suicide bomber blows his pickup truck to pieces in a crowded market, killing three civilians an injuring more than twenty others."], ["2005.04.11", "Thailand", "Narathiwat", 2, 0, "Two civilians are murdered by Islamic gunmen in separate attacks."], ["2005.04.11", "Thailand", "Pattani", 1, 0, "Muslim terrorists kill a civilian, then burn his body."], ["2005.04.12", "India", "Shopian", 1, 0, "The Mujahideen shoot a woman to death in front of her house."], ["2005.04.12", "Iraq", "Mosul", 5, 12, "Fedayeen suicide bomber murders five civilians on a city street."], ["2005.04.12", "Iraq", "Tal Afar", 5, 8, "A suicide car bomber manages to kill five Iraqis and injure eight.  Most of the victims were children."], ["2005.04.12", "Philippines", "Tagaya", 4, 2, "An ambush by MILF terrorists leave four people dead."], ["2005.04.13", "Algeria", "Relizane", 2, 5, "Two civilians are shot to death in an ambush by religious fundamentalists.  Five others are injured in the attack."], ["2005.04.13", "Algeria", "Tebessa", 3, 3, "Religious fundamentalists kill three security guards and injure three others in three different bombings."], ["2005.04.13", "Dagestan", "Makhachkala", 1, 2, "A policeman is killed and two others injured as Islamic militants plant a bomb on a road leading to the airport."], ["2005.04.13", "Iraq", "Kirkuk", 12, 3, "Muslim terrorists plant a decoy bomb near another live one that kills a dozen policemen while they are trying to defuse the decoy."], ["2005.04.14", "Iraq", "Baghdad", 18, 36, "al-Qaeda sets off two car bombs on a crowded city street, massacring eighteen people and injuring about forty others."], ["2005.04.14", "Iraq", "Kirkuk", 6, 0, "Ansar al-Sunnah terrorists gun down five police officers and one civilian in a single attack."], ["2005.04.14", "Iraq", "Mahawil", 4, 6, "Suicide bomber takes four Iraqi with him.  Six others are badly injured."], ["2005.04.15", "Afghanistan", "Deh Rawod", 2, 2, "Religious extremists bomb a hotel, killing two civilians."], ["2005.04.16", "Iran", "Ahvaz", 3, 24, "Three people are killed, and several dozen injured in sectarian rioting."], ["2005.04.16", "Iraq", "Baghdad", 3, 6, "Religious extremist blows himself up, killing three other civilians and wounding six.  One of the women killed was described as 'Angel of Mercy.'"], ["2005.04.16", "Iraq", "Baqubah", 9, 12, "Radical Sunnis detonate a bomb in a restaurant, killing nine patrons and injuring over a dozen."], ["2005.04.17", "Chechnya", "Nozhai-Yurt,", 1, 0, "The Mujahideen kill a young boy with an IED."], ["2005.04.17", "Pakistan", "Kandahar", 1, 3, "One truck driver is killed, and three others injured when Taliban extremists attack their oil convoy with rockets."], ["2005.04.18", "Somalia", "Mogadishu", 1, 2, "Suspected Islamists open fire on a Swedish humanitarian aid vehicle, killing an aid worker and injuring two others."], ["2005.04.18", "Thailand", "Narathiwat", 1, 0, "Radical Muslims gun down a man sitting in a tea shop."], ["2005.04.19", "Dagestan", "Makhachkala", 1, 1, "Islamic terrorists detonate a bomb at a busy intersection, killing a civilian."], ["2005.04.19", "Iraq", "Baghdad", 2, 4, "Two American soldiers are killed by a Fedayeen suicide bomber."], ["2005.04.19", "Iraq", "Baghdad", 4, 38, "Islamist blows himself to Allah in a green minivan, taking four Iraqi police recruits with him and injuring thirty-eight others"], ["2005.04.19", "Thailand", "Pattani", 1, 0, "A man is murdered by Muslim terrorists while leaving a tea shop."], ["2005.04.20", "India", "Sopore", 2, 10, "The Mujahideen take out a vegetable vendor and another innocent woman in a grenade attack on a shopping district."], ["2005.04.20", "Iraq", "Baghdad", 4, 13, "Three terrorist attacks, including an ambush on a truck convoy, leave four civilians dead and at least thirteen injured, some critically."], ["2005.04.20", "Iraq", "Haditha", 19, 0, "Jihadis mark the birth of Muhammad by abducting nineteen Iraqi soldiers in civilian clothes heading home to celebrate the holiday with their families.  The men are then executed at a soccer stadium."], ["2005.04.20", "Pakistan", "Nowshera", 1, 0, "Pakistani mob chases a 'blasphemer' up a tree before lynching him."], ["2005.04.20", "Thailand", "Narathiwat", 1, 0, "A gentle Buddhist man is shot to death by Muslim radicals."], ["2005.04.20", "Thailand", "Pattani", 1, 0, "A hospital gardener is murdered by Islamic terrorists."], ["2005.04.21", "Iraq", "Suwayrah", 57, 0, "Women and children are amply represented among the more than fifty bodies pulled out of a river after having their throats cut by Islamist kidnappers."], ["2005.04.21", "Iraq", "al-Taji", 11, 0, "Yelling \"Allah Akbar\" Islamists bring down a civilian helicopter with a missile, killing ten.  The lone survivor is helped to is feet, then shot to death."], ["2005.04.21", "Saudi Arabia", "Mecca", 2, 0, "Saudi Islamists kill two Saudi policemen."], ["2005.04.21", "Thailand", "Narathiwat", 1, 0, "A man is murdered by Muslims while driving to work."], ["2005.04.22", "Afghanistan", "Maywand", 1, 0, "A government employee is murdered by the Taliban."], ["2005.04.22", "Algeria", "Bir El Ater", 2, 0, "Two Algerian civilians die in a bomb attack by Islamic fundamentalists."], ["2005.04.22", "Dagestan", "Makhachkala", 1, 1, "Muslim militants kill a civilian with a bomb hidden in a garbage can."], ["2005.04.22", "India", "Baramulla", 2, 0, "Two youths are killed in separate attacks by the Mujahideen.  One has his throat slit."], ["2005.04.22", "Iraq", "Baghdad", 12, 26, "Twelve people, including a 10-year-old boy, are killed when religious extremists bomb a Shia mosque.  Twenty-six others are badly injured."], ["2005.04.22", "Iraq", "Baqubah", 1, 1, "Radical Sunnis murder a 7-year-old girl with a roadside bomb."], ["2005.04.23", "Algeria", "Ain Defla", 4, 4, "The Salafist Group for Preaching and Combat shoots two family members to death, then kills two community guards in separate attacks."], ["2005.04.23", "England", "Southall", 1, 0, "A woman is brutally stabbed to death by her brother and cousin after refusing an arranged marriage."], ["2005.04.23", "Iraq", "Baghdad", 13, 30, "Multiple bombings by Jihadis, including at least one suicide attack, leave thirteen Iraqis dead and at least thirty injured."], ["2005.04.23", "Thailand", "Pattani", 1, 0, "A civilian is killed by Islamic terrorists."], ["2005.04.24", "Afghanistan", "Kandahar", 2, 0, "The Taliban attack a government building, killing two security staff."], ["2005.04.24", "Chechnya", "Shelkovskaya", 1, 0, "Islamic terrorists kill an imam who turned them away."], ["2005.04.24", "Indonesia", "Sulawesi", 6, 0, "At least six Christian villagers are killed by their Muslim neighbors after refusing to 'return to Islam.'"], ["2005.04.24", "Iraq", "Baghdad", 15, 40, "Sunni extremists plow a car into a crowd of people outside an ice cream shop in a Shia neighborhood, then detonate the vehicle as others rush to help the victims."], ["2005.04.24", "Iraq", "Tikrit", 6, 33, "Jihadis murder six policemen with two bombs.  Nearly three dozen others are injured."], ["2005.04.24", "Thailand", "Narathiwat", 2, 3, "Militant Muslims kill two Thai policemen with a remote-controlled bomb that injures three civilians as well."], ["2005.04.25", "India", "Khurhama", 1, 0, "A political activist is kidnapped by the Mujahideen and then shot to death."], ["2005.04.25", "Philippines", "Jolo", 2, 5, "Abu Sayyaf terrorists kill two Philippine soldiers with a bomb.  Five others are badly injured."], ["2005.04.25", "Yemen", "Sanaa", 2, 2, "Followers of a radical Shiite throw a bomb from a car window, killing two, including a student and injuring two others."], ["2005.04.26", "Afghanistan", "Dishu", 4, 2, "Four police officers are killed in an ambush by Taliban terrorists on their convoy."], ["2005.04.26", "Afghanistan", "Paktia", 1, 0, "A civilian is murdered by the Taliban."], ["2005.04.27", "India", "Pahalgam", 1, 0, "The Mujahideen abduct and murder an Indian school teacher."], ["2005.04.27", "Iraq", "Najaf", 1, 0, "Shiite cleric gunned down on his way to work."], ["2005.04.27", "Thailand", "Pattani", 1, 1, "Muslims kill a teacher and injure his nephew."], ["2005.04.28", "Algeria", "Sidi Daoud", 2, 0, "Algerian fundamentalists kill two soldiers in a terror bombing."], ["2005.04.29", "Iraq", "Baghdad", 41, 120, "Seven separate suicide bombings by Muslim extremists leave more than forty people dead and at least one-hundred and twenty injured.  Women and children are among the victims."], ["2005.04.29", "Kabardino-Balk.", "Nalchik", 4, 2, "A Russian cop and three civilians are killed by Islamic militants."], ["2005.04.29", "Thailand", "Narathiwat", 1, 0, "A government employee is killed by armed Muslims."], ["2005.04.29", "Thailand", "Pattani", 1, 0, "A man is murdered by Muslim terrorists."], ["2005.04.30", "Egypt", "Cairo", 0, 9, "Two women in veils stage a shooting attack on a tour bus.  They are the only fatalities, but nine innocents are injured."], ["2005.04.30", "Iraq", "Baghdad", 11, 36, "A series of five bombings kills at least eleven and injures dozens."], ["2005.05.01", "Afghanistan", "Baghlan", 3, 0, "The Taliban kill three women, at least one of whom was an aid worker."], ["2005.05.01", "Iraq", "Baghdad", 4, 5, "A Jihad car bomb kills four civilians and injures another five."], ["2005.05.01", "Iraq", "Baghdad", 5, 0, "Iraqi policemen are shot to death by al-Qaeda operatives at a checkpoint."], ["2005.05.01", "Iraq", "Tal Afar", 25, 51, "A Kurdish funeral is the target of a suicidal religious fanatic, who kills at least twenty-five others and injures about fifty mourners."], ["2005.05.01", "Israel", "Tzieda", 1, 1, "Islamic Jihad kills a 21-year-old Israeli soldier."], ["2005.05.02", "Afghanistan", "Shah Wali Kot", 2, 4, "Taliban fundamentalists kill two police officers with a terrorist bomb."], ["2005.05.02", "India", "Harni", 1, 4, "The Mujahideen attack a security patrol, killing one personnel."], ["2005.05.02", "Iraq", "Mosul", 23, 50, "Twenty-three Iraqis, including children are killed in eight car bombings by Muslim extremists.  More than fifty are badly injured."], ["2005.05.02", "Thailand", "Narathiwat", 1, 1, "Islamic radicals fire on a man and his wife as they are returning from working in an orchard."], ["2005.05.02", "Thailand", "Yala", 1, 0, "Militant Muslims murder a civilian working in his field."], ["2005.05.03", "India", "Pattan", 5, 0, "A political figure is assassinated by the Mujahideen, along with three civilians and a police officer."], ["2005.05.03", "India", "Pulwama", 0, 14, "Fourteen people are injured when an Islamic terrorist lobs a grenade into the road near a bus stop."], ["2005.05.03", "Thailand", "Pattani", 1, 0, "A postal worker is murdered by Islamists."], ["2005.05.04", "Iraq", "Erbil", 60, 150, "A Fedayeen suicide bomber walks into a crowd of Iraqi civilians standing in line to apply for jobs with the police and detonates his explosives, killing sixty and injuring about three times that number."], ["2005.05.04", "Thailand", "Narathiwat", 1, 1, "Muslims disguised as Islamic preachers kill a Muslim married to a Buddhist woman."], ["2005.05.05", "Afghanistan", "Shah Wali Kot", 9, 3, "Taliban fundamentalists ambush a military patrol with a landmine and automatic weapons, killing nine Afghans."], ["2005.05.05", "India", "Udhampur", 3, 22, "Mujahideen militants lob a grenade then open fire on a Hindu wedding party, killing two teenage girls (ages 15 and 17) and injuring twenty-two others."], ["2005.05.05", "Iraq", "Baghdad", 22, 43, "Three separate attacks, including another suicide bomber at a recruitment station, leave twenty-two Iraqis dead and at least that many injured."], ["2005.05.06", "Afghanistan", "Andar", 2, 0, "Two civilians are killed in their car by Sunni extremists."], ["2005.05.06", "Afghanistan", "Charcheno", 1, 0, "A civilian is kidnapped and murdered by the Taliban."], ["2005.05.06", "Iraq", "Baghdad", 14, 0, "Assyrian Christians are thought to be among the fourteen, bound corpses of torture victims found in a city garbage dump."], ["2005.05.06", "Iraq", "Suwayrah", 16, 36, "Sixteen Iraqis shopping at a marketplace are murdered by a Fedayeen, who wades into the crowd before detonating explosives strapped to his body.  At least thirty-six are injured."], ["2005.05.06", "Iraq", "Tikrit", 7, 8, "A suicidal religious extremist blows his car up next to a minivan taking Iraqi police to work, killing seven and injuring eight."], ["2005.05.06", "Thailand", "Pattani", 2, 0, "Two people, including a health care worker, are murdered by Islamists in separate attacks."], ["2005.05.07", "Iraq", "Baghdad", 22, 36, "Suicidal Sunnis target a civilian convoy at a busy intersection.  Twenty-two are killed in the blast and dozens lay injured in the circle of mutilated bodies."], ["2005.05.07", "Lebanon", "Jounieh", 2, 28, "Two people are killed by a bomb set in a commercial district of a Christian town."], ["2005.05.07", "Thailand", "Yala", 1, 0, "Radical Muslims kill a man as he is leaving his school."], ["2005.05.07", "Yemen", "Sanaa", 0, 5, "Five solider are injured when Yemeni fundamentalists throw a grenade at them from a passing car."], ["2005.05.08", "Afghanistan", "Kabul", 2, 6, "A suicide bomber in a cafe kills two civilians and injures six in a horrific blast."], ["2005.05.08", "India", "Kuligam-Lalpora", 1, 2, "A 12-year-old girl is killed by a bomb that also injures her father and sister."], ["2005.05.09", "India", "Chakka", 3, 0, "The Mujahideen open fire on civilians exiting a mosque, killing three and injuring an unknown number."], ["2005.05.09", "Iraq", "Baghdad", 4, 8, "A grisly scene as a suicidal Sunni rams his car into two police vehicles, burning the occupants to death."], ["2005.05.09", "Thailand", "Narathiwat", 1, 0, "A health care worker is murdered by Islamists."], ["2005.05.10", "Algeria", "Boghni", 1, 1, "Fundamentalists open fire on policemen manning a checkpoint, killing one."], ["2005.05.10", "Dagestan", "Makhachkala", 2, 4, "Two people are killed when Muslim extremists bomb a police station."], ["2005.05.10", "Iraq", "Baghdad", 7, 16, "Seven civilians are blasted and burned to death by Fedayeen suicide car bomber on a busy street."], ["2005.05.10", "Thailand", "Pattani", 2, 0, "A teacher and medical worker are shot to death by Muslim terrorists in separate attacks."], ["2005.05.10", "Thailand", "Yala", 1, 0, "A postal worker is murdered by Islamists."], ["2005.05.11", "Afghanistan", "Shindand", 3, 2, "Three police officers are killed in a bombing by Sunni extremists."], ["2005.05.11", "India", "Srinagar", 1, 40, "The Al-Nasreen terrorist group claims responsibility for a powerful car bombing at a busy intersection."], ["2005.05.11", "Iraq", "Baghdad", 4, 14, "Three separate Jihad attacks leave four dead and fourteen injured."], ["2005.05.11", "Iraq", "Hawija", 30, 37, "A Fedayeen straps explosives to his chest then wades into a group of unemployed civilians waiting to apply for government jobs.  At least thirty are blown to bits, with another forty suffering injuries."], ["2005.05.11", "Iraq", "Tikrit", 27, 75, "A suicide car bomber swerves his vehicle into a crowd of people on a sidewalk.  At least Twenty-seven are killed in the explosion."], ["2005.05.11", "Thailand", "Pattani", 1, 0, "Radical Muslims gun down a cop in front of his home."], ["2005.05.12", "India", "Srinagar", 2, 46, "The Mujahideen target a school with grenades, killing two women and injuring about fifty others, including eleven children."], ["2005.05.12", "Iraq", "Baghdad", 17, 65, "Jihad terrorists detonate a car bomb outside a market and a cinema, killing seventeen people and injuring nearly seventy, some with severe burns and internal injuries."], ["2005.05.12", "Thailand", "Narathiwat", 1, 0, "A civilian is shot and killed by Islamic terrorists."], ["2005.05.13", "Chechnya", "Ishkhoi-Yurt", 2, 3, "Islamists kill two policemen in an ambush.  Three others are injured."], ["2005.05.13", "India", "Sangdan", 1, 0, "A government teacher is dragged out of a high school class and shot to death on the sidewalk by the Mujahideen."], ["2005.05.13", "Iraq", "Baiji", 5, 0, "Car bomb kills five Iraqis."], ["2005.05.13", "Iraq", "Baqubah", 3, 6, "Fedayeen suicide bomber plows into a troop transport, killing two Iraqi soldiers and one civilian."], ["2005.05.14", "India", "Kalakote", 4, 1, "The Mujahideen murder a father and his three sons as they are returning from their work in a coal mine."], ["2005.05.14", "India", "Srinagar", 1, 0, "A businessman is gunned down by Muslim militants."], ["2005.05.14", "Iraq", "Baghdad", 4, 10, "Civilians are victimized by another suicidal car bomber looking for a ticket to paradise."], ["2005.05.14", "Iraq", "Jurf al-Sakhar", 3, 0, "Three beheaded corpses are found with signs of torture."], ["2005.05.15", "Algeria", "Khenchela", 11, 0, "All eleven members of a water supply convoy are blown up or machine-gunned by the Salafist Group for Preaching and Combat."], ["2005.05.15", "Iraq", "Baqubah", 5, 20, "Two suicide bombers, one in a car the other following on foot, attempt an assassination.  Five innocents are blown apart - another twenty badly injured."], ["2005.05.15", "Iraq", "Iskandariya", 34, 0, "The bodies of thirty-four people, some in handcuffs, are found dumped in three locations.  Jihadis tortured and beheaded many of them."], ["2005.05.15", "Iraq", "Latifiya", 6, 0, "Three Kuwaiti TV journalists, two Iraqi assistants and their driver are forced off the road by Jihadis then forced to kneel as their throats are cut."], ["2005.05.15", "Thailand", "Narathiwat", 1, 5, "After burning down in elementary school in Yala, Muslim extremists bomb a government vehicle, killing one Thai and injuring five others."], ["2005.05.16", "Indonesia", "Maluku", 6, 0, "Five policemen and a civilian are killed by Islamic militants in Indonesia, as they were sleeping.  The militants accused them of protecting a Christian village."], ["2005.05.16", "Iraq", "Aalgaya", 2, 2, "Muslim gunmen shoot a policeman and his wife to death in their car.  The attack also left their two young children badly injured."], ["2005.05.16", "Iraq", "Baghdad", 3, 0, "Three blindfolded and bound bodies are found.  Some were shot multiple times."], ["2005.05.16", "Thailand", "Narathiwat", 1, 0, "A civilian is shot off his motorcycle by Islamic gunmen."], ["2005.05.17", "Algeria", "Lakhdaria", 3, 5, "Members of an al-Qaeda linked group ambush an Algerian patrol, killing three and wounding five."], ["2005.05.17", "India", "Lohardaga", 4, 3, "Seven family members, including women are asleep in their home when militant Muslims barge in and slit the throats of four of them while beating the rest."], ["2005.05.17", "India", "Srinagar", 2, 17, "The Mujahideen attacks a funeral of a man they murdered, killing two additional mourners and injuring seventeen."], ["2005.05.17", "Iraq", "Dujail", 6, 0, "Six Iraqi truck drivers are pulled from their cabs and killed by radical Sunnis."], ["2005.05.18", "Afghanistan", "Helmand", 5, 0, "A gruesome scene as an attack on a humanitarian project leaves five people dead."], ["2005.05.18", "Afghanistan", "Kabul", 1, 0, "Religious fundamentalists kill a 24-year-old woman in her home.  She had been a pop music personality."], ["2005.05.18", "Chechnya", "Staryye Atagi", 1, 0, "A cop is gunned down by Jihadis."], ["2005.05.18", "Thailand", "Narathiwat", 1, 0, "Muslim separatists kill a defense volunteer."], ["2005.05.19", "Afghanistan", "Zabul", 6, 0, "Taliban gunmen ambush and kill six humanitarian aid workers transporting the bodies from those killed in an attack the day before."], ["2005.05.19", "Iraq", "Baghdad", 1, 8, "Suicide bomber kills an Iraqi soldier at a checkpoint.  Eight others are injured."], ["2005.05.19", "Iraq", "Mosul", 7, 3, "Fedayeen gunmen attack the house of a Sunni politician, killing seven people inside the home."], ["2005.05.19", "Iraq", "Samarrah", 2, 0, "In a brutal attack, Sunni gunmen kill a policeman and his elderly father as they are riding in a car."], ["2005.05.20", "Dagestan", "Makhachkala", 2, 2, "Gema’at Sharia assassinate a government official with a powerful bomb that also kills his driver and injures two children playing nearby."], ["2005.05.20", "India", "Mogla", 4, 0, "The Mujahideen ambush a security patrol from behind bushes, killing four Indian soldiers."], ["2005.05.20", "Iraq", "Baghdad", 2, 3, "Two civilians are killed by a suicide bomber.  Three others are injured."], ["2005.05.22", "Iraq", "Baghdad", 2, 3, "Sunni radicals spray a car with automatic weapons fire, killing a top official and his driver."], ["2005.05.22", "Thailand", "Pattani", 2, 0, "Two municipal workers are murdered by Islamists."], ["2005.05.23", "India", "Kashmir", 3, 3, "In a series of overnight attacks, the Mujahideen hang a woman and shoot two other innocents to death."], ["2005.05.23", "Iraq", "Baghdad", 10, 82, "Muslim extremists detonate a car bomb outside a Shiite restaurant, killing seven and injuring more then eighty.  Many have serious injuries."], ["2005.05.23", "Iraq", "Mahmoudiya", 7, 22, "A suicidal Sunni tries to drive his explosives-packed car into a mosque.  Seven are killed and more than thirty hurt.  Five killed are family members."], ["2005.05.23", "Iraq", "Tal Afar", 35, 25, "Two suicidal religious extremists murder more than thirty people outside the house of a community leader with twin bombings."], ["2005.05.24", "Iraq", "Baghdad", 6, 8, "Car bombing outside a girl's school kills six and injures eight."], ["2005.05.25", "Chechnya", "Nizhny Gerzel", 1, 0, "A cop is gunned down by Jihadis."], ["2005.05.25", "Pakistan", "Makin", 6, 0, "A woman, her two sons and three daughters, are killed by a bomb planted in their home."], ["2005.05.25", "Thailand", "Pattani", 1, 2, "Muslim terrorists fire on a group of firefighters and police officers, killing one person."], ["2005.05.26", "Iraq", "Baghdad", 3, 6, "Suicidal extremist kills three Iraqis and injures six with bombs hidden in a taxi."], ["2005.05.26", "Iraq", "Baghdad", 5, 0, "Jihadis attack and kill a university professor, along with three of his bodyguards.  They also knife a Shiite to death elsewhere."], ["2005.05.26", "Philippines", "Zamboanga", 3, 13, "Three civilians are killed when suspected Muslim terrorists throw two hand grenades into a village."], ["2005.05.27", "Algeria", "Ain Defla", 1, 0, "Salafist Group for Preaching and Combat kill a security patrol member with a bomb."], ["2005.05.27", "Iraq", "Tikrit", 2, 24, "Two civilians are killed and at least two dozen others injured, some badly, in a terrorist bombing."], ["2005.05.27", "Nigeria", "Sokoto", 1, 14, "Nigerian Sunnis attack a Shia political office, killing one and injuring fourteen."], ["2005.05.27", "Pakistan", "Islamabad", 19, 41, "A suicide bomber blows himself up amid a crowd of mostly Shia worshippers at a Pakistani shrine.  At least nineteen are killed and dozens injured."], ["2005.05.27", "Philippines", "Sulu", 2, 3, "Abu Sayyaf militants trigger a landmine against a vehicle on a water run, killing two soldiers and inuring three others."], ["2005.05.27", "Thailand", "Pattani", 1, 0, "Muslims gun down a man in front of his wife and children."], ["2005.05.27", "Thailand", "Yala", 2, 0, "Thai Muslims kill two men in separate attacks."], ["2005.05.28", "Algeria", "Batna", 1, 0, "Islamic fundamentalists murder a shepherd, then burn his body."], ["2005.05.28", "Indonesia", "Sulawesi", 24, 54, "A priest and an infant are among the nearly two dozen Christians killed when Islamic militants detonate two bombs in the center of a village.  At least sixty others are injured."], ["2005.05.28", "Iraq", "Baghdad", 1, 0, "Islamists stab a 44-year-old Japanese hostage to death on videotape."], ["2005.05.28", "Iraq", "Sinjar", 5, 45, "Two religious extremists kill five other people and injure at least forty more in coordinated suicide bombings."], ["2005.05.29", "Afghanistan", "Kandahar", 1, 0, "The Taliban stage a bold assassination on an opposition cleric, as he is leaving his office."], ["2005.05.29", "India", "Anantnag", 0, 44, "Forty-four people are injured in twins blasts set by Hizb-ul-Mujahideen.  One went off near a post office."], ["2005.05.29", "Iraq", "Mosul", 8, 0, "Eight civilians, including children, are blown to bits by Islamic terrorists."], ["2005.05.29", "Iraq", "Tuz", 2, 9, "Jihadis kill two civilians with a car bomb outside a school.  Nine others are injured."], ["2005.05.29", "Iraq", "al-Madyen", 2, 8, "A suicide car bomber kills two Iraqis and injures eight on his way to Paradise."], ["2005.05.29", "Pakistan", "Kani Wam", 3, 2, "al-Qaeda suspected in ambush on Pakistani official's car that leaves three dead."], ["2005.05.30", "Afghanistan", "Arghandab", 4, 7, "Four officers are killed in an assault on their station by religious extremists."], ["2005.05.30", "Iraq", "Baghdad", 27, 118, "Two Fedayeen suicide bombers kill twenty-seven Iraqis.  The first waded into a crowd before detonating.  The second ran after the survivors, killing many of them as well."], ["2005.05.30", "Thailand", "Pattani", 1, 0, "A Buddhist teacher is murdered by Islamic radicals."], ["2005.05.31", "Algeria", "Boumerdes", 2, 5, "The Salafist Group for Preaching and Combat ambushes a security patrol, killing two and injuring five."], ["2005.05.31", "Chechnya", "Grozny", 1, 0, "A civilian is blown apart in his car by a Jihad landmine."], ["2005.05.31", "Pakistan", "Karachi", 5, 26, "A suicide bombing attack at a Shia mosque kills five people and injures twenty-six."], ["2005.05.31", "Pakistan", "Karachi", 6, 0, "A mob of angry Shias take out their frustration at Sunnis on Kentucky Fried Chicken employees, killing six, including four who were burned alive."], ["2005.05.31", "Thailand", "Narathiwat", 1, 0, "A trader is murdered by Islamists."], ["2005.05.31", "Thailand", "Yala", 1, 0, "A man is killed in his motorcycle shop by Muslim radicals."], ["2005.06.01", "Afghanistan", "Kandahar", 21, 42, "An al-Qaeda member wades into a crowd of mourners at a funeral for a murdered anti-Taliban cleric, killing about two dozen people and hurting dozens more."], ["2005.06.01", "Afghanistan", "Lashkargah", 2, 5, "The Taliban kill two mine-detection crewmen in a remote-controlled blast."], ["2005.06.01", "Thailand", "Narathiwat", 1, 0, "A government official is murdered by Islamists."], ["2005.06.01", "Thailand", "Yala", 1, 0, "A man is murdered by Muslims while inspecting a school."], ["2005.06.02", "India", "Harwan", 4, 1, "The Mujahideen abduct and later behead four members of two families."], ["2005.06.02", "Iraq", "Baghdad", 9, 0, "Muslim militants fire into a crowded market from three passing cars, murdering at least nine civilians."], ["2005.06.02", "Iraq", "Baqubah", 4, 4, "Four Iraqis killed in a blast by a suicidal Sunni."], ["2005.06.02", "Iraq", "Kirkuk", 4, 11, "A convoy of civilian contractors is targeted by a Fedayeen suicide bomber who paves his way to Paradise with at least four dead bodies."], ["2005.06.02", "Iraq", "Mosul", 5, 0, "Thinking that they were a Christian family, Jihad gunmen spray the inside of a car with weapons fire, killing two parents and their three young children."], ["2005.06.02", "Iraq", "Mosul", 5, 13, "Jihadis detonate bombs on two motorcycles parked outside a cafe, killing five Iraqis."], ["2005.06.02", "Iraq", "Tuz Khormato", 12, 40, "Suicidal religious extremist plows his car into a restaurant and detonates a blast that leaves at least twelve people dead, including children, and forty others maimed."], ["2005.06.02", "Lebanon", "Beirut", 1, 1, "Car bombing in a Christian area of the city takes the life of a journalist who opposed Syrian hegemony."], ["2005.06.03", "Afghanistan", "Kandahar", 5, 5, "Five separate attacks by the Taliban, leave five people dead and at least five others injured."], ["2005.06.03", "Afghanistan", "Tirin Kot", 1, 1, "The Taliban invade the home of a civic educator, beat up his elderly father, then execute him."], ["2005.06.03", "Iraq", "Balad", 10, 12, "Ten Iraqis are slaughtered by a suicidal religious fanatic in a car bombing.  Twelve more are injured."], ["2005.06.03", "Thailand", "Pattani", 1, 0, "A teacher is murdered by Islamic radicals."], ["2005.06.04", "Algeria", "Aomar", 1, 0, "Islamic fundamentalists assassinate a deputy mayor."], ["2005.06.04", "Mauritania", "Limgheiti", 15, 19, "al-Qaeda militants attack and kill fifteen Mauritanian soldiers in a remote area.  Nineteen others are injured."], ["2005.06.05", "India", "Bandipore", 2, 0, "The Mujahideen abduct and kill two civilians."], ["2005.06.05", "Iraq", "Shorgat", 1, 3, "An Iraqi soldier is killed by a suicide bomber on a motorcycle."], ["2005.06.05", "Thailand", "Narathiwat", 2, 0, "A man and his brother are shot to death in their shop by Muslim terrorists."], ["2005.06.05", "Thailand", "Pattani", 1, 0, "A man is murdered by Muslim radicals while leaving his tea shop."], ["2005.06.06", "Thailand", "Narathiwat", 1, 0, "A 59-year-old Buddhist plantation worker is captured and beheaded by militant Muslims."], ["2005.06.07", "Afghanistan", "Gilan", 1, 0, "A teacher is murdered by fundamentalists."], ["2005.06.07", "Afghanistan", "Spin Boldak", 2, 0, "Two Pakistani truck drivers are murdered by the Taliban."], ["2005.06.07", "Algeria", "M'sila", 13, 6, "Militants fighting for an Islamic state kill thirteen soldiers in a bombing attack on their truck."], ["2005.06.07", "India", "Bahk-e-Hakar", 1, 0, "A civilian is abducted from his home and beheaded by the Mujahideen."], ["2005.06.07", "Iraq", "Habaniyah", 7, 0, "The 'Army of Ansar al-Sunna' ambushes a civilian truck convoy and slaughters seven drivers."], ["2005.06.07", "Iraq", "Hawija", 18, 38, "Militant Sunnis kill eighteen Iraqi civilians in a series of four suicide bombings and other attacks."], ["2005.06.07", "Israel", "Ganei Tal", 3, 0, "Islamic Jihad bomb an Israeli greenhouse, killing three, including a Chinese worker."], ["2005.06.09", "Chechnya", "Tver", 7, 1, "Seven Chechen police officers are killed when Mujahideen rebels fire a grenade launcher at their car."], ["2005.06.09", "Iraq", "Kirkuk", 2, 0, "Two Iraqis are killed in a Jihad attack on their vehicle."], ["2005.06.09", "Iraq", "Qaim", 17, 0, "The bodies of seventeen Iraqi Shiites are discovered bound and executed.  Some were beheaded."], ["2005.06.09", "Syria", "Damascus", 1, 1, "Two Syrian security force personnel are shot by religious extremists as they are attempting an arrest."], ["2005.06.09", "Thailand", "Yala", 1, 0, "A Buddhist teenager is shot in the head by Muslim separatists."], ["2005.06.10", "Iraq", "Basra", 2, 0, "A policeman and his brother are shot to death by Jihadis while riding in their car."], ["2005.06.10", "Thailand", "Narathiwat", 2, 0, "Two separate shooting attacks by Muslim militants leave two, including a Buddhist, dead."], ["2005.06.11", "Iraq", "Baghdad", 10, 0, "Ten people are slaughtered by a Sunni bomb in a Shia neighborhood, including a pregnant woman and her husband."], ["2005.06.11", "Iraq", "Diyara", 11, 2, "Jihad gunmen open fire on a bus carrying construction laborers, killing eleven in the brutal attack and injuring two."], ["2005.06.11", "Iraq", "Najaf", 2, 3, "A bomb planted in a Shia cemetery kills two people, including an 8-year-old girl, and injures three others, all from the same family."], ["2005.06.11", "Thailand", "Narathiwat", 1, 0, "Muslims murder a 49-year-old Buddhist construction worker on his way to work."], ["2005.06.12", "Afghanistan", "Kandahar", 1, 4, "The Taliban kill a woman with a landmine.  The blast injures her two children and two other women."], ["2005.06.12", "Iran", "Ahvaz", 8, 74, "Four women are among eight dead in a series of bomb blasts."], ["2005.06.12", "Iraq", "Baghdad", 3, 4, "Three people are killed, and at least four injured in two separate suicide blasts."], ["2005.06.12", "Russia", "Uzunova", 0, 15, "Fifteen people are injured when a bomb believed to be planted by Chechen terrorists derails a commuter train"], ["2005.06.13", "Algeria", "Khadirat El Nukta", 4, 6, "Armed fundamentalists stage a shooting attack on a group of people, killing at least four."], ["2005.06.13", "India", "Pulwama", 13, 100, "At least thirteen people are slaughtered, and over one hundred injured when the Mujahideen set off a truck bomb near a school.  Many schoolchildren are among the casualties."], ["2005.06.13", "Thailand", "Narathiwat", 1, 3, "Islamic radicals plant a bomb in a garbage truck, killing one of the workers and injuring several more."], ["2005.06.13", "Thailand", "Pattani", 1, 1, "Two Buddhist twin brothers are shot by Islamic terrorists as they are riding home from school.  One dies."], ["2005.06.14", "Afghanistan", "Khost", 7, 0, "Taliban extremists walk into a medical clinic and gun down a doctor and seven hospital workers in cold blood."], ["2005.06.14", "Iraq", "Baqubah", 6, 4, "Suicide bomber kills six Iraqis, including two children and injures four others."], ["2005.06.14", "Iraq", "Kirkuk", 19, 89, "A Fedayeen suicide bomber wades into a crowd of people shopping in a market and kills nineteen, including children, and injures about ninety others in an egregious and senseless attack."], ["2005.06.15", "Afghanistan", "Kandahar", 1, 0, "A man is cut to pieces by Taliban bullets."], ["2005.06.15", "India", "Chaklas", 2, 0, "The Mujahideen assassinate a veterinarian and also set fire to another civilian's house, killing his 8-month-old daughter in the flames."], ["2005.06.15", "Iraq", "Baghdad", 4, 29, "A suicide bomber detonates near a market, murdering four Iraqis and injuring twenty-nine others."], ["2005.06.15", "Iraq", "Khalis", 23, 28, "A particularly heinous suicide bombing attack on Iraqi soldiers eating lunch at their base leaves twenty-three dead and about thirty injured."], ["2005.06.15", "Thailand", "Pattani", 4, 0, "Four people are murdered in three shooting attacks by Islamic radicals."], ["2005.06.16", "India", "Awantipora", 0, 15, "Fifteen people, including a child and two women are injured by the splinters of a grenade thrown by the Mujahideen on a road."], ["2005.06.16", "Iraq", "Mosul", 2, 0, "Ansar al-Sunna terrorists shoot an Iraqi judge to death, along with his driver."], ["2005.06.16", "Thailand", "Narathiwat", 2, 3, "Three separate attacks in the same Thai province by militant Muslims leave two dead and three injured."], ["2005.06.17", "Egypt", "Sinai", 1, 3, "Islamic extremists gun down a cop."], ["2005.06.17", "Iraq", "Fallujah", 14, 8, "Fourteen Iraqis die when a suicide bomber detonates an explosives laden car on a street corner."], ["2005.06.17", "Russia", "Astrakhan", 2, 1, "Islamic gunmen are thought responsible for an attack on a hospital, in which two patients were shot to death in their beds."], ["2005.06.17", "Thailand", "Narathiwat", 1, 0, "A policeman is murdered by Islamists."], ["2005.06.17", "Thailand", "Pattani", 2, 0, "A Laotian man and wife are beheaded on the chicken farm where they work."], ["2005.06.17", "Thailand", "Yala", 1, 0, "A school guard is beaten to death by radical Muslims."], ["2005.06.18", "Iraq", "Baghdad", 3, 0, "A 10-year-old girl is killed by a bomb and two bodies are found, brutally executed."], ["2005.06.18", "Saudi Arabia", "Makkah", 1, 0, "Senior Saudi official is gunned down by Islamists outside his home."], ["2005.06.19", "Afghanistan", "Nad Ali", 3, 0, "The Taliban machine-gun a car with three people, including a judge."], ["2005.06.19", "India", "Dachan", 1, 1, "The Mujahideen fire into a civilian's home, killing his 14-year-old daughter and injuring his wife."], ["2005.06.19", "Iran", "Mashad", 2, 0, "Two gay teenagers are hanged."], ["2005.06.19", "Iraq", "Baghdad", 23, 36, "A suicidal religious extremist walks into a restaurant and blows up twenty-three innocent people.  Another thirty-six patrons are injured."], ["2005.06.19", "Iraq", "Iskandariya", 3, 7, "Sunni terrorists open fire on shoppers at a marketplace, killing three and injuring seven."], ["2005.06.19", "Iraq", "Tikrit", 3, 9, "Fedayeen suicide bomber kills three Iraqis."], ["2005.06.19", "Israel", "Gaza", 1, 2, "The Palestinian terrorist group, Abu Rish Brigade, takes credit for an ambush on a civilian labor group that leaves an Israeli guard dead."], ["2005.06.20", "India", "Watalar", 1, 0, "Two Harkat-ul-Mujahideen terrorists assassinate a local political figure."], ["2005.06.20", "Iraq", "Ebril", 19, 118, "Three car bombs, at least one by a suicidal \"holy warrior,\" kill eighteen people, mostly Kurds, and injure over one-hundred."], ["2005.06.20", "Israel", "Baqa al-Sharqiya", 1, 1, "Palestinian snipers kill an Israeli civilian traveling in his car.  His 13-year-old son is shot as well."], ["2005.06.20", "Thailand", "Pattani", 3, 0, "Islamic militants invade a home and shoot three young volunteer teachers to death."], ["2005.06.21", "Afghanistan", "Kandahar", 1, 0, "A civilian is killed in an ambush by Taliban gunmen."], ["2005.06.21", "Afghanistan", "Maiwand", 1, 1, "Taliban terrorists kill the husband of an election worker."], ["2005.06.21", "Lebanon", "Beirut", 1, 1, "An anti-Syria political leader is assassinated by a car bomb in Lebanon."], ["2005.06.22", "Algeria", "Skikda", 1, 2, "A civilian is killed when Islamists put a bomb under his vehicle."], ["2005.06.22", "India", "Bijbehara", 0, 17, "About seventeen people, including two teenage boys are injured when the Mujahideen toss a grenade onto a road."], ["2005.06.22", "India", "Nadihal", 2, 0, "The Mujahideen abduct and kill two civilians by slashing their throats."], ["2005.06.22", "Iraq", "Baghdad", 18, 46, "Eighteen Shiite civilians are slaughtered in three separate bombing attacks by radical Sunnis.  About fifty are injured."], ["2005.06.22", "Thailand", "Narathiwat", 0, 7, "A bomb set off by Muslim extremists injures seven, including two monks and three elderly people."], ["2005.06.22", "Thailand", "Narathiwat", 1, 0, "Muslim extremists behead a 34-year-old cloth vendor.  The head is found 2km away."], ["2005.06.23", "Algeria", "Azzefoun", 1, 5, "The Salafist Group for Preaching and Combat bombs a police convoy, killing one officer."], ["2005.06.23", "Iraq", "Baghdad", 17, 60, "Four more car bombs aimed at Shia civilians kill fifteen and injure over fifty in residential neighborhoods."], ["2005.06.23", "Iraq", "Fallujah", 4, 13, "A senseless attack on a U.S. Marine mail convoy kills four, including three women."], ["2005.06.23", "Pakistan", "Karachi", 2, 1, "Two Sunni clerics are assassinated in an attack that leaves a boy injured."], ["2005.06.23", "Pakistan", "South Waziristan", 4, 0, "Probable al-Qaeda ambush on a delivery truck leaves four people dead."], ["2005.06.24", "Afghanistan", "Chora", 3, 0, "The Taliban murder an election candidate and two of his bodyguards."], ["2005.06.24", "Chechnya", "Shali-Makhety", 1, 0, "A man is killed by a Muslim sniper."], ["2005.06.24", "India", "Srinagar", 9, 25, "Nine people are killed when Islamic militants detonate a powerful car bomb at a popular tourist attraction."], ["2005.06.24", "Iraq", "Ramadi", 13, 10, "Eight policemen are captured at a checkpoint by Jihadis, then executed.  Two separate attacks elsewhere leave five others dead."], ["2005.06.24", "Thailand", "Narathiwat", 1, 0, "A female school principal is murdered by Islamic gunmen."], ["2005.06.24", "Thailand", "Yala", 2, 0, "A man and his wife stop to remove a tree branch from the road, when they are attacked by militant Muslims, who then cut off their heads."], ["2005.06.25", "India", "Behibagh", 1, 0, "A female schoolteacher is killed by the Mujahideen."], ["2005.06.25", "Iraq", "Baghdad", 5, 7, "Sunni insurgents mortar bomb a crowded Shia cafe, killing five civilians and injuring seven."], ["2005.06.25", "Iraq", "Mosul", 5, 2, "Suicide bomber blows himself to Allah, taking five innocents with him."], ["2005.06.25", "Iraq", "Samarrah", 9, 16, "Suicide bomber slams into a residential neighborhood, killing nine civilians and injuring sixteen."], ["2005.06.25", "Israel", "Beit Hagai", 2, 3, "A brutal shooting attack a point-blank range on a group of Israeli teenagers, hitchhiking on a roadside, leaves a 17-year-old and a 16-year-old dead.  Three others were injured.  al-Aqsa Martyrs Brigade take credit for the murder."], ["2005.06.25", "Thailand", "Yala", 2, 0, "Two civilians, including a rubber worker, are murdered by Muslims in separate attacks."], ["2005.06.26", "India", "Dachabpore", 1, 0, "The Mujahideen abduct a civilian from his home, take him to an orchard and kill him in brutal fashion."], ["2005.06.26", "Iraq", "Mosul", 36, 19, "Four bombings by suicidal Fedayeen in disguised vehicles leave three dozen people dead and dozens more injured."], ["2005.06.27", "India", "Kupwara", 1, 0, "The Mujahideen abduct a woman from her home, torture then murder her."], ["2005.06.27", "Ingushetia", "Karabulak", 1, 0, "Sunni extremists murder an engineer."], ["2005.06.27", "Iraq", "Baghdad", 3, 0, "Islamic fundamentalists attack a barbershop, killing two, including a 9-year-old boy, then blow up the building."], ["2005.06.28", "India", "Bhaderwah", 4, 0, "Four security personnel are killed by Muslim militants in a shootout."], ["2005.06.28", "Iraq", "Baghdad", 4, 24, "Four civilians are killed, and dozens injured when fundamentalists detonate a car bomb outside a theater."], ["2005.06.28", "Iraq", "Baghdad", 5, 0, "An 87-year-old Iraqi politician and four others, including his son, are killed by a Fedayeen suicide bomber."], ["2005.06.28", "Iraq", "Kirkuk", 3, 0, "Sunni terrorists kill three oil company workers with a roadside bomb."], ["2005.06.28", "Iraq", "Musayyib", 3, 13, "A suicide bomber enters a hospital then detonates his explosives, killing three other people."], ["2005.06.28", "Iraq", "Tal Afar", 4, 21, "Four people, including a child, lose their lives in a Jihad mortar attack."], ["2005.06.28", "Thailand", "Narathiwat", 1, 0, "A chicken vendor is murdered by Islamists."], ["2005.06.28", "Thailand", "Pattani", 2, 0, "A janitor and a poultry trader are murdered in separate attacks by Islamic militants on motorcycles."], ["2005.06.28", "Thailand", "Yala", 1, 0, "Islamic militants shoot a government worker to death as he is walking along the side of the road."], ["2005.06.29", "India", "Srinagar", 0, 14, "Fourteen people are injured when the Mujahideen toss a grenade into a city street."], ["2005.06.29", "Israel", "Mount Dov", 1, 3, "Hezbollah attacks an Israeli position from across the Lebanese border, killing one and injuring three."], ["2005.06.29", "Thailand", "Narathiwat", 2, 0, "Two people are murdered in separate attacks by radical Muslims."], ["2005.06.29", "Thailand", "Pattani", 1, 0, "A city councilman is killed by Muslim assassins."], ["2005.06.30", "Afghanistan", "Tirin Kot", 9, 1, "Nine village elders are kidnapped and killed by the Taliban, along with a 10-year-old boy."], ["2005.06.30", "India", "Kallar Kattal", 1, 0, "A man is attacked in his home and beaten to death by militant Muslims."], ["2005.06.30", "India", "Mahakund", 4, 0, "The Mujahideen kill a 20-year-old girl on the night before her wedding, along with her mother and a neighbor.  A civilian is also abducted from his home and killed in the same district."], ["2005.06.30", "Iraq", "Baghdad", 7, 0, "Muslim gunmen burst into an optician's shop and kill seven people in cold blood - four from the same family."], ["2005.06.30", "Saudi Arabia", "Mecca", 1, 0, "A security specialist is murdered by al-Qaeda as he is leaving work."], ["2005.06.30", "Thailand", "Yala", 1, 0, "A civilian is murdered by Islamists as he is leaving a market."], ["2005.07.01", "India", "Kashmir", 3, 0, "Three civilians are abducted from their homes and executed by the Mujahideen, including a 65-year-old man."], ["2005.07.01", "Iraq", "Baghdad", 1, 0, "A Shiite cleric is gunned down in cold blood by Sunnis in a drive-by attack."], ["2005.07.02", "Afghanistan", "Paktika", 6, 2, "The Taliban attack a UN convoy with a roadside bomb, killing six Afghan security personnel."], ["2005.07.02", "Dagestan", "Makhachkala", 11, 23, "Russian troops and civilians are casualties in a radio-controlled bomb attack outside a bathhouse blamed on Islamic militants."], ["2005.07.02", "Iraq", "Baghdad", 16, 22, "A suicidal Muslim bomber kills sixteen other people outside a police station.  About two dozen others are injured in the blast."], ["2005.07.02", "Iraq", "Hilla", 6, 26, "Two Sunni suicide bombers kill at least six people and injured dozens more in a Shia neighborhood."], ["2005.07.02", "Iraq", "Mahmudiyah", 2, 0, "A bomb hidden in a vegetable cart targets a Shia funeral procession."], ["2005.07.02", "Thailand", "Pattani", 1, 0, "A farmer is gunned down my Islamic radicals."], ["2005.07.02", "Thailand", "Pattani", 1, 1, "Muslims fire on a policeman and his wife, killing the man."], ["2005.07.02", "Thailand", "Pattani", 2, 0, "Two Buddhist villagers are murdered by Muslim terrorists while drinking tea."], ["2005.07.03", "Afghanistan", "Kandahar", 1, 0, "Pro-democracy cleric is killed by a Taliban sniper his home."], ["2005.07.03", "Syria", "Damascus", 2, 0, "Two Syrian border patrol personnel are killed an Islamic extremist, near Lebanon."], ["2005.07.04", "Afghanistan", "Bande Sardeh", 1, 2, "A suicide bomber on a bicycle kills a Turkish engineer and injures two others."], ["2005.07.04", "Afghanistan", "Registan", 2, 0, "Two Afghan policemen are kidnapped and executed by the Taliban."], ["2005.07.04", "Dagestan", "Makhachkala", 2, 2, "Two policemen are killed by an insurgent bombing."], ["2005.07.04", "India", "Dadsara", 1, 0, "The Mujahideen abduct then shoot a civilian to death."], ["2005.07.04", "India", "Wagbal Karhama", 1, 0, "A youth is abducted and hanged by the Mujahideen."], ["2005.07.04", "Iraq", "Baghdad", 2, 1, "Sunni insurgents kill a painting contractor, and kidnap, torture and behead another man."], ["2005.07.04", "Iraq", "Baghdad", 2, 4, "A remote-controlled bomb kills two civilians, including a woman."], ["2005.07.04", "Iraq", "Fallujah", 3, 9, "Three civilians are blown to bits, and nine others badly injured by a Fedayeen suicide bombing on a busy road."], ["2005.07.04", "Thailand", "Yala", 1, 0, "A civilian is murdered by Muslim jihadists."], ["2005.07.05", "Dagestan", "Makhachkala", 2, 0, "A prominent politician is assassinated, along with his uncle, by suspected Islamists as they sit in their car at a light."], ["2005.07.05", "India", "Pulwama", 2, 1, "In two separate home invasions, the Mujahideen shoot two people to death and critically injure the wife of one."], ["2005.07.05", "Iraq", "Baghdad", 3, 0, "Islamic extremists shoot three barbers to death for shaving beards."], ["2005.07.05", "Thailand", "Pattani", 1, 0, "A 44-year-old security force member is abducted and beheaded by Islamists."], ["2005.07.06", "Algeria", "Skikda", 1, 13, "Islamic fundamentalists bomb a convoy, killing one Algerian solider and injuring thirteen others."], ["2005.07.06", "Algeria", "Tizi Ouzou", 4, 0, "Fundamentalists slit the throats of three Algerian soldiers and a civilian."], ["2005.07.06", "Dagestan", "Makhachkala", 1, 3, "Islamic militants open fire on a group of policemen, killing one."], ["2005.07.06", "India", "Budgam", 1, 0, "The Mujahideen kidnap a student from his classroom and subsequently shoot him to death."], ["2005.07.06", "Iraq", "Jbala", 13, 30, "Thirteen civilians are slaughtered in twin suicide bombings by Muslim extremists.  About thirty others are injured."], ["2005.07.06", "Thailand", "Narathiwat", 1, 0, "A newspaper deliveryman is murdered by Muslim radicals."], ["2005.07.06", "Thailand", "Narathiwat", 1, 0, "Muslims on motorcycles shoot a 52-year-old in the neck and hand as he is riding to market."], ["2005.07.06", "Thailand", "Pattani", 1, 0, "A teacher is murdered by Islamists."], ["2005.07.07", "Afghanistan", "Helmand", 10, 0, "Ten Afghan police officers are captured by the Taliban and senselessly beheaded."], ["2005.07.07", "Afghanistan", "Spin Boldak", 3, 0, "Religious extremists blow up a passing vehicle, killing three civilians."], ["2005.07.07", "England", "London", 52, 750, "Islamic terrorists massacre more than fifty commuters on three separate subway trains and a double-decker bus on the street with four suicide bombs.  Over seven-hundred people are injured."], ["2005.07.07", "Iraq", "Baghdad", 1, 0, "al-Qaeda Organization for Holy War pronounces \"Allah's judgment\" and kills a kidnapped Egyptian diplomat on video."], ["2005.07.07", "Iraq", "Mosul", 5, 52, "Five people at a market are killed when Sunni terrorists lob more than a dozen mortar rounds into the square."], ["2005.07.08", "Afghanistan", "Paktika", 2, 0, "A man and his wife are murdered inside their home by Sunni extremists."], ["2005.07.08", "India", "Rajouri", 4, 0, "Four Indian soldiers are ambushed and killed by Islamic militants."], ["2005.07.08", "Thailand", "Narathiwat", 1, 0, "Islamists fire on utility workers trimming trees, killing one."], ["2005.07.09", "Algeria", "Tezi Ozo", 4, 0, "A group of thirty Islamists set-up a fake roadblock, then slaughter four Algerians that are fooled into stopping."], ["2005.07.09", "Iraq", "Baghdad", 8, 0, "A family of eight Shia is gruesomely murdered by Sunni radicals as they sleep in their home."], ["2005.07.09", "Pakistan", "Karachi", 1, 0, "A Shia cleric is gunned down on a street by Pakistani Sunnis."], ["2005.07.10", "Afghanistan", "Darreh-ye Nur", 2, 0, "The Taliban murder two civilians in an incendiary attack on their vehicle."], ["2005.07.10", "Iraq", "Baghdad", 25, 47, "A al-Qaeda suicide bomber blows himself to Allah, taking twenty-five innocents with him.  Nearly fifty others are injured."], ["2005.07.10", "Iraq", "Kirkuk", 4, 15, "Suicidal Sunni kills four civilians on a highway, near a hospital.  Fifteen are injured in the blast."], ["2005.07.10", "Iraq", "Syrian Border", 7, 0, "Two Islamic suicide bombers kill seven customs agents."], ["2005.07.10", "Thailand", "Narathiwat", 1, 0, "A man is murdered in his grocery story by Islamic radicals."], ["2005.07.11", "Somalia", "Mogadishu", 1, 0, "al-Qaeda assassinates a Somali peace activist outside his home."], ["2005.07.11", "Thailand", "Yala", 2, 0, "Two village guards are killed in separate terror attacks."], ["2005.07.12", "Algeria", "Ahnif", 2, 0, "Two community guards are killed in separate attacks by Islamic fundamentalists (Jijel)."], ["2005.07.12", "Iraq", "Kirkuk", 3, 15, "Sunnis detonate a car bomb in an industrial district, killing three civilians and injuring fifteen more."], ["2005.07.12", "Israel", "Netanya", 5, 70, "The terror group, Islamic Jihad, takes credit for a suicide bombing, in which a bomber kills five Jews crossing the street in front of a mall.  All of the victims were female, two were teenage girls.  About seventy others were injured."], ["2005.07.12", "Lebanon", "Beyrouth", 1, 12, "Muslim terrorists target a Christian politician with a bomb, but kill a civilian instead."], ["2005.07.12", "Thailand", "Pattani", 4, 0, "Four civilians are murdered in separate attacks by Muslim radicals."], ["2005.07.13", "Afghanistan", "Safian", 1, 0, "A civilian is shot to death by Sunni extremists."], ["2005.07.13", "India", "Bigambri", 1, 0, "The Mujahideen abduct a civilian, then kill him in captivity."], ["2005.07.13", "Iraq", "Baghdad", 27, 25, "An Islamic suicide bomber deliberately plows his car into a group of children, slaughtering at least twenty-seven.  Children were amply represented among the injured."], ["2005.07.13", "Iraq", "Jalawlah", 2, 16, "A suicide bomber kills two others inside a Sunni mosque."], ["2005.07.13", "Pakistan", "Jhal Magsi", 3, 3, "Three children, including two brothers, are killed by a homemade bomb."], ["2005.07.14", "Israel", "Netiv Haasara", 1, 1, "Palestinian terrorists hit an Israeli residence with a missile, killing a woman."], ["2005.07.14", "Thailand", "Yala", 2, 21, "Islamic militants set off four bombs in restaurants and other business areas, killing at least two people."], ["2005.07.15", "Afghanistan", "Kandahar", 7, 0, "Seven cops are brutally slain in a surprise attack by religious extremists."], ["2005.07.15", "Iraq", "Baghdad", 27, 100, "Seven suicide bombers take at least twenty-seven innocents with them to Allah.  About one hundred others suffer injuries; many lose limbs."], ["2005.07.15", "Thailand", "Narathiwat", 1, 0, "A metal-shop owner is shot to death in a tea shop by Islamists."], ["2005.07.15", "Thailand", "Narathiwat", 2, 0, "Two female teachers are gunned down by Muslims on motorcycles as they are walking home."], ["2005.07.15", "Thailand", "Pattani", 2, 0, "Two civilians, including a taxi driver, are murdered by Islamic terrorists."], ["2005.07.16", "India", "Baramulla", 2, 0, "The Mujahideen shoot a man to death outside his home, and also stage a separate attack that kills a 6-year-old girl."], ["2005.07.16", "Iraq", "Basra", 3, 2, "Muslim terrorists kill three British soldiers with a roadside bomb."], ["2005.07.16", "Iraq", "Musayyib", 71, 160, "A religious extremist with explosives wrapped around his chest, detonates himself in a crowded city street, killing over seventy other people.  Nearly two-hundred others are injured in the horrific attack."], ["2005.07.16", "Thailand", "Narathiwat", 2, 0, "Muslim separatists attack a school, killing two security guards."], ["2005.07.17", "Iraq", "Baghdad", 22, 21, "Four Fedayeen kill twenty-two people in separate suicide bombings."], ["2005.07.18", "Afghanistan", "Kamdish", 1, 0, "Taliban extremists murder an electoral worker."], ["2005.07.18", "Afghanistan", "Uruzgan", 9, 0, "Nine villagers are slaughtered in a Taliban raid."], ["2005.07.18", "India", "Arwani", 1, 1, "The Mujahideen shoot a man to death outside his shop."], ["2005.07.18", "Iraq", "Baghdad", 7, 0, "Islamic insurgents murder six policemen and a government worker in six separate shooting attacks."], ["2005.07.18", "Pakistan", "Chilas Farm", 5, 15, "Five passengers aboard a bus are killed when the Mujahideen ambush it along a mountain road.  Fifteen others are injured."], ["2005.07.18", "Pakistan", "Karachi", 1, 1, "A Sunni cleric is attacked in his car by Shia on motorcycles, who manage to kill his son."], ["2005.07.18", "Pakistan", "Quetta", 1, 1, "A Shia schoolteacher is gunned down, and his wife critically injured."], ["2005.07.18", "Thailand", "Yala", 3, 1, "In three separate attacks, Muslims behead a farmer and shoot at least two other people to death, including a school principal."], ["2005.07.19", "Chechnya", "Znamenskoye", 14, 36, "Fourteen people, including civilians, are killed in a Jihad attack by Muslim separatists on a remote road."], ["2005.07.19", "Ethiopia", "Jigjiga", 1, 0, "Islamic militants stop a bus and force the Christians on it to repeat a Muslim creed and pray to Mecca.  The one who refuses to do so is shot to death."], ["2005.07.19", "India", "Chitabas", 6, 0, "The Hizbul Mujahideen enter a residence and slaughter six members of a family, in a heinous attack."], ["2005.07.19", "Iraq", "Baqubah", 13, 0, "Jihadis stage a shooting attack on a minivan carrying civilians, killing thirteen in all."], ["2005.07.20", "India", "Srinagar", 6, 17, "Hizbul Mujahideen suicide bomber targets a missionary children's school in the Indian capital, killing at least six and injuring more than a dozen."], ["2005.07.20", "Iraq", "Baghdad", 10, 21, "A suicidal Sunni murders ten people near an airport and causes egregious injuries to at least a dozen others."], ["2005.07.20", "Iraq", "Hilla", 4, 4, "Two Jihad car bombings kill four and injure four, including a young girl."], ["2005.07.20", "Pakistan", "Gilgit", 3, 0, "Three people are gunned down in sectarian attacks."], ["2005.07.21", "Afghanistan", "Helmand", 2, 0, "The Taliban ambush a vehicle carrying two people.  Both are killed in the explosion."], ["2005.07.21", "Afghanistan", "Kajran", 15, 0, "Fifteen innocents are attacked and killed by Taliban extremists in a three-day spree."], ["2005.07.21", "India", "Anantnag", 1, 2, "Militant Muslims fire on a bus stop, killing a civilian and injuring two others."], ["2005.07.21", "India", "Sopore", 2, 2, "Two civilians are killed when the Mujahideen attack a security camp."], ["2005.07.21", "Iraq", "Mahmudiyah", 5, 8, "A religious extremist kills himself and five innocents in a blast at a traffic checkpoint."], ["2005.07.21", "Thailand", "Narathiwat", 2, 0, "Two civilians are brutally murdered in separate attacks."], ["2005.07.22", "Iraq", "Baghdad", 12, 5, "Four Jihad attacks leave twelve Iraqis dead, including a senseless ambush on a wedding party that left the bride and her mother dead."], ["2005.07.22", "Pakistan", "South Waziristan", 4, 0, "al-Qaeda suspected in shooting deaths of a tribal leader, his two sons and brother."], ["2005.07.22", "Thailand", "Pattani", 2, 0, "Islamic terrorists kill two people in a shooting ambush."], ["2005.07.23", "Afghanistan", "Kandahar", 1, 0, "The Taliban assassinate a judge as he is walking to work."], ["2005.07.23", "Chechnya", "Shelkovskaya", 1, 0, "A forest director is killed in his home by Jihad gunmen."], ["2005.07.23", "Egypt", "Sharm el-Sheik", 88, 119, "More than eighty tourists and workers are killed when Islamic militants detonate three powerful car bombs outside a cafe and two hotels.  One suicide bomber drove into the lobby.  Over one-hundred people suffer injuries."], ["2005.07.23", "Israel", "Kissufim", 2, 5, "Palestinian gunmen murder an Israeli husband and wife.  They also open fire on medical rescue workers, injuring five of them."], ["2005.07.23", "Lebanon", "Beirut", 0, 12, "Twelve people are injured by a car bomb placed in a Christian neighborhood."], ["2005.07.23", "Thailand", "Narathiwat", 1, 0, "Islamic militants shoot a 58-year-old village leader twice in the head as he is riding with his wife."], ["2005.07.23", "Thailand", "Pattani", 1, 0, "A Buddhist student is gunned down by Islamic extremists."], ["2005.07.24", "Dagestan", "Makhachkala", 1, 4, "Muslim terrorists put a bomb beneath a passenger train that kills one and injures four commuters."], ["2005.07.24", "Iraq", "Baghdad", 22, 30, "A horrific scene as a Fedayeen suicide bomber kills twenty-two people, mostly civilians in a crowded area near sidewalk cafes."], ["2005.07.25", "Iraq", "Baghdad", 12, 16, "A Fedayeen suicide bomber drives his car in front of a hotel and slaughters a dozen people.  Sixteen others are injured."], ["2005.07.25", "Thailand", "Pattani", 1, 0, "Islamists behead the son of a police officer."], ["2005.07.26", "Afghanistan", "Kandahar", 2, 0, "The Taliban kill a police chief and one other with a rocket attack on their car."], ["2005.07.26", "Chechnya", "Dargo", 1, 3, "Muslim terrorists ambush a security patrol, killing one and injuring three."], ["2005.07.26", "Ethiopia", "Jigjiga", 5, 30, "A Muslim separatist group, the ONLF, kills five people, including a child, in two grenade attacks against civilian targets."], ["2005.07.26", "India", "Mahore", 1, 0, "Hizb-ul-Mujahideen members invade a home and murder a civilian."], ["2005.07.26", "Iraq", "Baghdad", 16, 27, "Sunni gunmen massacre sixteen Shia civilians with an automatic weapons attack on their vehicles.  Over two dozen are inured with gunshot wounds."], ["2005.07.26", "Iraq", "Basra", 3, 0, "In two separate attacks (one in Tikrit) Jihadis kill three innocents, including a child and a truck driver."], ["2005.07.26", "Iraq", "Hilla", 3, 0, "Three policemen are killed when terrorists fire a rocket at point-blank range."], ["2005.07.26", "Thailand", "Narathiwat", 1, 0, "A school principal is murdered by Islamic radicals."], ["2005.07.26", "Thailand", "Narathiwat", 2, 0, "Two civilians are killed in their motorcycle shop."], ["2005.07.27", "Chechnya", "Grozny", 1, 0, "A cop is gunned down by Jihadis."], ["2005.07.27", "Iraq", "Baghdad", 2, 0, "al-Qaeda executes two Algerian diplomats that were abducted several days earlier."], ["2005.07.27", "Thailand", "Southern Provinces", 5, 1, "Five civilians are gunned down by Islamic radicals in separate attacks."], ["2005.07.28", "India", "Sokar", 3, 0, "A 5-year-old girl, her mother and grandmother are slaughtered in a home invasion by the Mujahideen."], ["2005.07.28", "Thailand", "Narathiwat", 1, 0, "Islamic terrorists kill a man as he is buying candy for his children."], ["2005.07.29", "Afghanistan", "Gizab", 7, 0, "The Taliban ambush and slaughter seven people."], ["2005.07.29", "Algeria", "Boumerdes", 2, 4, "The Salafist Group for Preaching and Combat kill two Algerian police officers in an ambush."], ["2005.07.29", "Bangladesh", "Boalmari", 2, 0, "Two Christian charity workers are hacked to death inside their home by hardline Islamic militants, who chained the doors shut to prevent their escape or rescue."], ["2005.07.29", "Chechnya", "Grozny", 1, 1, "A cop is gunned down by Jihadis."], ["2005.07.29", "India", "Doda", 2, 0, "Islamists kill two policemen in an ambush."], ["2005.07.29", "India", "Kupwara", 2, 0, "The Mujahideen invade a home to kill the wife of a police officer, along with his young nephew."], ["2005.07.29", "India", "Rajouri", 6, 0, "Muslims line up five Hindu villagers and then slit their throats.  Elsewhere in the same district, they murder a woman with an axe."], ["2005.07.29", "Iraq", "Rabiah", 52, 35, "A suicidal religious extremist wanders into a crowd of people and detonates explosives strapped to his body, killing over fifty people."], ["2005.07.29", "Thailand", "Pattani", 1, 3, "A village leader is gunned down and three others suffer injuries in a separate attack in Narathiwat."], ["2005.07.30", "Afghanistan", "Charchino", 3, 0, "A district governor and his two bodyguards are assassinated by the Taliban in a roadside attack."], ["2005.07.30", "India", "Srinagar", 2, 25, "The Mujahideen stage an attack on a hotel that claims the lives of two security personnel and injures about twenty-five others."], ["2005.07.30", "Iraq", "Baghdad", 3, 0, "Police find the bodies of three airport workers, bound and tortured by the Jihadis.  Their throats were cut."], ["2005.07.30", "Iraq", "Baghdad", 6, 26, "A Fedayeen suicide bomber kills six Iraqis near a theatre.  Twenty-six others are injured."], ["2005.07.30", "Iraq", "Basra", 2, 2, "A bomb attack on the British Embassy convoy leaves two security guards dead and two children injured."], ["2005.07.31", "India", "Badarkot", 1, 0, "A civilian is shot to death inside his own home by militant Muslims."], ["2005.07.31", "Iraq", "Haswa", 7, 12, "Seven civilians are killed by a Jihad car bombing."], ["2005.08.01", "Afghanistan", "Gresk", 2, 0, "Religious extremists gun down a policeman and his young daughter."], ["2005.08.02", "Afghanistan", "Nuristan", 8, 0, "The Taliban kill eight police in an attack on their checkpoint."], ["2005.08.02", "India", "Nandyali", 1, 0, "A woman is shot to death by the Mujahideen inside her home."], ["2005.08.02", "India", "Pulwama", 1, 0, "The Mujahideen kill a man who is working his paddy fields."], ["2005.08.02", "Iraq", "Baghdad", 4, 24, "An Islamic suicide bomber kills four civilians and injures two dozen."], ["2005.08.02", "Iraq", "Shu'la", 7, 0, "Shia gunmen kill a Sunni cleric and his brother, then gun down a vehicle carrying five mourners on their way to view the bodies."], ["2005.08.02", "Thailand", "Narathiwat", 2, 4, "Muslim assailants kill two people in separate attacks."], ["2005.08.03", "Iraq", "Basra", 1, 1, "Shia gunmen abduct and execute an American journalist.  They also cause severe injury to his female interpreter."], ["2005.08.03", "Israel", "Sderot", 1, 9, "Palestinian terrorists fire a rocket at a group of Israeli demonstrators.  The missile hits their own group instead, killing a 3-year-old boy and injuring nine others, including five children."], ["2005.08.03", "Thailand", "Yala", 1, 0, "A civilian is murdered by armed Muslims."], ["2005.08.04", "Afghanistan", "Lashkargah", 1, 0, "The Taliban kill an election worker in an attack from a motorcycle."], ["2005.08.04", "Indonesia", "Poso", 2, 0, "Two witnesses who testified against the Islamic bombers behind a massacre of Christians at a market are themselves assassinated."], ["2005.08.04", "Iraq", "Baqubah", 7, 0, "A Fedayeen suicide bomber kills four Iraqis and injures an unknown number of others."], ["2005.08.04", "Iraq", "Doloyah", 2, 0, "Jihadis shoot two engineers to death for working at a U.S. base."], ["2005.08.04", "Pakistan", "Miranshah", 5, 0, "al-Qaeda militants kill five Pakistani soldiers with a landmine."], ["2005.08.04", "Thailand", "Narathiwat", 1, 0, "Muslim terrorists murder a school bus driver."], ["2005.08.04", "Thailand", "Narathiwat", 2, 0, "A married couple is murdered in their orchard by Islamists."], ["2005.08.05", "Iraq", "Baqubah", 3, 0, "Muslim fanatics invade the home of an Iraqi soldier and kill his wife, 12-year-old daughter and 6-year-old son in their beds."], ["2005.08.05", "Iraq", "Dora", 1, 5, "Jihadis open fire on a line of cars at a gas station, killing one civilian."], ["2005.08.05", "Iraq", "Mosul", 4, 0, "The bodies of four civilians surface in Mosul with signs of torture."], ["2005.08.06", "Afghanistan", "Mizan", 1, 2, "The Taliban murder a civilian and kidnap two others."], ["2005.08.06", "India", "Doda", 1, 4, "The Mujahideen throw a grenade at a hostel, killing a pregnant woman."], ["2005.08.06", "Pakistan", "Koti Ashro", 1, 2, "al-Qaeda suspected in the attack on a highway police checkpoint that leaves an officer dead."], ["2005.08.06", "Thailand", "Yala", 1, 0, "A man is murdered by Muslim terrorists as he leaves a tea shop."], ["2005.08.07", "India", "Thatharaka", 1, 1, "The Mujahideen invade two residences, killing one civilian and severely injuring another."], ["2005.08.07", "Iraq", "Baghdad", 10, 4, "In six separate attacks, Jihadi gunmen kill ten Iraqis."], ["2005.08.07", "Iraq", "Tikrit", 2, 10, "Suicide bomber blows himself to Allah, taking two Iraqis with him.  Ten others are injured."], ["2005.08.07", "Thailand", "Narathiwat", 1, 0, "A man is shot to death by Muslims at a tea shop."], ["2005.08.08", "Afghanistan", "Ghanzi", 2, 0, "The Taliban murder a doctor, on the grounds that he was planning to run for public office.  Another villager is killed as well."], ["2005.08.08", "Chechnya", "Grozny", 1, 2, "Militant Muslims spray a car with automatic weapons fire, killing the parent of a young child, who was also severely injured in the attack."], ["2005.08.08", "India", "Awantipora", 2, 0, "Two civilians are killed in a bomb blast outside a shop."], ["2005.08.08", "India", "Batalik", 3, 0, "Three young girls are killed by a Mujahideen bomb."], ["2005.08.08", "Iraq", "al-Sharqat", 7, 3, "Seven civilians, including three children are murdered when Islamic terrorists bomb a minibus."], ["2005.08.08", "Philippines", "Basilan", 1, 0, "A cop is gunned down by Sunni terrorists."], ["2005.08.08", "Thailand", "Yala", 1, 0, "A tractor mechanic is murdered by Muslim terrorists."], ["2005.08.09", "Chechnya", "Kurdyukovskaya", 1, 1, "A policeman is murdered in an attack by Islamic terrorists."], ["2005.08.09", "India", "Thanna Mandi", 1, 0, "A shepherd is beaten to death by the Mujahideen."], ["2005.08.09", "Iraq", "Baghdad", 21, 41, "At least six separate Jihad attacks, mostly on civilians, leave over twenty Iraqis dead and more than twice as many injured."], ["2005.08.09", "Iraq", "Baiji", 4, 5, "In a senseless attack, terrorists use a roadside bomb and small arms fire to kill four Americans trying to clear landmines."], ["2005.08.09", "Pakistan", "Lahore", 1, 0, "A Catholic layman is abducted and strangled to death by Islamic fundamentalists."], ["2005.08.09", "Thailand", "Narathiwat", 2, 0, "Two civilians, including a school janitor, are murdered separately by Islamic terrorists."], ["2005.08.09", "Thailand", "Yala", 1, 0, "A civilian is murdered by Islamists."], ["2005.08.10", "Afghanistan", "Bakurzai", 1, 0, "The Taliban drag a poor, illiterate woman from her house and shoot her to death."], ["2005.08.10", "India", "Bandipore", 1, 0, "The Mujahideen abduct and later kill a police officer."], ["2005.08.10", "Iraq", "Baghdad", 2, 1, "Jihadis kill a 12-year-old girl's mother and pharmacist father in an attack that also leaves her injured."], ["2005.08.10", "Iraq", "Baiji", 2, 0, "Two oil pipeline security guards are shot to death by Islamic terrorists."], ["2005.08.10", "Iraq", "Ghazaliya", 6, 14, "A suicidal Sunni detonates a car bomb near a group of police, killing at least six, including four civilians.  Fourteen suffer injury."], ["2005.08.10", "Pakistan", "Quetta", 2, 0, "Muslim extremists kill two Shia civilians in separate motorcycle attacks."], ["2005.08.10", "Pakistan", "Taza Ghondai", 4, 1, "al-Qaeda targets and kills four civilians with a landmine."], ["2005.08.10", "Philippines", "Zamboanga", 0, 26, "Abu Sayyaf behind two bombs that injure twenty-six near a parked van and at a restaurant."], ["2005.08.10", "Thailand", "Narathiwat", 1, 0, "A rubber plantation owner is murdered by Islamists."], ["2005.08.10", "Thailand", "Yala", 1, 0, "A school guard is murdered by Muslim terrorists on his way to work."], ["2005.08.11", "Afghanistan", "Zabol", 2, 0, "Two civilians are beheaded by Islamic extremists."], ["2005.08.11", "Algeria", "Skikda", 3, 4, "Muslim extremists kill three community guards and injure four others."], ["2005.08.11", "India", "Kawani", 1, 0, "An employee of an irrigation works project is abducted and killed by the Mujahideen."], ["2005.08.11", "Pakistan", "Lahore", 1, 0, "Islamic radicals kidnap, torture and kill a Catholic layman."], ["2005.08.12", "Afghanistan", "Kandahar", 1, 6, "A bomb explodes at a women's market, killing a young child."], ["2005.08.12", "India", "Kulhand", 2, 0, "The Hizb-ul-Mujahideen attack a village and shoot two teenage boys to death."], ["2005.08.12", "Iraq", "Najaf", 4, 19, "Three children are among four civilians killed by a bomb planted by radical Muslims near a mosque."], ["2005.08.13", "India", "Shajroo", 5, 9, "Muslim militants attack a Hindu village in the middle of the night, killing five people in their homes, including three Hindu teenagers, and injuring at least nine others."], ["2005.08.13", "Thailand", "Narathiwat", 2, 0, "Two civilians are shot to death by Islamists."], ["2005.08.13", "Thailand", "Pattani", 0, 2, "A man and his 13-year-old son are critically wounded by Muslim gunmen."], ["2005.08.14", "Chechnya", "Roshnichu", 5, 2, "Four investigators are killed by Islamic terrorists on their way to probe another murder that took place earlier in the day."], ["2005.08.14", "Iraq", "Baghdad", 18, 15, "Various sectarian attacks leave eighteen dead."], ["2005.08.14", "Iraq", "al-Mahawil", 2, 5, "An Islamic suicide bomber kills two civilians and injures five others."], ["2005.08.14", "Pakistan", "Sialkot", 5, 0, "Five family members lose their lives in an 'honor killing.'"], ["2005.08.14", "Thailand", "Narathiwat", 2, 2, "In three separate attacks, Muslim gunmen shoot two Buddhist men at point-blank range as they are drinking tea.  They also shoot a 40-year-old woman by the side of the road and hack another woman with a machete while she is working her garden."], ["2005.08.15", "Chechnya", "Grozny", 2, 11, "Muslims target a restaurant with a car bomb, killing a woman and a 12-year-old boy."], ["2005.08.15", "Iraq", "Dura", 1, 0, "'Holy Warriors' kidnap a Christian woman and then cut off her head."], ["2005.08.15", "Iraq", "Uwarige", 30, 0, "The mass grave of thirty people, including two women, is uncovered.  The Fedayeen tortured the victims before executing them."], ["2005.08.17", "Afghanistan", "Kandahar", 1, 11, "One person is killed, and eleven others injured by a Taliban bus bomb."], ["2005.08.17", "Algeria", "Mozaya", 3, 0, "Three civilians are killed when Islamic fundamentalists attack their village."], ["2005.08.17", "Bangladesh", "Dhaka", 2, 115, "The Jumatul Mujahedin take credit for hundreds of synchronized blasts that kill two, including a 40-year-old rickshaw puller.  Over one-hundred others are injured."], ["2005.08.17", "India", "Qazigund", 1, 9, "An Indian guard is killed, and nine other people are injured by a Mujahideen car bombing in a residential area."], ["2005.08.17", "Iraq", "Baghdad", 43, 89, "Jihadis murder over forty people in three separate car bombings that also leave about one-hundred injured.  Most of the victims were simply waiting at a bus stop or seeking medical treatment at a hospital when they were targeted."], ["2005.08.17", "Iraq", "Hawija", 6, 0, "Six Iraqi recruits are pulled from a bus by Sunni radicals and shot to death execution-style."], ["2005.08.18", "Chechnya", "Grozny", 1, 0, "A police officer is abducted and brutally slain by the Mujahideen."], ["2005.08.18", "India", "Kashmir", 4, 0, "In four separate attacks, the Mujahideen kill four civilians, including a 75-year-old man and a 16-year-old boy."], ["2005.08.18", "Iraq", "Baghdad", 2, 0, "Jihadis murder a judge and his driver."], ["2005.08.18", "Thailand", "Narathiwat", 2, 2, "A teacher and a policeman are shot dead by Muslim militants in separate attacks."], ["2005.08.19", "Algeria", "Kechida", 6, 0, "In a gruesome attack, Islamic fundamentalists knife six hikers to death, including a woman."], ["2005.08.19", "India", "Gogaldara", 1, 0, "A man is gunned down in cold blood by the Mujahideen."], ["2005.08.19", "Iraq", "Mosul", 3, 0, "Jihadi gunmen abduct three Sunni political workers that were hanging posters urging people to vote.  They are later made to stand against a wall, where they are executed."], ["2005.08.19", "Jordan", "Aqaba", 1, 1, "A Jordanian soldier is killed by an al-Qaeda rocket attack at a seaport."], ["2005.08.20", "Dagestan", "Makhachkala", 3, 1, "Islamic Jamaat claims responsibility for a bombing that killed three policemen walking past a grove of trees."], ["2005.08.21", "Afghanistan", "Daychopan", 4, 3, "The Taliban kill four members of a medical rescue team."], ["2005.08.21", "Afghanistan", "Panjawyi", 2, 0, "Sunni extremists kill two scholars."], ["2005.08.21", "India", "Salbala", 1, 0, "Jaish-e-Mohammed terrorists kidnap and kill a civilian."], ["2005.08.21", "Ingushetia", "Nazran", 1, 2, "A 48-year-old passerby is killed by Islamic militants in a remote-controlled bombing."], ["2005.08.21", "Iraq", "Fallujah", 4, 5, "A terrorist bomb kills four Iraqis and injures five."], ["2005.08.21", "Thailand", "Pattani", 8, 15, "Islamic separatists kill eight people, mostly civilians, in five separate attacks across the southern Thai provinces using bombs and bullets."], ["2005.08.22", "India", "Koteranka", 5, 0, "Hizb-ul-Mujahideen kill three family members inside their home.  Two other civilians are abducted and killed in separate incidents in Kashmir."], ["2005.08.22", "Ingushetia", "Nazran", 2, 3, "Muslims place a bomb near a gas pipeline.  Two civilians are killed in the explosion."], ["2005.08.22", "Iraq", "Baghdad", 2, 6, "Two children are killed in a bombing by Islamic terrorists.  Six others are injured."], ["2005.08.22", "Iraq", "Baghdad", 8, 0, "In four separate attacks across the country radical Sunnis kill eight, including a married couple in their car, the owner of a food shop and his son, and two truck drivers."], ["2005.08.22", "Iraq", "Tarmiyah", 8, 3, "Jihad gunmen spray a police van with bullets, killing eight and injuring three.  Casualties include civilians."], ["2005.08.22", "Thailand", "Narathiwat", 1, 0, "A power company employee is murdered by Islamic radicals."], ["2005.08.23", "Iraq", "Baqubah", 7, 19, "An al-Qaeda suicide bomber on foot slaughters seven people and injures about twenty others."], ["2005.08.23", "Thailand", "Narathiwat", 1, 3, "Muslim gunmen kill a man in his pickup truck."], ["2005.08.23", "Thailand", "Yala", 1, 0, "A tour operator is murdered by Islamists."], ["2005.08.24", "India", "Srinagar", 0, 7, "Seven people are injured when an Islamic militant throws a grenade into the street."], ["2005.08.24", "Iraq", "Baghdad", 9, 35, "In at least four separate attacks, nine people are killed by Jihadis and over thirty injured."], ["2005.08.24", "Thailand", "Narathiwat", 2, 0, "A teacher and a school guard are shot to death by Muslim radicals."], ["2005.08.24", "Thailand", "Pattani", 1, 0, "A man is shot to death by Muslim terrorists while drinking tea with friends."], ["2005.08.25", "Afghanistan", "Lashkar Gah", 2, 0, "A map-maker and a merchant are slaughtered by Taliban extremists."], ["2005.08.25", "Egypt", "Sinai", 2, 2, "Islamic extremists attack a police patrol with an IED, killing two members."], ["2005.08.25", "India", "Thanna Mandi", 2, 1, "A man and his son are shot to death by the Mujahideen, while another family is injured in the attack."], ["2005.08.25", "Indonesia", "Ambon", 0, 7, "A bomb set by Muslim radicals in a Christian sector of town injures seven people."], ["2005.08.25", "Iraq", "Abu Saida", 6, 15, "Six civilians, mostly elderly men, are murdered in a cafe by militant Muslim gunmen, who enter at breakfast to gun down the victims."], ["2005.08.25", "Iraq", "Oraida", 36, 0, "The bodies of thirty-six men in civilian clothes are found dumped in a remote area.  They were handcuffed and executed."], ["2005.08.25", "Israel", "Jerusalem", 1, 1, "A Palestinian stabs two young ultra-orthodox Jews on the street, killing one of them and leaving the other badly injured."], ["2005.08.25", "Thailand", "Narathiwat", 1, 0, "A cattle farmer is murdered by Islamists."], ["2005.08.26", "India", "Kashmir", 4, 18, "Several separate attacks across Kashmir by Muslim terrorists leave four civilians dead and more than a dozen people injured."], ["2005.08.26", "Ingushetia", "Nazran", 1, 3, "An assassination attempt by Islamic militants injures a prime minister and kills his bodyguard."], ["2005.08.26", "Thailand", "Narathiwat", 1, 0, "Muslim militants murder a man on his way home."], ["2005.08.26", "Thailand", "Yala", 1, 1, "Muslims shoot and kill a Buddhist man and also shoot his paralyzed father as the two were watching TV."], ["2005.08.27", "Afghanistan", "Uruzgan", 1, 0, "A political candidate is murdered by the Taliban."], ["2005.08.27", "Egypt", "Halal", 2, 0, "Two Egyptians are killed in the Sinai, when Islamic radicals detonate a landmine under their car."], ["2005.08.27", "Iraq", "Mosul", 1, 0, "A Christian is gunned down by Muslim militants."], ["2005.08.27", "Iraq", "Mosul", 3, 0, "Three members of a Sunni political party are kidnapped and later killed in front of a mosque by men calling them \"non-Muslims.\""], ["2005.08.27", "Kosovo", "Urosevac-Skopje", 2, 2, "Two Christians are killed and two wounded when Muslim gunmen attack their car."], ["2005.08.27", "Pakistan", "Shawal", 2, 1, "Islamic militants kill two Pakistani soldiers with a bomb."], ["2005.08.27", "Thailand", "Yala", 1, 0, "A defense volunteer is killed by Muslim gunmen."], ["2005.08.28", "Israel", "Beersheba", 0, 8, "Eight Israelis are hospitalized by a Fatah suicide bomber, including two guards that were seriously wounded."], ["2005.08.28", "Kosovo", "Strpce", 2, 0, "Two Serbian men are shot and killed in a terror attack."], ["2005.08.28", "Philippines", "Lamitan", 2, 29, "Thirty people are injured and two people, including a child, are killed when Abu Sayyaf militants, disguised as fishermen, bomb a ferry."], ["2005.08.28", "Thailand", "Narathiwat", 1, 0, "A former religious teacher is killed by Islamists."], ["2005.08.28", "Thailand", "Yala", 1, 0, "An art teacher is murdered by Islamic fundamentalists."], ["2005.08.29", "Iraq", "Mosul", 3, 7, "Islamic insurgents \"fight for freedom\" by killing a child with a missile that also injures seven other children, who are then treated by U.S. soldiers.  Elsewhere the bodies of a beheaded civilian and a policeman are found."], ["2005.08.29", "Thailand", "Narathiwat", 1, 0, "A cleric is gunned down by terrorists."], ["2005.08.29", "Thailand", "Yala", 1, 0, "A guard protecting Buddhist monks is shot to death by Muslim radicals."], ["2005.08.30", "Thailand", "Narathiwat", 1, 0, "A Buddhist construction worker is murdered by Islamists."], ["2005.08.30", "Thailand", "Narathiwat", 1, 0, "A former official is killed in front of a school full of children by Muslim gunmen."], ["2005.08.31", "Afghanistan", "Helmand", 1, 0, "A cleric is beheaded by the Taliban for participating in an election."], ["2005.08.31", "Afghanistan", "Herat", 3, 2, "The Taliban gun down three security officers in cold blood and kidnap a British engineer and his interpreter."], ["2005.08.31", "Chechnya", "Novoterskoye", 2, 0, "Two police officers are killed in a shootout with Islamic militants planning a major terror attack in Chechnya."], ["2005.08.31", "India", "Wusan Pattan", 1, 0, "A campaign worker is shot to death by the Mujahideen."], ["2005.08.31", "Iraq", "Baghdad", 7, 36, "Sunni radicals stage three separate attacks on Shia pilgrims, killing seven and injuring about three dozen."], ["2005.08.31", "Pakistan", "Mastung", 1, 3, "Muslim radical detonates a bomb on a city street, killing a passerby and injuring three others."], ["2005.08.31", "Thailand", "Pattani", 1, 1, "Islamic radicals spray a police checkpoint with bullets, killing an officer and severely injuring his wife."], ["2005.08.31", "Thailand", "Sungai Kolok", 0, 15, "Fifteen people are injured by six bombs set by Muslim militants outside a hotel."], ["2005.08.31", "Thailand", "Yala", 1, 1, "A rubber plantation worker is gunned down, and his wife injured by Muslim terrorists."], ["2005.09.01", "Afghanistan", "Girishk", 1, 0, "A moderate cleric is gunned down by Muslim extremists."], ["2005.09.01", "Algeria", "Ammal", 1, 0, "The mayor of a small town is shot and killed by Islamic fundamentalists at a fake roadblock."], ["2005.09.01", "Thailand", "Narathiwat", 1, 0, "A bus driver is shot to death by Islamists while dropping kids off at school."], ["2005.09.01", "Thailand", "Narathiwat", 1, 0, "Militant Muslims gun down a hospital worker."], ["2005.09.01", "Thailand", "Yala", 1, 0, "A religious teacher is killed by terrorists on his way to school."], ["2005.09.02", "Dagestan", "Makhachkala", 5, 11, "Five people, including a 7-year-old child, are killed and eleven wounded in a Jihad bombing attack."], ["2005.09.02", "India", "Soundhar", 3, 4, "Lashkar-e-Toiba terrorists attack a group of civilians, killing three and injuring four.  The casualties include two women."], ["2005.09.02", "Iraq", "Baiji", 5, 9, "Five Iraqi soldiers are killed in a terrorist bombing while on patrol.  Nine are injured."], ["2005.09.02", "Pakistan", "Laddha", 1, 0, "al-Qaeda militants kill a village elder."], ["2005.09.02", "Thailand", "Narathiwat", 1, 0, "A rubber tapper is murdered by Islamists."], ["2005.09.02", "Thailand", "Yala", 1, 1, "Muslims kill a 45-year-old Buddhist man as he is traveling home with his daughter."], ["2005.09.03", "Afghanistan", "Ghowrak", 5, 0, "Five people are murdered in a shooting spree by Taliban terrorists."], ["2005.09.03", "Afghanistan", "Zabul", 1, 2, "Taliban extremists murder a police officer at a checkpoint."], ["2005.09.03", "Iraq", "Baqubah", 16, 2, "Jihadis murder sixteen Iraqi security force personnel in three separate attacks."], ["2005.09.03", "Iraq", "Samarrah", 3, 11, "Islamic militants fire several mortars into a residential area, killing three civilians and injuring eleven."], ["2005.09.03", "Iraq", "Zubayr", 1, 4, "Shia gunmen fire on Sunni worshippers at a mosque, killing one."], ["2005.09.03", "Thailand", "Narathiwat", 1, 0, "A civilian is murdered by Islamic radicals while on his way to pick herbs."], ["2005.09.03", "Thailand", "Narathiwat", 1, 0, "Militant Muslims gun down a cattle farmer."], ["2005.09.03", "Thailand", "Pattani", 1, 0, "Muslim separatists shoot a civilian in his car, then burn him alive."], ["2005.09.03", "Thailand", "Yala", 1, 0, "Muslim terrorists spray a grocery store with machine-gun fire, killing a Buddhist patron."], ["2005.09.04", "Afghanistan", "Helmand", 5, 0, "The Taliban execute a British hostage and also ambush a police patrol, killing four officers."], ["2005.09.04", "India", "Bijbehara", 2, 0, "The Mujahideen shoot a retired schoolteacher to death.  Elsewhere (Poshana) another civilian is abducted and killed in captivity."], ["2005.09.04", "Iraq", "Qaim", 10, 0, "al-Qaeda takes over a small town and executes at least ten people, including a woman accused of being a prostitute."], ["2005.09.04", "Philippines", "Karawan", 3, 0, "Abu Sayyaf terrorists kill three unarmed, off-duty Filipino soldiers."], ["2005.09.04", "Thailand", "Pattani", 1, 0, "A man is murdered by Muslim gunmen in front of his home."], ["2005.09.05", "India", "Achar", 3, 0, "Three brothers are shot to death by the Hizb-ul-Mujahideen."], ["2005.09.05", "India", "Batpora", 0, 16, "Sixteen civilians are injured when a Muslim terrorist hurls a grenade into the road."], ["2005.09.05", "India", "Kahi", 1, 0, "Militant Muslims shoot a young woman to death approximately two months after her husband is killed."], ["2005.09.05", "India", "Poshana", 1, 0, "A civilian is abducted and killed by Islamic militants."], ["2005.09.05", "India", "Sangiot", 1, 0, "An elderly woman is abducted and beheaded by the Mujahideen."], ["2005.09.05", "Iraq", "Balad", 2, 1, "Suicide bomber kills two Iraqis."], ["2005.09.05", "Iraq", "Hit", 11, 16, "Eleven Iraqis, mostly civilian, are killed by a 'Holy Warrior' suicide bomber on a city street."], ["2005.09.05", "Pal. Auth.", "Gaza City", 4, 27, "Four people, including a woman, are killed and twenty-seven injured when a Hamas weapons lab blows up in a residential neighborhood."], ["2005.09.05", "Thailand", "Narathiwat", 1, 0, "A Buddhist worker delivering wood is brutally slain by Muslim terrorists."], ["2005.09.05", "Thailand", "Narathiwat", 1, 3, "Islamic radicals bomb a convoy of teachers, killing a guard."], ["2005.09.05", "Thailand", "Yala", 1, 0, "Muslims intrude into a villager's home and kill him."], ["2005.09.06", "Dagestan", "Inchkhe", 3, 0, "Islamic militants suspected in a shooting attack on a police vehicle that leaves three Russian officers dead."], ["2005.09.06", "India", "Kashmir", 2, 1, "Two civilians are gunned down by the Hizb-ul-Mujahideen in separate attacks."], ["2005.09.07", "Afghanistan", "Ghazni", 4, 0, "The Taliban kill four policemen guarding a road maintenance crew."], ["2005.09.07", "Afghanistan", "Helmand", 1, 2, "A suicide car bombing goes badly, killing three bombers but only one passerby."], ["2005.09.07", "Dagestan", "Khasavyurt", 1, 0, "A Russian soldier is killed in an Islamic terror bombing."], ["2005.09.07", "Iraq", "Basra", 4, 0, "Four American civilians are killed by Muslim terrorists in a roadside bombing."], ["2005.09.07", "Iraq", "Basra", 16, 21, "Muslim terrorists car bomb a take-out restaurant, killing sixteen civilians in and around the building.  Twenty-one are injured."], ["2005.09.07", "Thailand", "Narathiwat", 1, 3, "An elderly civilian is killed in a bombing by Muslim radicals."], ["2005.09.08", "India", "Doda", 2, 0, "Two civilians are abducted and killed in separate attacks by the Mujahideen."], ["2005.09.08", "India", "Sopore", 1, 13, "One civilian is killed and thirteen others injured when Muslim militants toss a grenade into a bus stop."], ["2005.09.08", "Pakistan", "Gilgit", 2, 0, "Two civilians are killed in attacks by rival Islamic groups."], ["2005.09.08", "Thailand", "Narathiwat", 2, 0, "Two ordinary civilians are gunned down for no apparent reason by Muslim terrorists in separate attacks."], ["2005.09.08", "Thailand", "Yala", 1, 1, "A Buddhist truck driver delivering rice is murdered by radical Islamic gunmen."], ["2005.09.09", "Afghanistan", "Helmand", 4, 0, "Four police officer are brutally murdered in their vehicle in a Taliban bombing."], ["2005.09.09", "Afghanistan", "Herat", 1, 0, "Taliban extremists kill the bodyguard of an election candidate."], ["2005.09.09", "India", "Dharmari", 6, 8, "Six members of three families are massacred by Muslim militants, who level continuous fire into their village.  Two women are among the dead."], ["2005.09.09", "India", "Gandoh", 1, 0, "The Mujahideen kill a Hindu as he is grazing his cattle."], ["2005.09.09", "India", "Udhampur", 2, 0, "Two shepherds are abducted from their field by the Mujahideen and then killed in captivity."], ["2005.09.09", "Thailand", "Narathiwat", 1, 0, "A woman is murdered by Muslims while on her way to see children at a hospital."], ["2005.09.10", "India", "Awantipora", 5, 7, "Vicious ambush on an Indian convoy by Lashkar-e-Toiba terrorists leaves five security force personnel dead and seven injured."], ["2005.09.10", "India", "Jammu", 2, 0, "The Mujahideen shoot a father and son to death."], ["2005.09.10", "Thailand", "Narathiwat", 1, 0, "A Buddhist construction worker is shot to death by militant Muslims."], ["2005.09.10", "Thailand", "Narathiwat", 1, 0, "Muslim radicals nearly behead a teenage boy with a knife."], ["2005.09.10", "Thailand", "Pattani", 1, 0, "Islamic terrorists kill a cattle salesman."], ["2005.09.10", "Thailand", "Yala", 1, 0, "Muslims slash a 62-year-old Buddhist man to death while he was on his way to work."], ["2005.09.11", "Thailand", "Pattani", 1, 0, "A civilian is shot off the back of a motorcycle by terrorists."], ["2005.09.12", "Bangladesh", "Khulna", 1, 0, "Islamic extremists suspected in deadly attack on a high school teacher."], ["2005.09.12", "Chechnya", "Grozny", 1, 5, "A Mujahideen remote control bomb kills one and injures five."], ["2005.09.12", "India", "Shopian", 1, 0, "A civilian is abducted and murdered by the Mujahideen."], ["2005.09.12", "Iraq", "Baghdad", 2, 17, "Jihadis car bomb a restaurant, killing two people and injuring seventeen more.  Most of the victims were women."], ["2005.09.12", "Pakistan", "Tappi", 3, 0, "Three citizens are abducted by al-Qaeda terrorists and then have their throats slit after being tortured."], ["2005.09.12", "Thailand", "Pattani", 1, 1, "Two Buddhist school bus drivers are ambushed by Muslim terrorists.  At least one dies from gunshot wounds."], ["2005.09.13", "Afghanistan", "Uruzgan", 7, 0, "The Taliban shoot seven civilians to death after finding election materials in their car."], ["2005.09.13", "Afghanistan", "Zabul", 1, 0, "An election official is captured and hanged by the Taliban."], ["2005.09.13", "Algeria", "Sidi Daoud", 3, 0, "Three Algerian troops are killed in an ambush by the Salafi Group for Preaching and Combat."], ["2005.09.13", "Dagestan", "Buinaksk", 1, 1, "Coordinated attack by Muslim terrorists leaves a Russian policeman dead."], ["2005.09.13", "India", "Rajouri", 1, 3, "The Mujahideen invade a woman's home, take her food, then shoot her to death and seriously injure her three children."], ["2005.09.13", "Iraq", "Mosul", 1, 0, "A 21-year-old Christian woman is assaulted by Muslim radicals for wearing jeans.  She is beaten and stabbed to death."], ["2005.09.13", "Thailand", "Pattani", 1, 0, "A teacher is murdered by Islamic radicals."], ["2005.09.14", "Afghanistan", "Tirin Kot", 3, 4, "Taliban extremists kill three civilians traveling in a car.  Four others, including a child, are badly injured."], ["2005.09.14", "Chechnya", "Argun", 5, 3, "Islamic militants open fire on a group of Russian soldiers from a house, killing five."], ["2005.09.14", "Iraq", "Baghdad", 134, 300, "'Holy Warrior' suicide bombers stage twelve separate attacks against Shia civilians (mostly day laborers looking for work).  About one-hundred and thirty-five are slaughtered, with over three-hundred others injured."], ["2005.09.14", "Iraq", "Taji", 17, 0, "Sunni gunmen invade Shia homes in the middle of the night, pulling seventeen men out and murdering them execution style."], ["2005.09.14", "Pakistan", "Quetta", 1, 0, "Sunnis murder a Shia civilian."], ["2005.09.14", "Thailand", "Pattani", 1, 0, "A merchant is murdered by Islamists."], ["2005.09.15", "Afghanistan", "Ghazni", 1, 2, "An Afghan interpreter is killed by the Taliban in a roadside attack."], ["2005.09.15", "Afghanistan", "Helmand", 1, 0, "A candidate for election is pulled from his house and executed by religious extremists."], ["2005.09.15", "Dagestan", "Kizilyurt", 1, 3, "Islamic terrorists attack a police checkpoint."], ["2005.09.15", "India", "Tipri", 2, 0, "The Mujahideen guns down two civilians in cold blood at their village."], ["2005.09.15", "Iraq", "Baghdad", 23, 32, "Three Fedayeen suicide bombers kill at least twenty Iraqis and injure more than thirty more in a commercial district.  Three bodies are found elsewhere."], ["2005.09.15", "Iraq", "Karbala", 3, 0, "Three Shia pilgrims on their way to a shrine are gunned down by Sunni radicals."], ["2005.09.15", "Iraq", "Mosul", 1, 3, "A terrorist bomb explodes in a Shia mosque, killing the Imam and injuring three others."], ["2005.09.15", "Thailand", "Narathiwat", 1, 1, "Muslim terrorists shoot a former school teacher to death in front of his wife, who narrowly escapes with her life."], ["2005.09.15", "Thailand", "Yala", 1, 0, "A 40-year-old man is killed by Muslim extremists on his way to work at a rubber plantation."], ["2005.09.16", "Algeria", "Ouled Attia", 2, 4, "Fundamentalists attack a security patrol, killing two members."], ["2005.09.16", "Chechnya", "Grozny", 2, 4, "Muslim terrorists attack a police car on the city streets, killing an officer and a civilian."], ["2005.09.16", "Iraq", "Baghdad", 12, 22, "Five Jihad attacks leave about a dozen Iraqis dead and over twenty injured."], ["2005.09.16", "Iraq", "Tuz", 10, 21, "A suicidal Sunni kills himself and ten others outside a Shia mosque with a car bomb.  Almost two dozen others are injured."], ["2005.09.16", "Lebanon", "Beirut", 1, 22, "A bomb placed in a Christian neighborhood kills one man and injures twenty-two other people."], ["2005.09.16", "Thailand", "Narathiwat", 1, 0, "A Buddhist construction worker is murdered by Muslim radicals."], ["2005.09.17", "Algeria", "Bordj", 1, 0, "A guard at a natural gas facility is murdered by terrorists."], ["2005.09.17", "India", "Surankote", 1, 0, "A civilian is abducted from his village and beheaded by the Mujahideen."], ["2005.09.17", "Iraq", "Baghdad", 9, 0, "Sunni radicals kidnap and torture nine men before killing them execution style."], ["2005.09.17", "Iraq", "Mushahada", 3, 1, "A Jihad ambush on an Iraqi Parliament member leaves him and two civilians dead."], ["2005.09.17", "Iraq", "Nahrawan", 30, 38, "al-Qaeda murders thirty Shiites in a street bombing in an industrial area.  About forty others are injured in the blast."], ["2005.09.18", "Afghanistan", "Khost", 2, 0, "Two security officers are killed by the Taliban in an ambush."], ["2005.09.18", "Iraq", "Baghdad", 1, 4, "Sunnis open fire on a group of Shia civilians, killing at least one."], ["2005.09.18", "Iraq", "Kirkuk", 4, 3, "Four Iraqi security force personnel are killed by a roadside bomb planted by Jihadis."], ["2005.09.18", "Pakistan", "Wana", 1, 0, "al-Qaeda shoots a 50-year-old schoolteacher to death."], ["2005.09.19", "Algeria", "Skikda", 4, 0, "Islamic fundamentalists kill two civilians and two Algerian soldiers in a remote area."], ["2005.09.19", "India", "Doda", 2, 0, "Two civilians are killed in their homes by the Mujahideen."], ["2005.09.19", "India", "Takiya Sheikhpora", 1, 0, "A villager has his throat slit by the Mujahideen."], ["2005.09.19", "Iraq", "Basra", 1, 0, "Islamic extremists kidnap, torture, and kill a reporter for the New York Times."], ["2005.09.19", "Iraq", "Karbala", 10, 12, "Two suicide bombers strike Shia pilgrims as they are walking on foot to a shrine.  Ten are killed and at least a dozen injured."], ["2005.09.19", "Kabardino-Balk.", "Nalchik", 1, 0, "Mujahideen kill a Russian soldier in a terror attack."], ["2005.09.20", "Afghanistan", "Sahag", 2, 0, "Two civilians are killed in a roadside terror bombing by the Taliban."], ["2005.09.20", "Afghanistan", "Uruzgan", 3, 3, "Three policemen are killed by the Taliban while traveling home."], ["2005.09.20", "Chechnya", "Krasny Voskhod", 1, 3, "An ambush by Jihadis on a police convoy leaves one officer dead."], ["2005.09.20", "India", "Udhampur", 3, 0, "Three civilians are shot to death after the Mujahideen invade their homes."], ["2005.09.20", "Ingushetia", "Karabulak", 3, 1, "Shouting 'Allah Akbar,' masked terrorists attack a group of border policemen checking passports, killing three."], ["2005.09.20", "Iraq", "Baghdad", 1, 0, "A transsexual is beaten and burned to death by Islamic extremists."], ["2005.09.20", "Iraq", "Duluiyah", 4, 2, "Four American contractors are murdered by Muslim radicals after their car takes a wrong turn."], ["2005.09.20", "Iraq", "Mosul", 4, 2, "A suicidal extremist kills an American diplomat and three civilian contractors in a car bombing."], ["2005.09.20", "Pakistan", "Shakai", 2, 8, "al-Qaeda kills a tribal leader and a soldier in separate remote-controlled bomb attacks."], ["2005.09.20", "Philippines", "Milaya", 1, 0, "Abu Sayyaf gunmen murder a security member."], ["2005.09.20", "Thailand", "Tanyong Limo", 2, 0, "Two Thai marines are captured by Muslim villagers when their car breaks down.  The people later stab and beat the two Buddhists to death after holding them hostage for 18 hours."], ["2005.09.20", "Thailand", "Tanyong Limo", 2, 3, "Militant Muslims stage a shooting attack on a tea shop, killing two men."], ["2005.09.21", "Afghanistan", "Jozjan", 7, 0, "Seven musicians are slaughtered by the Taliban as they are traveling home from a wedding."], ["2005.09.21", "Thailand", "Narathiwat", 1, 1, "A man is killed, and his Buddhist wife injured, by Muslim gunmen."], ["2005.09.21", "Thailand", "Yala", 1, 1, "A school janitor is killed, and a female factory worker injured, in a shooting attack by religious extremists."], ["2005.09.22", "Algeria", "M'sila", 8, 4, "The Salafist Group for Preaching and Combat stages a terrorist attack against an Algerian army patrol, killing at least eight."], ["2005.09.22", "Chechnya", "Oktyabrskiy", 1, 0, "A cop is gunned down by Jihadis."], ["2005.09.22", "India", "Pathan Mohalla", 1, 1, "Two family members are abducted from their home by the Mujahideen.  The father is released after his son is executed."], ["2005.09.22", "Iraq", "Baghdad", 9, 3, "Jihadis kill nine people in four attacks, including the owner of a tile-making factory, who is killed in his home along with his two sons and daughter-in-law."], ["2005.09.22", "Pakistan", "Lahore", 6, 27, "Two separate bomb blasts in commercial areas by Muslim terrorists kill six, including a woman, and injure thirty."], ["2005.09.22", "Thailand", "Narathiwat", 1, 1, "In the second such attack in as many days, Muslims fire on a married couple, killing the husband."], ["2005.09.22", "Thailand", "Yala", 1, 0, "A Buddhist care-taker of elephants is murdered by Islamists."], ["2005.09.22", "Thailand", "Yala", 1, 0, "A Buddhist vegetable vendor is murdered by Islamic extremists."], ["2005.09.23", "Denmark", "Slagelse", 1, 1, "Pakistani man guns down his 19-year-old sister and injures her husband in a public honor killing in Denmark."], ["2005.09.23", "India", "Kulgam", 1, 0, "Militant Muslims kill a female police officer in her home."], ["2005.09.23", "Iraq", "Baghdad", 4, 0, "Four Assyrian Christians are killed in a Muslim bomb attack on a Christian minister."], ["2005.09.23", "Iraq", "Baghdad", 6, 12, "Suicide bomber targets a civilian passenger bus and kills six people and injures at least a dozen."], ["2005.09.23", "Iraq", "Karbala", 1, 4, "A suicide bomber succeeds in killing a small child.  Four others are wounded."], ["2005.09.23", "Pakistan", "Gilgit", 2, 2, "Sunni terrorists open fire on a bus, killing two Shias, including a 15-year-old girl."], ["2005.09.23", "Pal. Auth.", "Jebaliya", 17, 140, "A Hamas truck, loaded with rockets intended for Israel, explodes early, killing seventeen Palestinians (including three children) and injuring another one-hundred and forty."], ["2005.09.23", "Thailand", "Narathiwat", 2, 2, "Two policemen are killed by a mobile-phone bomb triggered by Islamists."], ["2005.09.23", "Thailand", "Pattani", 2, 0, "In separate attacks, a construction worker and a public health employee are gunned down by Muslim terrorists."], ["2005.09.23", "Thailand", "Yala", 1, 0, "Militant Muslims shoot a migrant worker to death."], ["2005.09.24", "Afghanistan", "Chemtal", 6, 0, "Six musicians are shot to death by religious fundamentalists opposed to music."], ["2005.09.24", "Chechnya", "Grozny", 6, 11, "Three Mujahideen terror attacks leave six Russian servicemen dead and eleven wounded."], ["2005.09.24", "India", "Gandoh", 1, 0, "The mother-in-law of a police officer is killed inside her home by Islamic militants."], ["2005.09.25", "Algeria", "Skikda", 2, 0, "Islamic fundamentalists set up a fake roadblock to stop a civilian car and cut the throats of two occupants.  Family members are abducted."], ["2005.09.25", "India", "Kalotra", 1, 0, "A government lecturer is shot to death by the Mujahideen."], ["2005.09.25", "Iraq", "Baghdad", 9, 12, "A horrific scene of twisted metal, charred bodies and blood, as a 'Holy Warrior' kills himself in a bombing attack that also takes the lives of nine others."], ["2005.09.25", "Iraq", "Hilla", 5, 48, "A bomb planted on a bicycle kills a passerby outside a music store.  Elsewhere, four bodies are found bound and murdered."], ["2005.09.25", "Iraq", "Mussayib", 6, 19, "A Fedayeen suicide bomber on a motorcycle kills six civilians and injures about twenty others."], ["2005.09.25", "Pakistan", "Lahore", 2, 0, "Two more victims of the 9/22 blast die from injuries, including a 7-year-old girl."], ["2005.09.26", "Afghanistan", "Helmand", 4, 0, "Taliban landmine kills all four people in a passenger car."], ["2005.09.26", "Chad", "Madayouna", 38, 0, "Thirty-eight innocent people are murdered in a Janjaweed raid."], ["2005.09.26", "Iraq", "Baghdad", 6, 14, "A suicide bomber blows himself to Allah in an attack against a bus carrying oil ministry staff workers, taking six innocents with him and leaving fourteen others critically injured."], ["2005.09.26", "Iraq", "Muelha", 6, 0, "In a senseless attack, nine Sunni gunmen walk into an elementary school and drag five Shia teachers and their driver out of their classrooms, put them up against a wall and execute them."], ["2005.09.26", "Israel", "Ramallah", 1, 0, "The body of an Israeli factory worker is found after he is kidnapped, tortured and killed by Hamas."], ["2005.09.26", "Thailand", "Tonmaisoong", 1, 1, "A 54-year-old man is killed by Muslim terrorists while sitting in a tea shop."], ["2005.09.27", "Algeria", "Boukhil", 3, 1, "Three civilians are killed when Islamic fundamentalists blow a vehicle apart with an IED."], ["2005.09.27", "India", "Mendhar", 1, 0, "A Lashkar-e-Toiba terrorist uses a teenage girl as a human shield in a gun battle.  Both are killed."], ["2005.09.27", "Iraq", "Baqubah", 9, 21, "A suicide bomber kills himself and nine innocents in the process of applying for government jobs.  Twenty-one others are injured."], ["2005.09.27", "Iraq", "Kut", 22, 0, "The bodies of twenty-two victims of Islamic terror are found bound and executed outside a small town."], ["2005.09.27", "Thailand", "Pattani", 1, 0, "Islamic radicals gun down a school teacher."], ["2005.09.28", "Afghanistan", "Kabul", 9, 28, "Nine Afghans are killed outside a military training center by a suicide bomber on a motorbike.  Twenty-eight others are injured in the blast."], ["2005.09.28", "India", "Malad", 2, 1, "Hizb-ul-Mujahideen terrorists invade a home and take a family of four hostage during a shoot-out with police.  A mother and daughter are killed."], ["2005.09.28", "India", "Nasu", 2, 0, "A civilian is killed in his home by Islamic militants and another (in Thom Gali) is abducted and executed."], ["2005.09.28", "Iraq", "Tal Afar", 6, 30, "A female suicide bomber detonates a bomb packed with metal ball bearings in a crowd waiting outside a recruitment center.  Six are killed and many hurt."], ["2005.09.28", "Sudan", "Aro Sharow", 34, 10, "Thirty-four refugees are massacred by Arab militia on horseback at a camp.  Women and children are amply represented among the dead."], ["2005.09.29", "Chechnya", "Grozny", 3, 1, "Mujahideen gunmen open up on a car, killing two police officers and a 3-year-old girl.  The girl's mother suffered injury."], ["2005.09.29", "India", "Alal", 1, 0, "Islamic militants abduct a civilian and beat him to death."], ["2005.09.29", "India", "Srinagar", 0, 19, "Fifteen civilians and four security personnel are injured when a Muslim militant hurls a grenade into a crowd."], ["2005.09.29", "Indonesia", "Landangan", 1, 0, "A 43-year-old Christian is shot to death."], ["2005.09.29", "Iraq", "Baghdad", 4, 8, "In two attacks, Sunni gunmen machine-gun workers at a Shia bakery as well as a van carrying soccer-stadium employees.  Four people are murdered."], ["2005.09.29", "Iraq", "Balad", 99, 124, "About one-hundred people are massacred in three separate suicide attacks by Sunni fanatics.  Most were at a vegetable market or near a bank.  The third was near a clothing shop.  Many more are injured, most with burns - some with missing limbs."], ["2005.09.29", "Pakistan", "Angoor Adda", 1, 0, "A civilian has his throat slit by al-Qaeda militants."], ["2005.09.29", "Pakistan", "Karim Kut", 5, 0, "al-Qaeda terrorists stage an attack on a vehicle carrying government officials, killing five."], ["2005.09.29", "Thailand", "Narathiwat", 1, 1, "A fruit vendor is shot to death by Muslims, in an attack that also injures his 8-year-old daughter."], ["2005.09.30", "India", "Somboora", 2, 0, "The Mujahideen invade a home and kill a young girl.  Another civilian is killed elsewhere (Kulgam)."], ["2005.09.30", "Iraq", "Baghdad", 1, 0, "A transgender man is murdered by Islamic extremists earlier in the month."], ["2005.09.30", "Iraq", "Hilla", 9, 47, "Nine Shia civilians are blown to bits by a morning car bomb at a vegetable market.  Nearly fifty others are injured."], ["2005.09.30", "Sudan", "Darfur", 29, 10, "Janjaweed militia attack a camp for displaced persons, killing about thirty innocents."], ["2005.09.30", "Thailand", "Narathiwat", 2, 0, "Two Chinese street vendors are killed in a drive-by shooting by Islamists on motorcycles."], ["2005.09.30", "Thailand", "Pattani", 1, 0, "A Buddhist student is murdered by Islamists as he is riding home."], ["2005.09.30", "Thailand", "Yala", 1, 5, "Terrorists ambush a police patrol, killing one and injuring five."], ["2005.10.01", "Chechnya", "Grozny", 2, 0, "Two people are abducted and brutally murdered by the Mujahideen."], ["2005.10.01", "Chechnya", "Shatoi", 1, 2, "Jihad rebels blow apart a troop transport, killing one soldier and injuring two others."], ["2005.10.01", "Indonesia", "Bali", 19, 132, "Islamic suicide bombers murder nineteen people, mostly tourists, at two cafes and a restaurant in three coordinated attacks.  Over one-hundred are injured."], ["2005.10.02", "Bangladesh", "Atkhira", 2, 3, "Militants hurl homemade bombs at a group of civilians in a fish market, killing two and injuring three."], ["2005.10.02", "India", "Bhalna", 1, 0, "A civilian is murdered by a Harkat-ul-Jehad-i-Islami terrorist."], ["2005.10.02", "Pakistan", "Mir Ali", 3, 8, "al-Qaeda militants kill three Pakistani security personnel in a rocket attack."], ["2005.10.02", "Pakistan", "Zha Gundai", 1, 1, "The son of a pro-government tribal leader is gunned down by al-Qaeda militants."], ["2005.10.02", "Thailand", "Songkhla", 2, 3, "Two bomb squad inspectors are killed in a remote-controlled explosion courtesy of Islamic terrorists."], ["2005.10.03", "Bangladesh", "Laxmipu", 2, 40, "Members of Jamaat-ul-Mujahideen stage a series of bombing attacks that kill at least two people and injure forty."], ["2005.10.03", "India", "Shopian", 1, 0, "Terrorists abduct a civilian and murder him in captivity."], ["2005.10.03", "Indonesia", "Pantangolemba", 1, 0, "A 53-year-old Christian is shot to death."], ["2005.10.03", "Iraq", "Baghdad", 3, 2, "An attempted assassination of an oil minister leaves his two bodyguards dead.  A Jihad attack from the day before killed the director of public works."], ["2005.10.04", "Afghanistan", "Spin Boldak", 6, 16, "Six Afghans are killed by a Taliban bomb at a border crossing.  Sixteen others are injured."], ["2005.10.04", "India", "Budgam", 3, 0, "The Mujahideen kill two counter-insurgents in an attack and also abduct and kill a civilian in Kulgam."], ["2005.10.04", "Iraq", "Baghdad", 3, 6, "Ramadan in Iraq begins with a suicide car bombing inside the Green Zone that kills three people."], ["2005.10.05", "Afghanistan", "Kandahar", 1, 3, "A 'Holy Warrior for Allah' manages to kill a 10-year-old boy in a suicide bombing."], ["2005.10.05", "India", "Gumeri", 3, 0, "Hizb-ul-Mujahideen cadres enter a residence and kill a man along with his 21-year-old daughter and 16-year-old son.  Another son had been killed last year."], ["2005.10.05", "Iraq", "Hilla", 36, 95, "At least three dozen Shiites are killed and nearly one-hundred others injured by a suicide bomber at a mosque during a funeral service."], ["2005.10.05", "Thailand", "Yala", 1, 0, "A civilian is abducted and beheaded by Muslim terrorists."], ["2005.10.06", "Algeria", "Messila", 2, 0, "Two civilians are killed in a car bombing."], ["2005.10.06", "India", "Anantnag", 2, 0, "Two people are taken from their homes and murdered by the Mujahideen."], ["2005.10.06", "India", "Dooru", 1, 5, "Hizb-ul-Mujahideen terrorists detonate a bomb under a bank truck, killing the driver."], ["2005.10.06", "Iraq", "Baghdad", 2, 0, "Suicide bomber blows himself to Allah, taking two innocent women with him."], ["2005.10.06", "Iraq", "Baghdad", 10, 8, "Ten Iraqis riding a bus are blown to bits by a Fedayeen suicide bomber.  Eight others are badly injured."], ["2005.10.06", "Pakistan", "Datta Kheil", 3, 0, "al-Qaeda militants fire a rocket into a house, killing a man and his young son and daughter."], ["2005.10.06", "Thailand", "Narathiwat", 1, 10, "Two bombs are set off by Muslim terrorists at a restaurant, killing one and injuring ten."], ["2005.10.06", "Thailand", "Narathiwat", 5, 2, "Islamic militants shoot five Thai soldiers to death as they are eating dinner at a remote outpost."], ["2005.10.07", "Chechnya", "Vinogradnoye", 1, 0, "A policeman is murdered in his home by Jihadis."], ["2005.10.07", "India", "Briswana", 1, 0, "A civilian is killed inside his home by the Mujahideen."], ["2005.10.07", "India", "Sapore", 2, 6, "A small girl is among two killed by a Mujahideen grenade blast in a terror attack."], ["2005.10.07", "Iraq", "Kirkuk", 3, 11, "Jihadi car bomb kills three civilians."], ["2005.10.07", "Pakistan", "Mong", 8, 19, "Sectarian attack on a crowd of people by gunmen at a mosque for a minority Islamic group leaves eight dead and nineteen injured."], ["2005.10.07", "Thailand", "Yala", 1, 0, "Radicals kill the driver of a police chief."], ["2005.10.08", "Iraq", "Baghdad", 7, 16, "Fedayeen suicide bomber murders seven people on a city street.  Sixteen others are injured in the blast."], ["2005.10.08", "Thailand", "Pattani", 2, 0, "A Buddhist husband and wife are murdered on their way home by Islamic gunmen."], ["2005.10.08", "Thailand", "Yala", 1, 0, "A rubber tapper is gunned down by Islamic extremists."], ["2005.10.09", "Afghanistan", "Gerdiz", 1, 5, "A Taliban rocket attack leaves one person dead and five injured."], ["2005.10.09", "Algeria", "Algiers", 2, 0, "Members of the Salafist Group for Preaching and Combat storm a coffee house, where they slit the throats of two patrons."], ["2005.10.09", "Dagestan", "Makhachkala", 2, 0, "Two policemen are slain in a brutal assault by Islamic terrorists."], ["2005.10.09", "Iraq", "Baghdad", 13, 8, "Suicide bombings and other Sunni attacks across the country (and an incident in which a Shiite teacher was dragged out of his classroom and shot to death) leave thirteen Iraqis dead."], ["2005.10.09", "Iraq", "Basra", 2, 3, "A suicide bomber kills a woman and a child outside an apartment building."], ["2005.10.09", "Pakistan", "Miranshah", 3, 0, "al-Qaeda militants kill three Pakistani soldiers in a landmine blast."], ["2005.10.09", "Thailand", "Pattani", 1, 1, "A woman having dinner with her son is shot to death by Muslim radicals."], ["2005.10.10", "Afghanistan", "Helmand", 18, 4, "The Taliban ambush a police convoy in a remote area and slaughter eighteen officers."], ["2005.10.10", "Afghanistan", "Kandahar", 3, 5, "Three people are killed when a Taliban suicide bomber detonates his explosives along a city street."], ["2005.10.10", "Chechnya", "Zakan-Yurt", 2, 0, "A firefighter and a civilian are blown apart by a Muslim IED."], ["2005.10.10", "India", "Qazigund", 2, 2, "A young woman is killed inside her home by Muslim terrorists.  The same group also invades a second residence, killing a teenager."], ["2005.10.10", "India", "Rajnagar", 10, 1, "In two gruesome attacks, Hizb-ul-Mujahideen members swoop into two residences and slit the throats of ten Hindu family members.  Only one child is known to have survived."], ["2005.10.11", "Iraq", "Baghdad", 4, 0, "Four people are killed by a suicide bomber at a gas station."], ["2005.10.11", "Iraq", "Tal Afar", 30, 45, "A Fedayeen suicide bomber drives an explosives-laden car disguised as a taxi into a crowd of shoppers at a market, killing thirty and injuring forty-five."], ["2005.10.11", "Pakistan", "Gilgit", 1, 7, "Militant Muslims ambush a group of civilians, shooting one of them to death."], ["2005.10.11", "Pakistan", "Naurote", 1, 0, "Sectarian attack leaves a civilian dead."], ["2005.10.11", "Thailand", "Pattani", 1, 0, "Muslims kill a security volunteer."], ["2005.10.12", "Afghanistan", "Kandahar", 5, 3, "Taliban extremists murder five medical workers returning from a relief trip.  The dead include two doctors, two nurses and a driver."], ["2005.10.12", "Afghanistan", "Uruzgan", 6, 0, "Six policemen die in a Taliban ambush."], ["2005.10.12", "Egypt", "Alexandria", 0, 2, "A nun and one other person are stabbed in front of their church by a Muslim demonstrator."], ["2005.10.12", "India", "Hyderabad", 1, 1, "Suicide blast sponsored by Islamic terror groups kills one and injures another."], ["2005.10.12", "Iraq", "Tal Afar", 30, 35, "A second al-Qaeda suicide bombing in as many days leaves another thirty Iraqis dead and at least thirty-five others in various stages of physical suffering."], ["2005.10.12", "Philippines", "Pamatsakin", 3, 2, "Abu Sayyaf militants attack a security patrol, killing a civilian and two soldiers."], ["2005.10.13", "India", "Chowkian", 2, 1, "An elderly man is killed in his home by the Mujahideen in an attack that also injures his wife.  Another civilian is gunned down in Sambora."], ["2005.10.13", "Kabardino-Balk.", "Nalchik", 44, 64, "A coordinated urban attack by 150 Islamic militants on a school and airport leaves at least forty-four civilians and law enforcement personnel dead."], ["2005.10.13", "Pakistan", "Gilgit", 12, 25, "Twelve people, including three women, are killed in sectarian violence following a Shia demonstration."], ["2005.10.13", "Thailand", "Narathiwat", 1, 0, "A fruit trader is murdered by Islamists."], ["2005.10.14", "Afghanistan", "Miwand", 2, 13, "Two policemen are killed in an ambush by religious extremists."], ["2005.10.14", "Afghanistan", "Tani", 1, 16, "Religious extremists kill a cleric and injure sixteen others with a bombing at a mosque."], ["2005.10.14", "Thailand", "Narathiwat", 1, 0, "A 43-year-old electrician is gunned down by Islamists on a motorcycle while on his way to work."], ["2005.10.14", "Thailand", "Pattani", 1, 0, "Militant Muslims capture and behead a 68-year-old Buddhist cattle farmer."], ["2005.10.15", "Algeria", "Tizi Ouzou", 1, 0, "A civilian is murdered by an Islamic terrorist."], ["2005.10.15", "India", "Kathua", 2, 6, "Islamic militants attack a group of soldiers as they are performing physical exercises on their base."], ["2005.10.15", "Iraq", "Saqlawiyah", 5, 0, "Five U.S. Marines are killed by a terrorist bomb while responding to a mortar attack on a polling station."], ["2005.10.15", "Thailand", "Narathiwat", 3, 0, "Three Thai civilians are killed in three separate attacks across the southern provinces."], ["2005.10.16", "Afghanistan", "Lashkargah", 3, 0, "The Taliban assassinate a religious cleric and later open fire on a group of security personnel in a separate attack."], ["2005.10.16", "Algeria", "Algiers", 2, 3, "Religious fundamentalists in eastern Algerian storm a house and slit the throats of two of the occupants.  Three other family members are kidnapped."], ["2005.10.16", "Iran", "Ahvaz", 6, 80, "At least six people are killed by a mysterious bomb planted at a shopping center.  More than eighty bystanders are injured."], ["2005.10.16", "Israel", "Gush Etzion", 3, 5, "Three Israeli civilians, two young women and a 14-year-old boy, are gunned down in cold blood while waiting by the side of the road.  Five others are injured.  al-Aksa claims credit for the child killings."], ["2005.10.16", "Thailand", "Pattani", 3, 0, "Militant Muslims attack a Buddhist temple, slit the throat of a 76-year-old monk and brutally kill two teenage boys.  The bodies are subsequently burned."], ["2005.10.16", "Thailand", "Yala", 2, 0, "Two policemen guarding a railway station are gunned down by Islamists."], ["2005.10.17", "Iraq", "Baghdad", 1, 0, "al-Qaeda releases a video of a man with his hands tied behind his back being shot twice in the back of the head."], ["2005.10.17", "Iraq", "Samarrah", 2, 1, "Two people attending a funeral are killed by a Fedayeen suicide bomber, who wanders in amidst the mourners."], ["2005.10.17", "Thailand", "Narathiwat", 2, 0, "Two men are gunned down by Muslim militants in separate attacks."], ["2005.10.18", "Afghanistan", "Dand", 1, 0, "A school janitor is shot to death by the Taliban."], ["2005.10.18", "Algeria", "Jejil", 6, 0, "Five security guards and a civilian are killed when Islamic fundamentalists open fire at a checkpoint."], ["2005.10.18", "Bangladesh", "Narsingdi", 1, 0, "A Hindu priest is kidnapped and murdered by Islamic extremists."], ["2005.10.18", "Dagestan", "Khasavyurt", 1, 3, "Islamic militants kill a policeman and injure two others in a shootout."], ["2005.10.18", "India", "Srinagar", 4, 3, "Lashker-e-Toiba terrorists barge into the home of a government minister in a suicide attack that leaves him, a security guard and two civilians dead."], ["2005.10.18", "Iraq", "Baghdad", 7, 11, "A Jihad attack on a police checkpoint leaves four Iraqis dead.  Three civilians are gunned down in a residential neighborhood elsewhere in the city."], ["2005.10.18", "Thailand", "Narathiwat", 1, 0, "A villager is murdered by Muslim militants while standing in his yard."], ["2005.10.19", "Afghanistan", "Panjwayi", 1, 0, "An anti-Taliban government official is gunned down while praying in a mosque."], ["2005.10.19", "Afghanistan", "Panjwayi", 2, 0, "The headmaster of a school is executed in front of his students.  A guard at a different school is also killed and his body is dumped in a stream."], ["2005.10.19", "India", "Pampore", 2, 10, "Two civilians are killed in a Mujahideen attack that also leaves ten others injured."], ["2005.10.19", "Iraq", "Baghdad", 3, 0, "Three election workers are killed by Jihadis while driving home after counting ballots."], ["2005.10.19", "Iraq", "Iskandariya", 6, 0, "Sunni gunmen barge into a factory, identify six Shia workers, then line the men up against a wall and kill them in front of their co-workers."], ["2005.10.19", "Pakistan", "Wana", 1, 0, "al-Qaeda militants abduct and kill a pro-government tribal chief."], ["2005.10.19", "Thailand", "Paluru", 1, 0, "Islamic militants kill a 28-year-old woman riding on the back of a motorcycle."], ["2005.10.20", "Afghanistan", "Faryab", 1, 3, "Religious extremists kill a humanitarian worker."], ["2005.10.20", "Chechnya", "Elistanzhi", 3, 3, "Islamists fire at a group of civilians fishing, killing three."], ["2005.10.20", "India", "Dardkoot", 1, 0, "A man is abducted from his home by militant Muslims and killed in captivity."], ["2005.10.20", "India", "Nalli Dillo", 1, 0, "A shepherd is killed by the Mujahideen as he is grazing in the field."], ["2005.10.20", "Iraq", "Baghdad", 3, 5, "A small girl is among three people killed when Jihadis fire a rocket at a school.  Five other children are injured."], ["2005.10.20", "Iraq", "Baqubah", 4, 14, "A Fedayeen suicide car bomber kills four civilians and causes injury to at least fourteen others."], ["2005.10.20", "Thailand", "Narathiwat", 2, 0, "A 60-year-old man is shot to death in front of a school in a motorcycle attack.  Muslims also kill another civilian in Yala."], ["2005.10.21", "Afghanistan", "Helmand", 9, 0, "Nine policemen are killed in a Taliban ambush on their patrol."], ["2005.10.21", "Afghanistan", "Khost", 1, 3, "The Taliban kill an Afghan journalist with a remote-controlled bomb."], ["2005.10.21", "Afghanistan", "Nimroz", 2, 5, "The Taliban kill a police chief and at least one other person with a remote-controlled bomb outside a mosque."], ["2005.10.21", "India", "Ratnipora", 1, 0, "A political activist is killed inside his residence by the Mujahideen."], ["2005.10.21", "India", "Srinagar", 1, 14, "Fourteen people are injured, and one civilian killed, when an Islamic militant hurls a grenade at a crowd outside a hotel."], ["2005.10.23", "Bangladesh", "Khulna", 1, 0, "Jamaat-ul-Mujahideen suspected of bombing that kills a party leader."], ["2005.10.23", "England", "Birmingham", 1, 1, "Pakistanis stab a 24-year-old Christian man senselessly to death in what is either a racial or religious attack."], ["2005.10.23", "India", "Srinagar", 2, 0, "Jaish-e-Mohammed members attack and kill two policemen at a market."], ["2005.10.23", "India", "Wadwal", 3, 1, "Islamic terrorists open fire on a group of security personnel, killing three."], ["2005.10.23", "Iraq", "Baghdad", 4, 11, "A suicide bomber kills two civilians and two police officers."], ["2005.10.23", "Iraq", "Kirkuk", 2, 13, "Two civilians are killed by a suicide bomber.  Thirteen others are injured."], ["2005.10.23", "Iraq", "Taji", 3, 0, "Three Iraqis are shot to death by Sunni insurgents while driving a water truck."], ["2005.10.23", "Iraq", "Tikrit", 5, 0, "Jihadis murder two young boys riding in a car, as well as two girls, ages 7 and 9, who were standing by the car when the remote-controlled device was detonated."], ["2005.10.23", "Lebanon", "Ein el-Hilweh", 1, 3, "Fatah gunmen kill a government contractor."], ["2005.10.23", "Pakistan", "North Waziristan", 1, 2, "A terrorist shoots at a group of three men at a bazaar, killing one."], ["2005.10.23", "Thailand", "Pattani", 1, 0, "In a brutal attack, Muslims force a Buddhist man into a burning car."], ["2005.10.24", "Afghanistan", "Kandahar", 2, 6, "Two workers for a British agency working to clear landmines are killed in a bomb attack by religious extremists."], ["2005.10.24", "Canada", "Montreal, QB", 1, 0, "A 'scholar of Islam' stabs his apostate brother to death over heresy."], ["2005.10.24", "India", "Puchhal", 1, 0, "A man is killed inside his home after failing to heed the warning posters at a local mosque."], ["2005.10.24", "Iraq", "Baghdad", 14, 5, "Three separate incidents include the discovery of eight bound and executed victims, a suicide car bomb that kills two civilians, and a shooting ambush that kills three municipal workers and a passerby."], ["2005.10.24", "Iraq", "Baghdad", 20, 40, "Twenty passersby are massacred by three coordinated suicide attacks against a hotel.  The bombs were packed with ball-bearings to maximize human suffering."], ["2005.10.24", "Iraq", "Hilla", 12, 1, "Terrorists execute twelve people working at a construction site.  Five of the victims were brothers."], ["2005.10.24", "Pakistan", "Ladha", 1, 11, "al-Qaeda militants kill the driver of a military truck with a remote-controlled bomb."], ["2005.10.24", "Thailand", "Pattani", 1, 3, "Muslim gunmen shoot a villager to death and injure three more."], ["2005.10.25", "Afghanistan", "Jalalabad", 1, 2, "The Taliban opens fire on a police vehicle, killing an instructor and injuring two others."], ["2005.10.25", "Afghanistan", "Kabul", 4, 3, "A child is among four civilians killed by Taliban extremists in a rocket attack on a convoy of cars."], ["2005.10.25", "Algeria", "Medea", 1, 1, "Islamic fundamentalists shoot into a group of civilians, killing one."], ["2005.10.25", "Algeria", "Medea", 2, 3, "In separate attacks, Islamic fundamentalists kill two people at a coffee house and a nearby market."], ["2005.10.25", "India", "Srinagar", 0, 9, "Nine people are injured when a Jaish-e-Mohammed cadre lobs a grenade into a street."], ["2005.10.25", "Iraq", "Baghdad", 1, 9, "Sunni insurgents kill a 7-year-old boy by the side of the road with a bomb that also injured nine other pedestrians."], ["2005.10.25", "Iraq", "Sulaimaniyah", 9, 4, "Nine civilians are killed by a Fedayeen suicide bomber on a city street."], ["2005.10.25", "Lebanon", "Helweh", 1, 0, "Fatah Uprising terrorists kill a Lebanese army contractor."], ["2005.10.25", "Thailand", "Yala", 1, 0, "Muslims stab a Buddhist man multiple times, and eventually kill him by slitting his throat."], ["2005.10.26", "Algeria", "Batna", 1, 0, "Religious fundamentalists slit the throat of a 70-year-old shepherd."], ["2005.10.26", "Algeria", "Skikda", 3, 0, "Two civilians are among three killed by the Salafist Group for Preaching and Combat."], ["2005.10.26", "India", "Mundana", 2, 0, "Two security personnel are slain in a brutal ambush by Muslim terrorists."], ["2005.10.26", "India", "Omarabad", 0, 30, "About thirty people are injured when Hizb-ul-Mujahideen target a bus with an IED."], ["2005.10.26", "Ingushetia", "Nazran", 4, 1, "Muslim militants ambush a vehicle carrying Russians, shooting four to death in the attack."], ["2005.10.26", "Israel", "Hadera", 5, 30, "A suicide bomber from Islamic Jihad murders five Israelis in front of a food stand in a public area."], ["2005.10.26", "Pakistan", "Quetta", 1, 0, "A Shia teacher is gunned down on his way to school by radical Sunnis."], ["2005.10.26", "Thailand", "Narathiwat", 9, 10, "Nine people are killed in a series of attacks by militant Islamists."], ["2005.10.27", "India", "Ganethi", 2, 0, "A Mujahideen ambush on a security patrol leaves two dead."], ["2005.10.27", "Iraq", "Baghdad", 1, 9, "A Fedayeen suicide bomber kills a civilian and injured nine others."], ["2005.10.27", "Iraq", "Nahrawan", 15, 14, "Sectarian violence in the form of a Sunni on Shia ambush claims the lives of fifteen."], ["2005.10.27", "Pakistan", "Kot Langarkhel", 1, 11, "al-Qaeda-linked tribesmen target a military vehicle with a landmine, killing one."], ["2005.10.28", "Afghanistan", "Helmand", 3, 0, "The Taliban ambush a civilian vehicle, killing two brothers and one of their sons."], ["2005.10.28", "Afghanistan", "Paktika", 3, 0, "Two men are dragged out a mosque and executed by Taliban extremists.  A tribal leader in nearby Khost is also shot to death."], ["2005.10.28", "India", "Shabga", 6, 0, "Six members of a family are hacked to death in an honor killing."], ["2005.10.28", "Thailand", "Narathiwat", 1, 0, "Islamic militants disguised as fully-veiled women shoot a local religious leader to death from the back of a motorcycle."], ["2005.10.29", "India", "New Delhi", 62, 155, "Three coordinated blasts that tear through a bus and two markets crowded with people celebrating a Hindu festival bear all the hallmarks of the Religion of Peace.  An Islamic group claims responsibility."], ["2005.10.29", "Indonesia", "Bukit Bambu", 3, 1, "Three Christian 16-year-old girls on their way to school are attacked and beheaded by six Muslim gentlemen, who leave the headless bodies in the street and carry the heads to a different location."], ["2005.10.29", "Iraq", "Howaider", 31, 42, "In a particularly heinous attack, an Islamist suicide bomber disguises an explosives-laden truck as a produce vendor, gathers ordinary customers around it, then detonates, killing at least thirty innocents."], ["2005.10.29", "Thailand", "Yala", 1, 0, "Islamic radicals kill a man herding goats."], ["2005.10.30", "Algeria", "Boumerdes", 2, 0, "Two civilians are shot to death by Islamic fundamentalists.  One was a child."], ["2005.10.30", "Algeria", "al-Taheer", 1, 7, "Islamic fundamentalists attack a police patrol in a small town, killing one officer and injuring seven people, including civilians."], ["2005.10.30", "India", "Batpora Harwan", 1, 0, "A civilian is abducted and executed by the Mujahideen."], ["2005.10.30", "India", "Kanji", 1, 0, "The Mujahideen murder a civilian defense volunteer in his village."], ["2005.10.30", "Iraq", "Baghdad", 5, 9, "Jihad attacks on an oil tanker and a construction site kill four laborers and a government driver."], ["2005.10.31", "Algeria", "Baghlia", 1, 0, "A civilian standing on a city street is gunned down in a suspected Islamist attack."], ["2005.10.31", "Iraq", "Baghdad", 4, 5, "Four employees working at an oil company are killed in a rocket attack by Jihadis."], ["2005.10.31", "Iraq", "Basra", 18, 59, "Eighteen shoppers are killed when Islamic insurgents detonate a car bomb in a crowded market area.  About fifty others are injured."], ["2005.10.31", "Iraq", "Tal Afar", 14, 0, "Fourteen bound and tortured corpses are found in the former Islamist stronghold.  Two were decapitated."], ["2005.10.31", "Nigeria", "Niger Province", 3, 13, "Three Christians are killed by Muslims in unrest following the carrying out of a Sharia sentence of amputation against a Christian."], ["2005.10.31", "Thailand", "Pattani", 1, 3, "A villager is shot and killed by terrorists in a shooting attack."], ["2005.10.31", "Thailand", "Yala", 1, 0, "A cop is gunned down by Jihadis on his way home."], ["2005.10.31", "Yemen", "Munabbah", 12, 0, "Islamists ambush and kill twelve Yemeni policemen as they are traveling through a remote town."], ["2005.11.01", "India", "Lamad-Bernai", 1, 1, "Two civilians are abducted by the Mujahideen.  One is strangled.  The other is still missing."], ["2005.11.01", "Thailand", "Narathiwat", 1, 0, "A civilian is murdered by Islamists."], ["2005.11.02", "Afghanistan", "Bahramshah", 5, 0, "A drug-fighting police unit is surprised by the Taliban, who take five officers prisoner, then cut off their heads."], ["2005.11.02", "Chechnya", "Grozny", 1, 1, "Jihadis use a landmine to kill a member of an engineering squad."], ["2005.11.02", "India", "Srinagar", 10, 18, "Jaish-e-Mohammed kill a 10-year-old boy, a woman, and at least eight others with a suicide bombing in a residential neighborhood."], ["2005.11.02", "Iraq", "Jurf al Naddaf", 5, 6, "Five Iraqis in a private minibus are killed in a Jihadi roadside bombing attack."], ["2005.11.02", "Iraq", "Musayyib", 23, 46, "Twenty-three Shiites are killed when a minibus packed with explosives is detonated next to a mosque and a busy market."], ["2005.11.02", "Israel", "Kafr Mirka", 1, 0, "An Israeli soldier is shot in the head by Palestinian gunmen while making an arrest.  Soldiers noticed suspicious movement nearby, but hesitated for fear of hitting civilians."], ["2005.11.02", "Thailand", "Narathiwat", 2, 3, "Two men are killed in a Jihadi bombing."], ["2005.11.02", "Thailand", "Pattani", 1, 0, "A fisherman is shot to death by Islamic extremists."], ["2005.11.02", "Thailand", "Yala", 1, 0, "A 32-year-old man is shot to death by Muslim militants as he is riding a motorcycle."], ["2005.11.03", "Thailand", "Narathiwat", 1, 0, "A teenager is shot to death by Muslim gunmen."], ["2005.11.03", "Thailand", "Pattani", 1, 0, "Muslim extremists behead a Buddhist monk."], ["2005.11.04", "Iraq", "Baghdad", 9, 2, "Two Jihad attacks kill four, including a 10-year-old girl.  Her mother and another child were seriously injured.  Five policemen are killed in a separate bombing south of Kirkuk."], ["2005.11.04", "Iraq", "Bores", 9, 11, "A brutal ambush on a police checkpoint by Islamic insurgents dressed as women leaves nine officers and eleven injured."], ["2005.11.04", "Thailand", "Narathiwat", 1, 1, "Muslim separatists murder a civilian."], ["2005.11.04", "Thailand", "Yala", 1, 0, "A villager is gunned down for no apparent reason by Muslim radicals."], ["2005.11.05", "India", "Rajwar", 1, 0, "A villager is gunned down by the Mujahideen."], ["2005.11.05", "Iraq", "Balad Ruz", 13, 3, "Sunni insurgents machine-gun an infant to death along with twelve other Shia family members as they are returning from a minibus trip to a family cemetery."], ["2005.11.05", "Pakistan", "Mir Ali", 3, 0, "Three children are killed by an al-Qaeda bomb that explodes prematurely."], ["2005.11.05", "Thailand", "Narathiwat", 2, 0, "Two Buddhist rubber tappers are slain by Muslim gunmen."], ["2005.11.06", "India", "Kashmir", 3, 1, "Terrorists shoot three villagers to death in separate attacks (Chakras, Batapora Sopore, Kulgam)"], ["2005.11.06", "Iraq", "Baghdad", 3, 7, "Car bomb on a city street kills three civilians and injures seven."], ["2005.11.06", "Iraq", "Kut", 21, 0, "Eleven bodies are found in Kut, five of which were beheaded.  Ten others are found outside Baghdad to days later, bound and showing signs of torture."], ["2005.11.07", "Afghanistan", "Uruzgan", 2, 0, "The Taliban abduct and behead two villagers."], ["2005.11.07", "France", "Paris", 1, 0, "A 61-year-old retiree is beaten to death by Muslim youth for trying to extinguish a fire that they started."], ["2005.11.07", "India", "Indergam", 1, 0, "The Mujahideen gun down a civilian in an apple orchard."], ["2005.11.07", "India", "Quil Muqam", 2, 0, "Two civilians are killed in a Mujahideen bombing."], ["2005.11.07", "Iraq", "Baghdad", 5, 0, "A Fedayeen suicide bomber kills four U.S. soldiers on security patrol along with their civilian translator."], ["2005.11.07", "Iraq", "Baghdad", 9, 10, "A suicide car bomber kills nine Iraqis and injures ten."], ["2005.11.07", "Somalia", "Mogadishu", 1, 0, "Muslim terrorists spray a car with bullets, killing the driver."], ["2005.11.07", "Sudan", "Darfur", 18, 16, "Arab militias attack a series of villages, killing at least eighteen people."], ["2005.11.07", "Thailand", "Yala", 2, 0, "Muslim militants kill a villager and a Buddhist policeman in coordinated attacks."], ["2005.11.07", "Thailand", "Yala", 6, 2, "Six people are murdered in a series of coordinated attacks by Muslim terrorists."], ["2005.11.08", "India", "Larkuti", 2, 0, "Lashkar-e-Toiba terrorists invade the home of a council member's brother and sister-in-law to shoot both people to death."], ["2005.11.08", "India", "Lawaypora", 1, 19, "The Mujahideen bomb a security patrol, injuring twenty people, one of whom later succumbs to his injuries."], ["2005.11.08", "Indonesia", "Poso", 1, 1, "Two Christian 17-year-old girls are shot in the head in a brutal attack only a few days after three others were beheaded."], ["2005.11.08", "Iraq", "Basra", 3, 0, "In two attacks, a journalist is shot to death by Islamic militants and a member of the Iraqi security forces is killed in a bombing along with his brother."], ["2005.11.08", "Iraq", "Kirkuk", 7, 3, "Six bound and executed corpses are discovered on the same day that Sunni insurgents kill a policeman with a car bomb."], ["2005.11.08", "Iraq", "Mustansiriyah", 1, 1, "A car bomb explodes at a university, killing one civilian."], ["2005.11.08", "Thailand", "Narathiwat", 3, 0, "Three civilians, including a food vendor and newspaper editor, are shot to death by Muslim radicals in separate attacks."], ["2005.11.09", "Afghanistan", "Shah Wali Kot", 7, 2, "Seven policemen are killed in an ambush by religious extremists along a remote road.  Two others are abducted."], ["2005.11.09", "India", "Tral", 1, 0, "A civilian is gunned down by the Mujahideen in his village."], ["2005.11.09", "Iraq", "Baghdad", 6, 31, "Two Sunni car bombs detonate outside a Shiite mosque, killing six people and injuring thirty-one.  Woman and children are among the casualties."], ["2005.11.09", "Iraq", "Baqubah", 7, 9, "Suicidal Sunni straps explosives to his body and kills three civilians and four policemen on patrol.  Nine other people are injured."], ["2005.11.09", "Jordan", "Amman", 56, 115, "Three coordinated and horrific suicide bombings target hotels, including Days Inn and the Grand Hyatt.  The worst damage was at the Radisson, where an al-Qaeda bomber walked into a wedding party and killed dozens, including several children."], ["2005.11.09", "Thailand", "Narathiwat", 1, 1, "A Buddhist businessman is murdered, and his teenage son injured, by Muslim gunmen."], ["2005.11.10", "Afghanistan", "Helmand", 3, 0, "A former district chief and two others are killed in separate Taliban attacks."], ["2005.11.10", "India", "Nadihal-Bandipora", 1, 0, "A teacher is shot to death by Islamic militants."], ["2005.11.10", "Iraq", "Baghdad", 33, 24, "Two suicide bombers target a packed restaurant, slaughtering over thirty people.  The vast majority of the casualties are civilian."], ["2005.11.10", "Iraq", "Kirkuk", 7, 13, "Seven Iraqis standing outside a recruiting center are killed in a Sunni car bombing.  Thirteen others are injured."], ["2005.11.10", "Pakistan", "Brabcha", 6, 6, "Six members of the same family are killed in an al-Qaeda landmine blast.  Six others sustain injury."], ["2005.11.11", "Afghanistan", "Khost", 1, 5, "The Taliban attack a police station killing one officer and injuring five others."], ["2005.11.11", "Algeria", "Beni Boussaid", 1, 4, "Fundamentalists fire on a group of vacationers, killing one."], ["2005.11.11", "India", "Pulwama", 1, 0, "A congressional party activist is murdered by Muslim militants."], ["2005.11.11", "Iraq", "Baghdad", 2, 4, "Drive-by shooting on the Oman embassy by Jihadis leaves two workers dead and four injured."], ["2005.11.12", "Afghanistan", "Helmand", 3, 0, "Three policemen are kidnapped by Taliban extremists, then shot to death in captivity."], ["2005.11.12", "India", "Raipora", 2, 3, "A 16-year-old is among two people killed in an encounter with the Hizb-ul-Mujahideen."], ["2005.11.12", "Iraq", "Baghdad", 4, 1, "Four bodies are found, tortured and bound, along with one survivor."], ["2005.11.12", "Iraq", "Baghdad", 8, 12, "At least one car bomb goes off in a marketplace, killing eight shoppers, including an 8-year-old girl."], ["2005.11.12", "Philippines", "Jolo", 1, 0, "A 26-year-old photojournalist is shot in the head by Abu Sayyaf militants."], ["2005.11.12", "Philippines", "Jolo", 3, 12, "Three Filipino soldiers are killed in an ambush by Abu Sayyaf militants and the shootouts that follow."], ["2005.11.12", "Thailand", "Narathiwat", 1, 0, "A man is murdered in front of his home by Islamic gunmen."], ["2005.11.12", "Thailand", "Narathiwat", 1, 0, "Militant Muslims gun down a school teacher."], ["2005.11.13", "Somalia", "Mogadishu", 4, 5, "Islamic fundamentalists fire into the lobby of a cinema, killing four civilians."], ["2005.11.13", "Thailand", "Pattani", 3, 0, "Three civilians, including a teacher, are gunned down over the weekend by Muslim extremists."], ["2005.11.14", "Afghanistan", "Kabul", 9, 7, "Two suicide bombings kill nine people and injure seven others."], ["2005.11.14", "Bangladesh", "Jhalokathi", 2, 0, "Jamatul Mujahideen extremists hurl a bomb at a car carrying two judges, killing them both."], ["2005.11.14", "India", "Gulbug Ratnipora", 1, 0, "A 22-year-old woman is killed inside her home by the Mujahideen."], ["2005.11.14", "India", "Srinagar", 4, 14, "Islamic militants attack people in a business district, near hotels.  Four people are killed and fourteen others injured."], ["2005.11.14", "Iraq", "Baghdad", 2, 3, "Two South Africans are killed and three other foreigners wounded in a terrorist attack on their SUV."], ["2005.11.14", "Iraq", "Baghdad", 3, 4, "At least three people are killed when Islamic terrorists detonate a roadside bomb in a busy commercial district."], ["2005.11.14", "Iraq", "Ramadi", 6, 30, "Six civilians are killed when Jihadis bomb two passenger buses.  Over thirty others are injured."], ["2005.11.14", "Thailand", "Pattani", 3, 1, "Islamists walk into a grocery store and murder the husband and wife owners.  Their 10-year-old boy escapes.  Two Buddhist highway workers are shot in a separate attack."], ["2005.11.15", "Afghanistan", "Paktika", 5, 2, "Five Afghan police are killed in a landmine attack by Taliban extremists."], ["2005.11.15", "Chechnya", "Grozny", 2, 0, "Two policemen are kidnapped and murdered by the Religion of Peace."], ["2005.11.15", "India", "Tangmarg", 7, 90, "al-Arifeen claims responsibility for a grenade attack on a political rally.  Seven people are killed, including a 12-year-old, and about ninety injured."], ["2005.11.15", "Iraq", "Baghdad", 2, 7, "Two policemen are killed by a bomb.  Two small girls are among the injured."], ["2005.11.15", "Iraq", "Kirkuk", 7, 3, "Seven Iraqis are killed in two separate attacks by Jihadis."], ["2005.11.15", "Pakistan", "Karachi", 3, 12, "A firebomb goes off inside a fast-food restaurant, then a car bomb detonates nearby.  Three people are killed and about a dozen injured.  (Identity unclear)."], ["2005.11.15", "Thailand", "Narathiwat", 1, 0, "A man working in a rice field is shot three times by two Islamists who stop him under the pretense of asking directions."], ["2005.11.16", "Afghanistan", "Kandahar", 3, 6, "At least three civilians are killed by a suicide car bomber.  Another six are injured."], ["2005.11.16", "India", "Awantipora", 2, 3, "Muslim militants attack a security convoy, killing two and injuring three."], ["2005.11.16", "India", "Srinagar", 6, 48, "Lashkar-e-Taiba sets off a car bomb in the heart of a business district, killing at least four people and injuring over forty."], ["2005.11.16", "Thailand", "Narathiwat", 2, 0, "Two Buddhists are murdered by Muslim extremists in separate shooting attacks."], ["2005.11.16", "Thailand", "Narathiwat", 9, 9, "A man, woman and seven children, including an infant are slaughtered in their home by ten Islamic militants with assault rifles."], ["2005.11.17", "India", "Lancha", 2, 0, "Two cousins are killed inside their home by the Hizb-ul-Mujahideen."], ["2005.11.17", "Ingushetia", "Malgobek", 2, 1, "Islamic gunmen suspected in attack on a group of policemen."], ["2005.11.17", "Iraq", "Baghdad", 1, 0, "Jihad gunmen kill a doctor inside his clinic."], ["2005.11.17", "Thailand", "Narathiwat", 1, 0, "A villager is murdered in front of a tea shop by militant Muslims."], ["2005.11.18", "Afghanistan", "Kabul", 1, 3, "A Portuguese peacekeeper is killed in a Taliban landmine attack on his vehicle."], ["2005.11.18", "Indonesia", "Palu", 1, 1, "Machete-wielders attack and nearly decapitate a 23-year-old cosmetics salesgirl. Her 20-year-old companion's left arm is nearly hacked off as well."], ["2005.11.18", "Indonesia", "Poso", 1, 1, "One woman dies after a machete attack by militant Muslims."], ["2005.11.18", "Iraq", "Baghdad", 8, 40, "Two synchronized suicide car bombs near a hotel kill at least eight people and injure about forty."], ["2005.11.18", "Iraq", "Khanaqin", 74, 85, "Seventy-four worshippers at two Shia mosques are slaughtered by two Sunni suicide bombers.  At least eighty others are injured amidst the carnage."], ["2005.11.18", "Sweden", "Hogsby", 1, 0, "A 20-year-old man is beaten with an iron bar, doused with oil and stabbed 23 times by the family of his lover in an honor killing."], ["2005.11.19", "Afghanistan", "Helmand", 3, 0, "The Taliban blow-up a vehicle carrying three Afghans.."], ["2005.11.19", "Chechnya", "Chechen-Aul", 1, 0, "A civilian is kidnapped and murdered by the Mujahideen."], ["2005.11.19", "Indonesia", "Palu", 0, 2, "Christian couple shot by radical Muslims while on their way to church."], ["2005.11.19", "Iraq", "Abu Saida", 36, 50, "A suicide car bomber blows himself to Allah after plowing in a Shia funeral procession.  Thirty-six innocents are killed and at least fifty others injured."], ["2005.11.19", "Iraq", "Baghdad", 13, 21, "A car bombing at a popular market leaves thirteen shoppers dead and at least fifteen others injured."], ["2005.11.19", "Iraq", "Haditha", 15, 0, "A bombing and shooting ambush by Jihad fighters leaves fifteen civilians dead and an unknown number wounded."], ["2005.11.20", "Iraq", "Basra", 1, 4, "Terrorists kill a British soldier in a roadside bombing attack."], ["2005.11.20", "Thailand", "Narathiwat", 0, 3, "Islamic gunmen attempt to kill three people, including a pregnant milk vendor in drive-bys."], ["2005.11.20", "Thailand", "Sungai Kolok", 0, 12, "Twelve people, including a 2-year-old boy, are injured by two bombs at a market.  One was hidden in a fruit basket."], ["2005.11.21", "India", "Sopore", 1, 1, "A Muslim extremist shoots a man to death in a residential area, then lobs a grenade at another house, injuring a woman."], ["2005.11.21", "India", "Srinagar", 0, 10, "Ten people, including eight civilians, are injured in a Mujahideen grenade attack on a city street."], ["2005.11.21", "Iraq", "Baghdad", 4, 0, "Four Christian women are killed when gunmen storm their home in the middle of the night."], ["2005.11.21", "Iraq", "Kanaan", 5, 14, "Roadside terrorist blast kills five civilians and injures fourteen others."], ["2005.11.21", "Israel", "Metulla", 0, 12, "Eleven Israeli soldiers and one civilian are injured by a Hezbollah attack in northern Israel."], ["2005.11.21", "Thailand", "Yala", 3, 2, "Armed Muslim extremists rampage though a Buddhist village, killing at least three residents."], ["2005.11.22", "Iran", "Gonbad-e-Kavus", 1, 0, "A Muslim convert to Christianity is stabbed to death by radical Islamists after being abducted from his home."], ["2005.11.22", "Iraq", "Kirkuk", 18, 28, "Jihadis kill eighteen innocents in a suicide bombing, including four policemen who were lured to the scene after the gunmen injured one of their own as bait."], ["2005.11.22", "Thailand", "Narathiwat", 1, 1, "A man is killed in his home by Muslim militants, who also shoot his wife to keep her from getting help."], ["2005.11.22", "Thailand", "Yala", 1, 0, "A village chief is shot eight times by Muslim militants as he returns home."], ["2005.11.23", "Afghanistan", "Charchino", 3, 0, "Three unarmed policemen are gunned down with Kalashnikovs while walking home after work."], ["2005.11.23", "Afghanistan", "Nimroz", 1, 0, "The Taliban behead an Indian engineer that was captured the week before."], ["2005.11.23", "India", "Ashminder Pulwama", 1, 0, "The Mujahideen abduct a man from his home and strangle him."], ["2005.11.23", "India", "Doda", 1, 0, "A civilian who was injured in a terrorist ambush a few days earlier, succumbs to his injuries."], ["2005.11.23", "India", "Srinagar", 3, 4, "Three policemen are killed in a Fedayeen grenade and small arms attack on a former cinema used as a security post in a downtown area."], ["2005.11.23", "Iraq", "Baghdad", 5, 0, "A pro-election sheik, his three sons, and a son-in-law are killed by radicals, who invade the home in the middle of the night to shoot the victims."], ["2005.11.23", "Iraq", "Baqubah", 1, 1, "A civilian is killed in a roadside terrorist bombing."], ["2005.11.23", "Philippines", "Sulu", 1, 2, "A Philippine solider is killed by Abu Sayyaf."], ["2005.11.23", "Thailand", "Narathiwat", 1, 0, "A 4-year-old child is shot to death by Muslim extremists."], ["2005.11.24", "Afghanistan", "Khogyani", 2, 2, "A bomb hidden in a car kills two people and injures two others."], ["2005.11.24", "India", "Surankote", 2, 2, "Muslim militants throw a grenade into a family's house, killing a 3-year-old girl and her sister."], ["2005.11.24", "Iraq", "Baghdad", 4, 0, "An attempted ambush assassination by Jihadis leaves four innocents dead."], ["2005.11.24", "Iraq", "Baghdad", 4, 0, "Four policemen are killed by radical Sunnis while on patrol."], ["2005.11.24", "Iraq", "Hilla", 11, 17, "Terrorists target patrons at a soft drink stand with a car bomb, killing eleven and injuring seventeen."], ["2005.11.24", "Iraq", "Mahmoudiya", 30, 35, "Women and children are amply represented among more than thirty people blown to bits by a \"Holy Warrior\" suicide bomber near a hospital."], ["2005.11.24", "Thailand", "Narathiwat", 1, 4, "Islamic militants spray a tea shop with automatic weapons, killing a patron and injuring four others."], ["2005.11.24", "Thailand", "Pattani", 1, 0, "A 42-year-old man is gunned down by Islamists on his way to work."], ["2005.11.25", "Afghanistan", "Mazar-e-Sharif", 1, 3, "A Swedish peacekeeper dies in a bomb attack."], ["2005.11.25", "India", "Handwara", 1, 0, "A civilian is gunned down by the Mujahideen."], ["2005.11.25", "Iraq", "Hawija", 4, 0, "In a brutal attack, Jihadis ambush and kill two off-duty Iraqi soldiers and their wives."], ["2005.11.26", "Afghanistan", "Helmand", 1, 0, "A civilian is gunned down by the Taliban."], ["2005.11.26", "Afghanistan", "Sharana", 1, 0, "A government official is killed by a sustained Taliban rocket attack on public buildings."], ["2005.11.26", "Iraq", "Baghdad", 1, 3, "An election worker is killed while hanging campaign posters."], ["2005.11.26", "Iraq", "Baghdad", 4, 0, "Four civilians are killed by Islamic terrorists in a car bomb attack."], ["2005.11.26", "Iraq", "Samarrah", 6, 12, "A Fedayeen suicide bomber drives his explosives-laden pickup truck into a crowded gas station, incinerating six innocents."], ["2005.11.26", "Thailand", "Narathiwat", 1, 0, "Muslim terrorists shoot a man to death in his rice paddy."], ["2005.11.27", "Iraq", "Baghdad", 2, 4, "Islamic gunmen shoot two members of a pro-government news channel to death.  Four others are injured."], ["2005.11.27", "Iraq", "Baqubah", 2, 1, "Roadside bomb kills a civilian.  In Hawija, Islamists kidnap and behead a former Army cook."], ["2005.11.27", "Iraq", "Rustomia", 7, 0, "Seven bodies are discovered over a 24-hour period."], ["2005.11.27", "Thailand", "Narathiwat", 1, 0, "A husband is gunned down in front of his wife in an attack by Islamic extremists."], ["2005.11.28", "Chechnya", "Pamyatoi", 1, 0, "Government official is assassinated by Jihadis in an ambush on his vehicle."], ["2005.11.28", "India", "Bandipore", 2, 0, "Jamiat-ul-Mujahideen terrorists stop a car carrying a local official then execute him and his cousin."], ["2005.11.28", "Iraq", "Abu Ghraib", 4, 0, "Four men, including a legislator are shot to death in a brutal Jihadi assassination."], ["2005.11.28", "Iraq", "Baghdad", 3, 3, "Three British citizens are murdered when a bus carrying Shia pilgrims is attacked by Sunnis."], ["2005.11.28", "Yemen", "Sadah", 8, 0, "Radical Shiites kill eight policemen in a series of attacks."], ["2005.11.29", "Bangladesh", "Chittagong", 2, 16, "A suicide bombing at a courthouse checkpoint kills at least two people."], ["2005.11.29", "Bangladesh", "Gazipur", 5, 50, "Jamaatul Mujahideen suicide bomber at a law library kills at least five others and injures over fifty."], ["2005.11.29", "Chechnya", "Avtury", 2, 0, "Jihadis enter a house and murder a man and his son."], ["2005.11.29", "Iraq", "Mosul", 2, 1, "Two Christians are gunned down by Muslim militants as they are hanging campaign posters."], ["2005.11.29", "Thailand", "Narathiwat", 1, 1, "A man is shot off the back of his motorcycle by Muslim radicals."], ["2005.11.30", "Iraq", "Baqubah", 9, 2, "Jihad gunmen open up on a minibus with assault weapons, killing nine farm workers as they are boarding."], ["2005.11.30", "Thailand", "Narathiwat", 1, 0, "A 33-year-old Buddhist is gunned down by Islamic militants."], ["2005.11.30", "Thailand", "Yala", 1, 0, "Muslims kill a 40-year-old Buddhist man as he is on his way to tend cattle."], ["2005.12.01", "Bangladesh", "Gazipur", 2, 30, "An Islamist straps a bomb to his leg then detonates it in a DA's office, killing two other people."], ["2005.12.01", "India", "Challi Dangri", 2, 0, "Two boys are killed by a landmine planted by Islamic militants."], ["2005.12.01", "Iraq", "Rutba", 5, 0, "The bodies of four men, bound and executed, are found.  In Basra, radicals kill an Iraqi translator."], ["2005.12.01", "Iraq", "Zaghneya", 1, 0, "A Shiite leader is killed in a sectarian drive-by attack."], ["2005.12.01", "Pakistan", "Miranshah", 2, 0, "Two innocent victims of a bomb-making cell are a teenage student and a 5-year-old boy."], ["2005.12.01", "Thailand", "Yala", 1, 1, "Two Buddhist villagers are shot at by Muslim militants, one of whom succumbs to injury."], ["2005.12.02", "Afghanistan", "Helmand", 1, 5, "A Taliban ambush on a police vehicle leaves one officer dead."], ["2005.12.02", "Afghanistan", "Shah Wali Kot", 3, 3, "A district chief is killed in a Taliban roadside bombing along with two other Afghans."], ["2005.12.02", "India", "Chuntimulla", 1, 0, "The Mujahideen enter the house of a widow and shoot her to death."], ["2005.12.02", "India", "Karam Katha", 1, 0, "A man is kidnapped and murdered by the Mujahideen."], ["2005.12.02", "India", "Pattan", 1, 0, "Islamic militants shoot a teacher to death by the side of the road."], ["2005.12.02", "Iraq", "Fallujah", 10, 11, "Ten U.S. Marines guarding a hospital are senselessly killed by Islamic bombers"], ["2005.12.02", "Pakistan", "Balochistan", 1, 0, "A Sunni group, Lashkar-e-Jhangvi, takes credit for killing a Shia cleric in front of his home."], ["2005.12.02", "Thailand", "Narathiwat", 1, 0, "A village headsman is gunned down by Islamic radicals."], ["2005.12.03", "Iraq", "Adhaim", 19, 2, "Iraqi soldiers are ambushed by terrorists while in transport.  Nineteen are killed."], ["2005.12.04", "Afghanistan", "Kandahar", 1, 2, "A civilian is killed by a suicide bomber.  Two others are injured."], ["2005.12.04", "Egypt", "Cairo", 1, 0, "Christian pastor killed following threats."], ["2005.12.04", "Iraq", "Baghdad", 3, 26, "Two civilians are killed by a bomb planted under a car on a city street.  Elsewhere in the city, a Shiite cleric is gunned down."], ["2005.12.04", "Pakistan", "Shakai", 1, 0, "al-Qaeda backed militants kill a Pakistani soldier."], ["2005.12.05", "Afghanistan", "Marja", 3, 2, "Two civilians are among three dead in a drive-by Taliban shooting."], ["2005.12.05", "India", "Nambalhar", 1, 1, "A civilian is killed in a Mujahideen attack."], ["2005.12.05", "Iraq", "Rutba", 11, 0, "The bodies of eleven civilians are found, bound and executed."], ["2005.12.05", "Israel", "Netanya", 5, 47, "Five Israelis are murdered at the entrance to a shopping mall by a bomber from the militant group, 'Islamic Jihad'."], ["2005.12.05", "Pakistan", "Karachi", 1, 0, "A Sunni cleric is killed in a sectarian attack while buying food at a store."], ["2005.12.05", "Thailand", "Pattani", 1, 0, "Religious extremists kill a school janitor walking home from work."], ["2005.12.06", "Iraq", "Baghdad", 3, 20, "Three people at a cafe are murdered by a Fedayeen suicide bomber.  Twenty other patrons are injured."], ["2005.12.06", "Iraq", "Baghdad", 43, 73, "Two al-Qaeda suicide bombers walk into separate classrooms at a police academy and slaughter more than forty students.  Over seventy others are injured."], ["2005.12.06", "Iraq", "Fallujah", 9, 0, "Nine bodies of civilians are found, bound and executed."], ["2005.12.06", "Iraq", "Shorkat", 3, 0, "Jihadis gun down three employees of an Iraqi oil company as they are driving home."], ["2005.12.06", "Pakistan", "Miranshah", 7, 0, "The Taliban kill seven tribesmen in their homes, later mutilating and hanging the bodies from utility poles."], ["2005.12.06", "Pakistan", "Wana", 2, 0, "Two Pakistani soldiers are kidnapped and beheaded by Islamic fundamentalists."], ["2005.12.06", "Thailand", "Narathiwat", 1, 0, "A cleric is gunned down by Islamists on a motorcycle."], ["2005.12.06", "Thailand", "Pattani", 1, 0, "A man is murdered in front of his family by Islamic terrorists."], ["2005.12.07", "Ingushetia", "Nazran", 0, 9, "Nine Russians manning a checkpoint are injured when Jihad gunmen open fire."], ["2005.12.07", "Iraq", "Kirkuk", 3, 5, "Three hospital guards are gunned down on the job by terrorists."], ["2005.12.08", "Afghanistan", "Helmand", 1, 2, "Taliban extremists attack a police patrol, killing one officer."], ["2005.12.08", "Afghanistan", "Khost", 4, 1, "Two civilians are among four people reported killed by the Taliban."], ["2005.12.08", "Bangladesh", "Gangni", 1, 10, "Bombing at a traffic crossing kills one person and leaves ten others injured."], ["2005.12.08", "Bangladesh", "Netrakona", 6, 100, "A Jamaatul Mujahideen Bangladesh suicide bomber kills six people working in a Communist Party office."], ["2005.12.08", "India", "Gandoh", 1, 0, "A security guard at a civilian residence is shot and killed at point blank range by a Muslim terrorist."], ["2005.12.08", "Iraq", "Baghdad", 1, 0, "The Islamic Army of Iraq claims to have executed an unarmed American civilian abducted earlier."], ["2005.12.08", "Iraq", "Baghdad", 32, 44, "A 'Holy Warrior' blows apart more than thirty passengers on a packed bus, including women and children, as they are prepared to travel home for the weekend."], ["2005.12.08", "Israel", "Kalandiya", 1, 0, "A 20-year-old Israeli soldier is fatally stabbed in the neck by an al-Aqsa terrorist at a point of entry."], ["2005.12.08", "Pakistan", "Jandola", 12, 40, "Twelve people are killed when a planted bomb rips through a hotel restaurant.  Forty others are injured."], ["2005.12.09", "Afghanistan", "Zabul", 1, 2, "The Taliban attack a remote checkpoint, killing a policeman and injuring two others."], ["2005.12.09", "Iraq", "Baghdad", 3, 0, "Two men are killed by Islamic insurgents.  The body of a kidnapped intelligence officer is found in Balad."], ["2005.12.09", "Thailand", "Narathiwat", 2, 0, "A Buddhist husband and wife are brutally murdered by radical Muslims."], ["2005.12.10", "Afghanistan", "Nazarjusth", 7, 6, "Seven policemen are killed when religious extremists stage an assault on their compound."], ["2005.12.10", "Iraq", "Mosul", 1, 1, "Two campaign workers are shot while hanging posters."], ["2005.12.10", "Iraq", "Mosul", 2, 1, "Terrorists kill two civilians with a roadside bomb."], ["2005.12.10", "Iraq", "Tikrit", 1, 0, "An Egyptian man working to build a medical clinic is kidnapped and murdered by Islamic insurgents."], ["2005.12.10", "Pakistan", "North Waziristan", 2, 0, "The Taliban kill two more people, decapitating them and hanging their bodies upside down from pylons."], ["2005.12.11", "India", "Chandilora", 1, 0, "A shop owner is killed in his place of business by Muslim terrorists."], ["2005.12.11", "Iraq", "Baiji", 2, 1, "Sunni gunmen attack a car carrying off-duty Iraqi soldiers, killing two."], ["2005.12.12", "Iraq", "Baghdad", 10, 31, "Three Jihad attacks kill six people and the bodies of four abductees are discovered."], ["2005.12.12", "Lebanon", "Mkalles", 4, 30, "Christian reporter is assassinated by a car bombing that kills three other people.  Thirty innocents are injured in the blast."], ["2005.12.13", "India", "Kashreyan", 1, 0, "The Mujahideen gun down a civilian near his home."], ["2005.12.13", "Iraq", "Ramadi", 1, 0, "An election candidate is gunned down by Jihadis while waiting for gas at a station."], ["2005.12.13", "Pakistan", "Balochistan", 1, 0, "A hotel owner is killed in a sectarian attack."], ["2005.12.13", "Pakistan", "Dera Bugti", 3, 6, "Three members of a family, including a child, are killed when al-Qaeda-backed militants attack their home with a dozen rockets."], ["2005.12.13", "Philippines", "Patikul", 2, 11, "Two Filipino soldiers are killed in a gunfight with Abu Sayyaf militants."], ["2005.12.14", "Afghanistan", "Andar", 2, 0, "Two civilians are kidnapped and killed by religious extremists."], ["2005.12.14", "Afghanistan", "Kandahar", 1, 0, "A pro-government cleric is assassinated by the Taliban as he is riding to work."], ["2005.12.14", "India", "Tanta", 1, 0, "A student who refused to join the Mujahideen is kidnapped and shot to death."], ["2005.12.15", "Afghanistan", "Nad Ali", 1, 0, "The Taliban drag a teacher out of his classroom and kill him for teaching girls.  He had ignored previous warnings."], ["2005.12.15", "Iraq", "Mosul", 1, 7, "A polling station guard is killed when militants toss a grenade from a motorcycle."], ["2005.12.16", "Afghanistan", "Kabul", 2, 2, "Two passersby are killed by a Fedayeen suicide car bomber.  Two others are injured."], ["2005.12.16", "India", "Baramulla", 2, 0, "Two civilians die in separate incidents.  One is kidnapped and murdered, the other is killed with a grenade."], ["2005.12.16", "India", "Jamia Mohalla", 1, 1, "The Mujahideen open fire on a group of civilians, killing one and injuring another."], ["2005.12.16", "India", "Kulgam", 1, 0, "A woman is shot to death by Islamic militants."], ["2005.12.16", "India", "Mohalla Jamia", 2, 0, "The Mujahideen kills two villagers near their home."], ["2005.12.16", "Iraq", "Parwana", 5, 2, "Four children playing soccer are among five killed by Islamic insurgents mortaring a schoolyard.  Two other children are injured."], ["2005.12.16", "Israel", "Hebron", 1, 1, "al-Aqsa fires on a passenger car carrying Israeli civilians, killing a 35-year-old man."], ["2005.12.16", "Thailand", "Pattani", 1, 0, "A man is murdered by Islamists as he is walking home from evening exercises."], ["2005.12.16", "Thailand", "Yala", 1, 0, "Islamists murder a civilian."], ["2005.12.17", "Afghanistan", "Akhundkariz", 3, 0, "Three policemen are killed when religious extremists storm a checkpoint."], ["2005.12.17", "Afghanistan", "Lashkargah", 2, 0, "The Taliban murder an 18-year-old student and a school guard with automatic weapons."], ["2005.12.17", "Iraq", "Balad Ruz", 3, 1, "A barbershop attack by fundamentalists leaves three dead and one injured."], ["2005.12.18", "Iraq", "Baghdad", 3, 2, "A terrorist's roadside bomb kills two police officers and injures two."], ["2005.12.18", "Iraq", "Baghdad", 6, 13, "Three attacks, including a Fedayeen bombing, leave four innocents dead and thirteen injured.  The bodies of two people are recovered elsewhere."], ["2005.12.19", "Iraq", "Baghdad", 2, 11, "A suicidal religious extremist kills two people outside a children's hospital with a bomb."], ["2005.12.19", "Iraq", "Baghdad", 3, 3, "Three bodyguards of a politician are killed in a Jihad ambush on their car."], ["2005.12.19", "Pakistan", "Miranshah", 1, 0, "The Taliban abduct and behead a man, then hang his body from a pole while throwing the head into a cemetery."], ["2005.12.19", "Sudan", "Abu Surooj", 20, 16, "Arab militias kill at least twenty villagers, including an elderly man, three women and two children."], ["2005.12.20", "Afghanistan", "Kabul", 3, 0, "Three Afghan soldiers are killed in an ambush by religious extremists."], ["2005.12.21", "Pakistan", "Wana", 1, 0, "A man is abducted and beheaded by the local Taliban."], ["2005.12.21", "Pakistan", "Wana", 3, 1, "Religious fundamentalists kill three men at a barbershop."], ["2005.12.21", "Thailand", "Narathiwat", 1, 0, "A farmer is shot to death by Islamic terrorists."], ["2005.12.21", "Thailand", "Narathiwat", 1, 0, "Muslims behead a Buddhist civilian."], ["2005.12.21", "Thailand", "Yala", 1, 0, "A 42-year-old man is gunned down by Islamists while walking home from work."], ["2005.12.21", "Thailand", "Yala", 1, 0, "Muslim radicals shoot a 55-year-old Buddhist to death as he is working in his orchard."], ["2005.12.22", "India", "Sopore", 2, 3, "Al-Mansooran claims responsibility for a grenade attack that kills one person.  Elsewhere (Guloora Handwara) a civilian is shot to death."], ["2005.12.22", "Iraq", "Baghdad", 2, 3, "Two foreign civilians are killed in an IED terror attack."], ["2005.12.22", "Iraq", "Baghdad", 4, 6, "Jihadis murder four policemen at a checkpoint with a barrage of automatic weapons fire.  Six others are injured."], ["2005.12.22", "Iraq", "Iskandariya", 4, 1, "Sunni gunmen rake a passenger bus with machine-guns, killing at least four civilians."], ["2005.12.22", "Pakistan", "Miranshah", 2, 0, "Two more bullet-ridden victims of Islamic seminary students calling themselves the Taliban are found in a stream."], ["2005.12.23", "Chechnya", "Grozny", 9, 4, "The lives of nine people are cut short by Mujahideen terrorists in three attacks over 24 hours."], ["2005.12.23", "Iraq", "Adhaim", 8, 17, "Eight Iraqi policemen are massacred when Jihadis open up on their checkpoint with rockets and automatic weapons."], ["2005.12.23", "Iraq", "Balad Ruz", 10, 4, "A suicidal Sunni on a bicycle rides it up to a Shia mosque and detonates, killing ten innocents."], ["2005.12.23", "Thailand", "Narathiwat", 0, 7, "Islamists car-bomb a tea shop, injuring at least seven people."], ["2005.12.24", "Algeria", "Boumerdes", 3, 13, "The Salafist Group for Preaching and Combat blows up a coast guard boat, killing three innocents."], ["2005.12.24", "Bangladesh", "Rajshahi", 1, 0, "Radicals murder a university professor out for a morning walk."], ["2005.12.24", "Iraq", "Baghdad", 14, 0, "Seven civilians are gunned down by Jihadis in three separate attacks, while the bodies of seven others are found bound and executed."], ["2005.12.24", "Pakistan", "Tank", 1, 0, "Islamists kill the nephew of a pro-government leader at a market."], ["2005.12.24", "Thailand", "Narathiwat", 1, 0, "A 46-year-old school guard is cut down in a hail of automatic weapons fire from Muslim extremists."], ["2005.12.24", "Thailand", "Narathiwat", 1, 0, "A Buddhist civilian is shot to death by Muslim radicals."], ["2005.12.25", "Iraq", "Kirkuk", 2, 7, "Two civilians are killed by a terrorist car bombing."], ["2005.12.25", "Thailand", "Bannag Sata", 1, 1, "A man is killed and a woman seriously injured by Islamic gunmen while riding a motorcycle."], ["2005.12.25", "Thailand", "Raman", 2, 0, "Two members of the Buddhist minority are shot to death by Muslim militants on a road."], ["2005.12.26", "Dagestan", "Makhachkala", 2, 0, "Two people are gunned down by Jihadis in their car."], ["2005.12.26", "India", "Hiynan", 1, 0, "The body of a civilian that had been abducted by Islamists is recovered."], ["2005.12.26", "Iraq", "Baghdad", 11, 38, "Five separate bombings kill eight civilians as three bodies are found bound and executed."], ["2005.12.26", "Iraq", "Buhriz", 5, 4, "al-Qaeda slaughters five policemen at a checkpoint with rockets and mortars from point-blank range."], ["2005.12.26", "Iraq", "Dhabab", 5, 0, "Five Iraqi soldiers are killed in a coordinated terror attack."], ["2005.12.26", "Sudan", "Kulbus", 20, 13, "Suspected Arab militias attack a village, killing twenty people."], ["2005.12.26", "Thailand", "Narathiwat", 1, 0, "An innocent villager is murdered by Islamists."], ["2005.12.27", "Iraq", "Asriya", 4, 0, "Islamic insurgents attack a poultry farm, killing four Iraqi workers."], ["2005.12.27", "Iraq", "Jbala", 4, 0, "Four residents are killed in their homes by terrorists."], ["2005.12.27", "Saudi Arabia", "Buraydah", 5, 0, "Five Saudi policemen are killed in two drive-by shooting attacks by an Islamic fundamentalists."], ["2005.12.27", "Thailand", "Narathiwat", 1, 0, "A Buddhist villager is shot off the back of his motorcycle by Muslim gunmen."], ["2005.12.28", "Afghanistan", "Kunar", 2, 2, "Two people, including a civilian, are killed when the Taliban ambush a military convoy."], ["2005.12.28", "India", "Bangalore", 1, 4, "Lashkar-e-Taiba suspected in a campus attack on a university professor and four others."], ["2005.12.28", "Iraq", "Hilla", 4, 0, "Two girls and their parents are stabbed to death by Allah's holy warriors."], ["2005.12.28", "Thailand", "Narathiwat", 1, 0, "A village headsman is gunned down by Islamists."], ["2005.12.28", "Thailand", "Yala", 1, 0, "A civilian is shot and killed by Muslim gunmen."], ["2005.12.29", "Iraq", "Baghdad", 4, 5, "Four Iraqi policemen are killed by a Fedayeen suicide bomber."], ["2005.12.29", "Iraq", "Latifiya", 11, 0, "Eleven members of a Shiite family are massacred by six Sunnis, who invade their home and slit the throats of all, including children."], ["2005.12.29", "Israel", "Tulkarm", 5, 10, "A suicide bomber exits a taxi and detonates an explosives belt, killing an Israeli and four other Palestinians, including the taxi driver.  Islamic Jihad takes credit."], ["2005.12.29", "Pakistan", "Mir Ali", 1, 0, "al-Qaeda militants open fire on a restaurant, killing a Pakistani soldier."], ["2005.12.29", "Pakistan", "Miranshah", 1, 0, "A local tribal leader is abducted by militant Muslims, who then slash his throat."], ["2005.12.29", "Thailand", "Narathiwat", 1, 0, "A civilian shot and killed by Muslim terrorists in his home while eating dinner."], ["2005.12.30", "Afghanistan", "Hazar Joft", 4, 7, "Religious extremists use a bomb to kill four policemen and injure seven."], ["2005.12.30", "Afghanistan", "Maywand", 1, 1, "The Taliban ambush a vehicle on a remote road, killing a passenger."], ["2005.12.30", "India", "Poonch", 1, 1, "The Mujahideen kill a police officer in a shooting ambush on a city street."], ["2005.12.30", "Iraq", "Baghdad", 6, 23, "Terrorists use mortars to kill six civilians near a coffee shop."], ["2005.12.30", "Iraq", "Baghdad", 9, 0, "Islamic extremists kill nine people in a drive-by shooting, because the victims were drinking alcohol in public."], ["2005.12.30", "Pakistan", "Gago Mandi", 3, 0, "A father slits the throats of his three daughters after learning that at least one was 'dishonored' by adultery."], ["2005.12.30", "Pakistan", "Khuzdar", 2, 0, "Two security force members are gunned down in their car."], ["2005.12.30", "Thailand", "Yala", 1, 1, "Muslim extremists shoot a retired teacher to death as he is jogging along a road with his brother."], ["2005.12.31", "Chechnya", "Grozny", 5, 2, "Two civilians and a child are among five killed when Islamic militants attack a security patrol."], ["2005.12.31", "India", "Pulwama", 1, 1, "The Mujahideen invade a home and open fire on the residents, killing the father and injuring another family member."], ["2005.12.31", "Indonesia", "Sulawesi", 8, 56, "Eight Christians are killed when Islamists bomb a market selling pork at a time when it is packed with shoppers.  The bomb was packed with nails."], ["2005.12.31", "Iraq", "Khalis", 5, 2, "Five civilians die in a bombing attack on their vehicle."], ["2005.12.31", "Pakistan", "Rawalpindi", 2, 0, "Islamic fundamentalists kill a 23-year-old Christian and his Muslim girlfriend because their relationship was against Sharia."]], "columns": ["Date", "Country", "City", "Killed", "Injured", "Description"], "year": 2005}