{"rows": [["2008.01.01", "India", "Rampur", 7, 3, "Lashkar-e-Toiba terrorists carry out an attack on a security base, killing at least seven people."], ["2008.01.01", "Iraq", "Baghdad", 36, 38, "A Fedayeen suicide bomber wades into a funeral and detonates, killing thirty-six people."], ["2008.01.01", "Iraq", "Jalawla", 5, 0, "Freedom Fighters abduct and murder an Iraqi policeman and four members of his family."], ["2008.01.01", "Iraq", "Tahwelah", 2, 0, "Radical Sunnis gun down a Shia man and his 16-year-old son."], ["2008.01.01", "Pakistan", "Kahna", 2, 0, "A young couple in their 20's is gunned down by family members for having sex."], ["2008.01.01", "Pakistan", "Kurram", 2, 5, "Two people are killed in fighting between rival Muslim groups."], ["2008.01.01", "Sudan", "Khartoum", 2, 0, "A US diplomat and his driver are killed in a shooting claimed by Islamic militants."], ["2008.01.01", "USA", "Irving, TX", 2, 0, "A Muslim immigrant shoots his two daughters to death on concerns about their 'Western' lifestyle."], ["2008.01.02", "Afghanistan", "Helmand", 1, 1, "Taliban militants shoot a local soldier to death."], ["2008.01.02", "Afghanistan", "Kandahar", 2, 0, "Two border guards are murdered by Islamic extremists."], ["2008.01.02", "Algeria", "Naciria", 5, 20, "Islamic fundamentalists bomb a police station, killing at least five people, including a 10-year-old girl."], ["2008.01.02", "Iraq", "Baghdad", 6, 0, "Freedom Fighters shoot five children and their father to death in a minivan at point-blank range."], ["2008.01.02", "Iraq", "Baqubah", 10, 28, "A female suicide bomber sends ten Iraqis to Allah."], ["2008.01.02", "Iraq", "Muqdadiyah", 6, 3, "Sunni radicals gun down six civilians in a drive-by attack."], ["2008.01.02", "Pakistan", "Kurram", 11, 13, "Eleven people are killed in a sectarian clash between Sunni and Shia."], ["2008.01.02", "Somalia", "Afgoye", 3, 24, "Islamists bomb a local market, killing three civilians."], ["2008.01.02", "Somalia", "Mogadishu", 1, 0, "Suspected Islamists storm an aid office, killing a local guard."], ["2008.01.03", "Afghanistan", "Nimroz", 7, 12, "A Fedayeen suicide bomber detonates in the middle of road construction crew, killing seven workers and their guards."], ["2008.01.03", "India", "Shopian", 1, 0, "The Mujahideen abduct and execute a civilian."], ["2008.01.03", "Iraq", "Baghdad", 6, 11, "Six civilians are killed in two separate Jihad attacks."], ["2008.01.03", "Iraq", "Basra", 1, 0, "A woman is shot to death by fundamentalists for unIslamic activities."], ["2008.01.03", "Iraq", "Khalis", 6, 3, "Six Iraqi soldiers are killed inside a home by a bomb set by radical Sunnis."], ["2008.01.03", "Pakistan", "Kurram", 6, 11, "Six people are killed in violence between Sunni and Shia."], ["2008.01.03", "Thailand", "Pattani", 1, 3, "A local soldier dies from injuries suffered in a roadside bombing by militant Muslims."], ["2008.01.03", "Thailand", "Yala", 1, 0, "A 44-year-old Buddhist rubber tapper is murdered by Muslim extremists."], ["2008.01.03", "Thailand", "Yala", 1, 0, "Islamists gun down a 57-year-old civilian in the street."], ["2008.01.04", "Pakistan", "Kurram", 3, 0, "Fighting between Sunni and Shia leaves three people dead."], ["2008.01.04", "Thailand", "Yala", 1, 2, "A 43-year-old villager is shot to death by Muslim militants."], ["2008.01.05", "Iraq", "Muqdadiyah", 6, 3, "Jihadis bomb a minibus, killing six civilians including women and children."], ["2008.01.06", "Iraq", "Baghdad", 3, 16, "A Jihad car bombing kills three people and injures sixteen others."], ["2008.01.06", "Iraq", "Baghdad", 11, 17, "A Fedayeen suicide bomber attacks an Iraqi celebration of national unity, killing eleven innocent people."], ["2008.01.06", "Iraq", "Muqdadiya", 4, 0, "Islamic radicals kidnap and behead four people, tossing their heads out on a highway."], ["2008.01.06", "Pakistan", "Peshawar", 1, 0, "Fundamentalists bomb a video shop, killing a security guard."], ["2008.01.06", "Pakistan", "Wana", 9, 8, "Nine tribal leaders are killed in two separate shooting attacks by Uzbeki Islamic extremists."], ["2008.01.07", "Afghanistan", "Helmand", 4, 4, "Taliban militants kill four Afghans with a roadside bombing."], ["2008.01.07", "Afghanistan", "Spin Boldak", 1, 4, "A suicide bomber on a motorcycle kills a local border guard."], ["2008.01.07", "Iraq", "Baghdad", 18, 63, "Eighteen innocents are killed in two separate bombings, one a Fedayeen attack"], ["2008.01.07", "Iraq", "Hawija", 3, 0, "A married couple and their young son are shot to death by Islamic terrorists."], ["2008.01.07", "Iraq", "Khanaqeen", 6, 0, "Radical Sunnis abduct, bind and then murder five men.  A carpenter is gunned down in a separate attack."], ["2008.01.07", "Pakistan", "Chugmalai", 1, 3, "Islamic militants attack a security post, killing a local soldier."], ["2008.01.08", "Iraq", "Madaen", 2, 5, "A Fedayeen suicide bomber takes out two Iraqi policemen."], ["2008.01.08", "Somalia", "Dibiyada", 4, 7, "Four civilians are killed during an ambush by Islamic militants."], ["2008.01.09", "Algeria", "Ait Yahia", 4, 2, "Islamic fundamentalists kill four local soldiers in a landmine attack."], ["2008.01.09", "Philippines", "Jolo", 2, 0, "Two off-duty cops are shot to death by suspected Islamic extremists, while jogging along a road."], ["2008.01.09", "Thailand", "Yala", 1, 0, "A 34-year-old man riding his motorcycle is murdered by Islamist gunmen."], ["2008.01.09", "Yemen", "Haidan", 1, 0, "Shiite militants kill a tribal elder."], ["2008.01.10", "Iraq", "Baghdad", 5, 13, "A pair of Jihad bombings leave five Iraqis dead."], ["2008.01.10", "Pakistan", "Lahore", 24, 80, "A suicide bomber attacks a police post, killing two dozen police and civilians alike."], ["2008.01.10", "Thailand", "Narathiwat", 1, 0, "A Buddhist villager is murdered by Muslim gunmen in an unprovoked attack."], ["2008.01.10", "Thailand", "Yala", 3, 7, "Three men are shot to death by Muslim terrorists in three separate attacks."], ["2008.01.10", "Yemen", "Sa'ada", 6, 6, "Six local soldiers are killed in an ambush by Shiite radicals."], ["2008.01.11", "Iraq", "Baghdad", 4, 8, "Jihadis bomb a bakery, killing four people."], ["2008.01.11", "Pakistan", "Sheikhupura", 1, 0, "A 13-year-old Christian boy is targeted and killed by Muslim gunmen."], ["2008.01.11", "Somalia", "Baidoa", 1, 0, "Islamic militants shoot an off-duty soldier to death in a marketplace."], ["2008.01.12", "Afghanistan", "Helmand", 1, 8, "A suicide bomber tries to enter a house, but is stopped short.  He still manages to kill one adult and injure two children."], ["2008.01.12", "Afghanistan", "Kandahar", 8, 0, "Taliban militants gun down eight Afghan police officers."], ["2008.01.12", "Iraq", "Dhuluiya", 6, 0, "Three children are among six killed when al-Qaeda gunmen invade two homes."], ["2008.01.12", "Iraq", "Sulaimaniyah", 1, 0, "Shia fundamentalists gun down a liquor store owner."], ["2008.01.12", "Somalia", "Baidoa", 2, 0, "Two Red Crescent workers are killed by suspected members of an Islamic militia."], ["2008.01.12", "Thailand", "Narathiwat", 1, 0, "A father is murdered by Muslim gunmen after dropping his daughter off at school."], ["2008.01.13", "Algeria", "Medea", 3, 0, "Islamic fundamentalists machine-gun three kids to death as they are gathering chestnuts."], ["2008.01.13", "Pakistan", "Mingora", 1, 0, "A civilian who supports a peace initiative is kidnapped by Islamic radicals and murdered."], ["2008.01.13", "Thailand", "Yala", 1, 0, "Islamic gunmen shoot a man in the back of the head as he is watching television."], ["2008.01.14", "Afghanistan", "Kabul", 8, 6, "Religious extremists attack a hotel with suicide vests and machine-guns, managing to kill eight people in the lobby."], ["2008.01.14", "Iraq", "Buhriz", 7, 3, "Sunni militants booby-trap a home, killing seven Iraqi police."], ["2008.01.14", "Pakistan", "Karachi", 11, 52, "Three children are among eleven killed in a bombing by Islamic militants outside a textile factory."], ["2008.01.14", "Pakistan", "Mohmand", 7, 12, "Seven local soldiers are killed when Taliban militants ambush a military convoy."], ["2008.01.14", "Thailand", "Narathiwat", 8, 7, "Islamists ambush and kill eight local soldiers in a vicious attack that leaves them beheaded, shot or blasted to death."], ["2008.01.15", "Israel", "Ein Hashlosha", 1, 0, "Hamas snipers kill a farm laborer working in a field."], ["2008.01.15", "Lebanon", "Beirut", 3, 21, "A car bomb targeting the US embassy kills three passing civilians."], ["2008.01.15", "Pakistan", "Sararogha", 22, 0, "Two dozen local soldiers are killed when religious militants overrun and capture a fort.  Seven are beheaded."], ["2008.01.15", "Philippines", "Mindanao", 1, 0, "A priest resists a kidnapping attempt by Abu Sayyaf terrorists and is shot to death in his chapel."], ["2008.01.15", "Somalia", "Afar-Darjin", 2, 4, "Jihadis kill two civilians with a roadside bomb, four others are injured, including a pregnant woman who loses a leg."], ["2008.01.15", "Somalia", "Aymiska", 2, 0, "Islamic gunmen shoot two civilians in the head."], ["2008.01.15", "Thailand", "Yala", 0, 44, "Islamic bombers injure forty-four people in an attack on market stalls."], ["2008.01.16", "Chechnya", "Chechnya", 1, 6, "Mujahideen kill a Russian and injure six more in an attack."], ["2008.01.16", "Iraq", "Baghdad", 4, 15, "Two roadside bomb attacks kill four civilians and injure fifteen."], ["2008.01.16", "Iraq", "Baquba", 8, 7, "A female suicide bomber sends eight Shia souls to Allah."], ["2008.01.16", "Iraq", "Tuz Khurmato", 2, 0, "A university student is among two people killed by Islamic terrorists."], ["2008.01.16", "Somalia", "Mogadishu", 7, 7, "Jihadis kill seven Ethiopians in a bomb attack that leaves several others 'on the ground screaming in pain.'"], ["2008.01.17", "Iraq", "Baquba", 11, 15, "A suicidal Sunni bomber detonates inside a Shia mosque, killing eleven worshippers."], ["2008.01.17", "Iraq", "Mosul", 2, 0, "A human rights activist is among two people shot to death by Freedom Fighters."], ["2008.01.17", "Pakistan", "Peshawar", 1, 0, "A Christian man (and father of an infant daughter) is brutally gunned down by masked men."], ["2008.01.17", "Pakistan", "Peshawar", 10, 25, "A young Sunni suicide bomber rushes into a Shia mosque and slaughters ten people."], ["2008.01.18", "Afghanistan", "Musa Qala", 1, 0, "The Taliban hang an innocent civilian from an electricity pole."], ["2008.01.18", "Iraq", "Baghdad", 3, 2, "A woman and her two children are murdered by Freedom Fighters in a roadside attack."], ["2008.01.18", "Iraq", "Mo'alimeen", 2, 4, "Two children are killed when Jihadis attack their home with an IED."], ["2008.01.18", "Iraq", "Nassiriya", 80, 120, "Clashes in two cities between mainstream Shias and the Soldiers of Heaven leave at least eighty dead."], ["2008.01.18", "Thailand", "Pattani", 1, 2, "Muslim radicals kill a local soldier outside a mosque."], ["2008.01.18", "Yemen", "Hadramout", 4, 2, "Two Belgian tourists and two locals are murdered by suspected al-Qaeda."], ["2008.01.19", "Afghanistan", "Kandahar", 5, 0, "A child is among five civilians blown apart by a Taliban roadside bomb."], ["2008.01.19", "India", "Budgam", 1, 20, "One person is killed in a sectarian clash between Shia groups."], ["2008.01.19", "Iraq", "Ramadi", 7, 14, "Three Fedayeen suicide bombers kill seven Iraqis."], ["2008.01.19", "Iraq", "Tal Afar", 7, 20, "Sunni radicals send Katyusha rockets into a group of Shia pilgrims, killing at least seven."], ["2008.01.19", "Thailand", "Pattani", 1, 0, "A 20-year-old woman is murdered in a vicious ambush by Islamic extremists."], ["2008.01.19", "Thailand", "Yala", 1, 0, "A 44-year-old butcher is shot to death by Muslim terrorists while riding home."], ["2008.01.19", "Thailand", "Yala", 1, 0, "Muslim radicals shoot the head of a local health clinic in the back of the head while he is on a lunch break."], ["2008.01.20", "Afghanistan", "Helmand", 6, 3, "Religious extremists murder six Afghans transporting construction materials."], ["2008.01.20", "Afghanistan", "Zabul", 3, 0, "The Taliban kidnap the head of a reconciliation mission and his two drivers. They then execute them in captivity."], ["2008.01.20", "Chechnya", "Niki-Khita", 2, 0, "Mujahideen gunmen ambush a group of Russians, killing two."], ["2008.01.20", "Iraq", "Balad", 5, 20, "Sunnis rain down mortars on a Shia festival, killing at least five."], ["2008.01.20", "Iraq", "Fallujah", 6, 10, "A teenage suicide bomber murders at least six other innocents at a celebration."], ["2008.01.20", "Thailand", "Narathiwat", 1, 0, "Islamic radicals gun down a 23-year-old villager."], ["2008.01.21", "Iraq", "Kalar", 2, 0, "A woman and her daughter are shot to death by Muslim radicals."], ["2008.01.21", "Iraq", "Qahira", 2, 9, "Jihadis set off a car bomb along a city street, killing two civilians."], ["2008.01.21", "Iraq", "Tikrit", 18, 22, "A suicide bomber attacks a funeral, killing eighteen mourners."], ["2008.01.21", "Pakistan", "Seerikh", 1, 0, "A government official is assassinated by suspected al-Qaeda militants."], ["2008.01.21", "Thailand", "Narathiwat", 1, 0, "A 53-year-old janitor is shot to death in front of a coffee shop."], ["2008.01.21", "Thailand", "Pattani", 2, 0, "Two laborers are murdered in a drive-by attack by Muslim extremists."], ["2008.01.22", "Ingushetia", "Nazran", 2, 3, "Suspected Mujahideen kill two in a car bomb blast."], ["2008.01.22", "Pakistan", "Ladha", 5, 7, "Fedayeen militants attack a military post, killing five local soldiers."], ["2008.01.22", "Pakistan", "Nawaz Kot", 1, 2, "Islamic militants attack a group of local soldiers, killing one."], ["2008.01.22", "Pakistan", "Razmak", 2, 10, "Islamic militants lob rockets into a military compound, killing two local soldiers."], ["2008.01.22", "Philippines", "Tawi-Tawi", 1, 0, "An innocent vendor is executed after being kidnapped by Abu Sayyaf terrorists for use as a human shield."], ["2008.01.22", "Somalia", "Mogadishu", 2, 1, "A civilian is among two people killed in an ambush by Islamic militia."], ["2008.01.22", "Sudan", "Sureif Judad", 21, 0, "The young and the old are among twenty-one civilians massacred by government-backed militias in an attack on their village."], ["2008.01.22", "Thailand", "Pattani", 1, 0, "A 37-year-old villager is pumped full of holes by Muslim gunmen."], ["2008.01.23", "Chechnya", "Grozny", 1, 1, "A police officer is gunned down by the Mujahideen."], ["2008.01.23", "India", "Doda", 1, 0, "Lashkar-e-Toiba terrorists abduct, torture and murder a civilian."], ["2008.01.23", "Iraq", "Baquba", 1, 21, "Students and teachers are among the casualties when Jihadis bomb a prep school."], ["2008.01.23", "Iraq", "Buhriz", 7, 0, "Seven members of the same family are slaughtered by Sunni radicals."], ["2008.01.23", "Iraq", "Kirkuk", 7, 16, "A Fedayeen suicide bomber kills six Iraqi civilians."], ["2008.01.23", "Iraq", "Mosul", 60, 224, "Freedom fighters bomb an apartment building, killing 60 residents and bystanders."], ["2008.01.23", "Pakistan", "Karkhano", 1, 1, "A suicide bomber manages to kill a civilian."], ["2008.01.23", "Somalia", "Mogadishu", 1, 2, "A child is killed when Islamic militias mortar an airport."], ["2008.01.23", "Thailand", "Yala", 3, 0, "A Buddhist is among three people murdered by Islamic radicals in separate shooting attacks."], ["2008.01.24", "Iraq", "Mosul", 3, 10, "A suicide bomber targets police investigating a prior bombing, killing at least three people."], ["2008.01.24", "Pakistan", "Swat", 3, 2, "Islamic hardliners murder two brothers and one other man."], ["2008.01.24", "Somalia", "Baidoa", 2, 1, "Two Somalis, including a cafe owner are killed in an ambush by Islamic militia members."], ["2008.01.24", "Thailand", "Pattani", 1, 0, "A Buddhist teacher is shot to death by Muslim militants while riding to school."], ["2008.01.24", "Turkey", "Gaziantep", 1, 0, "al-Qaeda militants open fire on a group of police officers, killing one."], ["2008.01.25", "Israel", "Jerusalem", 1, 6, "Palestinian gunmen fire into an Israeli checkpoint, killing one policeman and wounding six civilians."], ["2008.01.25", "Lebanon", "Beirut", 4, 38, "Islamic terrorists bomb a vehicle, killing a two officials and two civilian bystanders."], ["2008.01.25", "Pakistan", "South Waziristan", 2, 7, "al-Qaeda militants attack a group of local soldiers, killing two."], ["2008.01.25", "Somalia", "Mogadishu", 3, 9, "Three Ethiopians are killed when Islamists fire rockets into a group of soldiers at point-blank range."], ["2008.01.25", "Thailand", "Pattani", 1, 0, "A 36-year-old man is murdered by Islamic extremists."], ["2008.01.25", "Thailand", "Pattani", 3, 0, "Three men in their 50's are murdered by Islamic gunmen in separate attacks."], ["2008.01.26", "Jordan", "Jerash", 1, 0, "A 17-year-old girl is strangled by her brother for shaming her family."], ["2008.01.26", "Pakistan", "Khwezai", 1, 0, "An Afghan refugee is murdered by the Taliban."], ["2008.01.26", "Somalia", "Mogadishu", 3, 0, "Jihadis kill three Somalis with a fragment bomb."], ["2008.01.26", "Thailand", "Narathiwat", 1, 1, "Islamic militants open fire on two teenage boys, killing one, whom they then mutilate."], ["2008.01.26", "Thailand", "Yala", 1, 0, "A 34-year-old man is shot to death by Muslim terrorists while sitting in his car."], ["2008.01.27", "Afghanistan", "Helmand", 2, 3, "Religious extremists ambush a police vehicle, killing two local cops."], ["2008.01.27", "Iraq", "Talibiya", 4, 0, "Freedom fighters invade a home and stab a family of four to death."], ["2008.01.27", "Pakistan", "Makin", 3, 0, "The bodies of three soldiers taken hostage by the Taliban are found."], ["2008.01.27", "Pakistan", "Orakzai", 3, 2, "Islamic militants attack a check post, killing three local soldiers."], ["2008.01.27", "Somalia", "Mogadishu", 2, 2, "Two civilians are killed when Islamic militias fire rockets into the main airport."], ["2008.01.27", "Somalia", "Mogadishu", 2, 3, "A man and woman are killed by Islamic militia bombers."], ["2008.01.27", "Thailand", "Pattani", 1, 0, "Islamists gun down a trained monkey vendor."], ["2008.01.27", "Thailand", "Pattani", 1, 1, "A woman is shot to death by Muslim terrorists while a motorcycle."], ["2008.01.28", "India", "Handwara", 1, 0, "A 34-year-old man is abducted from his village and murdered by the Mujahideen."], ["2008.01.28", "India", "Tenkasi", 1, 0, "A gang of Muslims hacks a Hindu man to death."], ["2008.01.28", "Iraq", "Baghdad", 3, 10, "Jihadis bomb a funeral procession, killing three civilians."], ["2008.01.28", "Pakistan", "Swat", 1, 0, "Islamic militants drag a policeman from his house and behead him."], ["2008.01.28", "Somalia", "Kismayu", 4, 0, "Two humanitarian doctors and a journalist are among four killed in a remote-controlled bomb attack."], ["2008.01.28", "Somalia", "Mogadishu", 2, 9, "Two Ethiopian guards at a market are murdered in an ambush by Islamic militias."], ["2008.01.29", "Afghanistan", "Kandahar", 3, 5, "Taliban militants kill three civilians in two separate landmine attacks."], ["2008.01.29", "Algeria", "Thenia", 4, 20, "At least four people are killed in a suicide attack by Islamic radicals."], ["2008.01.29", "Iraq", "Baghdad", 2, 5, "Two women are killed at a checkpoint by a female suicide bomber."], ["2008.01.29", "Iraq", "Duluiya", 3, 2, "Three schoolgirls are killed in a Jihad bombing as they are walking to school."], ["2008.01.29", "Iraq", "Muqdadiyah", 19, 0, "Nine complete bodies and ten severed heads are discovered - suspected to be al-Qaeda victims."], ["2008.01.29", "Iraq", "Saidiyah", 5, 2, "Five Iraqis are killed by a bomb planted by Sunni radicals."], ["2008.01.29", "Pakistan", "FATA", 1, 0, "A village elder is abducted and murdered by al-Qaeda terrorists."], ["2008.01.29", "Pakistan", "Punjab", 1, 0, "A 16-year-old Christian is kidnapped and sold for organ harvesting."], ["2008.01.29", "Pakistan", "Razmak", 3, 4, "Three local soldiers are killed in an ambush by Islamic militants."], ["2008.01.30", "Iraq", "Baghdad", 1, 3, "Jihadis manage to kill a young boy with a mortar attack on a neighborhood."], ["2008.01.30", "Iraq", "Tuz Khormatu", 2, 0, "Islamists kidnap and behead two brothers."], ["2008.01.30", "Pakistan", "NWFP", 13, 0, "The bodies of thirteen soldiers taken hostage several days earlier by religious extremists are discovered."], ["2008.01.30", "Philippines", "Zamboanga", 1, 1, "A woman is killed, and another injured, following an ambush by Moro Islamic terrorists."], ["2008.01.30", "Thailand", "Pattani", 1, 0, "A security guard at a car showroom is shot to death by Muslim militants."], ["2008.01.30", "Thailand", "Yala", 2, 0, "Two men, ages 32 and 52, are shot to death by Muslim militants in separate attacks."], ["2008.01.31", "Afghanistan", "Kabul", 1, 4, "A suicide bomber kills a passing civilian."], ["2008.01.31", "Afghanistan", "Lashkar Gah", 5, 18, "Five people are blown to bits by a suicide bomber at a mosque."], ["2008.01.31", "Afghanistan", "Nuristan", 4, 0, "Four construction workers are kidnapped and beheaded by Taliban extremists."], ["2008.01.31", "Iraq", "Baghdad", 11, 18, "A pair of Jihad bombings leave eleven Iraqis dead."], ["2008.01.31", "Somalia", "Mogadishu", 1, 0, "Islamic militias assassinate a government spokesperson."], ["2008.01.31", "Somalia", "Mogadishu", 3, 1, "Islamic militia stage a drive-by attack on a house, killing three people inside."], ["2008.02.01", "Bangladesh", "Cinatuly", 1, 0, "An elderly Christian woman dies from burn suffered when a Muslim mob set fire to her home for converting her family members."], ["2008.02.01", "Iraq", "Baghdad", 99, 196, "al-Qaeda sends two women with Down's Syndrome into two pet markets, then detonates each remotely, slaughtering about one hundred other innocents."], ["2008.02.01", "Iraq", "Kut", 2, 4, "The Mujahideen fire into a bus terminal, killing two Iraqis."], ["2008.02.01", "Iraq", "Mosul", 1, 0, "A 12-year-old boy is taken out by Sunni radicals."], ["2008.02.01", "Mauritania", "Nouakchott", 0, 3, "Bearded Jihadis shout 'Allah Akbar' and open up on the Israeli embassy with automatic weapons, injuring three bystanders."], ["2008.02.01", "Pakistan", "Mir Ali", 5, 8, "A suicidal Sunni rams a police vehicle with an explosives-laden vehicle, killing at least five people."], ["2008.02.01", "Thailand", "Narathiwat", 2, 0, "Two elderly men are murdered by Islamic gunmen in separate attacks."], ["2008.02.02", "India", "Poonch", 2, 1, "Two police officers are killed by Lashkar-e-Toiba gunmen."], ["2008.02.02", "Iraq", "Mosul", 4, 9, "al-Qaeda bombers take out four Sunnis."], ["2008.02.02", "Thailand", "Yala", 1, 0, "A rubber tapper is shot to death by Muslim militants on his way to work."], ["2008.02.03", "Iraq", "Baquba", 4, 0, "Suspected al-Qaeda gunmen attack a home, killing four young Sunnis."], ["2008.02.03", "Somalia", "Mogadishu", 8, 9, "Islamic militia blow up a minibus, killing eight civilians and maiming nine more."], ["2008.02.03", "Sweden", "Malmo", 1, 0, "A 16-year-old girl dies after being pushed from the balcony in a suspected honor killing by her brother."], ["2008.02.04", "Afghanistan", "Helmand", 5, 1, "Two children and two women are among five members of the same family killed in a roadside attack by religious extremists."], ["2008.02.04", "Iraq", "Abu Saida", 2, 1, "Jihadis kill a 7-year-old boy and one other civilian in an attack on a minibus."], ["2008.02.04", "Israel", "Dimona", 1, 11, "A Palestinian suicide bomber murders an Israeli woman at a shopping mall."], ["2008.02.04", "Pakistan", "Rawalpindi", 8, 25, "A suicide bomber rams his car into a minibus carrying medical personnel, killing at least eight."], ["2008.02.04", "Pakistan", "Sukkur", 1, 0, "A girl is chopped to pieces with an axe by her father, who was concerned about her 'character.'"], ["2008.02.04", "Thailand", "Pattani", 1, 12, "Islamists detonate a bomb outside a boarding school, killing one person."], ["2008.02.04", "Thailand", "Yala", 1, 0, "A 30-year-old civilian is shot to death by Muslim militants."], ["2008.02.05", "Afghanistan", "Kandahar", 2, 0, "Two Afghan police are killed in a Taliban bombing."], ["2008.02.05", "Bangladesh", "Rangpur", 1, 0, "A convert to Christianity dies from burns suffered when a Muslim mob set fire to her house four weeks earlier."], ["2008.02.05", "Iraq", "Fallujah", 5, 4, "A Fedayeen suicide bomber murder five Iraqis along a city street."], ["2008.02.05", "Iraq", "Hillah", 1, 0, "A woman is shot to death by Islamic radicals."], ["2008.02.05", "Iraq", "Samarrah", 1, 0, "A cleric speaks out against al-Qaeda and is quickly gunned down."], ["2008.02.05", "Iraq", "Samarrah", 55, 0, "Fifty-five bodies, victims of the Islamic State of Iraq, are found in a mass grave.  Many had been tortured."], ["2008.02.05", "Somalia", "Bossaso", 25, 90, "Islamic militias claim responsibility for two separate bombings in which 25 African laborers are killed."], ["2008.02.05", "Somalia", "Mogadishu", 4, 9, "Two women are among four killed in a marketplace attack by Islamic militias."], ["2008.02.06", "Iraq", "Diwaniya", 4, 9, "Four people are killed when Jihadis bomb a minibus."], ["2008.02.06", "Iraq", "Kirkuk", 2, 9, "A 7-year-old girl and a woman are killed in separate Jihad bombings."], ["2008.02.06", "Iraq", "Muqdadiyah", 10, 0, "Ten headless bodies are found, presumably kidnap victims decapitated by the Mujahideen."], ["2008.02.06", "Pakistan", "Khyber", 1, 2, "A civilian is killed in a bomb blast."], ["2008.02.06", "Thailand", "Yala", 1, 0, "A 21-year-old man is shot to death by Muslim militants."], ["2008.02.07", "Iraq", "Baghdad", 11, 18, "Islamic gunmen shoot eleven people to death in various attacks."], ["2008.02.07", "Iraq", "Muradiyah", 4, 9, "A child is killed in a bombing.  Jihadis also invade a home and murder three brothers in a separate attack."], ["2008.02.07", "Thailand", "Narathiwat", 1, 0, "Islamic radicals kidnap a young man in his 20's, bind him, slash his throat and then shoot him in the head."], ["2008.02.08", "Afghanistan", "Ghazni", 2, 7, "A child is among two Afghans murdered in a suicide attack by a Fedayeen bomber."], ["2008.02.08", "Algeria", "Ain R'Ghiya", 8, 0, "Eight security officers are massacred at point-blank range by Islamists with machine-guns."], ["2008.02.08", "Algeria", "Boukalfa", 1, 1, "Islamic gunmen murder a police officer."], ["2008.02.08", "India", "Poonch", 1, 0, "A civilian is shot to death by Muslim terrorists."], ["2008.02.08", "Iraq", "Baquba", 13, 0, "Jihadis kill five people in a brutal home invasion as a mass grave is unearthed elsewhere with eight bodies."], ["2008.02.08", "Sudan", "Abu Surouj", 200, 0, "The initial death toll from attacks on three villages by government troops and the Janjiweed is put at two-hundred civilians.  An elderly woman and a disabled girl are among several burnt alive."], ["2008.02.09", "Afghanistan", "Nawa", 4, 0, "Three children and a woman are killed when a bomb being constructed by a religious cleric explodes prematurely."], ["2008.02.09", "Iraq", "Baghdad", 26, 0, "More than twenty-five victims of sectarian violence are found in at least two locations."], ["2008.02.09", "Nigeria", "Kano", 3, 20, "Muslims riot over a cartoon caricature of Muhammad, killing three people with machetes."], ["2008.02.09", "Pakistan", "Charsadda", 27, 50, "A Fedayeen suicide bomber slaughters twenty-seven people attending a political rally."], ["2008.02.09", "Somalia", "Hiiraan", 5, 9, "Suspected Islamic militia kill five local soldiers in a brutal ambush."], ["2008.02.09", "Somalia", "Mogadishu", 2, 0, "Two men are shot to death by Muslim militants in separate terror attacks."], ["2008.02.09", "Thailand", "Yala", 1, 0, "A 29-year-old woman is murdered by Islamic gunmen while she is riding a motorcycle."], ["2008.02.09", "Thailand", "Yala", 2, 0, "Two middle-aged men are brutally ambushed and killed by Muslim extremists while sitting in a pickup truck."], ["2008.02.10", "Afghanistan", "Herat", 1, 2, "Religious extremists ambush a vehicle, killing a young man inside."], ["2008.02.10", "Iraq", "Albo Efan", 3, 7, "A suicide attack leaves three civilians dead.  A woman is shot to death elsewhere."], ["2008.02.10", "Iraq", "Tal Abta", 12, 7, "Two women and four children are among the dead when al-Qaeda gunmen attack a Sunni village."], ["2008.02.10", "Iraq", "Yathrib", 33, 51, "A Fedayeen suicide bomber at a marketplace blasts thirty-three Iraqi shoppers to Allah."], ["2008.02.10", "Somalia", "Baidoa", 1, 0, "Islamic gunmen assassinate a government worker."], ["2008.02.10", "Thailand", "Narathiwat", 1, 1, "A 65-year-old man is shot to death by Muslim militants while sitting in a tea shop."], ["2008.02.11", "Iraq", "Baghdad", 19, 45, "Nineteen Iraqis are blown to bits when Sunni bombers car bombers attack a petrol station."], ["2008.02.11", "Pakistan", "Mir Ali", 10, 13, "A suicide bomber detonates at a political rally, killing ten people."], ["2008.02.12", "Iraq", "Baquba", 4, 3, "Four children are killed by Islamic terrorists in two separate attacks - one a bombing and the other a shooting."], ["2008.02.12", "Iraq", "Muqdadiyah", 20, 0, "Twenty victims of suspected Sunni extremists are discovered in two locations."], ["2008.02.12", "Thailand", "Narathiwat", 2, 0, "A district chief and his teenage son are shot to death by militant Muslims."], ["2008.02.13", "Afghanistan", "Helmand", 3, 4, "Three local soldiers are killed in a Taliban roadside bombing."], ["2008.02.13", "Afghanistan", "Khost", 4, 1, "Four security guards are murdered by Islamic bombers."], ["2008.02.13", "Iraq", "Saadiya", 5, 2, "Five construction workers are shot to death by Mujahid."], ["2008.02.13", "Iraq", "Zafariyah", 1, 1, "Holy warriors break into a school where they beat a woman and hang her 3-year-old son."], ["2008.02.13", "Pakistan", "Swat", 2, 3, "Two people are killed when Muslim militants bomb a civilian convoy."], ["2008.02.13", "Somalia", "Hegan", 1, 0, "Islamic militias assassinate a local official."], ["2008.02.14", "Algeria", "Boumerdes", 1, 0, "Islamic terrorists assassinate a security guard."], ["2008.02.14", "Iraq", "Awja", 9, 0, "Freedom Fighters shoot a family of nine to death in their home, including children."], ["2008.02.14", "Iraq", "Baghdad", 7, 36, "Jihadis bomb a crowded marketplace, killing at least seven Iraqis."], ["2008.02.14", "Pakistan", "Bajaur", 3, 3, "Three local soldiers are killed by a Taliban roadside blast as they return from guard duty."], ["2008.02.14", "Somalia", "Mogadishu", 1, 4, "Islamic militants hurl a grenade into a crowd, killing a school headmaster."], ["2008.02.14", "Thailand", "Narathiwat", 2, 1, "Two villagers are murdered by Islamic gunmen."], ["2008.02.14", "Thailand", "Yala", 1, 0, "A laborer is shot to death in front of his wife by militant Muslims."], ["2008.02.15", "Afghanistan", "Nimroz", 4, 2, "Religious extremists gun down four Afghan police officers."], ["2008.02.15", "Algeria", "Bouyara", 3, 5, "Islamic terrorists detonate a bomb at a sports stadium, killing three people."], ["2008.02.15", "Iraq", "Tal Afar", 4, 17, "Two Fedayeen suicide bombers kill four Shia in an attack on their mosque."], ["2008.02.15", "Pakistan", "Peshawar", 1, 1, "Mujahideen attack an army checkpoint with automatic weapons, killing a local soldier."], ["2008.02.16", "Afghanistan", "Arghandab", 101, 75, "A suicide bomber blows himself up in a crowd of spectators watching a dog-fighting event, killing over one-hundred."], ["2008.02.16", "Algeria", "Tadmait", 3, 0, "Three local soldiers are killed in an ambush by Islamic fundamentalists."], ["2008.02.16", "Algeria", "Tizi Ouzou", 1, 4, "A local soldier is blown to bits by Islamic fundamentalist bombers."], ["2008.02.16", "Iraq", "Ramadi", 5, 0, "Five Iraqis are kidnapped and tortured to death by Freedom Fighters."], ["2008.02.16", "Pakistan", "Parachinar", 47, 110, "A suicide bomber sends at least forty-seven souls to Allah by plowing an explosives-laden car into a political office."], ["2008.02.16", "Pakistan", "Swat", 2, 14, "A Fedayeen suicide bomber kills two civilians."], ["2008.02.16", "Somalia", "Yaqshid", 1, 0, "Islamic militia members assassinate a local official outside a mosque."], ["2008.02.16", "Thailand", "Narathiwat", 1, 0, "A local Buddhist is murdered by Muslim gunmen while riding a motorcycle."], ["2008.02.16", "Thailand", "Pattani", 1, 0, "A gardener is shot to death by Mujahid while sitting outside a teashop."], ["2008.02.16", "Thailand", "Pattani", 1, 2, "An Islamic radical strides into a mosque and blows away a local with a handgun."], ["2008.02.17", "Iran", "Zahedan", 1, 0, "A man and a friend stone his 14-year-old daughter to death over an unauthorized relationship."], ["2008.02.17", "Iraq", "Baghdad", 3, 12, "A female suicide bomber at a marketplace sends three shoppers to Allah."], ["2008.02.17", "Iraq", "Mosul", 4, 2, "Jihadis kill four Iraqis with a remote-controlled bomb."], ["2008.02.17", "Somalia", "Mogadishu", 1, 0, "A young child is killed when Islamic fundamentalists toss a grenade into a crowd watching a soccer match on TV."], ["2008.02.18", "Afghanistan", "Spin Boldak", 38, 36, "Thirty-eight Afghans are blown apart by suicide bomber in an explosives packed car."], ["2008.02.18", "Iraq", "Baghdad", 5, 14, "Jihadis mortar an airport, killing five Iraqi civilians."], ["2008.02.18", "Iraq", "Hit", 2, 1, "Fundamentalists bomb a video store, killing the owner and a customer."], ["2008.02.18", "Iraq", "Mosul", 3, 4, "Three civilians are killed in a roadside bombing."], ["2008.02.18", "Iraq", "Sheikh", 4, 0, "al-Qaeda gunmen murder a couple and their teenage son in their home along with a neighbor."], ["2008.02.18", "Somalia", "Dhobley", 3, 5, "Fundamentalists cut down three youth with gunfire for refusing demands to turn off their music."], ["2008.02.18", "Sudan", "Jebel Moon", 11, 0, "Seven women and four children are killed in an attack by government troops on their village."], ["2008.02.19", "Afghanistan", "Kandahar", 1, 1, "A civilian is killed by a suicide bomber."], ["2008.02.19", "Iraq", "Baghdad", 6, 3, "Six civilians are killed in two Mujahideen bombing attacks."], ["2008.02.19", "Iraq", "Baquba", 4, 0, "Two children and their parents are shot to death by Islamic terrorists.  The family had been displaced."], ["2008.02.19", "Pal. Auth.", "Khan Yunis", 1, 2, "A 10-year-old boy is killed while being used by Hamas as a human shield to ambush Israeli soldiers."], ["2008.02.19", "Somalia", "Mogadishu", 6, 0, "Islamic militia ambush a patrol along a city street, killing four soldiers and two civilians."], ["2008.02.19", "Thailand", "Pattani", 1, 1, "A 46-year-old Buddhist man is shot from his motorcycle and then set ablaze by militant Muslims."], ["2008.02.20", "Iraq", "Balad", 3, 7, "Jihadis kill three children playing soccer near a US base."], ["2008.02.20", "Iraq", "Mosul", 5, 4, "Sunni gunmen murder five Iraqis, including one woman."], ["2008.02.20", "Iraq", "Muqdadiyah", 7, 20, "Seven civilians are killed when a suicide bomber detonates in a marketplace."], ["2008.02.20", "Iraq", "Tal Afar", 2, 8, "A woman and a 6-year-old child are taken out by a suicide bomber at municipal office."], ["2008.02.20", "Somalia", "Baidoa", 2, 0, "Two Ethiopian soldiers standing guard at a market are murdered by Islamic gunmen."], ["2008.02.21", "Afghanistan", "Helmand", 1, 4, "Religious extremists kill a local policeman in a roadside bombing attack."], ["2008.02.21", "Iraq", "Baquba", 24, 0, "Three women are among twenty-four victims of al-Qaeda found in two mass graves."], ["2008.02.21", "Somalia", "Afgoi", 1, 0, "Islamic militias assassinate a government official."], ["2008.02.22", "Afghanistan", "Khost", 3, 0, "A suicide attack kills three Afghans."], ["2008.02.22", "Iraq", "Baghdad", 8, 15, "Various Jihad attacks leave at least eight Iraqis dead, including three children."], ["2008.02.22", "Iraq", "Fallujah", 6, 9, "Six people at a mosque are blown to bits by a suicide bomber."], ["2008.02.22", "Iraq", "Garma", 2, 3, "A Fedayeen suicide bomber murders two Iraqis at a checkpoint."], ["2008.02.22", "Iraq", "Tikrit", 3, 8, "Three people are killed when a suicide bomber rams his vehicle into a police station."], ["2008.02.22", "Pakistan", "Swat", 13, 14, "Bombers kill thirteen members of a wedding party traveling in a minibus."], ["2008.02.22", "Thailand", "Narathiwat", 0, 22, "Twenty-two migrant workers are injured when Islamists set off a bomb at a garbage dump."], ["2008.02.23", "Afghanistan", "Kunar", 7, 0, "Seven Afghans are killed in a landmine attack by the Taliban."], ["2008.02.23", "Afghanistan", "Zabul", 1, 0, "A civilian truck driver is killed and his vehicle set ablaze by religious extremists."], ["2008.02.23", "Iraq", "Baiji", 1, 1, "Jihadis kill a woman in a roadside attack that leaves her son badly injured."], ["2008.02.23", "Iraq", "al-Saqlawiyah", 6, 2, "Sunni radicals attack a police station, killing six Iraqis."], ["2008.02.23", "Somalia", "Mogadishu", 3, 5, "Two young sisters are among three civilians killed in a roadside bombing attack by Islamic militia."], ["2008.02.23", "Somalia", "Mogadishu", 4, 0, "Four Ethiopians driving a water truck are gunned down by radicals screaming 'Allah Akbar.'"], ["2008.02.24", "Afghanistan", "Garmabak", 3, 2, "The Taliban are suspected in an assassination attempt on a local official that leaves three people dead."], ["2008.02.24", "Algeria", "Tablat", 1, 2, "A village guard is gunned down by Islamic fundamentalists."], ["2008.02.24", "Iraq", "Baghdad", 3, 49, "Three Shia pilgrims are killed when Sunni gunmen attack their procession."], ["2008.02.24", "Iraq", "Iskandariyah", 63, 68, "A suicidal Sunni blasts more than sixty Shia pilgrims to death as they are resting from their journey in a tent."], ["2008.02.24", "Iraq", "Mosul", 2, 3, "Two electrical workers are blown apart in an IED attack on their vehicle."], ["2008.02.24", "Pakistan", "Qadirabad", 3, 5, "Islamic militants attack a group of local police, killing three."], ["2008.02.24", "Somalia", "Dinsoor", 18, 8, "Islamic militias attack a small town, killing eighteen local defenders."], ["2008.02.25", "Afghanistan", "Helmand", 5, 1, "Religious extremists kill five civilians with a rocket."], ["2008.02.25", "Iraq", "Baghdad", 4, 15, "Three women are among four Shia pilgrims killed by radical Sunni bombers."], ["2008.02.25", "Iraq", "Haruja", 8, 0, "Eight women are kidnapped and executed by Islamic fundamentalists."], ["2008.02.25", "Iraq", "Mosul", 7, 7, "Three members of the same family are killed in their home by Jihads.  Four other Iraqis are killed in a separate attack."], ["2008.02.25", "Iraq", "Samarra", 3, 8, "A suicide bomber in a wheelchair murders three Iraqi policemen."], ["2008.02.25", "Pakistan", "Mansehra", 5, 10, "Two women are among five dead when Islamists attack and burn down a humanitarian agency office."], ["2008.02.25", "Pakistan", "Mingora", 1, 0, "A traffic cop is gunned down by Muslim militants."], ["2008.02.25", "Pakistan", "Rawalpindi", 8, 35, "Eight people are killed when a suicide bomber rams into another vehicle along a city road."], ["2008.02.25", "Somalia", "Mogadishu", 1, 0, "A young police officer is assassinated outside his home by Islamic militia members."], ["2008.02.26", "Afghanistan", "Kandahar", 2, 0, "An 50-year-old American humanitarian worker and her driver are kidnapped and executed by the Taliban"], ["2008.02.26", "Afghanistan", "Khost", 6, 0, "A 9-year-old child and five Afghan adults are murdered by Islamic bombers."], ["2008.02.26", "Iraq", "Mosul", 8, 8, "A suicide bomber detonates inside a passenger bus, killing eight Iraqis."], ["2008.02.26", "Pakistan", "Peshawar", 1, 0, "A Shia leader is shot to death by Sunni radicals."], ["2008.02.26", "Somalia", "Dusamareb", 1, 0, "A former government official is assassinated by Islamic terrorists."], ["2008.02.27", "Afghanistan", "Kandahar", 2, 6, "Two local soldiers are gunned down in an ambush by religious extremists."], ["2008.02.27", "India", "Pulwama", 2, 1, "Two local cops are massacred in a Mujahideen ambush.  Elsewhere, an 11-year-old boy is severely injured in a bomb attack."], ["2008.02.27", "Iraq", "Hamdaniyah", 1, 0, "A university student is shot to death by suspected fundamentalists."], ["2008.02.27", "Iraq", "Mosul", 2, 1, "Two civilians are killed in a Jihad bomb blast."], ["2008.02.27", "Israel", "Sderot", 1, 1, "Hamas kills an Israeli student with a rocket barrage on a college campus."], ["2008.02.27", "Thailand", "Narathiwat", 1, 0, "Muslim gunmen murder a 60-year-old man sitting in this truck."], ["2008.02.27", "Thailand", "Yala", 1, 4, "A local soldier is killed in a bombing ambush by Islamic militants."], ["2008.02.28", "Germany", "Odenwald", 3, 0, "Muslims ask three innocent Christians to identify their religion, then brutally execute them."], ["2008.02.28", "Iraq", "Mosul", 2, 0, "A traffic officer and his young son are shot to death by radical Sunnis."], ["2008.02.29", "Iraq", "Mosul", 2, 0, "An 11-year-old child and his father are murdered in a roadside bombing by Sunni radicals."], ["2008.02.29", "Iraq", "Mosul", 3, 0, "Three Christians are killed trying to unsuccessfully protect their archbishop from an abduction."], ["2008.02.29", "Pakistan", "Lahore", 1, 0, "A 15-year-old girl is strangled by her uncle over an illicit affair."], ["2008.02.29", "Pakistan", "Lakky Marwat", 4, 2, "Four local cops are blown to bits by Islamic bombers."], ["2008.02.29", "Pakistan", "Swat", 42, 50, "Over forty people attending a funeral are murdered by a Fedayeen bomber who wandered into the crowd before detonating."], ["2008.02.29", "Somalia", "Mogadishu", 13, 40, "Thirteen civilians are killed when Islamic terrorists attack government troops near a marketplace."], ["2008.02.29", "Thailand", "Narathiwat", 2, 0, "Two local soldiers are killed in an ambush by Islamic militants."], ["2008.03.01", "Afghanistan", "Khost", 3, 4, "Three members of the same family, including two women, are blown to bits by the Taliban while traveling to a cemetery."], ["2008.03.01", "Iraq", "Baghdad", 5, 12, "Five people are killed when Sunni extremists attack two buses carrying Shia pilgrims."], ["2008.03.01", "Pakistan", "Khar", 2, 21, "A suicide bomber kills two people in a car bomb attack."], ["2008.03.01", "Pakistan", "Langnar", 1, 0, "A 22-year-old man is beheaded by the Taliban."], ["2008.03.01", "Somalia", "Mogadishu", 2, 0, "Two local police manning a checkpoint near a market are shot to death by Islamic militia members."], ["2008.03.02", "Afghanistan", "Zhob", 4, 11, "Two children are among four killed when a bomb rips through an Afghan refugee camp."], ["2008.03.02", "Algeria", "Tizi Ouzou", 1, 0, "Islamic fundamentalists kill a bank guard."], ["2008.03.02", "India", "Warpora", 1, 0, "A civilian is shot to death by the Mujahideen."], ["2008.03.02", "Iraq", "Baquba", 6, 4, "A bus full of Shia pilgrims is attacked Sunni bombers.  At least six are killed."], ["2008.03.02", "Iraq", "Samarra", 8, 30, "A policeman and his family are murdered by Islamic radicals in a bombing attack that also kills others."], ["2008.03.02", "Jordan", "al-Azraq", 2, 0, "A young woman and her lover are shot to death by members of her family to restore their honor."], ["2008.03.02", "Pakistan", "Peshawar", 42, 58, "A teenaged suicide bomber murders over forty people gathered for a peace council."], ["2008.03.02", "Thailand", "Yala", 1, 0, "Islamist shoot a 41-year-old man to death as he is watching television in his home."], ["2008.03.03", "Afghanistan", "Khost", 4, 4, "Two Afghan laborers are among four killed by a Fedayeen suicide bomber."], ["2008.03.03", "Iraq", "Baghdad", 22, 43, "Twenty-two Iraqis are blown to bits by a suicide car bomber along a city street."], ["2008.03.03", "Iraq", "Ghadeer", 4, 10, "A suicide car bomber kills four people near a police checkpoint."], ["2008.03.03", "Iraq", "Samarra", 7, 9, "Jihadis manage to kill seven women and children with a truck bomb."], ["2008.03.03", "Iraq", "Sammara", 14, 0, "Fourteen Iraqis are found in a mass grave, believed to have been abducted and executed by Sunni extremists."], ["2008.03.03", "Pakistan", "Bara", 13, 15, "Thirteen people are killed when Lashkar Islami try to dismantle a rival Sunni shrine."], ["2008.03.04", "Afghanistan", "Tani", 1, 5, "A local cop is killed trying to prevent a suicide car bomber from plowing into a building."], ["2008.03.04", "India", "Shopian", 2, 5, "Two civilians are killed when Mujahid toss a grenade into their home."], ["2008.03.04", "Iraq", "Huwaish", 6, 10, "Four Iraqi children and two women are killed in a bombing attack by Sunni extremists."], ["2008.03.04", "Pakistan", "Khankhel", 1, 0, "A villager is killed in a botched kidnapping attempt by Uzbek Mujahideen."], ["2008.03.04", "Pakistan", "Lahore", 6, 24, "Two suicide bombers take out six other people in the parking lot of a naval college."], ["2008.03.05", "Algeria", "Jijel", 3, 0, "Islamic fundamentalists murder three volunteer guards at a remote village."], ["2008.03.05", "Iraq", "Kirkuk", 1, 0, "A 74-year-old professor is gunned down in a suspected al-Qaeda attack."], ["2008.03.05", "Thailand", "Pattani", 1, 4, "Islamic bomber murder a 47-year-old policeman at a market."], ["2008.03.06", "India", "Reasi", 3, 8, "Two girls, ages 9 and 13, are murdered along with their grandfather when Islamists toss a hand grenade into their home."], ["2008.03.06", "Iraq", "Baghdad", 68, 131, "Sixty-eight Iraqis at a crowded marketplace are murdered in a twin-suicide bombing attack by al-Qaeda.  Over a hundred more are injured."], ["2008.03.06", "Iraq", "Iskandariya", 2, 0, "Jihadis kill two women with a roadside bomb."], ["2008.03.06", "Iraq", "Mosul", 4, 0, "Four civilians are gunned down by Sunni extremists."], ["2008.03.06", "Israel", "Garara", 2, 2, "Two Israeli soldiers are killed in a bombing attack by Islamic Jihad."], ["2008.03.06", "Israel", "Jerusalem", 8, 10, "Eight defenseless students are brutally gunned down at a Jewish seminary by a Muslim gunman.  Seven of the victims are between the ages of 15 and 19."], ["2008.03.06", "Somalia", "Gobale", 4, 3, "Four civilians are killed when Islamic insurgents ambush a group of Ethiopians in a commercial area."], ["2008.03.06", "Somalia", "Mogadishu", 5, 5, "At least five Somalis are killed when Islamists attack a checkpoint with machine-guns and rockets."], ["2008.03.07", "Iraq", "Mosul", 4, 19, "A suicide bomber takes out four Iraqis at a police station."], ["2008.03.07", "Thailand", "Yala", 2, 0, "A 55-year-old man and his wife are murdered by Muslim gunmen inside their home."], ["2008.03.08", "Afghanistan", "Helmand", 3, 1, "Two children and an old man are blown to bits by a Taliban bomb."], ["2008.03.08", "Iraq", "Wajihiya", 3, 2, "Jihadis kill three family members with a roadside bomb."], ["2008.03.09", "Chechnya", "Troitskaya", 1, 0, "An Islamic sniper fires on a convoy, killing a Russian soldier."], ["2008.03.09", "Somalia", "Hiiraan", 10, 8, "A woman is among ten people shot to death by Islamic militants."], ["2008.03.10", "Afghanistan", "Badghis", 1, 0, "Religious extremists ambush and kill a local policeman."], ["2008.03.10", "England", "Liverpool", 1, 0, "A 17-year-old is beaten to death by other Muslims who accused him of violating Islamic law by drinking alcohol."], ["2008.03.10", "Iraq", "Baghdad", 6, 9, "Five US soldiers and one Iraqi are killed when a Fedayeen suicide bomber walks up to a foot patrol on a city street and detonates."], ["2008.03.10", "Iraq", "Kanaan", 3, 2, "A 5-year-old child is among three people murdered by a female suicide bomber."], ["2008.03.10", "Iraq", "Suleimaniyah", 3, 30, "Three civilians are killed by a suicide bomber outside a hotel."], ["2008.03.11", "Afghanistan", "Kandahar", 4, 11, "Two children and two women are killed in the crossfire when Taliban militants attack a military convoy."], ["2008.03.11", "Iraq", "Duluiya", 7, 33, "Two al-Qaeda car bombings leave seven Iraqis dead."], ["2008.03.11", "Iraq", "Nasariya", 16, 13, "Sixteen men, women and children are blown to bits in a Jihad roadside attack on their bus."], ["2008.03.11", "Pakistan", "Bajaur", 11, 13, "Two women are among eleven civilians killed during a firefight following an ambush on government troops by Muslim militants."], ["2008.03.11", "Pakistan", "Lahore", 35, 150, "Children are among the thirty-five innocents murdered when twin Fedayeen suicide bombers detonate in two different parts of the city."], ["2008.03.11", "Somalia", "Mogadishu", 2, 0, "Two local cops are killed in a roadside attack by Islamic militants."], ["2008.03.11", "Thailand", "Pattani", 1, 1, "A man is shot to death by Islamists while riding in a truck with his wife."], ["2008.03.11", "Thailand", "Yala", 1, 0, "A 36-year-old man is shot to death by Muslim terrorists."], ["2008.03.12", "Afghanistan", "Kandahar", 1, 4, "A passing truck driver is killed by a suicide car bomber along a city street."], ["2008.03.12", "Iraq", "Baghdad", 2, 10, "Islamic militants detonate a bomb in a residential neighborhood, killing two people."], ["2008.03.12", "Iraq", "Benazid", 5, 0, "Five Sunnis are shot and beheaded by al-Qaeda."], ["2008.03.12", "Pakistan", "Swat", 2, 2, "Two security personnel are killed by Islamic bombers."], ["2008.03.13", "Afghanistan", "Kabul", 6, 20, "A Fedayeen suicide bomber murders six civilians along a city street."], ["2008.03.13", "Afghanistan", "Saydabad", 1, 4, "Taliban bombers kill a local cop."], ["2008.03.13", "Iraq", "Baghdad", 11, 57, "Eleven innocents are blown to bits by Jihad car bombs in the heart of a commercial district."], ["2008.03.13", "Iraq", "Mosul", 1, 0, "A Christian archbishop is killed while in the captivity of Muslim militants."], ["2008.03.13", "Iraq", "Zab", 3, 9, "A suicide bomber kills three Iraqis."], ["2008.03.13", "Pakistan", "Terak", 1, 0, "A civilian is killed by a Taliban bomb blast."], ["2008.03.13", "Somalia", "Bossaso", 1, 0, "Suspected Islamists assassinate a government official."], ["2008.03.13", "Somalia", "Bur Haqaba", 3, 0, "Three police are killed at point-blank range in a brutal Mujahid attack."], ["2008.03.13", "Somalia", "Mogadishu", 2, 2, "Jihad Warriors fire into a Medecins Sans Frontieres transport vehicle, killing two guards and injuring medical volunteers."], ["2008.03.14", "Iraq", "Baghdad", 8, 24, "A soccer coach is one of at least eight Iraqis killed by Jihadis in various attacks."], ["2008.03.14", "Pakistan", "Sham", 1, 0, "Mujahid slash the throat of a 30-year-old tribesman."], ["2008.03.14", "Pakistan", "Swat", 1, 0, "A Taliban bomb kills a 12-year-old child."], ["2008.03.14", "Somalia", "Mogadishu", 2, 5, "A child is among two killed when Jihadis lob a mortar into their home."], ["2008.03.14", "Somalia", "Mogadishu", 3, 4, "Three local police are murdered in two separate attacks by Muslim extremists at a market."], ["2008.03.15", "Afghanistan", "Khost", 2, 3, "A child and an elderly man are blown to bits by a Shahid bomber."], ["2008.03.15", "Iraq", "Hilla", 1, 8, "Jihadis kill an Iraqi woman with a mortar attack on a neighborhood."], ["2008.03.15", "Pakistan", "Islamabad", 1, 15, "Islamists bomb an Italian restaurant, killing a Turkish woman."], ["2008.03.15", "Thailand", "Pattani", 1, 4, "Islamists set fire to a school to draw firefighters, then detonate a bomb, killing one."], ["2008.03.15", "Thailand", "Pattani", 2, 14, "Two people are killed when Islamic terrorists bomb a hotel."], ["2008.03.16", "Algeria", "Jijel", 3, 17, "Three local soldiers are killed when armed Islamic fundamentalists open fire on their patrol."], ["2008.03.16", "Algeria", "Kadiria", 1, 2, "Fundamentalists kill a 19-year-old student with a bomb that also injures two other teens."], ["2008.03.16", "Algeria", "al-Wadi", 2, 0, "Two moderate Muslims are gunned down by al-Qaeda at a mosque."], ["2008.03.16", "Iraq", "Basra", 1, 0, "A 17-year-old girl is stomped and stabbed to death by her father for falling in love with a British soldier.  (The father is not charged with a crime)."], ["2008.03.16", "Pakistan", "Mardan", 1, 8, "Jihadis kill a local police officer with a roadside bomb."], ["2008.03.16", "Philippines", "Jolo", 1, 0, "A gay man is stabbed and clubbed to death by suspected fundamentalists."], ["2008.03.17", "Afghanistan", "Girishk", 7, 11, "A Shahid blows himself up near a security convoy, killing three civilians and three multinational troops."], ["2008.03.17", "Iraq", "Baghdad", 3, 11, "Mujahideen bomb a minibus, killing three civilian passengers."], ["2008.03.17", "Iraq", "Baghdad", 5, 11, "Five children are killed when Jihadis lob mortars onto a soccer field."], ["2008.03.17", "Iraq", "Karbala", 43, 73, "A female suicide bomber murders over forty Shiites near a shrine."], ["2008.03.17", "Kosovo", "Mitrovica", 2, 130, "A suspected Muslim radical tosses a hand grenade into a crowd of protesting Serbs, killing two people."], ["2008.03.17", "Pakistan", "Swat", 2, 3, "Two young cadets are killed when a Shahid detonates himself at a police training center."], ["2008.03.17", "Thailand", "Yala", 0, 8, "Eight children are injured when Mujahid set off a bomb at a playground."], ["2008.03.17", "Thailand", "Yala", 2, 0, "Two men are shot to death by Muslim militants."], ["2008.03.18", "Canada", "Toronto, ON", 1, 0, "A man slits his wife's throat for disobeying him by allowing their children to be raised 'too Westernized.'"], ["2008.03.18", "Iraq", "Baghdad", 10, 74, "Ten Iraqis are killed by Islamic militants in three separate bombing attacks."], ["2008.03.18", "Israel", "Jerusalem", 0, 1, "A rabbi is stabbed in the neck by a Palestinian."], ["2008.03.18", "Yemen", "Sanaa", 2, 19, "A schoolgirl is among two killed in a bomb attack on the US Embassy."], ["2008.03.19", "India", "Srinagar", 1, 16, "One person is killed, and sixteen others injured when Jihadis plant a bomb along a city street."], ["2008.03.19", "Iraq", "Balad Ruz", 5, 16, "A female suicide bomber kills five innocent people at a market."], ["2008.03.19", "Thailand", "Yala", 1, 0, "A 70-year-old Buddhist is murdered by Mujahideen gunmen at a grocery store."], ["2008.03.19", "Thailand", "Yala", 1, 0, "A Buddhist village guard is shot to death by Islamic terrorists."], ["2008.03.19", "Thailand", "Yala", 2, 0, "Two people are killed when Muslim radicals throw a grenade into a moderate mosque."], ["2008.03.20", "India", "Gawari", 2, 0, "Two children are killed when Lashkar-e-Toiba lob a grenade into the yard of a house."], ["2008.03.20", "Iraq", "Mosul", 2, 7, "Two civilians are killed in a Mujahideen bombing attack in a neighborhood."], ["2008.03.20", "Pakistan", "Wana", 5, 9, "A Shahid detonates himself in a car bomb attack, killing five local soldiers."], ["2008.03.20", "Somalia", "Mogadishu", 7, 20, "A 7-year-old child is among seven people killed when Islamic terrorists attack a government base."], ["2008.03.20", "Thailand", "Pattani", 1, 0, "Muslim radicals gun down a local Imam."], ["2008.03.21", "Afghanistan", "Kabul", 2, 4, "Two people are killed by a Fedayeen suicide bomber."], ["2008.03.21", "Afghanistan", "Kanduz", 1, 0, "A local cop is gunned down by the Taliban."], ["2008.03.21", "India", "Kupwara", 1, 0, "A 40-year-old man is dragged out of his home by Mujahideen, who then slash his throat."], ["2008.03.21", "Iraq", "Mosul", 1, 0, "Holy warriors kidnap and decapitate a civilian."], ["2008.03.22", "Afghanistan", "Jawzjan", 1, 0, "A district chief is stabbed to death by religious extremists."], ["2008.03.22", "Afghanistan", "Kunar", 1, 0, "A civilian is brutally murdered by Sunni extremists."], ["2008.03.22", "India", "Bakhna", 1, 0, "A young man is abducted from his home and brutally killed in captivity by Hizb-ul-Mujahideen."], ["2008.03.22", "Iraq", "Latifiya", 1, 0, "A civilian is kidnapped and beheaded by the Mujahideen."], ["2008.03.22", "Pakistan", "Hangu", 4, 25, "Sectarian strife between rival mosques leaves four dead."], ["2008.03.23", "Afghanistan", "Jawzjan", 5, 7, "Religious extremists calmly shoot five Afghans to death.  The workers were trying to clear landmines at the time."], ["2008.03.23", "India", "Srinagar", 4, 3, "Lashker-e-Toiba militants ambush and kill four policemen."], ["2008.03.23", "Iraq", "Baghdad", 22, 34, "Women and children are among the casualties as Islamic terrorists stage at least three separate attacks on civilians."], ["2008.03.23", "Iraq", "Baqubah", 2, 2, "Two children are killed by a Jihad roadside attack."], ["2008.03.23", "Iraq", "Mosul", 15, 45, "Fifteen Iraqi security personnel are murdered by a suicidal Sunni bomber."], ["2008.03.23", "Iraq", "Samarra", 5, 11, "A Fedayeen suicide bomber kills five Iraqis."], ["2008.03.23", "Pakistan", "Torkham", 2, 50, "al-Qaeda terrorists bomb a restaurant and an oil facility, killing two people."], ["2008.03.23", "Somalia", "Mogadishu", 1, 0, "A doctor is reported killed in an attack by Islamic terrorists."], ["2008.03.24", "Afghanistan", "Herat", 6, 0, "Religious extremists kill two farmers and four local police in an ambush."], ["2008.03.24", "Afghanistan", "Kunduz", 2, 0, "Two more mine-clearing workers are murdered by the Taliban."], ["2008.03.24", "Chechnya", "Alleroi", 2, 0, "Mujahideen murder two policemen with a homemade bomb."], ["2008.03.24", "Iraq", "Baghdad", 2, 0, "The bodies of two American civilians are found mutilated following their kidnapping."], ["2008.03.24", "Pakistan", "North Waziristan", 1, 0, "A young man is executed by al-Qaeda with a gunshot to the head."], ["2008.03.24", "Somalia", "Mogadishu", 4, 0, "A civilian is among four people killed when Islamic terrorists attack a police station."], ["2008.03.24", "Thailand", "Yala", 1, 0, "A 48-year-old man is murdered by Muslim gunmen after dropping his wife off at work."], ["2008.03.25", "Iraq", "Basra", 31, 88, "Thirty-three people are killed when a Shiite militia attacks government troops."], ["2008.03.25", "Pakistan", "Bajaur", 1, 0, "A man is killed in a landmine attack by suspected Islamic militants."], ["2008.03.25", "Pakistan", "Swat", 2, 0, "Two people are murdered by suspected al-Qaeda."], ["2008.03.25", "Pakistan", "Swat", 2, 1, "Islamic militants gun down a married couple as they are standing outside their home."], ["2008.03.26", "Afghanistan", "Helmand", 1, 2, "A local police officer is killed in a landmine attack by religious extremists."], ["2008.03.26", "Afghanistan", "Helmand", 8, 17, "Eight shoppers at an outdoor market are blown to bits by a Taliban car bomb."], ["2008.03.26", "Somalia", "Jowhar", 7, 0, "Mujahideen kill at least seven Somalis in an attack on an agricultural town."], ["2008.03.27", "Iran", "Ahwazi", 7, 0, "Sa'ad Ibn Abi Waqqas Brigade terrorists open fire on a bus, killing seven Iranians."], ["2008.03.27", "Iraq", "Baghdad", 5, 21, "Jihadis kill at least five people in a series of mortar attacks."], ["2008.03.27", "Iraq", "Baiji", 1, 5, "A woman is killed when Islamic terrorists lob a mortar into a neighborhood."], ["2008.03.27", "Iraq", "Diyala", 37, 0, "A mass grave is discovered containing the tortured remains of thirty-seven victims of sectarian violence."], ["2008.03.27", "Iraq", "Samarra", 2, 2, "A man and his son are brutally murdered by al-Qaeda.  A child and woman are injured in the attack."], ["2008.03.27", "Pakistan", "Karachi", 2, 0, "Two local intelligence agents are shot to death by al-Qaeda militants."], ["2008.03.27", "Pakistan", "Kohat", 50, 0, "Four days of violent attacks between Sunni and Shia leave over fifty dead, including women and children."], ["2008.03.27", "Pakistan", "Kurram", 7, 1, "Two women are among seven killed when Islamic terrorists fire a rocket into an ambulance."], ["2008.03.27", "Thailand", "Yala", 0, 8, "Seven children are among eight people injured when Islamists detonate a bomb attached to a motorcycle."], ["2008.03.28", "Afghanistan", "Nimroz", 2, 2, "Two local cops are murdered when the Taliban attack a counter-narcotics unit."], ["2008.03.28", "Iraq", "Baghdad", 2, 6, "Two US civilians are killed in a mortar attack by Islamic terrorists."], ["2008.03.28", "Iraq", "Basra", 1, 0, "A woman with a baby in her arms is murdered by fundamentalists for 'unIslamic' activity."], ["2008.03.28", "Thailand", "Pattani", 1, 0, "A young man is shot to death in his truck by Muslim radicals."], ["2008.03.29", "Afghanistan", "Girishk", 2, 8, "Sunni extremists attack a power station with a bomb, killing two employees."], ["2008.03.29", "Iraq", "Bani Saad", 3, 0, "Three members of a family are wiped out by a Jihadi mortar."], ["2008.03.30", "Iraq", "Baghdad", 1, 0, "The remains of an American soldier, kidnapped and executed in captivity three years earlier, are identified."], ["2008.03.30", "Iraq", "Baghdad", 6, 21, "Jihadis kill six Iraqis with a mortar strike."], ["2008.03.30", "Iraq", "Baiji", 7, 8, "Eight people are killed when Islamists detonate a car bomb."], ["2008.03.30", "Iraq", "Muqdadiyah", 14, 0, "An al-Qaeda mass grave is discovered containing fourteen torture victims."], ["2008.03.30", "Thailand", "Yala", 2, 0, "Islamists murder two civilians in separate attacks."], ["2008.03.31", "Iraq", "Latifiya", 6, 0, "Six Iraqis are kidnapped, blindfolded and shot to death by Islamic terrorists."], ["2008.03.31", "Pakistan", "Nowshera", 2, 0, "A man and a woman are stoned to death for adultery."], ["2008.03.31", "Somalia", "Bule Burte", 12, 0, "Twelve Somalis are killed when Islamists attack a small village."], ["2008.03.31", "Somalia", "Mogadishu", 1, 0, "Islamic extremists sneak up to a local guard and shoot him in the head."], ["2008.04.01", "Afghanistan", "Nimroz", 2, 5, "Two Afghan police are blown up by a suicide car bomber."], ["2008.04.01", "Iraq", "Sammara", 12, 0, "A dozen moderate Sunnis are murdered by al-Qaeda gunmen in two attacks."], ["2008.04.01", "Pakistan", "Matta", 2, 6, "Two members of a tribal peace committee are blown to bits in a bombing attack on their vehicle by Muslim militants."], ["2008.04.02", "India", "Kupwara", 1, 0, "A man is shot to death in his home by Islamic militants."], ["2008.04.02", "Iraq", "Baghdad", 6, 24, "Two women are among six killed in Jihad bombings."], ["2008.04.02", "Iraq", "Mahmudiya", 1, 1, "Gunmen shoot a teacher to death and injure his son."], ["2008.04.02", "Iraq", "Muqdadiyah", 11, 5, "Eleven Iraqis are murdered in Mujahideen bombings."], ["2008.04.02", "Somalia", "Qansah Dhere", 3, 8, "Islamists attack a government residence, killing at least three people."], ["2008.04.03", "Afghanistan", "Kunar", 1, 0, "Religious extremists target a fuel truck, killing the local driver."], ["2008.04.03", "Iraq", "Mosul", 5, 17, "A Fedayeen bomber kills five civilians, including a woman and a 5-year-old child."], ["2008.04.03", "Iraq", "Samarra", 5, 0, "Jihadis kill five Iraqis with a roadside bombing."], ["2008.04.03", "Thailand", "Songkhla", 1, 0, "An older man is murdered by Muslim gunmen while sitting in his truck."], ["2008.04.04", "Afghanistan", "Lashkar Gah", 4, 8, "Four Afghans are murdered by a suicide bomber."], ["2008.04.04", "India", "Kupwara", 2, 0, "Two policemen are kidnapped and brutally tortured to death by the al-Badr Mujahideen."], ["2008.04.04", "Iraq", "Hamrin", 9, 30, "A suicide bomber detonates at a funeral, killing at least nine mourners."], ["2008.04.04", "Iraq", "Hilla", 7, 3, "Two Jihadi bombings leave seven local cops dead."], ["2008.04.04", "Somalia", "Mogadishu", 5, 4, "Islamists kill five local soldiers with a planted bomb."], ["2008.04.05", "Algeria", "Djebel Sbaa", 1, 1, "al-Qaeda bombers kill one Algerian and seriously wound another."], ["2008.04.05", "Iraq", "Baghdad", 3, 16, "Sunni extremists bomb a bus, killing three people."], ["2008.04.05", "Iraq", "Karradah", 1, 0, "A Christian priest is shot to death by Muslim fanatics."], ["2008.04.05", "Iraq", "Khaneqin", 8, 1, "Four oil workers are kidnapped and beheaded.  Four other innocents are killed elsewhere by Jihadis."], ["2008.04.05", "Pakistan", "Kurrum", 2, 26, "Sectarian violence between Sunni and Shia leaves two dead."], ["2008.04.05", "Pal. Auth.", "Gaza", 1, 1, "A Hamas rocket falls short, killing a Palestinian farmer."], ["2008.04.05", "Somalia", "Mogadishu", 3, 3, "Three local soldiers are ambushed and killed by Islamic militia."], ["2008.04.05", "Yemen", "Sanaa", 1, 7, "An al-Qaeda gunmen attacks a checkpoint killing one person."], ["2008.04.06", "Iraq", "Kirkuk", 1, 0, "A woman is shot to death by suspected fundamentalists."], ["2008.04.06", "Iraq", "Samarra", 7, 0, "al-Qaeda gunmen assassinate seven Sunnis."], ["2008.04.06", "Pakistan", "Peshawar", 3, 18, "Islamic militants ambush vehicles along a highway, killing at least three locals."], ["2008.04.06", "Somalia", "Afgoye", 2, 3, "A 9-year-old boy is among two people murdered when Islamists stage a shooting attack."], ["2008.04.06", "Somalia", "Mogadishu", 7, 14, "Seven people are shot to death by Muslim radicals in two attacks at a market."], ["2008.04.06", "Thailand", "Narathiwat", 1, 0, "A civilian is killed by radical Muslim gunmen."], ["2008.04.07", "Afghanistan", "Helmand", 2, 6, "Two local policemen are killed in a Taliban bombing attack."], ["2008.04.07", "Afghanistan", "Herat", 2, 1, "Sunni extremists attack a checkpoint, killing two local officers."], ["2008.04.07", "Afghanistan", "Kandahar", 7, 2, "Seven local members of an anti-drug task force are murdered by religious extremists."], ["2008.04.07", "Somalia", "Baidoa", 13, 12, "Thirteen people are killed in three separate Islamist bomb attacks."], ["2008.04.07", "Sudan", "Darfur", 14, 38, "Janjaweed militias attack three villages, murdering at least fourteen civilians."], ["2008.04.08", "Afghanistan", "Helmand", 1, 2, "Taliban terrorists ambush a group of local cops, killing one."], ["2008.04.08", "Afghanistan", "Zabul", 17, 16, "Seventeen civilian road workers are murdered by Taliban gunmen."], ["2008.04.08", "Iraq", "Balad Ruz", 7, 10, "Sunni bombers target a minibus, killing seven innocents."], ["2008.04.08", "Iraq", "Baquba", 4, 0, "A family of four is wiped out by Jihadi gunmen."], ["2008.04.08", "Pakistan", "Hangu", 2, 4, "Two people are killed over a religious dispute."], ["2008.04.08", "Pakistan", "Karachi", 1, 0, "A Hindu man is beaten to death by his Muslim co-workers over allegedly insulting Islam."], ["2008.04.08", "Somalia", "Mogadishu", 2, 9, "Two people are killed in a Fedayeen car-bomb attack."], ["2008.04.09", "Iraq", "Baghdad", 7, 27, "The Mujahideen lob mortars into a funeral, killing seven mourners, including children."], ["2008.04.09", "Iraq", "Dhuluiya", 5, 0, "A mother and her four children are taken out in a Sunni mortar attack."], ["2008.04.09", "Iraq", "Mosul", 4, 18, "Four people are killed in a pair of Jihad car bombings."], ["2008.04.09", "Israel", "Nahal Oz", 2, 2, "Two Israeli civilians are shot to death by Palestinian militants at a fuel depot."], ["2008.04.09", "Pakistan", "Kurram", 1, 6, "A sectarian clash leaves one person dead."], ["2008.04.09", "Somalia", "Mogadishu", 5, 4, "Islamists target a military convoy with a landmine.  Civilians are among the casualties."], ["2008.04.09", "Thailand", "Pattani", 1, 0, "A man is gunned down by Islamic terrorists while driving home."], ["2008.04.09", "Turkey", "Ankara", 3, 0, "Video is released showing the execution of three Chinese hostages by a Turkish Islamic group."], ["2008.04.10", "Afghanistan", "Kandahar", 8, 20, "Eight civilians are murdered by a Taliban suicide bomber."], ["2008.04.10", "Iraq", "Mahmoudiya", 33, 0, "Thirty victims of sectarian violence within the Religion of Peace are found in a mass grave."], ["2008.04.10", "Iraq", "Mosul", 4, 25, "Jihadis kill four Iraqis with a pair of bombs."], ["2008.04.11", "Iraq", "Baiji", 2, 13, "Children are among the casualties of two Jihad terror attacks, including a suicide bombing."], ["2008.04.11", "Iraq", "Ramadi", 3, 5, "A suicide bomber takes out three Iraqis."], ["2008.04.11", "Pakistan", "Charsadda", 1, 0, "A government official is shot to death by pro-Taliban militants."], ["2008.04.11", "Pakistan", "Chinar Chowk", 2, 3, "Religious radicals shell a market, killing two people."], ["2008.04.11", "Pakistan", "Kurram", 2, 2, "A 13-year-old boy is among two people killed in separate attacks by sectarian militants."], ["2008.04.12", "Afghanistan", "Helmand", 4, 7, "Four local cops are ambushed and killed by the Taliban."], ["2008.04.12", "Afghanistan", "Maiwand", 4, 0, "Sunni extremists murder four anti-drug workers in a field."], ["2008.04.12", "Afghanistan", "Nimroz", 4, 3, "Three Indian road workers and a local Afghan are killed by a Fedayeen suicide bomber."], ["2008.04.12", "Pakistan", "Kurram", 8, 10, "Eight people are killed in violence between rival religious groups."], ["2008.04.13", "Afghanistan", "Khost", 3, 4, "Three civilians are blown to bits by a bomb planted by Islamic militants."], ["2008.04.13", "Ingushetia", "Karabulak", 1, 0, "A judge is assassinated by suspected Islamic gunmen."], ["2008.04.13", "Iraq", "Mosul", 3, 10, "An Islamist bombing and beheading leave three Iraqis dead."], ["2008.04.14", "Afghanistan", "Arghandab", 11, 1, "Islamic hardliners storm a police checkpoint, killing eleven locals."], ["2008.04.14", "Iraq", "Baghdad", 7, 17, "Jihadis kill seven civilians with two bomb blasts."], ["2008.04.14", "Iraq", "Sinjar", 12, 15, "A dozen Iraqi soldiers are murdered by a suicide bomber while traveling home from a security posting."], ["2008.04.14", "Iraq", "Tal Afar", 4, 14, "A suicide bomber takes out four mourners at a funeral."], ["2008.04.14", "Pakistan", "Parachinar", 7, 68, "Seven more people are killed in sectarian violence within the Religion of Peace."], ["2008.04.14", "Somalia", "Belet Weyne", 4, 0, "A 70-year-old man is among four teachers shot in the head by Islamists."], ["2008.04.14", "Somalia", "Merka", 4, 12, "Fundamentalists toss a grenade into a cinema showing Western films, killing at least four patrons."], ["2008.04.15", "Afghanistan", "Spin Boldak", 2, 3, "Two local cops are murdered by Sunni bombers."], ["2008.04.15", "India", "Ramban", 1, 0, "Lashkar-e-Toiba militants kill a local soldier."], ["2008.04.15", "Iraq", "Al-Doum", 5, 6, "Shiite radicals kill five Iraqis and kidnap six more."], ["2008.04.15", "Iraq", "Baghdad", 11, 19, "Jihads rack up eleven civilians, including women, in at least two attacks."], ["2008.04.15", "Iraq", "Baqubah", 40, 80, "At least forty civilians are killed when Sunni extremists plant a bomb near a courthouse."], ["2008.04.15", "Iraq", "Karbala", 5, 2, "Five people are murdered by Sunni extremists in an armed attack on their village."], ["2008.04.15", "Iraq", "Mosul", 9, 20, "Six women, including a schoolgirl, are among nine Iraqis murdered by Jihadis."], ["2008.04.15", "Iraq", "Ramadi", 13, 20, "Islamic terrorists send a suicide bomber into a restaurant, killing at least thirteen patrons."], ["2008.04.15", "Pakistan", "Parachinar", 1, 6, "One person is killed in a Sunni-Shia sectarian clash."], ["2008.04.16", "Afghanistan", "Zabul", 1, 0, "A local police officer is gunned down in a Taliban ambush."], ["2008.04.16", "Iraq", "Muqdadiyah", 2, 5, "Sunni extremists open fire on a minibus, killing two occupants."], ["2008.04.16", "Pakistan", "Khyber", 20, 15, "Lashkar-e-Islam and fellow Sunnis clash over a religious dispute.  Twenty people are killed."], ["2008.04.16", "Thailand", "Pattani", 1, 0, "The manger of a shrimp farm is kidnapped and beheaded by Muslim extremists."], ["2008.04.16", "Yemen", "Marib", 4, 3, "Four local cops are killed in an al-Qaeda bombing."], ["2008.04.17", "Afghanistan", "Zarang", 23, 31, "A Fedayeen suicide bomber strikes a crowd of civilians leaving a mosque, killing two dozen."], ["2008.04.17", "India", "Doda", 1, 0, "A civilian is murdered by Mujahideen gunmen."], ["2008.04.17", "Iraq", "Mahmudiya", 51, 0, "A mass grave containing the tortured remains of 51 Iraqis is discovered."], ["2008.04.17", "Iraq", "Tuz Khormato", 51, 55, "Fifty-one mourners at a funeral are blown to bits by a Fedayeen suicide bomber."], ["2008.04.17", "Pakistan", "Baytha", 1, 0, "Fundamentalists kill a female health worker at her clinic."], ["2008.04.17", "Somalia", "Mogadishu", 3, 0, "Islamists attack three foreigners collecting water, killing them with a rocket."], ["2008.04.17", "Thailand", "Pattani", 1, 0, "A villager on his way to work is shot to death by Muslim terrorists."], ["2008.04.17", "Thailand", "Yala", 1, 0, "A 55-year-old man is shot and killed by Muslim radicals while running errands."], ["2008.04.17", "Thailand", "Yala", 1, 0, "Islamic radicals kill a local soldier in a bomb attack."], ["2008.04.18", "Afghanistan", "Logar", 3, 1, "Three civilians are killed by a Taliban roadside blast."], ["2008.04.18", "Afghanistan", "Uruzgan", 2, 2, "Islamic radicals kill two Dutch soldiers, saying that it is in retaliation for Fitna, a Dutch movie alleging a violence problem within Islam."], ["2008.04.18", "Pakistan", "Parachinar", 4, 0, "Four young men are murdered by suspected Mujahideen in two separate attacks."], ["2008.04.18", "Yemen", "Saada", 3, 6, "A government official and two others are shot to death by suspected Islamic militants."], ["2008.04.19", "Afghanistan", "Zabul", 3, 1, "Three civilians are blown to bits by a Taliban bomb."], ["2008.04.19", "Iraq", "Baqubah", 1, 3, "A child is killed in a Jihad roadside bombing."], ["2008.04.19", "Iraq", "Diwaniyah", 16, 0, "A mass grave is found containing sixteen decapitated bodies."], ["2008.04.19", "Somalia", "Mogadishu", 8, 12, "Eight civilians are killed in an ambush by Islamic militants."], ["2008.04.19", "Thailand", "Narathiwat", 1, 1, "A 45-year-old man is shot and killed by Islamists while riding with his wife on a motorcycle."], ["2008.04.20", "Afghanistan", "Kunar", 1, 5, "The Taliban kill a 15-year-old boy collecting livestock food with other children."], ["2008.04.20", "Iraq", "Diyala", 47, 0, "Forty-seven bodies of kidnap victims are found in a mass grave."], ["2008.04.20", "Iraq", "Rashad", 2, 0, "Two contractors are shot to death by Sunni militants."], ["2008.04.20", "Iraq", "Sinjar", 2, 0, "A government official and his brother are kidnapped from their home and murdered by Islamic terrorists."], ["2008.04.20", "Lebanon", "Zahle", 2, 0, "Two political figures are shot to death by suspected Islamists."], ["2008.04.20", "Pakistan", "Hub", 3, 1, "Three local soldiers are machine-gunned to death by religious radicals."], ["2008.04.20", "Somalia", "Mogadishu", 1, 4, "A man is killed in a mortar attack that also leaves his wife and children injured."], ["2008.04.20", "Thailand", "Narathiwat", 1, 5, "Islamists detonate a bomb and then open fire on a group of local soldiers, killing one."], ["2008.04.20", "Thailand", "Narathiwat", 2, 1, "Two policemen guarding a polling station are gunned down by Muslim militants."], ["2008.04.21", "Afghanistan", "Kandahar", 6, 0, "Six local policemen are murdered in an attack on their checkpoint by religious extremists."], ["2008.04.21", "Iraq", "Baqubah", 4, 5, "A female suicide bomber kills four Iraqis."], ["2008.04.21", "Iraq", "Mosul", 3, 0, "A teenager is among three civilians cut down by militant Sunnis."], ["2008.04.21", "Pakistan", "Jamrud", 2, 5, "Two local security personnel are gunned down in a brutal ambush by dozens of Islamic fighters."], ["2008.04.21", "Somalia", "Baidoa", 1, 0, "A government official is assassinated by Islamic terrorists."], ["2008.04.21", "Somalia", "Guda", 4, 7, "Islamic militias attack a small town, killing four local defenders."], ["2008.04.22", "Iraq", "Baghdad", 6, 10, "Jihadis rain down rockets on a residential neighborhood, leaving six dead."], ["2008.04.22", "Iraq", "Jalawla", 8, 17, "A female suicide bomber murders eight Iraqis."], ["2008.04.22", "Iraq", "Ramadi", 2, 29, "Iraqi children are among the casualties when a suicide bomber targets a group of Marines."], ["2008.04.22", "Thailand", "Yala", 1, 0, "A villager is shot three times in the head by Islamists."], ["2008.04.23", "Afghanistan", "Helmand", 2, 3, "Two Afghans are murdered by a suicide bomber."], ["2008.04.23", "Afghanistan", "Kunar", 5, 7, "Religious extremists attack a police post, killing five officers."], ["2008.04.23", "Afghanistan", "Spin Boldak", 3, 14, "Children are among the casualties of a suicide bombing that kills three civilians."], ["2008.04.23", "Iraq", "Mosul", 4, 9, "Four people are killed by a suicide bomber and responders, who were then gunned down."], ["2008.04.23", "Iraq", "Tikrit", 2, 0, "Two oil workers are murdered by Sunni terrorists."], ["2008.04.23", "Thailand", "Pattani", 1, 0, "A man is shot to death by Muslim militants while riding home on a motorcycle."], ["2008.04.24", "Iraq", "Baghdad", 3, 15, "Freedom fighters bomb a marketplace, killing three Iraqis."], ["2008.04.24", "Iraq", "Kirkuk", 3, 0, "Jihadis manage to murder three people with a roadside bomb."], ["2008.04.24", "Pakistan", "Miranshah", 1, 0, "A young shopkeeper is abducted, tortured and murdered by religious extremists."], ["2008.04.24", "Thailand", "Pattani", 5, 1, "Five construction workers are brutally gunned down by Islamic separatists."], ["2008.04.25", "Afghanistan", "Kabul", 3, 4, "Three local cops are murdered by the Taliban in two attacks."], ["2008.04.25", "Iraq", "Basra", 12, 31, "A child killed when Jihadis throw a grenade into a wedding is among a dozen civilians taken out in various attacks around the country."], ["2008.04.25", "Israel", "Nitzanei Oz", 2, 0, "Two Israelis in their 50's are executed by a Palestinian gunman."], ["2008.04.25", "Pakistan", "Hub", 3, 8, "Suspected Islamists machine-gun three cement factory workers to death on their way to work."], ["2008.04.25", "Pakistan", "Mardan", 5, 30, "Five people are blown to bits by a Taliban bomb."], ["2008.04.26", "Iraq", "Baghdad", 3, 18, "Jihadis gun down a shop owner.  Two other Iraqis are blown up by a suicide bomber."], ["2008.04.26", "Iraq", "Mosul", 9, 11, "Nine people are murdered in two Fedayeen suicide bombing attacks."], ["2008.04.26", "Pakistan", "Dadukhel", 4, 10, "Woman and children are among the casualties when the Taliban attack a residence."], ["2008.04.27", "Afghanistan", "Kabul", 3, 10, "Sunni extremists rocket a parade, killing three people."], ["2008.04.27", "Iraq", "Baghdad", 3, 9, "A suicidal Sunni bomber takes out three Iraqis."], ["2008.04.27", "Iraq", "Samarra", 1, 4, "Jihadis murder a woman in a roadside attack."], ["2008.04.27", "Iraq", "al-Guba", 50, 0, "A mass grave is discovered containing the bodies of at least fifty people, rounded up by Sunni radicals, bound and executed."], ["2008.04.27", "Somalia", "Mogadishu", 3, 0, "Islamic militias fire a mortar into a home, killing a mother and her two children."], ["2008.04.27", "Somalia", "Mogadishu", 7, 2, "Seven civilians are killed when Islamists attack a government target."], ["2008.04.27", "Thailand", "Narathiwat", 2, 0, "Two men in their 30's are shot to death in separate Mujahideen attacks."], ["2008.04.28", "Iraq", "Baghdad", 2, 4, "A woman and child are killed when Islamic terrorists fire mortars into the city."], ["2008.04.28", "Pakistan", "Waziristan", 1, 0, "A 35-year-old policeman is abducted and beheaded by the Taliban."], ["2008.04.28", "Somalia", "Baidoa", 6, 2, "An attack by Islamic militia leaves six people dead."], ["2008.04.29", "Afghanistan", "Khogyani", 18, 14, "The Taliban use a young boy as a suicide bomber, killing eighteen innocent people."], ["2008.04.29", "Iraq", "Baquba", 3, 16, "Two female suicide bomber kill three Iraqis in separate attacks."], ["2008.04.29", "Iraq", "Diyala", 6, 0, "Six academics are kidnapped and murdered by suspected Sunni extremists."], ["2008.04.29", "Iraq", "Kirkuk", 4, 15, "Four Iraqis are taken out by Jihadis in a roadside attack."], ["2008.04.29", "Pakistan", "Kohat", 3, 3, "Militant Muslims gun down three local police officers."], ["2008.04.29", "Somalia", "Hiraan", 1, 0, "A local army officer is kidnapped, tortured and murdered by the Mujahideen."], ["2008.04.29", "Sudan", "Helf", 1, 1, "A woman is killed, and a child gravely injured, when the Islamic Republic bombs a village."], ["2008.04.30", "Iraq", "Tikrit", 2, 0, "A man and woman are kidnapped and tortured to death by suspected Islamic militants."], ["2008.04.30", "Somalia", "Mogadishu", 17, 9, "Seventeen civilians are killed in a bombing by Islamic terrorists."], ["2008.04.30", "Thailand", "Pattani", 1, 1, "A middle-aged man is shot, then burned to death by the Religion of Peace."], ["2008.04.30", "Thailand", "Pattani", 3, 5, "Islamic bombers kill three policemen after luring them to their deaths."], ["2008.05.01", "Afghanistan", "Spin Boldak", 8, 6, "Two children are among eight people killed by the Taliban in separate bombing attacks."], ["2008.05.01", "Iraq", "Baghdad", 9, 23, "Jihadis murder nine people in a car-bomb attack along a city street."], ["2008.05.01", "Iraq", "Balad Ruz", 35, 76, "Two female al-Qaeda suicide bombers take out three dozen Shiites in a brutal attack on a wedding."], ["2008.05.01", "Pakistan", "Bara", 0, 31, "Thirty-one people are injured when a suicide bomber attacks a rival seminary."], ["2008.05.02", "Indonesia", "Horale", 3, 0, "A Muslim mob rampages through a Christian village, killing three people and setting fire to churches and homes."], ["2008.05.02", "Thailand", "Pattani", 1, 1, "Islamists open fire on a group of Buddhists, killing at least one."], ["2008.05.02", "Yemen", "Saada", 3, 0, "Three local cops are gunned down at a checkpoint by suspected Shia militia."], ["2008.05.02", "Yemen", "Saada", 9, 38, "A woman and child are among nine people killed when sectarian Jihadis bomb a rival mosque."], ["2008.05.03", "Iraq", "Baghdad", 2, 7, "Two Iraqis are killed when Islamic terrorists hit an apartment building with a rocket."], ["2008.05.03", "Iraq", "Shirqat", 1, 2, "A child is killed by Jihadis during a mortar attack.  Two others are injured."], ["2008.05.03", "Thailand", "Yala", 1, 0, "Islamists shoot a 47-year-old man to death as he is buying milk."], ["2008.05.04", "Chechnya", "Grozny", 6, 2, "Six local cops are killed by Mujahideen bombers in two separate attacks."], ["2008.05.04", "India", "Kishtwar", 2, 0, "Two civilians are kidnapped an brutally murdered by Hizb-ul-Mujahideen."], ["2008.05.04", "Iraq", "Balad", 2, 0, "Two women are taken out by Jihadis bombers."], ["2008.05.04", "Iraq", "Mosul", 5, 4, "A female journalist pulled from her car and shot in the head is among five people killed by Islamic terrorists."], ["2008.05.04", "Pakistan", "Hafizabad", 1, 0, "A 19-year-old Christian is tortured and killed for having a relationship with a Muslim woman."], ["2008.05.04", "Sudan", "Al-Ain", 3, 0, "Three children are killed when the Islamic Republic bombs a village."], ["2008.05.04", "Sudan", "Shugag Karo", 11, 5, "Eleven civilians are killed when the Islamic Republic bombs a busy market."], ["2008.05.05", "Iraq", "Balad Ruz", 10, 13, "Sunni radicals assassinate ten local policemen."], ["2008.05.05", "Iraq", "Mosul", 3, 2, "Three prostitutes are shot to death in their apartment by Islamic fundamentalists."], ["2008.05.05", "Pakistan", "Matta", 2, 0, "Two bank guards are murdered by followers of a local cleric."], ["2008.05.05", "Thailand", "Narathiwat", 0, 12, "Three young girls are among a dozen injured when Islamists plant a bomb in front of a house."], ["2008.05.06", "Iraq", "Tikrit", 4, 27, "Sunni radicals detonate a car bomb outside a restaurant, killing four and injuring dozens of others."], ["2008.05.06", "Pakistan", "Bannu", 3, 4, "Three people are killed by a suicide bomber pulling a rickshaw."], ["2008.05.07", "Afghanistan", "Khost", 4, 2, "A child and a scientist are among four killed in two attacks by Islamic terrorists."], ["2008.05.07", "Iraq", "Yusufiya", 1, 0, "A local teacher is gunned down by religious militants."], ["2008.05.07", "Jordan", "Amman", 1, 0, "A man shoots his 20-year-old sister three times in the head after learning that she is pregnant outside of marriage."], ["2008.05.07", "Philippines", "Midsayap", 3, 10, "Suspected Islamists detonate a crude bomb, killing three people waiting for a bus."], ["2008.05.07", "Somalia", "Mogadishu", 5, 1, "A young girl is among five people killed when Islamic militias detonate a roadside bomb."], ["2008.05.07", "Somalia", "Mogadishu", 13, 0, "Thirteen civilians are killed when Islamic terrorists ambush an Ethiopian convoy."], ["2008.05.07", "Thailand", "Yala", 1, 0, "A wood factory worker is brutally murdered by Muslim gunmen."], ["2008.05.08", "Iraq", "Baghdad", 10, 25, "Mujahideen murder ten Iraqi civilians with a car bombing and rocket attack."], ["2008.05.08", "Iraq", "Ramadi", 4, 8, "al-Qaeda gunmen kill four Iraqis in a terror attack."], ["2008.05.08", "Pakistan", "Swat", 1, 1, "Fundamentalists blow up a music shop and attack a local security base, killing one soldier."], ["2008.05.09", "Israel", "Kfar Aza", 1, 1, "An Israeli father of four is murdered in a Hamas mortar attack."], ["2008.05.09", "Pakistan", "Kabbal", 1, 2, "Islamic militants kill a local police officer with a hail of rockets."], ["2008.05.09", "Somalia", "Mogadishu", 2, 13, "At least two civilians are killed during an ambush by Islamic militia."], ["2008.05.10", "Iraq", "Basra", 2, 5, "Two civilians are taken out in a roadside bombing."], ["2008.05.10", "Lebanon", "Beirut", 2, 0, "Two funeral mourners are gunned down by suspected Shia snipers."], ["2008.05.10", "Pakistan", "Dera Ismail Khan", 3, 0, "Three young Shia men are brutally shot to death by radical Sunnis while sitting in a shop."], ["2008.05.11", "Algeria", "Medea", 6, 0, "Six Algerian soldiers on patrol are ambushed and killed by the Salafist Group for Preaching and Combat."], ["2008.05.11", "Dagestan", "Makhachkala", 1, 0, "Islamic gunmen open up on a local cop with automatic weapons at point blank range."], ["2008.05.11", "India", "Samba", 6, 5, "A man and his wife are shot to death in their home by Islamic militants.  A photographer and three other civilians are later killed by the same group."], ["2008.05.12", "Algeria", "Bouira", 3, 0, "Islamic fundamentalists stop a patrol truck with a bomb, then machine-gun three soldiers to death."], ["2008.05.12", "Israel", "Moshav Yesha", 1, 0, "A 70-year-old woman is killed in her home by a rocket fired by Islamic Jihad in Gaza."], ["2008.05.12", "Thailand", "Narathiwat", 2, 0, "Two locals are shot to death by militant Muslims."], ["2008.05.12", "Thailand", "Pattani", 3, 0, "Three men are murdered in separate attacks by Islamic gunmen."], ["2008.05.13", "Afghanistan", "Helmand", 2, 6, "Taliban militants kill two local cops in an ambush."], ["2008.05.13", "Afghanistan", "Kunduz", 1, 0, "A teacher is shot to death for saying that suicide bombings are un-Islamic."], ["2008.05.13", "India", "Jaipur", 63, 216, "A Hindu temple is among several targets of Islamic bombers.  Over sixty innocents, including children, lose their lives in the carnage."], ["2008.05.13", "Iraq", "Mosul", 5, 4, "Five Iraqi security personnel are murdered by Sunni bombers."], ["2008.05.13", "Iraq", "Nassiriya", 1, 3, "Jihadis manage to kill one woman and injure three others with a mortar round."], ["2008.05.13", "Pakistan", "Bajur", 1, 1, "Islamic militants attack a military post, killing a local soldier."], ["2008.05.13", "Thailand", "Pattani", 2, 0, "Islamists ambush and kill a middle-aged married couple as they are traveling from their job at a rubber plantation."], ["2008.05.14", "Iraq", "Abu Minasir", 25, 48, "An al-Qaeda suicide bomber detonates at a funeral, killing over twenty innocent people."], ["2008.05.14", "Iraq", "Yusufiya", 1, 7, "al-Qaeda uses a teenage girl as a suicide bomber to kill another Iraqi."], ["2008.05.14", "Israel", "Ashkelon", 0, 15, "A baby is among fifteen injured when Palestinians send an Iranian-supplied rocket into an Israeli shopping mall."], ["2008.05.14", "Pakistan", "Khar", 1, 0, "Islamic militants shoot a village guard to death."], ["2008.05.14", "Pakistan", "Naurak", 1, 0, "A man is kidnapped and beheaded by religious extremists."], ["2008.05.14", "Pakistan", "Peshawar", 1, 1, "Islamic militants ambush and kill a local tribal elder."], ["2008.05.14", "Thailand", "Narathiwat", 1, 0, "An ice cream vendor is shot to death by Muslim terrorists."], ["2008.05.15", "Afghanistan", "Farah", 16, 28, "Sunni extremists use a burqa-clad suicide bomber to blow sixteen people to bits at a marketplace."], ["2008.05.15", "Afghanistan", "Kandahar", 1, 3, "Sunni extremists kill a local soldier with a remote-controlled bomb."], ["2008.05.15", "Dagestan", "Gubden", 2, 1, "Local Islamists gun down two cops."], ["2008.05.15", "Germany", "Hamburg", 1, 0, "A 16-year-old girl is stabbed to death by her brother in an honor killing prompted by her 'Western lifestyle.'"], ["2008.05.15", "Iraq", "Jalawla", 2, 4, "Jihadis kill two Iraqis with a roadside bomb."], ["2008.05.15", "Iraq", "al-Anbar", 11, 0, "al-Qaeda operatives invade the home of eleven Iraqi policemen, killing each one."], ["2008.05.15", "Pakistan", "Kohat Cantt", 2, 1, "Local Taliban kill two Pakistani soldiers on routine patrol."], ["2008.05.15", "Pakistan", "Spinka Raghda", 1, 1, "Taliban militants kill a local soldier with a bomb."], ["2008.05.16", "Iraq", "Fallujah", 4, 9, "Sunni bomber take down four Iraqis with a bombing attack."], ["2008.05.16", "Pakistan", "Khar", 1, 0, "Tehreek-e-Taliban terrorists kidnap a Pakistani man and cut off his head."], ["2008.05.16", "Somalia", "Mogadishu", 20, 25, "Mujahideen stage a rocket attack in a commercial district, killing at least twenty people."], ["2008.05.17", "Afghanistan", "Ghazni", 2, 4, "Two local cops are gunned down by Sunni extremists."], ["2008.05.17", "Afghanistan", "Helmand", 2, 4, "Taliban bombers kill two Afghan security personnel."], ["2008.05.17", "Afghanistan", "Kandahar", 1, 4, "A child is killed when Sunni extremists attach a bomb to a bicycle."], ["2008.05.17", "Afghanistan", "Paktia", 3, 0, "The Taliban murders three Afghan civilians with a roadside bomb."], ["2008.05.17", "Iraq", "Baghdad", 7, 19, "Suspected Shia militia kill seven civilians, including a mother of three."], ["2008.05.17", "Iraq", "Baqubah", 3, 15, "A female suicide bomber blasts at least three Iraqis to Allah."], ["2008.05.18", "Afghanistan", "Helmand", 4, 8, "A religious extremist detonates himself and ends the lives of four Afghan civilians."], ["2008.05.18", "Afghanistan", "Zabul", 1, 0, "A Taliban bombing leaves one civilian dead."], ["2008.05.18", "Iraq", "Baghdad", 2, 6, "Jihadis set a car bomb that kills two Iraqis."], ["2008.05.18", "Pakistan", "Mamirogha", 1, 1, "Islamists kill a civilian with a remote-controlled bomb."], ["2008.05.18", "Pakistan", "Mardan", 14, 22, "Fourteen people are blown to bits by a suicide bomber outside a bakery."], ["2008.05.18", "Thailand", "Pattani", 1, 13, "Islamists set off two bombs, killing one person."], ["2008.05.19", "Afghanistan", "Farah", 1, 0, "Taliban extremists kidnap a local policeman and cut off his head."], ["2008.05.19", "Afghanistan", "Kabul", 1, 0, "A driver for a humanitarian agency is shot to death by Islamic militants."], ["2008.05.19", "Afghanistan", "Wardak", 7, 0, "Seven civilians are killed in a Taliban landmine attack."], ["2008.05.19", "Iraq", "Suwayra", 2, 0, "Two people are kidnapped and tortured.  One is beheaded.  The other shot."], ["2008.05.19", "Iraq", "al-Baaj", 11, 0, "Eleven young police recruits are brutally machine-gunned to death by Sunni terrorists."], ["2008.05.20", "Afghanistan", "Ghazni", 1, 0, "An Afghan civilian is killed by a Taliban bomb."], ["2008.05.20", "Iraq", "Baghdad", 2, 5, "Muslim terrorists bomb a minibus, killing two occupants"], ["2008.05.20", "Iraq", "Balad Ruz", 3, 9, "Jihadis fire mortars into a residential district, killing three people."], ["2008.05.20", "Iraq", "Mandali", 1, 9, "A 5-year-old girl is murdered by an al-Qaeda suicide bomber."], ["2008.05.20", "Philippines", "Patikul", 1, 4, "Abu Sayyaf terrorists ambush a patrol, killing a local soldier."], ["2008.05.20", "Thailand", "Narathiwat", 1, 0, "Islamists gun down a 46-year-old father as he is gassing up his car."], ["2008.05.21", "Afghanistan", "Kunar", 1, 0, "The Mujahideen slit the throat of a 32-year-old woman."], ["2008.05.21", "Afghanistan", "Kunar", 1, 3, "The Taliban kill a small child in a rocket attack."], ["2008.05.21", "Afghanistan", "Paktika", 1, 4, "A suicide bomber takes out a civilian."], ["2008.05.21", "China", "Shanghai", 3, 12, "Responsibility for a bus bombing that kills three people is claimed by the Turkistan Islamic Party."], ["2008.05.21", "Iraq", "Baghdad", 11, 3, "Eleven civilians are killed in a Mujahideen attack."], ["2008.05.21", "Iraq", "Rutba", 4, 3, "A female suicide bomber murders four Iraqis."], ["2008.05.21", "Pakistan", "Khyber", 4, 0, "Islamic militants are thought responsible for the shooting attack that leaves four family members dead."], ["2008.05.21", "Pakistan", "Swat", 1, 0, "Islamic fundamentalists set fire to two girls' schools and gun down a local cop."], ["2008.05.22", "Afghanistan", "Ghazni", 3, 0, "Three local guards are kidnapped and murdered by the Taliban with a bullet to the head."], ["2008.05.22", "Afghanistan", "Kandahar", 1, 1, "An Afghan is killed by a bicycle bomb set by religious extremists."], ["2008.05.22", "India", "Meerut", 3, 0, "Three Hindu youth are brutally tortured and beheaded by a Muslim gang."], ["2008.05.23", "Afghanistan", "Khost", 5, 6, "Five Afghans, including a child, are taken out by a suicidal Sunni bomber."], ["2008.05.23", "India", "Doda", 1, 0, "A civilian is murdered by Mujahideen gunmen while collecting flour."], ["2008.05.23", "Pakistan", "Tall-Mirali", 1, 0, "An Afghan civilian is murdered by Taliban sympathizers."], ["2008.05.23", "Somalia", "Mogadishu", 4, 6, "Four African Union Peacekeepers are killed in a bombing attack by Islamic militia."], ["2008.05.24", "Iraq", "Baghdad", 3, 6, "Jihadis place a bomb on a minibus that kills three Iraqis."], ["2008.05.24", "Iraq", "Shohada", 3, 0, "Three members of the same family are shot to death by Islamic terrorists."], ["2008.05.24", "Pakistan", "Peshawar", 1, 3, "A civilian is killed by a Taliban roadside blast."], ["2008.05.24", "Somalia", "Mogadishu", 5, 1, "A child is among five people killed in an ambush by Islamic militia."], ["2008.05.25", "Pakistan", "Peshawar", 2, 0, "A police chief and his driver are killed when Islamic militants bomb their car."], ["2008.05.25", "Thailand", "Pattani", 1, 0, "A 54-year-old policeman is shot to death outside his home by militant Muslims."], ["2008.05.26", "India", "Kupwara", 1, 0, "Islamic militants ambush and kill a local soldier."], ["2008.05.26", "Iraq", "Baghdad", 3, 12, "An al-Qaeda suicide bomber on a bicycle pedals to paradise, taking three innocents with him."], ["2008.05.26", "Iraq", "Khan Bani Saad", 2, 0, "A 6-year-old boy is shot to death along with his father by Islamic fanatics."], ["2008.05.26", "Iraq", "Tarmiyah", 6, 16, "Six Iraqis are killed by an al-Qaeda suicide bomber."], ["2008.05.26", "Pakistan", "Dera Ismail Khan", 2, 0, "A policeman and a Sunni civilian are killed in separate sectarian attacks."], ["2008.05.26", "Pakistan", "Dera Ismail Khan", 4, 2, "Four Shia are shot to death by radical Sunnis."], ["2008.05.26", "Somalia", "Mogadishu", 13, 8, "Thirteen civilians, including children, are killed during an ambush by Islamic militia."], ["2008.05.26", "Thailand", "Pattani", 1, 0, "Islamic gunmen murder a man inside his home."], ["2008.05.27", "Afghanistan", "Farah", 8, 1, "Eight civilians are blown to bits by a Taliban bombing attack against their minibus."], ["2008.05.27", "Afghanistan", "Kandahar", 3, 0, "Three young children playing near by are murdered by a bomb planted under a bridge."], ["2008.05.27", "Afghanistan", "Logar", 4, 0, "Religious extremists murder four local cops with a roadside bomb."], ["2008.05.27", "Afghanistan", "Shorabak", 9, 3, "Sunni extremists kill nine local police in two bombing attacks."], ["2008.05.27", "Iraq", "Baiji", 3, 0, "Three pipeline workers are shot to death by Sunni radicals."], ["2008.05.27", "Iraq", "Tal Afar", 4, 41, "A Religion of Peace car bomb takes out four Iraqis."], ["2008.05.27", "Lebanon", "Aramoun", 1, 0, "A local soldier is killed by Hezbollah supporters."], ["2008.05.27", "Pakistan", "Khyber", 8, 13, "Islamists clash with each other over religious dispute.  Eight are killed."], ["2008.05.27", "Somalia", "Mogadishu", 9, 11, "Nine civilians are killed when Islamic militia attack government troops along a city street."], ["2008.05.28", "Iraq", "Qara Tara", 2, 1, "Jihadis bomb a family vehicle, killing a father and son."], ["2008.05.28", "Thailand", "Yala", 3, 11, "Guests at a wedding party are among the casualties of a series of Jihad attacks that leave 3 people dead."], ["2008.05.29", "Afghanistan", "Ghazni", 9, 0, "Taliban terrorists overrun a small town, killing nine people."], ["2008.05.29", "Afghanistan", "Kabul", 3, 2, "Two children and a truck driver are blown away by a Religion of Peace car bomb."], ["2008.05.29", "Ethiopia", "Nagele", 3, 5, "An Islamic group claims responsibility for a bomb blast at a hotel that kills three people and leaves five others maimed."], ["2008.05.29", "Iraq", "Mosul", 3, 9, "Three Iraqis are murdered by a suicide bomber."], ["2008.05.29", "Iraq", "Sinjar", 16, 14, "A suicide bomber targets young police recruits, sending at least sixteen to their death."], ["2008.05.29", "Philippines", "Zamboanga", 3, 17, "Three civilians are murdered in a bomb attack by Islamic terrorists."], ["2008.05.29", "Thailand", "Pattani", 1, 0, "A 36-year-old man is shot to death by Muslim radicals while sitting in a teashop."], ["2008.05.30", "Afghanistan", "Kandahar", 1, 2, "A small child is killed by a bicycle bomb planted by Sunni extremists."], ["2008.05.30", "Iraq", "Diyala", 6, 8, "Three women and a child are among six Iraqis killed by Freedom Fighters."], ["2008.05.30", "Pakistan", "Kurram", 2, 0, "Two people are murdered by suspected Islamists."], ["2008.05.30", "Yemen", "Amran", 10, 26, "Ten people are killed when a gunman opens fire inside a mosque in an apparent honor attack."], ["2008.05.31", "Afghanistan", "Zabul", 2, 0, "Taliban gunmen shoot two Afghanis to death."], ["2008.05.31", "Iraq", "Hit", 13, 18, "Thirteen Iraqis are blown apart by a religious extremist with a suicide vest."], ["2008.05.31", "Lebanon", "al-Abedeh", 1, 0, "The Islamic terrorist group, Fatah, kills a local soldier with a bomb blast."], ["2008.05.31", "Pakistan", "Mamad Ghat", 1, 0, "An innocent bystander is killed when a Taliban bomb explodes prematurely."], ["2008.05.31", "Somalia", "Mogadishu", 1, 5, "A young girl is killed during an ambush by Islamic militia."], ["2008.05.31", "Thailand", "Narathiwat", 1, 0, "A 40-year-old motorcycle dealer is murdered by Islamic gunmen while walking home."], ["2008.06.01", "Afghanistan", "Kabul", 1, 5, "The Taliban kill a woman with a remote-controlled bomb."], ["2008.06.01", "Iraq", "Baghdad", 2, 5, "A Jihad car bomb kills two people."], ["2008.06.01", "Iraq", "Jalula", 2, 4, "Islamic terrorists murder a 3-year-old boy and his mother with a roadside bomb."], ["2008.06.01", "Thailand", "Narathiwat", 1, 0, "A Chinese carpet salesman is murdered by Muslim gunmen while sitting in a tea shop."], ["2008.06.02", "Iraq", "Mosul", 11, 45, "A suicide bomber takes out eleven Iraqis in a brutal attack."], ["2008.06.02", "Pakistan", "Islamabad", 8, 17, "Islamists bomb the Danish embassy, presumably over cartoons, killing eight people."], ["2008.06.03", "Afghanistan", "Helmand", 1, 23, "A suicide bomber kills a young child and injures two dozen others."], ["2008.06.03", "Indonesia", "Jakarta", 0, 12, "Radical Muslims with machetes attack a group of Christians at a religious tolerance rally, shouting 'Repent or die!'"], ["2008.06.03", "Iraq", "Baquba", 1, 0, "An 11-year-old boy is shot to death by Freedom Fighters."], ["2008.06.03", "Iraq", "al-Katoun", 1, 0, "A 5-year-old boy is kidnapped and hung by sectarian Jihadis."], ["2008.06.03", "Pakistan", "Kurram", 4, 7, "Two children, ages 11 and 9, are among four killed in a landmine attack by religious extremists."], ["2008.06.03", "Somalia", "Kismayo", 1, 1, "Islamic militia ambush a government official, killing one of his guards."], ["2008.06.03", "Thailand", "Narathiwat", 3, 0, "A teenager is among three civilians killed in separate attacks by Muslim militants."], ["2008.06.03", "Thailand", "Pattani", 1, 0, "A 45-year-old Buddhist is shot to death by Islamic radicals."], ["2008.06.03", "Thailand", "Yala", 1, 1, "Muslim gunmen fire into a home, killing a 15-year-old boy and injuring his 4-year-old sister."], ["2008.06.03", "Thailand", "Yala", 1, 4, "Islamic bombers kill a woman in an attack on a commercial district."], ["2008.06.04", "Afghanistan", "Ghanzi", 2, 0, "Two policemen are killed in a bombing by religious extremists."], ["2008.06.04", "Afghanistan", "Khost", 1, 19, "A civilian is killed by a suicide bomber."], ["2008.06.04", "Afghanistan", "Qarabagh", 2, 3, "The Taliban attack a convoy of fuel tankers, killing two guards."], ["2008.06.04", "Algeria", "Bordj El Kiffan", 2, 0, "Two civilians are taken out by a blast from a bomb planted by Islamic fundamentalists."], ["2008.06.04", "Iraq", "Baghdad", 25, 86, "Twenty-five Iraqis are killed in two explosions, one caused by a truck carrying weapons for Shia militia in a residential area."], ["2008.06.04", "Iraq", "Fallujah", 8, 12, "Freedom Fighters murder eight Iraqis in two attacks."], ["2008.06.04", "Pakistan", "Kohat", 3, 3, "Three people are killed in a wave of bombings against video stores by Islamic fundamentalists."], ["2008.06.04", "Thailand", "Narathiwat", 2, 0, "Mujahideen open fire at the half-time of a soccer match, killing the referee and a player."], ["2008.06.04", "Thailand", "Yala", 1, 0, "A 30-year-old man is killed by Muslim gunmen while out with friends."], ["2008.06.05", "Afghanistan", "Ghazni", 2, 0, "Sunni extremists murder two local police with a roadside bomb."], ["2008.06.05", "Algeria", "Bordj El Kiffan", 6, 4, "Two al-Qaeda suicide bombers leave six Algerians dead at a cafe and military post."], ["2008.06.05", "Israel", "Nir-Oz", 1, 3, "A father of three is murdered by Palestinians firing rockets into an Israeli residential area."], ["2008.06.05", "Pakistan", "Bajaur", 1, 0, "A Pakistani soldier is kidnapped and tortured to death by Islamic fundamentalists."], ["2008.06.06", "Afghanistan", "Nimroz", 1, 5, "A suicide bomber targets Indian engineers working on a road, killing one of them."], ["2008.06.06", "Iraq", "Ramadi", 4, 6, "A female suicide bomber is used in one of two attacks that leave four dead."], ["2008.06.06", "Pakistan", "Dera Ismail Khan", 5, 7, "Five people are killed in a bombing by suspected Islamists."], ["2008.06.06", "Somalia", "Huriwa", 5, 5, "Five civilians are killed during an ambush by Islamic militia."], ["2008.06.06", "Thailand", "Narathiwat", 1, 0, "A middle-aged man is shot to death by Muslim radicals while returning from work."], ["2008.06.06", "Thailand", "Songkhla", 2, 0, "Two construction workers are murdered by Muslim militants."], ["2008.06.06", "Thailand", "Yala", 1, 0, "A Buddhist woman is murdered by Islamic gunmen."], ["2008.06.07", "Afghanistan", "Helmand", 1, 0, "Holy warriors kidnap and murder a journalist."], ["2008.06.07", "Iraq", "Baghdad", 2, 7, "A suicide bomber murders two innocents."], ["2008.06.07", "Iraq", "Baghdad", 4, 18, "Jihadis take out four Iraqis with a roadside bomb blast."], ["2008.06.07", "Iraq", "Kanaan", 1, 3, "A small child is killed by Sunni radicals in a roadside attack."], ["2008.06.07", "Iraq", "Wihda", 8, 0, "Eight victims of suspected al-Qaeda are found in a mass grave, tortured and executed."], ["2008.06.07", "Somalia", "Kismayo", 1, 0, "A journalist is shot to death by Muslim militants."], ["2008.06.07", "Thailand", "Narathiwat", 1, 0, "Islamists gun down a 23-year-old civilian."], ["2008.06.08", "Afghanistan", "Ghazni", 8, 0, "Eight Afghan are murdered in a Mujahideen ambush."], ["2008.06.08", "Afghanistan", "Khost", 4, 0, "Four Afghans are shot to death at point-blank range by Talibanis while sitting in their car."], ["2008.06.08", "Algeria", "Lakhdaria", 13, 8, "Fundamentalists stage a double bomb attack, killing those who rushed to help victims of the first blast."], ["2008.06.08", "Ingushetia", "Nazran", 1, 0, "A local cop is gunned down by suspected Islamists."], ["2008.06.08", "Iraq", "Aziziya", 6, 0, "Six shepherds are brutally murdered by Mujahideen."], ["2008.06.08", "Iraq", "Baghdad", 8, 38, "Jihadis take out eight innocents in two bombing attacks."], ["2008.06.08", "Iraq", "Khanaqin", 5, 0, "Five people at a market are gunned down by Sunni militants."], ["2008.06.08", "Pakistan", "Chitral", 4, 0, "Four children are killed in an explosion triggered by Holy Warriors."], ["2008.06.08", "Pakistan", "Matani", 4, 1, "Four police are ambushed and killed by Jihadis while sitting in their van."], ["2008.06.08", "Somalia", "Baidoa", 1, 0, "A government official is assassinated by religious radicals."], ["2008.06.08", "Somalia", "Mogadishu", 20, 44, "Islamists ambush a military convoy in a civilian district, leaving some twenty people dead."], ["2008.06.09", "Afghanistan", "Ghazni", 5, 0, "The Taliban murder five local police in two shootings."], ["2008.06.09", "Algeria", "Bouira", 20, 0, "Islamic fundamentalists bomb a bus stop, killing twenty ordinary people."], ["2008.06.09", "Iraq", "Baghdad", 4, 12, "Militant Sunnis detonate a bomb along a city street, killing four passers-by."], ["2008.06.09", "Pakistan", "Kurram", 1, 6, "al-Qaeda-backed militants kill a civilian in his home with a mortar attack."], ["2008.06.09", "Thailand", "Yala", 1, 0, "Thai Islamists ambush a local police chief, then set his body on fire in front of his wife."], ["2008.06.10", "India", "Kangan", 1, 0, "Hizb-ul-Mujahideen abduct a 42-year-old civilian from his home and then murder him in captivity."], ["2008.06.10", "Somalia", "Baidoa", 2, 0, "A taxi driver and another civilian are shot to death by Islamists."], ["2008.06.10", "Somalia", "Mogadishu", 1, 0, "A government official is murdered by Islamic gunmen."], ["2008.06.10", "Somalia", "Mogadishu", 6, 2, "Islamic hardliners kill six Somalis in a savage ambush."], ["2008.06.10", "Thailand", "Narathiwat", 2, 0, "Mujahideen shoot and kill two young men riding a motorcycle."], ["2008.06.11", "Iraq", "Baghdad", 5, 10, "Jihads successfully kill five people with a bombing attack on a minibus."], ["2008.06.11", "Iraq", "Fallujah", 5, 0, "Five Iraqis are kidnapped and tortured to death by Sunni terrorists."], ["2008.06.11", "Pakistan", "Bajaur", 1, 0, "A civilian is shot to death by Muslim radicals."], ["2008.06.11", "Pakistan", "Bajaur", 1, 0, "A prostitute is murdered by religious fundamentalists."], ["2008.06.11", "Somalia", "Mogadishu", 2, 0, "The head of a humanitarian agency and his driver are shot to death by Muslim militia."], ["2008.06.11", "Thailand", "Pattani", 1, 2, "Islamist gunmen kill a father in an attack that leaves his two daughters injured as well."], ["2008.06.12", "Bangladesh", "West Bengal", 0, 15, "Fifteen Hindu pilgrims, including women and children, are burned by Molotov cocktails thrown by a Muslim mob."], ["2008.06.12", "England", "Forest Gate", 0, 1, "A Hindu man is set on fire for dating a Muslim girl."], ["2008.06.12", "Pakistan", "Dattakhel", 5, 0, "Five local family members are pulled out of a house and murdered by Islamic fundamentalists."], ["2008.06.12", "Pal. Auth.", "Beit Lahiya", 4, 0, "Four civilians, including a 4-month-old baby, are among seven killed in a Hamas explosion."], ["2008.06.12", "Somalia", "Leego", 1, 0, "A UN food convoy driver is shot by suspected Islamic militia gunmen."], ["2008.06.12", "Somalia", "Mogadishu", 5, 5, "A child is among five civilians murdered by the Mujahideen in a mortar attack."], ["2008.06.13", "Afghanistan", "Kandahar", 15, 0, "At least fifteen local prison guards are killed when Taliban militants storm the facility with two suicide bombers."], ["2008.06.13", "Chechnya", "Benoi-Vedeno", 3, 0, "Mujahideen kill three locals in a sustained attack on their village."], ["2008.06.13", "Dagestan", "Makhchkala", 1, 0, "A bomb planted by suspected Islamists kills a jogger."], ["2008.06.13", "India", "Watsar", 5, 0, "Five local soldiers are ambushed and killed by Lashkar-e-Toiba terrorists."], ["2008.06.13", "Ingushetia", "Naran", 4, 4, "Islamic fundamentalists detonate a bomb at a building storing alcohol, killing at least four innocents."], ["2008.06.13", "Iraq", "Tuz Khormato", 3, 0, "A father and son are among three people shot to death by Mujahideen."], ["2008.06.14", "Afghanistan", "Helmand", 4, 1, "Religious extremists kill four US Marines training local security forces."], ["2008.06.14", "Iraq", "Baghdad", 2, 7, "Jihadis kill two people with a bomb on a minibus."], ["2008.06.14", "Iraq", "Mosul", 2, 0, "Two brothers are shot to death outside their home by Holy Warriors."], ["2008.06.14", "Pakistan", "Sanghar", 1, 16, "Sunni extremists are thought responsible for a bomb at a tea shop that kills a young boy."], ["2008.06.14", "Somalia", "Mogadishu", 4, 0, "Two women are among four civilians abducted and murdered by suspected Islamic militia."], ["2008.06.15", "Afghanistan", "Helmand", 1, 1, "The Taliban kill a local police chief with a remote-controlled bomb."], ["2008.06.15", "Afghanistan", "Khost", 1, 0, "A 12-year-old boy is killed by Taliban bombers as he is walking to school."], ["2008.06.15", "Iraq", "Baghdad", 0, 34, "A female suicide bomber targets soccer fans celebrating a victory."], ["2008.06.15", "Iraq", "Baghdad", 3, 1, "Three members of a family, including two women, are murdered by Sunni militants in a home invasion."], ["2008.06.15", "Iraq", "Mosul", 2, 1, "A college professor is among two people shot to death by Freedom Fighters."], ["2008.06.15", "Pakistan", "FATA", 5, 7, "Islamic militants kill five people in two landmine attacks."], ["2008.06.16", "Chechnya", "Grozny", 3, 5, "Three border guards are murdered in a Jihad ambush on their vehicle."], ["2008.06.16", "Iraq", "Baghdad", 4, 31, "A double suicide bombing is one of two attacks that leaves four civilians dead."], ["2008.06.16", "Lebanon", "Bekaa", 3, 4, "Three people are killed in a sectarian clash."], ["2008.06.16", "Pakistan", "Dera Ismail Khan", 4, 5, "Four Shiites praying at a mosque are blown to bits by radical Sunnis."], ["2008.06.16", "Pakistan", "Torchapar", 1, 0, "Local Islamists kidnap and murder a village elder."], ["2008.06.17", "Iraq", "Baghdad", 63, 78, "Shiite radicals bomb an open-air market, slaughtering over sixty shoppers and vendors."], ["2008.06.17", "Iraq", "Mosul", 1, 0, "Religious extremists gun down a journalist who had presented segments on Islam and culture."], ["2008.06.17", "Iraq", "al-Saba Abkar", 4, 2, "A suicide bicycle bomber pedals to paradise, taking four Iraqis with him."], ["2008.06.17", "Pakistan", "Hangu", 4, 0, "Four members of a Shia family are murdered in their car by Sunni gunmen."], ["2008.06.17", "Somalia", "Mogadishu", 3, 2, "Islamic militants fire a mortar into a home, killing three civilians."], ["2008.06.17", "Somalia", "Mogadishu", 3, 17, "Three civilians are killed when Islamic militia open fire on government troops."], ["2008.06.17", "Thailand", "Narathiwat", 1, 0, "A 45-year-old widow and mother of five is chased down and shot by Holy Warriors."], ["2008.06.18", "Afghanistan", "Khost", 4, 3, "Four local cops are killed in a Taliban bombing."], ["2008.06.18", "Iraq", "Nineveh", 12, 0, "A report surfaces of a dozen Christian children kidnapped and crucified by Muslim extremists over the course of five years."], ["2008.06.18", "Somalia", "Mogadishu", 4, 3, "Four local police are killed by a roadside bomb detonated by Islamists."], ["2008.06.18", "Thailand", "Pattani", 2, 5, "Two members of a security patrol die from shrapnel injuries following a roadside blast set off by Mujahideen."], ["2008.06.19", "Iraq", "Tuz Khormato", 1, 0, "A man is kidnapped and tortured to death by Mujahid."], ["2008.06.19", "Pakistan", "Hajira", 4, 3, "Four local soldiers are killed by Islamic terrorists."], ["2008.06.19", "Pakistan", "Kharian", 1, 0, "A man shoots his sister-in-law to death on suspicion of 'bad character.'"], ["2008.06.19", "Pakistan", "Kurram", 4, 0, "Muslim radicals ambush a food relief convoy, killing the driver and three others, and then setting fire to the goods."], ["2008.06.19", "Pakistan", "Kurram", 7, 10, "Clashes between Sunni and Shia leave at least seven dead."], ["2008.06.19", "Thailand", "Yala", 2, 0, "A 3-year-old boy and his father are gunned down by the Religion of Peace."], ["2008.06.20", "Afghanistan", "Helmand", 7, 10, "Children are among the casualties when a suicide bomber detonates in a crowded market."], ["2008.06.20", "Afghanistan", "Zabul", 2, 3, "Two local soldiers are killed in a bomb attack by religious extremists."], ["2008.06.20", "France", "Paris", 0, 1, "A 17-year-old Hassidic Jew is beaten into a coma by Muslim immigrants."], ["2008.06.20", "Iraq", "Baghdad", 3, 8, "A Jihad car bombing kills eight Iraqis."], ["2008.06.20", "Israel", "Neveh Tzuf", 0, 2, "Masked Palestinians shoot two Israelis in a brutal drive-by attack."], ["2008.06.20", "Somalia", "Mogadishu", 13, 30, "At least two children are among thirteen civilians killed in attacks by Islamic militia."], ["2008.06.20", "Thailand", "Yala", 1, 4, "Islamic gunmen open up on a truck, killing an occupant."], ["2008.06.21", "Afghanistan", "Khost", 4, 8, "A woman and three children are taken out by a Mujahid rocket attack."], ["2008.06.21", "Afghanistan", "Kunar", 1, 2, "Extremists send a rocket into a hospital, killing at least one person."], ["2008.06.21", "Iraq", "Baquba", 2, 0, "Two brothers are kidnapped and killed."], ["2008.06.21", "Pakistan", "Khyber", 29, 50, "Feuding religious sects clash, leaving about thirty people dead."], ["2008.06.21", "Thailand", "Narathiwat", 4, 0, "Four railway workers are gunned down in cold blood by radical Muslims."], ["2008.06.22", "India", "Srinagar", 1, 0, "Lashkar-e-Taiba members ambush and kill an Indian soldier."], ["2008.06.22", "Iraq", "Baqubah", 17, 42, "A female suicide bomber massacres seventeen Iraqis."], ["2008.06.22", "Iraq", "Khalis", 7, 12, "Jihadis murder seven Iraqis in a mortar attack on a residential neighborhood."], ["2008.06.22", "Iraq", "Kirkuk", 3, 2, "Two women are among three killed in a Mujahideen bombing."], ["2008.06.22", "Lebanon", "Tripoli", 9, 35, "Nine people are killed in sectarian clashes within the Religion of Peace."], ["2008.06.22", "Somalia", "Dharkenley", 3, 4, "Three local soldiers are killed in an Islamic militia bombing."], ["2008.06.23", "Afghanistan", "Kandahar", 3, 0, "Taliban militants kill three local police in a brutal ambush."], ["2008.06.23", "Afghanistan", "Shindand", 5, 19, "A suicide car bomber takes out five Afghan civilians."], ["2008.06.23", "Dagestan", "Buinaksk", 1, 0, "A police chief succumbs after being sprayed with automatic weapons fire."], ["2008.06.23", "Iraq", "Mosul", 4, 2, "A woman and a university student are among four murdered by Islamic gunmen."], ["2008.06.23", "Lebanon", "Tripoli", 2, 0, "Two more people are killed in sectarian violence."], ["2008.06.23", "Pakistan", "Jandola", 16, 10, "Islamic militants attack pro-government tribesmen, killing at least sixteen."], ["2008.06.23", "Pakistan", "Kurram", 11, 0, "Eleven kidnapped Shias are brutally beheaded by Sunni radicals."], ["2008.06.24", "Afghanistan", "Herat", 1, 0, "A policewoman is murdered by fundamentalists as she is walking home from work."], ["2008.06.24", "Iraq", "Baghdad", 11, 11, "Eleven people are killed when Islamic militants set off a bomb at a government building."], ["2008.06.24", "Iraq", "Mosul", 2, 75, "A baby is among two people killed by a Fedayeen suicide bomber."], ["2008.06.24", "Lebanon", "Tripoli", 1, 0, "Another person is killed in a sectarian clash."], ["2008.06.24", "Somalia", "Kismayo", 1, 2, "A local official is assassinated by suspected Islamists."], ["2008.06.25", "Iraq", "Baghdad", 5, 25, "Two Jihad bombings leave five Iraqis dead."], ["2008.06.25", "Pakistan", "Jandola", 28, 0, "Twenty-eight members of a local peace council are murdered by the Taliban."], ["2008.06.25", "Somalia", "Deynile", 9, 0, "Nine local police are ambushed and killed by Islamic militia."], ["2008.06.26", "Iraq", "Karma", 20, 24, "A Fedayeen suicide bomber murders twenty innocents."], ["2008.06.26", "Iraq", "Mosul", 17, 62, "Jihadis successfully take out seventeen Iraqis with a well-placed car bomb."], ["2008.06.26", "Pakistan", "Barikot", 7, 0, "Islamists burn down a girls school and kill a family of seven."], ["2008.06.27", "Algeria", "Jijel", 6, 14, "Six security personnel are taken out by al-Qaeda gunmen."], ["2008.06.27", "Chechnya", "Vedeno", 4, 0, "Four police are ambushed and killed by Jihad fighters."], ["2008.06.27", "Iraq", "Khanaqin", 1, 2, "Islamic militants kill a shepherd with a well-placed bomb."], ["2008.06.27", "Iraq", "Shurqat", 2, 3, "al-Qaeda takes out two Iraqis with a roadside blast."], ["2008.06.27", "Pakistan", "Damadola", 2, 0, "A mob screaming \"Allah Akbar\" slits the throats of two Afghans, then beheads them."], ["2008.06.27", "Thailand", "Narathiwat", 1, 1, "A 36-year-old civilian is shot to death by Mujahid after dropping his children off at school."], ["2008.06.27", "Thailand", "Pattani", 1, 0, "A 64-year-old man is murdered by Islamic gunmen."], ["2008.06.28", "Afghanistan", "Faryab", 8, 0, "Eight local cops are ambushed and killed by Talibanis."], ["2008.06.28", "Iraq", "Samarrah", 7, 0, "Seven dead torture victims, including a woman, are found in an al-Qaeda hideout."], ["2008.06.28", "Iraq", "Samarrah", 50, 0, "A mass grave is discovered containing women and children among fifty people rounded up by Sunni militants and executed."], ["2008.06.28", "Lebanon", "Tripoli", 2, 25, "Shia terrorists detonate a bomb in an apartment building, killing two residents."], ["2008.06.28", "Pakistan", "Khyber", 8, 5, "A sectarian disagreement leaves eight dead."], ["2008.06.29", "Afghanistan", "Farah", 4, 5, "Religious extremists attack a local police post, killing four officers."], ["2008.06.29", "Iraq", "Duluiya", 7, 3, "A Fedayeen suicide bomber murders seven Iraqis."], ["2008.06.29", "Iraq", "Udhaim", 3, 0, "Mujahid kill two women and a child with a mortar attack on their home."], ["2008.06.29", "Pakistan", "Swat", 1, 0, "A civilian is beheaded by Sunni radicals."], ["2008.06.29", "Pakistan", "Swat", 6, 5, "Islamic militants kill six people in at least two separate bombings."], ["2008.06.30", "Somalia", "Mogadishu", 1, 0, "Muslim radicals kidnap and kill a humanitarian aid worker."], ["2008.06.30", "Thailand", "Yala", 1, 0, "A 46-year-old man is shot to death by Islamic terrorists."], ["2008.07.01", "Afghanistan", "Lashkar Gah", 2, 7, "Taliban bombers kill two local policemen."], ["2008.07.01", "Iraq", "Buhriz", 3, 1, "Three members of the same family are murdered by Mujahideen bombers."], ["2008.07.01", "Iraq", "Mandali", 4, 16, "A Fedayeen suicide bomber sends four Iraqis to Allah."], ["2008.07.01", "Iraq", "Mosul", 2, 32, "Two Jihad bombs leave two dead and about forty wounded."], ["2008.07.01", "Pakistan", "Swat", 5, 3, "An elderly woman is among five people shot to death by Islamists in four separate attacks."], ["2008.07.01", "Philippines", "Aleosan", 1, 0, "A Christian man is shot to death after refusing to give up his property to Moro Islamic Front raiders."], ["2008.07.01", "Somalia", "Mataban", 53, 40, "Fifty-three people are killed in a series of ambushes by Islamic militants."], ["2008.07.02", "Afghanistan", "Logar", 5, 0, "The Taliban murder five local soldiers with a roadside blast."], ["2008.07.02", "Afghanistan", "Nimroz", 5, 2, "Five people are murdered by a Fedayeen suicide bomber."], ["2008.07.02", "India", "Bhaderwah", 1, 20, "A man later dies of injuries suffered when Islamists toss a grenade into the street."], ["2008.07.02", "Iraq", "Baghdad", 3, 6, "A street sweeper is among three people killed in a Mujahideen roadside bombing."], ["2008.07.02", "Israel", "Jerusalem", 3, 57, "Two teachers, including a mother, are among three people are killed when a Palestinian goes on a violent rampage with a bulldozer."], ["2008.07.02", "Thailand", "Narathiwat", 1, 0, "Islamic gunmen murder a woman shortly after she drops her daughter off at school."], ["2008.07.03", "Afghanistan", "Kandahar", 8, 3, "Eight local police are killed in a brutal ambush by Sunni militants."], ["2008.07.03", "Iraq", "Baghdad", 4, 8, "Four Iraqis are blown apart by an Islamist bomb."], ["2008.07.03", "Iraq", "Samarra", 14, 0, "Fourteen victims of Sunni terrorists are discovered in a mass grave."], ["2008.07.03", "Pakistan", "Khyber", 5, 4, "Five people are killed when rival Islamist groups clash."], ["2008.07.03", "Somalia", "Hiiran", 10, 0, "Ten civilians are killed in an ambush by Islamic militia."], ["2008.07.03", "Thailand", "Yala", 1, 0, "A school principal is shot to death by Muslim radicals."], ["2008.07.04", "Afghanistan", "Kandahar", 1, 0, "Islamic hardliners are suspected in the assassination of a local official walking home from work."], ["2008.07.04", "Afghanistan", "Maidan-Wardak", 2, 5, "Two Afghan security personnel are taken out in a Taliban bombing."], ["2008.07.04", "India", "Kupwara", 5, 0, "Five Indian army personnel are massacred in a Mujahideen ambush."], ["2008.07.04", "Thailand", "Pattani", 1, 0, "A retired schoolteacher is gunned down by Islamic militants."], ["2008.07.04", "Thailand", "Yala", 1, 0, "Muslim radicals shoot a 42-year-old man to death."], ["2008.07.04", "Thailand", "Yala", 1, 1, "Islamists shoot a Buddhist, hammer nails through his hands, behead him and then set his body on fire.  The man's son is seriously injured as well."], ["2008.07.05", "Iraq", "Mosul", 3, 6, "Islamic militants manage to kill three Iraqis in two bombing and shooting attacks."], ["2008.07.05", "Somalia", "Mogadishu", 6, 0, "A married couple is blown up with four others by a bomb planted by Islamic fundamentalists."], ["2008.07.05", "Thailand", "Yala", 4, 4, "Muslim gunmen open up on a crowd eating breakfast at a tea shop, killing four."], ["2008.07.06", "Iraq", "Baghdad", 6, 14, "Jihadis kill six Iraqis with a car bomb."], ["2008.07.06", "Iraq", "Jalawla", 7, 12, "Seven members of the same family are murdered by a well-placed roadside bomb."], ["2008.07.06", "Iraq", "Mussayab", 1, 0, "Suspected fundamentalists kidnap and torture a woman to death."], ["2008.07.06", "Pakistan", "Islamabad", 19, 23, "A brutal suicide attack by a teenager near a market and a police station leaves about two dozen dead and many more maimed and bloodied."], ["2008.07.06", "Pakistan", "Quetta", 1, 1, "A prominent Shia is killed in a sectarian killing that also leaves a young boy injured."], ["2008.07.06", "Philippines", "Kauswagan", 5, 0, "Five people are killed in a shooting attack on a bus by suspected Moro Islamic terrorists."], ["2008.07.06", "Somalia", "Mogadishu", 1, 0, "Islamists gun down a UN official in charge of development."], ["2008.07.06", "USA", "Atlanta, Georgia", 1, 0, "A devout Muslim strangles his 25-year-old daughter in an honor killing."], ["2008.07.07", "Afghanistan", "Kabul", 65, 147, "Sunni hardliners bomb an Indian embassy, killing over sixty people, including seventeen children."], ["2008.07.07", "Iraq", "Baghdad", 17, 40, "Various attacks by the Mujahideen leave about seventeen innocent people dead, including women."], ["2008.07.07", "Pakistan", "Quetta", 1, 0, "A Shia lawyer is shot to death by sectarian rivals."], ["2008.07.07", "Pakistan", "Swat", 1, 0, "A religious leader is killed by rival Muslims."], ["2008.07.07", "Somalia", "Baidoa", 2, 7, "al-Shabaab terrorists attack a government facility, killing two people."], ["2008.07.07", "Thailand", "Pattani", 2, 3, "Islamists open fire on a bus full of Buddhist teenagers, killing two guards."], ["2008.07.08", "India", "Joynagar", 1, 0, "A Hindu monk is tied to a tree and severely beaten by a Muslim mob."], ["2008.07.08", "Iraq", "Mosul", 4, 8, "Sunni bombers kill four contractors traveling in a vehicle."], ["2008.07.08", "Iraq", "Ramadi", 22, 0, "Twenty-two victims of sectarian violence are discovered buried at an elementary school."], ["2008.07.08", "Pakistan", "Bara", 5, 3, "Hardliners ambush a security vehicle, killing five local cops."], ["2008.07.08", "Pakistan", "Karachi", 1, 37, "Religious hardliners set off a series of bombs, killing at least one person."], ["2008.07.08", "Philippines", "Pagangan", 1, 0, "A farmer is killed following an ambush by Moro Islamists."], ["2008.07.08", "Thailand", "Pattani", 2, 0, "A husband and wife team of laborers is shot, showered with gas and then burned by radical Muslims."], ["2008.07.09", "Ingushetia", "Muzhichi", 3, 0, "Islamic rebels kill three local policemen in a shooting attack."], ["2008.07.09", "Iraq", "Baghdad", 6, 8, "Muslim gunmen fire inside a rival mosque, murdering four attendees."], ["2008.07.09", "Iraq", "Baqubah", 4, 11, "Jihadis bomb a funeral procession, killing four mourners."], ["2008.07.09", "Iraq", "Fallujah", 6, 18, "Six elderly people are blown apart by a double bombing at a mosque."], ["2008.07.09", "Iraq", "Mosul", 8, 41, "Eight Iraqis are murdered by Mujahideen bombers."], ["2008.07.09", "Jordan", "Mafraq", 1, 0, "A 16-year-old girl is stabbed to death by her brother on suspicion of pre-marital sex."], ["2008.07.09", "Lebanon", "Tripoli", 4, 54, "Four people are killed in a Religion of Peace sectarian clash."], ["2008.07.09", "Pakistan", "Kurram", 1, 1, "One man is killed and another loses his leg after an encounter with the handiwork of Taliban bombers."], ["2008.07.09", "Pakistan", "Mardan", 2, 1, "Islamic militants fire on a police van, killing two officers."], ["2008.07.09", "Sudan", "Umm Hakibah", 7, 22, "Janjaweed militants attack a group of Africans working as UN peacekeepers, killing seven."], ["2008.07.09", "Turkey", "Istanbul", 3, 0, "al-Qaeda gunmen stage a brutal attack on the US consulate that leaves three guards dead."], ["2008.07.10", "India", "Kupwara", 1, 1, "Islamic militants ambush two local police, killing one."], ["2008.07.10", "Iraq", "Baghdad", 2, 13, "Two civilians are murdered when Jihadis detonate a car bomb in a residential neighborhood."], ["2008.07.10", "Pakistan", "Bajaur", 1, 2, "Islamic militants kill a 15-year-old girl in a targeted rocket attack on a home."], ["2008.07.10", "Pakistan", "Dosli", 1, 0, "A doctor is shot four times in the chest.  A note pinned to the body accuses him of 'opposing Islam and Jihad.'"], ["2008.07.10", "Pakistan", "Khyber", 8, 0, "Two women are among eight killed when militants fire mortars into two homes."], ["2008.07.10", "Pakistan", "Kurram", 7, 12, "The Taliban kill seven civilians in two landmine attacks."], ["2008.07.10", "Pakistan", "Tirah", 5, 15, "Rival Islamist groups clash, leaving five people dead."], ["2008.07.10", "Somalia", "Afgyoye", 1, 0, "Islamists with automatic weapons shoot a Christian man to death for not praying toward Mecca."], ["2008.07.10", "Somalia", "Baidoa", 2, 4, "Two local soldiers are beheaded by the Al-Shabaab Islamist group."], ["2008.07.11", "Pakistan", "Karachi", 1, 0, "The head of a Shia mosque is murdered by Sunni gunmen."], ["2008.07.11", "Somalia", "Taredishe", 1, 0, "Suspected Islamic militia gun down two aid workers in separate attacks as they are handing out food."], ["2008.07.12", "Afghanistan", "Bargi Matal", 1, 0, "A youth is killed defending his village from a Taliban attack."], ["2008.07.12", "Afghanistan", "Ghazi", 2, 0, "The Taliban force two female prostitutes to their knees, then shoot them."], ["2008.07.12", "Afghanistan", "Helmand", 4, 5, "A Fedayeen bomber in a suicide vest kills four local soldiers on routine patrol."], ["2008.07.12", "Algeria", "Beni Djemaa", 1, 0, "Fundamentalists behead a 66-year-old farmer."], ["2008.07.12", "Chechnya", "Grozny", 1, 2, "Mujahideen detonate a bomb hidden in a trash can, killing one person."], ["2008.07.12", "Iraq", "Mosul", 3, 4, "A woman and two local cops are murdered by Sunni radicals in separate attacks."], ["2008.07.12", "Iraq", "Tal Afar", 7, 0, "The bodies of seven people kidnapped by Islamic terrorists are discovered."], ["2008.07.12", "Pakistan", "Hangu", 16, 0, "Sixteen pro-government tribesmen are killed by the Taliban, eight by execution."], ["2008.07.12", "Pakistan", "Tirah", 7, 5, "Two women are among seven people killed in clashes between rival Islamist groups."], ["2008.07.13", "Afghanistan", "Oruzgan", 25, 30, "A suicide attack near a busy market leaves over two dozen people dead."], ["2008.07.13", "Iraq", "Baghdad", 11, 18, "Eleven Iraqis are killed in at least three Mujahid attacks around the country."], ["2008.07.13", "Pakistan", "Kharqamar", 1, 0, "A civilian is abducted and beheaded by devoted members of the Religion of Peace."], ["2008.07.13", "Pakistan", "Khyber", 6, 10, "Lashkar-e-Islam and Ansar-ul-Islam continue to work out their differences (six more dead)."], ["2008.07.14", "Afghanistan", "Paktika", 7, 2, "Sunni extremists take out a car with a roadside bomb, killing seven civilians."], ["2008.07.14", "India", "Doda", 1, 2, "Islamists toss a grenade into a police station, killing at least one local officer."], ["2008.07.14", "Iraq", "Baghdad", 3, 14, "Three people are killed when a Muslim terrorist tosses a grenade into a gathering."], ["2008.07.14", "Pakistan", "Balochistan", 5, 0, "Five women are tortured and buried alive for wanting to marry by choice."], ["2008.07.14", "Somalia", "Mogadishu", 1, 0, "Islamic militia gun down a man sitting in a tea shop."], ["2008.07.14", "Somalia", "Mogadishu", 2, 2, "Two woman are murdered in a shooting attack by Mujahideen."], ["2008.07.14", "Somalia", "Mogadishu", 4, 4, "Islamic militia kill four local soldiers in two ambushes."], ["2008.07.14", "Thailand", "Songkhla", 1, 1, "A local security patrol is ambushed by Islamic militants, leaving one member dead."], ["2008.07.15", "Chechnya", "Grozny", 1, 3, "A local cop is murdered in a staged Mujahideen ambush."], ["2008.07.15", "Iraq", "Baqubah", 35, 69, "Fedayeen bombers massacre nearly forty Iraqis, including first responders."], ["2008.07.15", "Iraq", "Mosul", 12, 6, "Two suicide bombers take out a dozen Iraqis in separate attacks."], ["2008.07.15", "Pakistan", "Khyber", 7, 5, "Rival Islamic groups continue to work out their differences by shooting at each other (seven more dead)."], ["2008.07.16", "India", "Doda", 1, 0, "Islamic militants abduct and murder a civilian."], ["2008.07.16", "Iraq", "Baghdad", 3, 7, "A female al-Qaeda suicide bomber detonates in the house a Sunni family, killing three people."], ["2008.07.16", "Iraq", "Mosul", 2, 9, "Jihadis kill two Iraqis with a car bomb."], ["2008.07.16", "Iraq", "Tal Afar", 18, 90, "Mujahideen detonate a car bomb along a city street, slaughtering at least eighteen Iraqis, including seven children."], ["2008.07.16", "Pakistan", "Lahore", 1, 0, "A teenaged Christian boy is kidnapped, tortured for two days, then killed by Muslims for dating a Muslim girl."], ["2008.07.16", "Somalia", "Anjel", 1, 0, "A Muslim gang murders a Christian man."], ["2008.07.17", "Afghanistan", "Zabul", 1, 5, "Taliban militants attack a convoy, killing an Afghan."], ["2008.07.17", "India", "Murshidabad", 1, 0, "A Hindu man is beheaded by Muslims, angry that he married a Muslim woman."], ["2008.07.17", "Pakistan", "Mohmand", 3, 0, "Three people are killed when rival Islamist groups clash."], ["2008.07.17", "Somalia", "Huriwa", 5, 3, "A mother and her two children are among five killed when Holy Warriors stage an ambush."], ["2008.07.18", "Afghanistan", "Helmand", 3, 4, "Three Afghan guards are killed when religious hardliners bomb their convoy."], ["2008.07.18", "India", "Banihal", 0, 36, "Three dozen people, mostly women and children, are injured when Islamic terrorists toss a grenade into a crowded market."], ["2008.07.18", "India", "Udhampur", 1, 0, "A civilian is abducted and murdered by the Hizb-ul-Mujahideen."], ["2008.07.18", "Iraq", "Mosul", 4, 7, "A Fedayeen suicide bomber takes out four Iraqis."], ["2008.07.18", "Pakistan", "North Waziristan", 1, 0, "The head of a local madrassa is gunned down by sectarian rivals."], ["2008.07.18", "Pakistan", "South Waziristan", 3, 0, "Three civilians are brutally executed by al-Qaeda backed militants."], ["2008.07.18", "Somalia", "Mogadishu", 3, 0, "Muslim gunmen shoot three elders to death for helping humanitarian efforts."], ["2008.07.19", "Afghanistan", "Kandahar", 4, 1, "Sunni extremists murder four local cops with a roadside bomb."], ["2008.07.19", "Ethiopia", "Jijiga", 0, 2, "Two former Muslims who converted to Christianity are attacked by a stone-throwing mob of Muslims."], ["2008.07.19", "India", "Srinagar", 10, 16, "Hizb-ul-Mujahedeen kill ten Indian soldiers in transport with a horrific bomb attack on their convoy."], ["2008.07.19", "Iraq", "Tikrit", 3, 0, "Freedom Fighters kill three Iraqis with automatic weapons."], ["2008.07.19", "Lebanon", "Ain el-Helweh", 1, 0, "Jund al-Sham gunmen take out a member of a reconciliation committee."], ["2008.07.19", "Pakistan", "Mohmand", 4, 0, "The Taliban murder four hostages in cold blood."], ["2008.07.19", "Pakistan", "Tirah", 9, 10, "Lashkar-e-Islam and Ansar-ul-Islam clash over sectarian differences, leaving nine people dead."], ["2008.07.19", "Pal. Auth.", "Jabaliya", 1, 0, "Suspected Hamas militants shoot a Fatah activist in his home."], ["2008.07.19", "Turkey", "Bosphorus", 1, 0, "A gay man is shot to death in a suspected 'honor' killing."], ["2008.07.20", "Afghanistan", "Laghman", 6, 0, "Six civilians are killed when Sunni hardliners blow up a fuel truck and a nearby minibus with a rocket."], ["2008.07.20", "Chechnya", "Grozny", 3, 0, "Suspect Islamic rebels kill three policemen in cold blood."], ["2008.07.20", "India", "Gulmarg", 2, 5, "An 8-year-old boy is among two people killed when Islamic terrorists toss a grenade into a resort."], ["2008.07.20", "India", "Reasi", 1, 0, "A civilian is shot to death outside his home by Mujahideen."], ["2008.07.20", "Iraq", "Basra", 1, 0, "A suspected prostitute is shot to death by fundamentalists."], ["2008.07.20", "Somalia", "Mogadishu", 6, 11, "Six people are killed when Islamic hardliners attack a government patrol along a city street."], ["2008.07.20", "Thailand", "Pattani", 3, 0, "Islamic terrorists shoot three villagers to death."], ["2008.07.21", "Afghanistan", "North Waziristan", 2, 0, "Two civilians are abducted and murdered by Talibanis."], ["2008.07.21", "Afghanistan", "Paktika", 1, 3, "Sunni extremists attack the home of a former governor, killing him and injuring members of his family."], ["2008.07.21", "China", "Kunming", 2, 10, "The Turkistan Islamic Party takes credit for a bus bombing that leaves two dead."], ["2008.07.21", "Iraq", "Mosul", 6, 8, "Freedom Fighters murder six Iraqis in various attacks."], ["2008.07.21", "Iraq", "Saidiya", 7, 8, "al-Qaeda kill seven Iraqis by planting a bomb on a tractor."], ["2008.07.21", "Pakistan", "Bajur", 1, 2, "Islamic militants gun down an elderly man riding in a car."], ["2008.07.21", "Somalia", "Mogadishu", 7, 12, "Three children are among seven killed in an Islamic militia mortar attack."], ["2008.07.22", "Afghanistan", "Ghazni", 4, 1, "The Taliban kidnaps a man after invading his home and killing his four sons."], ["2008.07.22", "Afghanistan", "Khost", 4, 3, "A woman and child are among four civilians blown up by Sunni bombers."], ["2008.07.22", "Israel", "Jerusalem", 0, 11, "A Palestinian attempts to run Israelis down with a bulldozer."], ["2008.07.22", "Philippines", "Aleosan", 1, 1, "Moro Islamists shoot a 62-year-old woman to death as she is farming her field."], ["2008.07.22", "Thailand", "Narathiwat", 1, 0, "A 41-year-old rubber worker is shot to death by Muslim militants."], ["2008.07.22", "Thailand", "Narathiwat", 1, 5, "A local soldier is killed in an Islamist bomb blast."], ["2008.07.23", "Afghanistan", "Nangarhar", 1, 2, "Religious extremists murder a local cop with a bomb."], ["2008.07.23", "Algeria", "Lakhdaria", 0, 13, "A suicide bomber on a motorbike injures thirteen Algerians."], ["2008.07.23", "Iraq", "Muqdadiyah", 1, 0, "A young woman is killed in a Jihad roadside bombing."], ["2008.07.23", "Somalia", "Jowhar", 1, 0, "Islamic militia assassinate a local official."], ["2008.07.23", "Thailand", "Pattani", 1, 0, "Islamists gun down a school bus driver in a drive-by shooting."], ["2008.07.24", "Afghanistan", "Paktia", 3, 4, "Talibanis murder three local police with a bomb."], ["2008.07.24", "India", "Doda", 4, 0, "A woman and a 13-year-old girl are among four civilians shot to death during a Hizb-ul-Mujahideen home invasion."], ["2008.07.24", "India", "Srinagar", 5, 28, "Four children, ages 4 to 12, are killed along with a woman from the same family of migrant workers when Islamic terrorists throw a grenade into a bus stop."], ["2008.07.24", "Iraq", "Baqubah", 8, 25, "A female suicide bomber kills eight Sunni Iraqis."], ["2008.07.24", "Philippines", "Digos", 2, 10, "A group tied to the Moro Islamic Front is suspected in the bombing of a bus in which two people died."], ["2008.07.24", "Thailand", "Pattani", 1, 0, "A 30-year-old schoolteacher is murdered by Islamic gunmen on his way to work."], ["2008.07.24", "Thailand", "Pattani", 1, 0, "Islamists shoot a 63-year-old villager to death."], ["2008.07.24", "Yemen", "Sayoun", 4, 12, "al-Qaeda is suspected in the car bombing of a ministry building that leaves four dead."], ["2008.07.25", "Bangladesh", "Sadar", 1, 0, "Suspected Jama'atul Mujahideen strangle a woman, then hang her from a tree."], ["2008.07.25", "India", "Bangalore", 2, 10, "Islamists set off a series of bombs, leaving two innocents dead, including a woman."], ["2008.07.25", "Pal. Auth.", "Gaza", 1, 3, "A bomb set outside a Christian cafe kills one person."], ["2008.07.25", "Pal. Auth.", "Gaza", 1, 15, "A bomb kills a young girl."], ["2008.07.26", "India", "Ahmedabad", 57, 161, "Islamic bombers rock India for a second day, setting seventeen bombs and killing over fifty innocent people."], ["2008.07.26", "Indonesia", "Jakarata", 0, 265, "Over two-hundred people are injured when a Muslim mob storms a Christian school."], ["2008.07.26", "Iraq", "Hilla", 1, 0, "Islamic gunmen take down a 4-year-old girl."], ["2008.07.26", "Lebanon", "Tripoli", 9, 50, "A 10-year-old boy and a woman are among nine people killed in a sectarian conflict between Sunni and Alawite."], ["2008.07.26", "Pakistan", "Dera Bugti", 3, 0, "Three local cops are murdered by Islamists in separate attacks."], ["2008.07.26", "Somalia", "Gedo", 3, 0, "Islamic militia shoot three people to death at a roadblock."], ["2008.07.27", "Iraq", "Baghdad", 7, 0, "Seven young Shia pilgrims on foot are shot at point-blank range by Sunni gunmen."], ["2008.07.27", "Iraq", "Buhriz", 2, 0, "Two oil workers are murdered by Jihadi bombers."], ["2008.07.27", "Iraq", "Fallujah", 2, 2, "Radical Sunnis bomb a house, killing two occupants."], ["2008.07.27", "Pakistan", "Charbagh", 1, 5, "A child is killed when fundamentalists bomb a shopping center."], ["2008.07.28", "Afghanistan", "Nuristan", 3, 0, "A Taliban rocket attack on a residential area leaves three dead."], ["2008.07.28", "Iraq", "Baghdad", 32, 102, "Three female suicide bombers run into crowds of Shia pilgrims before detonating.  Some thirty-two innocents are killed."], ["2008.07.28", "Iraq", "Kirkuk", 38, 178, "A Fedayeen suicide bomber attacks a political rally, slaughtering nearly forty people."], ["2008.07.28", "Iraq", "Mussayab", 1, 0, "A woman is abducted, tied up and then murdered by suspected fundamentalists."], ["2008.07.28", "Pakistan", "Kohat", 2, 12, "A teenager is among two people blown apart when Islamic militants detonate a bomb attached to a bicycle."], ["2008.07.28", "Pakistan", "Matta", 3, 2, "Three Pakistanis in a truck are shot to death by Tehrik-e-Taliban terrorists."], ["2008.07.28", "Pakistan", "Mohmand", 1, 0, "A 60-year-old man is abducted and murdered by the Mujahideen."], ["2008.07.29", "Pakistan", "Akhun Killay", 2, 0, "Two people are shot to death by Mujahideen."], ["2008.07.29", "Pakistan", "Degan", 1, 0, "A young woman is abducted and shot three times in the chest by Sunni extremists, who then dump the body in a sewer."], ["2008.07.29", "Philippines", "Mindanao", 4, 1, "Four Christian passengers are pulled from a bus and murdered by Islamic terrorists."], ["2008.07.30", "Ingushetia", "Nazran", 5, 5, "Islamic hardliners are suspected in a car bomb attack that leaves five people dead."], ["2008.07.30", "Pakistan", "Dera Ismail Khan", 1, 3, "Islamic extremists ambush a vehicle, shooting one occupant to death."], ["2008.07.30", "Pakistan", "Rabanpur", 3, 0, "Three young sisters (two of whom were teens) are beheaded by their brothers over suspicion of 'illicit' activity."], ["2008.07.31", "Iraq", "Mosul", 2, 0, "Fundamentalists kill two women over suspected immorality.  One is beheaded."], ["2008.07.31", "Iraq", "Mosul", 3, 0, "A judge and two bodyguards are taken out by Islamic terrorists."], ["2008.07.31", "Iraq", "Shaheed", 3, 4, "A Fedayeen suicide bomber takes out three Iraqi police."], ["2008.07.31", "Jordan", "Nqeira", 1, 0, "A man shoots his 23-year-old sister to death on suspicion that she had unmarried sex."], ["2008.07.31", "Pakistan", "Deolai", 7, 0, "Five children and their parents are killed when a shell hits their house following an ambush by Muslim militants."], ["2008.07.31", "Somalia", "Hodan", 2, 0, "A civilian and a police officer are gunned down in an ambush by Mujahid."], ["2008.07.31", "Thailand", "Pattani", 1, 0, "A 57-year-old schoolteacher is shot to death by Muslim militants at close-range."], ["2008.08.01", "Afghanistan", "Kunar", 1, 0, "Radical Sunnis take out a civilian in a roadside blast."], ["2008.08.01", "Afghanistan", "Nimroz", 3, 5, "Two children and a woman are murdered by a Fedayeen suicide bomber."], ["2008.08.01", "India", "Reasi", 1, 0, "A boy is abducted by Mujahid, who then slit his throat."], ["2008.08.01", "Iraq", "Rashad", 3, 1, "Jihadis kill three Iraqis with a roadside bomb."], ["2008.08.01", "Somalia", "Mogadishu", 1, 0, "Islamic militia blast a Ugandan peacekeeper to death with a bomb planted at an airport."], ["2008.08.02", "Afghanistan", "Kandahar", 13, 6, "The bride and groom are among thirteen people blown to bits when Islamists target a wedding party with a bomb."], ["2008.08.02", "India", "Ramban", 1, 0, "A youth is shot to death by Islamic militants."], ["2008.08.02", "Ingushetia", "Nazran", 1, 1, "Suspected Islamists open up on two policemen with automatic weapons."], ["2008.08.02", "Iraq", "Baqubah", 5, 3, "Sunni radicals murder five Iraqis with a roadside bomb."], ["2008.08.02", "Pakistan", "Kabal", 8, 5, "Islamic hard-liners bomb a police van killing eight people."], ["2008.08.02", "Pal. Auth.", "Gaza", 1, 16, "A young boy is killed in fighting between the Muslim terror groups, Hamas and Fatah."], ["2008.08.02", "Thailand", "Yala", 1, 0, "A 29-year-old civilian is shot to death while riding a motorcycle."], ["2008.08.03", "Afghanistan", "Gardiz", 3, 0, "Three civilians are murdered by Taliban militants."], ["2008.08.03", "Afghanistan", "Ghazni", 4, 0, "Religious extremists storm a police post, killing four officers."], ["2008.08.03", "Afghanistan", "Helmand", 1, 0, "Islamic extremists gun down a local judge."], ["2008.08.03", "Afghanistan", "Paktika", 0, 0, "Two clerics are killed while trying to assemble a suicide vest in their mosque."], ["2008.08.03", "Algeria", "Kabylie", 0, 25, "Twenty-five people are injured in a suicide blast."], ["2008.08.03", "Iraq", "Baghdad", 12, 22, "Islamic terrorists manage to kill a dozen Iraqis with a truck bomb."], ["2008.08.03", "Iraq", "Latifiyah", 6, 13, "Six civilians are killed by a Jihad roadside blast."], ["2008.08.03", "Pakistan", "Bajaur", 1, 0, "A civilian is shot to death by Sunni extremists."], ["2008.08.03", "Pakistan", "Temargara", 2, 2, "Two government tax collectors are shot to death by Sharia-minded militants."], ["2008.08.03", "Somalia", "Mogadishu", 20, 47, "Twenty civilians, mostly women street sweepers, are blown to bits by a massive bomb planted by Islamists."], ["2008.08.03", "Sudan", "Nyala", 6, 28, "Janjaweed militia ambush a civilian convoy, killing six people."], ["2008.08.04", "China", "Xinjiang", 16, 16, "Islamists stage a brutal grenade attack on a group of police, killing sixteen."], ["2008.08.04", "Iraq", "Baghdad", 2, 15, "Jihadis manage to kill two civilians with a roadside bomb."], ["2008.08.05", "Ingushetia", "Nazran", 2, 4, "Muslim hardliners take down two local cops in separate Kalashnikov attacks."], ["2008.08.05", "Iraq", "Basra", 1, 0, "Fundamentalists shoot a barber to death for shaving beards."], ["2008.08.05", "Iraq", "Kirkuk", 3, 0, "al-Qaeda militants slit the throats of three Iraqis."], ["2008.08.05", "Pakistan", "Mughli", 1, 0, "A mother of two is hacked to death with an axe by her cousin who objected to a suspected affair."], ["2008.08.05", "Philippines", "Aleosan", 1, 0, "One person is killed when Moro Islamic terrorists storm a sugar plantation."], ["2008.08.06", "Afghanistan", "Lashkar Gah", 7, 2, "Religious extremists attack a police post, killing seven local officers."], ["2008.08.06", "Iraq", "Baquba", 16, 0, "Sixteen men kidnapped by Sunni extremists are found bound and executed."], ["2008.08.06", "Iraq", "Mosul", 1, 11, "A suicide bomber kills a civilian and injures eleven more."], ["2008.08.06", "Pakistan", "Swat", 2, 15, "Islamic militants burn down several girls schools and kill two people, including a child, in separate attacks."], ["2008.08.06", "Pakistan", "Tirah", 4, 12, "Fighting breaks out between Islamic fundamentalist groups, leaving four dead."], ["2008.08.06", "Somalia", "Lafoole", 1, 0, "Islamic radicals gun down the head of an orphanage."], ["2008.08.06", "Thailand", "Yala", 0, 1, "A school principal is shot multiple times by Shahid while on his way home."], ["2008.08.07", "Iraq", "Mosul", 4, 6, "Terrorists plant a bomb on a corpse, luring four investigators to their deaths."], ["2008.08.07", "Pakistan", "Shahdara", 2, 0, "Two sisters in their 20s are murdered by their brother over suspicions of 'illicit' relations with local men."], ["2008.08.07", "Pakistan", "Swat", 4, 0, "Fundamentalists burn down a girls school then shoot three people to death and behead another."], ["2008.08.07", "Philippines", "Zamboanga", 2, 1, "A 16-year-old and his father are shot to death by suspected Abu Sayyaf militants."], ["2008.08.08", "Afghanistan", "Kunar", 1, 2, "A child is killed in a Taliban ambush."], ["2008.08.08", "Afghanistan", "Paktika", 5, 0, "Five local cops are murdered by Islamic bombers."], ["2008.08.08", "Iraq", "Tal Afar", 25, 74, "Jihadis bomb a marketplace, slaughtering over twenty Iraqis."], ["2008.08.08", "Pakistan", "Bajaur", 3, 0, "Three civilians are murdered by the Taliban - two by beheading."], ["2008.08.08", "Pakistan", "Sadeeqabad", 22, 0, "Twenty-two soldiers, some wounded, are riddled with bullets after being captured by Mujahideen."], ["2008.08.08", "Thailand", "Pattani", 1, 0, "A 60-year-old Buddhist is beheaded by Islam's Holy Warriors."], ["2008.08.08", "Thailand", "Yala", 2, 0, "A fruit trader having dinner with his wife is among two people shot to death by Muslim terrorists in separate attacks."], ["2008.08.09", "Algeria", "Zemmouri", 8, 8, "A suicide bomber takes out eight Algerians along a city street."], ["2008.08.09", "Iraq", "Baghdad", 1, 2, "Fundamentalists shoot at a swimming pool manager, injuring him but killing one of his sons."], ["2008.08.09", "Iraq", "Baqubah", 16, 0, "An al-Qaeda mass grave is discovered.  Five women are among the sixteen victims tortured and murdered."], ["2008.08.09", "Nigeria", "Kano", 1, 0, "A 50-year-old man is beaten to death by a Muslim mob for alleged blasphemy."], ["2008.08.09", "Pakistan", "Kurram", 16, 25, "Sunnis and Shia settle their sectarian differences with gunfire, leaving sixteen dead."], ["2008.08.09", "Pakistan", "Swat", 8, 15, "Eight local cops are shot to death inside their station by Islamic radicals."], ["2008.08.09", "Somalia", "Alamada", 4, 2, "Three civilians and a local cop are murdered in a grenade attack by Islamic militia."], ["2008.08.10", "Afghanistan", "Kandahar", 5, 3, "A group of migrant laborers is blown up by Taliban bombers.  Five are killed."], ["2008.08.10", "Algeria", "Tigzirt", 3, 0, "Islamic fundamentalists blow up a police station, killing three officers."], ["2008.08.10", "Algeria", "Zemmouri", 8, 19, "Eight Algerians are killed by a suicide bomber."], ["2008.08.10", "China", "Xinjiang", 8, 4, "Eight people are killed in a series of suicide bomb attacks by Muslim militants."], ["2008.08.10", "Iraq", "Baghdad", 9, 46, "Jihad bombers murder nine Iraqis in three attacks."], ["2008.08.10", "Iraq", "Khanaqin", 3, 25, "Fedayeen bombers blow themselves up in a minibus along a city street, killing three innocent bystanders."], ["2008.08.10", "Iraq", "Tarmiyah", 4, 21, "Four locals are taken out in a suicide bombing."], ["2008.08.10", "Pakistan", "Hangu", 1, 0, "Taliban hardliners are suspected in the shooting death of a local cop."], ["2008.08.10", "Pakistan", "Kurram", 10, 24, "A second day of Sunni-Shia sectarian violence leaves ten people dead."], ["2008.08.10", "Pakistan", "South Waziristan", 1, 0, "An elderly man is shot to death by Islamic terrorists."], ["2008.08.10", "Philippines", "Midsayap", 3, 0, "Moro Islamist snipers take out three local soldiers."], ["2008.08.10", "Saudi Arabia", "Riyadh", 1, 0, "A 26-year-old woman has her tongue cut out, then is set on fire by her father (a moral policeman) for converting to Christianity."], ["2008.08.11", "Afghanistan", "Kabul", 3, 12, "Three Afghan civilians are blown apart by a suicide car bomber."], ["2008.08.11", "Afghanistan", "Uruzgan", 6, 3, "A child is among a half dozen civilians killed while being used as human shields by Holy Warriors."], ["2008.08.11", "Iran", "Saravan", 2, 0, "A Sunni group called 'soldiers of Allah' kidnaps and executes two security guards."], ["2008.08.11", "Iraq", "Baqubah", 4, 16, "A female suicide bomber takes out four Iraqis."], ["2008.08.11", "Iraq", "Wajihiya", 5, 3, "Five women field laborers are slain by Jihad bombers while walking to work."], ["2008.08.11", "Pakistan", "Bajaur", 2, 0, "Islamists capture and then cut the heads off of two civilians."], ["2008.08.11", "Philippines", "Basilan", 2, 12, "Two civilians are killed when Moro Islamists storm a village."], ["2008.08.11", "Somalia", "Mogadishu", 8, 0, "Holy Warriors kill eight soldiers in a brutal ambush."], ["2008.08.12", "China", "Xinjiang", 3, 0, "Three security guards are stabbed to death by Muslim militants."], ["2008.08.12", "Germany", "Ruesselsheim", 1, 0, "A 55-year-old woman is shot to death in an honor attack involving two Muslim groups."], ["2008.08.12", "Iraq", "Baqubah", 2, 10, "A female suicide bomber takes out two Iraqis."], ["2008.08.12", "Iraq", "Ramadi", 6, 0, "A woman and three children are among six family members shot to death by the Religion of Peace."], ["2008.08.12", "Pakistan", "Peshawar", 13, 11, "A child is among thirteen people killed when Sunni bombers target a minibus."], ["2008.08.12", "Philippines", "Basilan", 4, 0, "At least four Catholic civilians are killed when Moro Islamists strafe their homes with gunfire."], ["2008.08.12", "Thailand", "Narathiwat", 3, 1, "Two small children and their father are brutally gunned down by radical Muslims while out on a family trip."], ["2008.08.13", "Afghanistan", "Helmand", 5, 4, "Taliban bombers murder five local police."], ["2008.08.13", "Afghanistan", "Logar", 4, 0, "Three female humanitarian workers and their driver are brutally shot to death at point blank range by Holy Warriors."], ["2008.08.13", "Algeria", "Bouira", 1, 0, "A local guard is killed by a bomb planted by Islamic fundamentalists."], ["2008.08.13", "India", "Kishtwar", 1, 0, "A civilian is shot to death by Muslim militants outside his home."], ["2008.08.13", "Iraq", "Khan Bani Saad", 1, 2, "A local woman is taken out by Mujahideen bombers."], ["2008.08.13", "Iraq", "Mosul", 3, 15, "Islamic bombers kill three Iraqis at an intersection."], ["2008.08.13", "Iraq", "Qayara", 2, 10, "Two patrons are killed when Jihadis set off a car bomb at a market."], ["2008.08.13", "Lebanon", "Tripoli", 18, 45, "Eighteen people at a bus stop are blown to bits by Islamic bombers."], ["2008.08.13", "Pakistan", "Bajaur", 1, 0, "A doctor is killed while being held as a human shield by Mujahideen."], ["2008.08.13", "Pakistan", "Kirri", 1, 5, "Baitullah Mehsud terrorists ambush a group of local soldiers, killing one."], ["2008.08.13", "Pakistan", "Lahore", 9, 35, "Islamists bomb an independence day celebration, killing at least nine innocents."], ["2008.08.13", "Saudi Arabia", "Riyadh", 1, 0, "A Christian girl has her tongue cut out and is then burned alive by her father for leaving Islam."], ["2008.08.13", "Thailand", "Pattani", 1, 19, "Islamists gun down a 26-year-old man, then plant a bomb to catch first responders."], ["2008.08.13", "Thailand", "Yala", 1, 2, "A 57-year-old man is killed, and his family injured, when Mujahideen toss a grenade into his home."], ["2008.08.14", "Algeria", "Jijel", 2, 0, "An army officer and his driver are killed by Islamic fundamentalists in their car.  A separate bombing kills one other person."], ["2008.08.14", "Iraq", "Baqubah", 1, 2, "An 8-year-old girl is killed by Islamic bomber, who also wound her mother and sister."], ["2008.08.14", "Iraq", "Karbala", 18, 75, "An al-Qaeda female suicide bomber strikes a group of Shiite pilgrims, slaughtering at least eighteen."], ["2008.08.14", "Pakistan", "Swat", 1, 0, "A civilian is abducted and riddled with bullets by Sunni militants."], ["2008.08.14", "Pakistan", "Swat", 2, 0, "A woman and a boy are killed when Islamists fire on security forces in a populated area."], ["2008.08.14", "Pakistan", "Umari", 1, 0, "A pro-government tribesman is shot to death by the Taliban"], ["2008.08.15", "Iraq", "Balad", 9, 48, "Sunnis detonate a bomb on a bus carrying Shiite pilgrims, killing nine."], ["2008.08.15", "Somalia", "Mogadishu", 5, 0, "Islamic militia kill five people with a roadside bomb along a city street."], ["2008.08.16", "Afghanistan", "Kandahar", 10, 0, "Ten Afghans are blown up by religious extremists in a roadside attack."], ["2008.08.16", "Afghanistan", "Logar", 1, 0, "A drum player is shot to death by Islamic hardliners."], ["2008.08.16", "India", "Kishtwar", 1, 0, "Mujahideen abduct and murder a civilian."], ["2008.08.16", "Iraq", "Baghdad", 6, 11, "Six more Shia pilgrims are murdered by Sunni bombers in an attack on their minibus."], ["2008.08.16", "Pakistan", "Hayatabad", 1, 0, "A prominent Shia leader is shot to death outside his home by Sunni militants."], ["2008.08.16", "Pakistan", "Shawaal", 1, 0, "A 40-year-old man is beheaded by religious radicals."], ["2008.08.16", "Philippines", "Panamao", 2, 0, "Two off-duty soldiers are brutally murdered by Abu Sayyaf after being stranded by a broken motorcycle."], ["2008.08.17", "Afghanistan", "Helmand", 3, 4, "A woman and two small children are killed when Mujahideen use them as human shields."], ["2008.08.17", "Azerbaijan", "Baku", 2, 8, "Islamic extremists are thought responsible for hurling a grenade into a mosque."], ["2008.08.17", "Iraq", "Baghdad", 15, 29, "An al-Qaeda suicide bomber on a motorcycle attacks a crowd outside a Sunni mosque, killing at least fifteen innocents."], ["2008.08.17", "Philippines", "Lanao del Sur", 7, 11, "Moro Islamists ambush a logistics transport, killing seven riders."], ["2008.08.17", "Somalia", "Dinsoor", 2, 0, "Two humanitarian workers are murdered by hardline Islamists."], ["2008.08.18", "Afghanistan", "Khost", 10, 13, "Ten civilians are murdered by a suicide bomber along a city street.  The victims are described as \"poor laborers.\""], ["2008.08.18", "Iraq", "Baghdad", 1, 1, "Radicals gun down a cleric.  His wife is also shot in the attack."], ["2008.08.18", "Iraq", "Ramadi", 5, 7, "Five Iraqis are taken down by a Fedayeen car bomber."], ["2008.08.18", "Pakistan", "Kari Wala", 1, 0, "A young woman is murdered by her cousins for having sex with a man she loved."], ["2008.08.18", "Pakistan", "Swat", 1, 0, "A civilian is shot to death by Mujahideen."], ["2008.08.18", "Philippines", "Mindanao", 49, 50, "Forty-nine Christian villagers are shot or hacked to death by Moro Islamists rampaging through three towns."], ["2008.08.18", "Somalia", "Doblai", 2, 2, "Fundamentalists hurl a grenade into a meeting place used by a sect, killing two people."], ["2008.08.19", "Afghanistan", "Khost", 2, 0, "Two civilians are killed in attacks by Sunni suicide bombers."], ["2008.08.19", "Afghanistan", "Surobi", 10, 21, "Ten French soldiers are brutally ambushed and killed.  Four were murdered in captivity."], ["2008.08.19", "Algeria", "Issers", 43, 38, "An Islamic fundamentalist drives a car packed with explosives into a police school.  Over forty are killed in the carnage."], ["2008.08.19", "Iraq", "Baqubah", 35, 0, "Thirty-five victims of Sunni terrorists are found bound and executed in two mass graves."], ["2008.08.19", "Pakistan", "Dera Ismail Khan", 30, 32, "A man walks into a hospital, yells \"Allah Akbar,\" then detonates, slaughtering over thirty innocents."], ["2008.08.20", "Algeria", "Bouira", 12, 38, "Islamic fundamentalists murder a dozen civilians with two bomb attacks, one on a hotel."], ["2008.08.20", "Iraq", "Baghdad", 7, 6, "Seven civilians are murdered by Islamic terrorists in various attacks, including a woman and a player on a soccer field."], ["2008.08.20", "Pakistan", "Peshawar", 2, 0, "Jaish-i-Islami shoot two accused prostitutes to death, then mutilate their faces with knives."], ["2008.08.20", "Pakistan", "Sargodha", 1, 0, "Two brothers kill their grown sister with knives over suspicions that she is engaging in unauthorized sex."], ["2008.08.20", "Somalia", "Kismayo", 9, 22, "Al Shabaab Islamists attack a town, killing at least nine civilians."], ["2008.08.20", "Somalia", "Mogadishu", 4, 7, "Four civilians are killed during an ambush by Islamic hardliners."], ["2008.08.21", "Iraq", "Mosul", 1, 0, "A civilian is abducted and beheaded by suspected fundamentalists."], ["2008.08.21", "Pakistan", "Kohat", 1, 0, "Muslim radicals on motorcycles gun down a young soldier."], ["2008.08.21", "Pakistan", "Swat", 5, 1, "Five civilians are brutally gunned down in two Taliban drive-bys."], ["2008.08.21", "Pakistan", "Wah", 78, 67, "Over seventy innocents are slaughtered by twin Fedayeen suicide bombers outside a factory."], ["2008.08.21", "Somalia", "Mogadishu", 6, 11, "Six civilians are killed during two separate attacks by Islamic militia."], ["2008.08.21", "Thailand", "Narathiwat", 2, 17, "A journalist is among two people murdered by Muslim car bombers."], ["2008.08.22", "India", "Ganderbal", 1, 1, "A local soldier is shot to death by Islamic militants while standing guard."], ["2008.08.22", "Pakistan", "NWFP", 2, 14, "Two security force personnel are killed when Mujahideen attack their vehicle with a grenade."], ["2008.08.22", "Pakistan", "Peshawar", 1, 2, "Taliban militants fire rockets into a police station, killing one officer."], ["2008.08.23", "Chechnya", "Agishty", 2, 2, "Jihad warriors take out two Russians with a roadside bomb."], ["2008.08.23", "Iraq", "Kirkuk", 5, 8, "Five people are killed when Fedayeen suicide bombers strike an auto dealership."], ["2008.08.23", "Pakistan", "Abuha", 2, 4, "Two people are killed when Islamists detonate a bomb at an intersection."], ["2008.08.23", "Pakistan", "Kurram", 4, 7, "Four people are killed in a sectarian clash."], ["2008.08.23", "Pakistan", "North Waziristan", 2, 0, "Two civilians are kidnapped and shot to death by Sunni radicals."], ["2008.08.23", "Pakistan", "Swat", 15, 23, "A Holy Warrior sends over a dozen innocents to Allah with a car bomb."], ["2008.08.24", "Iraq", "Baghdad", 9, 32, "Nine civilians are murdered in three separate Jihad bombings."], ["2008.08.24", "Iraq", "Baghdad", 30, 42, "Thirty people attending a celebration are blown apart by a Fedayeen suicide bomber."], ["2008.08.24", "Pakistan", "Matta", 4, 0, "Islamists kidnap and bind four civilians, then shoot them to death."], ["2008.08.25", "Iraq", "Mussayab", 1, 2, "Jihadis kill a soldier's daughter and injure his two sons with a bomb near his home."], ["2008.08.25", "Pakistan", "Shakardara", 2, 0, "Two tribesmen are killed and several girls schools are blown up during a rampage by Islamic hardliners."], ["2008.08.25", "Pakistan", "Swat", 10, 2, "Ten occupants of a home are killed when Talibanis fire rockets into it."], ["2008.08.25", "Philippines", "Maguindanao", 1, 0, "A soldier is kidnapped, bound, tortured and brutally executed."], ["2008.08.25", "Sudan", "Darfur", 32, 135, "Women and children are among the thirty-two bodies counted following a government attack on a civilian refugee camp."], ["2008.08.26", "India", "Kupwara", 1, 1, "A local soldier is shot to death in an ambush by Islamic militants."], ["2008.08.26", "Iraq", "Jalawla", 28, 45, "A suicide bomber calmly walks up and murders over twenty-five police recruits waiting outside a station."], ["2008.08.26", "Iraq", "Mandali", 5, 0, "A family of five is taken out by Jihadi roadside bombers as they are traveling to a religious shrine."], ["2008.08.26", "Pakistan", "Islamabad", 8, 20, "Sunni radicals manage to kill eight patrons at a cafe with a planted bomb."], ["2008.08.26", "Somalia", "Baidoa", 2, 1, "Two people are killed in a Mujahideen grenade attack on their home."], ["2008.08.27", "Afghanistan", "Nangarhar", 1, 0, "A Japanese humanitarian worker on an irrigation project is kidnapped and murdered by the Taliban."], ["2008.08.27", "India", "Jammu", 6, 0, "Lashkar-e-Toiba shoot six civilians to death, including a cab driver and his passengers."], ["2008.08.27", "Pakistan", "Wana", 2, 11, "A Taliban ambush leaves two local soldiers dead."], ["2008.08.27", "Somalia", "Mogadishu", 2, 0, "Two civilians are killed in a sudden attack by Islamic militia."], ["2008.08.27", "Thailand", "Narathiwat", 1, 0, "Muslim gunmen murder a government social worker."], ["2008.08.27", "Thailand", "Pattani", 2, 0, "A young man and woman are shot to death in separate attacks by radical Islamists."], ["2008.08.27", "Thailand", "Yala", 1, 0, "A 51-year-old electrical worker is shot to death by Mujahid."], ["2008.08.28", "China", "Xinjiang", 2, 7, "Knife-wielding Muslims set upon a group of police, stabbing at least two to death."], ["2008.08.28", "Iraq", "Baghdad", 2, 0, "A man and his wife are gunned down by Islamic terrorists."], ["2008.08.28", "Lebanon", "Sejoud", 1, 0, "Hezbollah gunmen fire on a helicopter, killing a Lebanese officer."], ["2008.08.28", "Pakistan", "Bannu", 10, 16, "Islamic bombers target a bus carrying prisoners, leaving at least ten dead."], ["2008.08.28", "Pakistan", "Koza Bandai", 1, 0, "The Taliban abduct and murder a civilian."], ["2008.08.28", "Pakistan", "Swat", 2, 0, "Two civilians are beheaded by religious radicals."], ["2008.08.29", "Algeria", "Batna", 7, 14, "Islamic fundamentalists kill seven Algerians in a highway attack."], ["2008.08.29", "Dagestan", "Makhachkala", 1, 0, "A local cop is gunned down by Islamic militants."], ["2008.08.29", "Pakistan", "Kohat Tunnel", 5, 37, "Fedayeen suicide car bombers murder five innocents."], ["2008.08.29", "Somalia", "Kismayo", 2, 1, "Two brothers are gunned down by armed Islamists."], ["2008.08.29", "Somalia", "Mogadishu", 1, 0, "A civilian is killed during an attack by Islamic militia."], ["2008.08.30", "Angola", "Andulo", 1, 40, "A young girl is decapitated by Muslims rampaging through a Christian community on a church-burning spree. (Reported)"], ["2008.08.30", "Chechnya", "Vedeno", 2, 11, "A Fedayeen suicide attack is one of two bombings that leave two people dead."], ["2008.08.30", "Iraq", "Iskandariya", 2, 0, "Two civilians are murdered by Jihadis, one of whom is decapitated."], ["2008.08.30", "Iraq", "al-Ahbash", 4, 0, "A husband, wife and their two children are slaughtered in their home by al-Qaeda militants."], ["2008.08.30", "Pakistan", "Kurram", 19, 70, "Nineteen tribesman are killed in a series of Taliban suicide attacks and ambushes."], ["2008.08.30", "Pakistan", "Swat", 2, 0, "A civilian and a cop are murdered by Mujahideen in separate attacks."], ["2008.08.30", "Philippines", "Sulu", 4, 10, "Four local soldiers are killed in a brutal ambush by Islamic extremists."], ["2008.08.31", "Iraq", "Mosul", 1, 0, "A Christian man is kidnapped and murdered by Islamic fundamentalists."], ["2008.08.31", "Thailand", "Pattani", 2, 0, "Muslim extremists gun down a 43-year-old man, and a 50-year-old in separate attacks."], ["2008.09.01", "Afghanistan", "Kandahar", 1, 0, "A taxi driver is murdered by Sunni extremists."], ["2008.09.01", "Afghanistan", "Khost", 2, 2, "The Taliban take down two local cops with a roadside bomb."], ["2008.09.01", "Afghanistan", "Kunduz", 1, 0, "A civilian is blown to bits by a suicide bomber."], ["2008.09.01", "Afghanistan", "Wardak", 3, 0, "Three security guards are killed by religious radicals in an ambush."], ["2008.09.01", "Iraq", "Kirkuk", 1, 2, "An Iraqi child is taken down by Islamic bombers."], ["2008.09.01", "Iraq", "Othmaniyah", 3, 0, "Sunni bombers kill three farmers with a device hidden in a water pump."], ["2008.09.01", "Pakistan", "Kohat", 7, 0, "Religious extremists take out seven security personnel in a surprise ambush."], ["2008.09.01", "Philippines", "Digos", 6, 32, "Islamic bombers are suspected in a blast that rips nails through a passenger bus, leaving six dead."], ["2008.09.01", "Somalia", "Mogadishu", 1, 0, "A civilian is killed during a Mujahideen ambush along a city street."], ["2008.09.01", "Thailand", "Pattani", 2, 0, "A Buddhist woman is among two people murdered in separate shooting attacks by Muslim radicals."], ["2008.09.01", "Thailand", "Yala", 1, 0, "A 61-year-old man is shot to death by militant Muslims while driving home."], ["2008.09.01", "Thailand", "Yala", 1, 0, "A teacher is brutally gunned down in front of his wife by Religion of Peace warriors."], ["2008.09.02", "Dagestan", "Makhachkala", 1, 0, "An anti-Islamist journalist is assassinated by suspected extremists."], ["2008.09.02", "India", "Pulwama", 1, 2, "An off-duty soldier is brutally cut down by Islamists while shopping at a vegetable market."], ["2008.09.02", "Iraq", "Baghdad", 4, 23, "Four Iraqis are killed in a couple of Jihad roadside attacks."], ["2008.09.02", "Iraq", "Kirkuk", 1, 2, "A 9-year-old boy is murdered by Islamic bombers."], ["2008.09.02", "Iraq", "Mosul", 1, 0, "Islamic fundamentalists abduct and murder a 65-year-old Christian doctor."], ["2008.09.02", "Iraq", "Mosul", 7, 7, "Children are among the victims of a Fedayeen suicide car bombing."], ["2008.09.02", "Pakistan", "Swat", 2, 0, "A retired schoolteacher is among two people murdered by the Mujahideen."], ["2008.09.03", "Pakistan", "Sahiwal", 1, 0, "A 17-year-old girl is shot to death by her father and brother for seeking a divorce after being forcibly married at 9."], ["2008.09.03", "Somalia", "Mogadishu", 2, 4, "Two civilians are killed during an ambush by Islamic militia."], ["2008.09.04", "Iraq", "Mosul", 4, 0, "A 12-year-old child and a woman are among four Iraqis murdered by Sunni terrorists."], ["2008.09.04", "Thailand", "Narathiwat", 1, 0, "Islamists gun down an orchard worker."], ["2008.09.05", "Iraq", "Baghdad", 6, 17, "Six people are killed by Jihadi bombers."], ["2008.09.05", "Thailand", "Pattani", 2, 0, "Two Buddhists are shot to death by militant Muslims in separate drive-by attacks."], ["2008.09.05", "Thailand", "Yala", 1, 0, "A man mourning beside his brother's grave at a cemetery is murdered by Muslim extremists."], ["2008.09.06", "Afghanistan", "Nimroz", 6, 1, "A suicide bomber pretending to be a beggar murders six office workers."], ["2008.09.06", "Afghanistan", "Nimruz", 2, 7, "Religious extremists attack a police post, killing two officers."], ["2008.09.06", "Iraq", "Buhriz", 2, 3, "Two people are blown apart by Sunni bombers."], ["2008.09.06", "Iraq", "Tal Afar", 6, 54, "Fedayeen suicide bombers take out six innocents, and injure nearly sixty more, with an attack on an outdoor market."], ["2008.09.06", "Pakistan", "Peshawar", 16, 80, "Sixteen people are blown up by suicide car bombers."], ["2008.09.06", "Pakistan", "Peshawar", 35, 91, "Over thirty people are massacred by Fedayeen suicide bombers in a brutal attack along a city street."], ["2008.09.06", "Somalia", "Mogadishu", 1, 0, "Mujahideen gun down a businessman in his store."], ["2008.09.07", "Afghanistan", "Kandahar", 8, 23, "Eight Afghans are blown to bits by a pair of Fedayeen suicide bombers."], ["2008.09.07", "India", "Ramban", 1, 2, "Muslim militants attack and kill a member of a search party."], ["2008.09.07", "Pakistan", "Kurram", 3, 12, "Three children are killed when Sunnis and Shia clash settle sectarian differences by targeting homes with heavy weapons."], ["2008.09.07", "Pakistan", "Swat", 2, 0, "Mujahideen shoot two civilians to death."], ["2008.09.07", "Pakistan", "Waris Khan", 2, 0, "A man shoots his daughter and her lover to death over their relationship."], ["2008.09.07", "Pakistan", "Zila Mir Pur Khas", 1, 0, "Islamic extremists gun down a Ahmadiyya doctor for worshipping the wrong god."], ["2008.09.07", "Somalia", "Beletwein", 5, 5, "Five civilians are taken down during an ambush by Islamic militia."], ["2008.09.08", "Afghanistan", "Zabul", 6, 2, "The Taliban take out six civilians with a landmine."], ["2008.09.08", "India", "Doda", 1, 0, "A civilian is shot to death by Hizb-ul-Mujahideen."], ["2008.09.08", "Iraq", "Baiji", 2, 4, "Car bombers take out two Iraqis."], ["2008.09.08", "Iraq", "Bani Saad", 2, 1, "Jihad gunmen murder a married couple and injure their young son."], ["2008.09.08", "Iraq", "Mosul", 3, 0, "Mujahideen kill a woman and two children by bombing their home."], ["2008.09.08", "Pakistan", "Sindh", 1, 0, "The local leader of a minority sect is murdered by Islamic hardliners."], ["2008.09.08", "Somalia", "Mogadishu", 4, 2, "Children are among those killed when Islamic militia stage a terror attack along a public street."], ["2008.09.09", "Iraq", "Mosul", 1, 0, "A humanitarian agency worker is gunned down by Muslim terrorists."], ["2008.09.09", "Pakistan", "Sindh", 4, 0, "Religious radicals gun down a man, his two wives and young grandson in their home."], ["2008.09.09", "Pakistan", "Swat", 5, 1, "Five civilians are murdered by the Taliban in two targeted attacks."], ["2008.09.09", "Sudan", "Bere", 6, 0, "Six villagers are killed during an attack by Janjiweed militia."], ["2008.09.09", "Thailand", "Pattani", 1, 0, "A Buddhist is shot and beheaded by Religion of Peace militants."], ["2008.09.09", "Thailand", "Yala", 1, 1, "A local soldier is killed when Islamists fire rockets into their base."], ["2008.09.10", "Iraq", "Mosul", 1, 0, "A Christian man is shot to death by Muslim fundamentalists."], ["2008.09.10", "Pakistan", "Bajaur", 3, 0, "Sunni fundamentalists kidnap three civilians, then shoot them in the neck."], ["2008.09.10", "Pakistan", "Dir", 25, 50, "Twenty-five people are killed when rival Islamists hurl grenades into a mosque."], ["2008.09.10", "Somalia", "Mogadishu", 4, 0, "At least four civilians are killed when dozens of militants screaming 'Allah Akbar' attack an Ethiopian patrol."], ["2008.09.10", "Sudan", "Zamzam", 5, 24, "Janjiweed militia attack a displaced persons camp, killing five refugees."], ["2008.09.11", "Afghanistan", "Kandahar", 2, 4, "A suicide bomber takes out two Afghan civilians, including a young boy on his way to school."], ["2008.09.11", "Afghanistan", "Nimroz", 2, 0, "Two civilians are murdered by a Fedayeen suicide bomber."], ["2008.09.11", "India", "Doda", 0, 1, "A farmer is pulled from his home by the Mujahideen, who then hack off his ears."], ["2008.09.11", "Iraq", "Baghdad", 3, 3, "Jihadis bomb a minibus carrying civil servants, killing at least three."], ["2008.09.11", "Iraq", "Khalis", 2, 0, "A man and his son are shot to death inside their home by Sunni militants."], ["2008.09.11", "Iraq", "Mosul", 5, 7, "A family of three is among five civilians taken down by Islamic terrorists."], ["2008.09.11", "Iraq", "Saidiya", 5, 2, "Five members of the same family are murdered in their home by Mujahideen."], ["2008.09.11", "Pakistan", "Orakzai", 2, 0, "Talibanis abduct and slit the throats of two local soldiers, then cut off their heads."], ["2008.09.11", "Pakistan", "Swat", 8, 0, "A 9-year-old girl, brutally gunned down by Jihadis, is among eight people murdered in two attacks."], ["2008.09.11", "Thailand", "Narathiwat", 1, 0, "Islamists gun down a 45-year-old man in a drive-by shooting."], ["2008.09.11", "Thailand", "Pattani", 2, 0, "A young Buddhist man is among two civilians killed in separate attacks by Muslim militants."], ["2008.09.12", "Afghanistan", "Farah", 8, 0, "Eight people are blasted to death at point-blank range with automatic weapons during a Taliban ambush."], ["2008.09.12", "Iraq", "Dujail", 31, 60, "Over thirty Shias are blown to Allah by bombs detonated by radical Sunnis at a marketplace."], ["2008.09.12", "Iraq", "Sinjar", 3, 15, "Sunnis bomb a Shia mosque, killing three attendees."], ["2008.09.12", "Turkey", "Diyarbakır", 1, 0, "A family slits their 19-year-old daughter's throat over her 'interactions with men.'"], ["2008.09.13", "Afghanistan", "Logar", 4, 0, "The Taliban murder a local governor with a bomb attack on his vehicle."], ["2008.09.13", "India", "New Delhi", 30, 90, "Islamists detonate bombs at five marketplaces within a 30-minute span, massacring dozens of innocent people explicitly in the name of Allah."], ["2008.09.13", "Iraq", "Baghdad", 4, 9, "Four Iraqis are killed in a roadside bombing attack by Jihadis."], ["2008.09.13", "Iraq", "Mosul", 2, 0, "Fundamentalists storm a home and kill a man and woman who may have been co-habitating."], ["2008.09.13", "Iraq", "Mosul", 4, 0, "Four members of a charity-TV crew are kidnapped and senselessly executed by Islamic terrorists."], ["2008.09.13", "Israel", "Yitzhar", 0, 1, "A Palestinian terrorist stabs a 9-year-old Israeli boy five times, then throws him from a balcony."], ["2008.09.13", "Pakistan", "Kurram", 2, 8, "At least two people are killed when Sunnis and Shias work out their differences."], ["2008.09.13", "Pakistan", "Lahore", 1, 0, "A man shoots his teenage daughter to death over a relationship with a non-Muslim boy."], ["2008.09.13", "Pakistan", "Zabul", 0, 1, "Talibanis drag a teacher out of a mosque and cut off his ears."], ["2008.09.14", "Afghanistan", "Ghazni", 6, 12, "Six children are blown to bits by Taliban bombers."], ["2008.09.14", "Afghanistan", "Ghazni", 7, 0, "Religious extremists murder seven Afghan security patrol members riding in a pickup truck."], ["2008.09.14", "Afghanistan", "Kandahar", 3, 16, "Two doctors and their drivers are murdered by fundamentalist bombers while delivering vaccine to children."], ["2008.09.14", "India", "Poonch", 4, 0, "Four local security personnel are killed in a Mujahideen ambush."], ["2008.09.14", "Iraq", "Mosul", 2, 0, "Two brothers are shot to death by sectarian rivals."], ["2008.09.14", "Iraq", "Saidiya", 7, 6, "Jihadi bombers take down seven Iraqis with a series of blasts."], ["2008.09.14", "Kenya", "Garissa", 0, 10, "A Muslim mob storms a church during a service, pelting worshippers with stones and injuring ten."], ["2008.09.14", "Pakistan", "Esha", 1, 0, "A 55-year-old refugee is kidnapped and severely tortured before being shot to death by Religion of Peace militants."], ["2008.09.14", "Pakistan", "Lahore", 1, 0, "A pregnant woman is burned alive by her husband, allegedly because she wanted to leave him."], ["2008.09.14", "Pakistan", "North Waziristan", 1, 0, "A 70-year-old man is stabbed to death in the neck by Sunni extremists."], ["2008.09.14", "Russia", "Karachayevo-Cherk.", 1, 2, "A local cop is gunned down outside his home by Muslim terrorists."], ["2008.09.14", "Somalia", "Afgoye", 1, 0, "A 22-year-old Christian is casually shot to death at a wedding after being accused of apostasy."], ["2008.09.14", "Somalia", "Mogadishu", 3, 0, "Islamic hardliners celebrate Ramadan by killing a Ugandan peacekeeper and two others."], ["2008.09.14", "Thailand", "Pattani", 1, 0, "A 41-year-old laborer is shot by Islamists while riding his motorcycle home."], ["2008.09.15", "Iraq", "Baghdad", 13, 35, "Jihadis successfully kill thirteen Iraqis with a pair of strategically placed bombs."], ["2008.09.15", "Iraq", "Balad Ruz", 22, 33, "A female suicide bomber sends twenty-two others to Allah with a blast in a residential area."], ["2008.09.15", "Mauritania", "Tourine", 12, 4, "al-Qaeda militants rake a security patrol with machine-gun fire, killing a dozen local men."], ["2008.09.15", "Somalia", "Mogadishu", 4, 0, "Four African Union soldiers are murdered by Islamic militia bombers."], ["2008.09.15", "Thailand", "Narathiwat", 1, 0, "A young hospital worker is murdered by Religion of Peace gunmen."], ["2008.09.15", "Thailand", "Pattani", 1, 0, "An 80-year-old man is murdered by Islamic gunmen."], ["2008.09.16", "Iraq", "Khanaqin", 4, 3, "Four local police are murdered by Jihadi bombers."], ["2008.09.16", "Iraq", "Taji", 2, 16, "Mujahideen manage to kill two civilians with a bicycle bomb placed in a marketplace."], ["2008.09.16", "Lebanon", "Ain el-Helweh", 4, 0, "Four people are killed when Sunnis and Shia clash over their differences."], ["2008.09.16", "Pakistan", "Swat", 3, 6, "Talibanis attack a schoolhouse, killing three guards."], ["2008.09.16", "Pal. Auth.", "Gaza", 1, 0, "Hamas gunmen attack a family home, killing a baby girl."], ["2008.09.16", "Thailand", "Narathiwat", 3, 0, "A man sweeping the curb outside his home is among two people shot to death by Islamists."], ["2008.09.16", "Thailand", "Pattani", 1, 0, "Muslim radicals murder a 50-year-old civilian outside his home."], ["2008.09.17", "India", "Srinagar", 0, 15, "Fifteen pedestrians are injured when Islamic terrorists toss a grenade into the street outside a shopping center."], ["2008.09.17", "Ingushetia", "Magas", 4, 0, "Four local security personnel are ambushed and killed by Muslim radicals."], ["2008.09.17", "Iraq", "Baghdad", 18, 79, "Eighteen Iraqis are killed in a series of Mujahideen bombing and shooting attacks."], ["2008.09.17", "Pakistan", "Dera Ismail Khan", 1, 7, "A woman is murdered by Islamic bombers in a residential area."], ["2008.09.17", "Pakistan", "Khyber", 1, 0, "The Taliban abduct and murder an Afghan refugee."], ["2008.09.17", "Philippines", "Mindanao", 1, 7, "Moro Islamists attack a group of local soldiers, killing one."], ["2008.09.17", "Thailand", "Yala", 2, 0, "A father and son are brutally gunned down by Religion of Peace militants."], ["2008.09.17", "Yemen", "Sanaa", 10, 13, "Women and children are among the casualties when al-Qaeda militants stage a coordinated attack on the US embassy."], ["2008.09.18", "Afghanistan", "Khost", 3, 0, "Three Afghans are taken down by a Taliban ambush."], ["2008.09.18", "England", "Crawley", 0, 1, "A man shouts about the Qur'an as he stabs a non-Muslim woman in the head."], ["2008.09.18", "Iraq", "Mosul", 2, 0, "Two family members are killed when sectarian gunmen storm their home."], ["2008.09.19", "Afghanistan", "Paktika", 4, 2, "A child is among four civilians working in a field killed by a Jihadi rocket attack."], ["2008.09.19", "Iraq", "Basra", 1, 0, "A Shia cleric is assassinated by Sunni extremists."], ["2008.09.19", "Iraq", "Tuz Khormato", 1, 0, "A woman is shot to death by Muslim terrorists."], ["2008.09.19", "Pakistan", "Quetta", 8, 9, "Eight students at a religious school are blown to bits by a suicide bomber."], ["2008.09.19", "Pakistan", "Swat", 2, 0, "Islamic militants attack a bank vehicle, killing two occupants."], ["2008.09.19", "Somalia", "Mogadishu", 12, 35, "al-Shabaab Islamists rain down mortars on a city airport, killing a dozen civilians."], ["2008.09.19", "Thailand", "Narathiwat", 1, 0, "A teenager is taken down in a drive-by shooting by Islamic radicals."], ["2008.09.20", "Ethiopia", "Addis Ababa", 0, 1, "A 35-year-old Christian leaders is nearly beaten to death by Religion of Peace advocates."], ["2008.09.20", "Iraq", "Tal Afar", 6, 23, "Three women are among six Iraqis murdered by Muslim terrorists in separate attacks."], ["2008.09.20", "Mauritania", "Tourine", 12, 0, "Twelve local soldiers are kidnapped and beheaded by al-Qaeda."], ["2008.09.20", "Pakistan", "Islamabad", 53, 257, "Over fifty people are burned or blasted to death when Mujahideen attack a Marriott hotel."], ["2008.09.20", "Pakistan", "Jamrud", 1, 1, "A truck driver is shot to death by religious militants."], ["2008.09.20", "Pakistan", "North Waziristan", 6, 5, "Six locals are blown to bits by a Fedayeen suicide bomber."], ["2008.09.20", "Philippines", "Maguindanao", 1, 4, "Moro Islamists ambush and kill a pro-government tribesman."], ["2008.09.21", "Iraq", "Jalawla", 3, 6, "Three people riding a minibus are murdered by Sunni roadside bombers."], ["2008.09.21", "Iraq", "Kirkuk", 3, 23, "Jihadis take down three Iraqis with a truck bomb."], ["2008.09.21", "Iraq", "Mosul", 6, 48, "A Fedayeen suicide bomber is among several Mujahideen attackers who kill six Iraqis, including a woman and two brothers"], ["2008.09.21", "Thailand", "Pattani", 1, 0, "A 60-year-old rubber worker is shot off his motorcycle by Mujahideen."], ["2008.09.21", "Thailand", "Pattani", 1, 0, "A Buddhist market vendor is murdered by Islamic gunmen."], ["2008.09.21", "Thailand", "Yala", 2, 0, "Two civilians are shot to death by Muslim radicals in separate attacks."], ["2008.09.22", "Afghanistan", "Kandahar", 2, 0, "Two Afghans are murdered by Taliban bombers while driving home."], ["2008.09.22", "Iraq", "Baghdad", 3, 5, "Sunni militants kill three Iraqis with a bomb."], ["2008.09.22", "Iraq", "Mosul", 5, 3, "Five Iraqi children at play are murdered by a bomb planted by Freedom Fighters."], ["2008.09.22", "Israel", "Jerusalem", 0, 15, "Fifteen Israelis are injured when an Arab driver goes on a rampage."], ["2008.09.22", "Pakistan", "Peshawar", 1, 1, "Suspected Islamists shoot a driver to death, then kidnap a passenger."], ["2008.09.22", "Pakistan", "Swat", 9, 2, "Nine local soldiers are killed by a Fedayeen suicide bomber."], ["2008.09.22", "Somalia", "Mogadishu", 42, 60, "Over forty people, including a woman and her five children, are killed by mortar fire during two al-Shabaab terrorist attacks."], ["2008.09.22", "Thailand", "Narathiwat", 2, 0, "A Buddhist man and his teenage son are shot and beheaded by Religion of Peace militants."], ["2008.09.23", "Afghanistan", "Uruzgan", 6, 0, "A woman and a 12-year-old are among six civilians blown to bits by Taliban bombers."], ["2008.09.23", "Iraq", "Baquba", 1, 8, "Sectarian rivals blow up the home of a recently returned family, killing one of the women."], ["2008.09.23", "Somalia", "Manyafulka", 1, 0, "A Christian is beheaded for leaving Islam by men who read the Qur'an aloud before decapitating him."], ["2008.09.24", "Afghanistan", "Kabul", 6, 4, "Six Afghan policemen are murdered in two attacks by religious extremists."], ["2008.09.24", "Iraq", "Diyala", 35, 0, "al-Qaeda gunmen ambush an Iraqi security patrol, wiping out thirty-five souls."], ["2008.09.24", "Pakistan", "Kot", 2, 10, "Islamic militants blow up a girls school and kill two local soldiers in a separate incident."], ["2008.09.24", "Pakistan", "Quetta", 4, 10, "A young girl is among four people killed by a Fedayeen suicide bomber."], ["2008.09.24", "Somalia", "Baidoa", 4, 0, "Mujahideen kill four people at a market with a bomb hidden in a donkey cart."], ["2008.09.24", "Somalia", "Mogadishu", 11, 40, "Eleven civilians are killed during an attack by Islamic militia."], ["2008.09.24", "Thailand", "Pattani", 1, 1, "A local soldier is killed by Muslim radicals while resting under a tree."], ["2008.09.24", "Thailand", "Yala", 1, 0, "A 30-year-old hospital gardener is murdered in cold blood by Islamic gunmen."], ["2008.09.25", "Afghanistan", "Herat", 11, 5, "Eleven guards at a construction site are murdered by religious radicals."], ["2008.09.25", "Afghanistan", "Kandahar", 4, 3, "Talibanis take down four locals with two bombs."], ["2008.09.25", "India", "Baramulla", 1, 0, "A pro-India politician is gunned down by Mujahideen."], ["2008.09.25", "Iraq", "Baghdad", 1, 0, "Fundamentalists gun down a local homosexual rights leader inside a barber shop."], ["2008.09.25", "Pakistan", "Charbagh", 1, 0, "A flour dealer is murdered near his shop by Muslim militants."], ["2008.09.25", "Pakistan", "Khyber", 1, 1, "The Taliban shoot a man to death outside a mosque."], ["2008.09.25", "Pakistan", "Swat", 2, 1, "Religious extremists gun down two local cops."], ["2008.09.25", "Somalia", "Wardegley", 10, 14, "Ten civilians, including a woman and several children are killed following attacks by Islamic militia."], ["2008.09.25", "Thailand", "Pattani", 3, 1, "Three civilians in their early 30's are murdered by Islamic gunmen in separate attacks."], ["2008.09.26", "Afghanistan", "Khost", 5, 7, "A Fedayeen suicide bomber murders five Afghans at a marketplace."], ["2008.09.26", "Iraq", "Baghdad", 3, 2, "Jihadis use an IED to kill three children."], ["2008.09.26", "Pakistan", "Karachi", 1, 0, "Religious extremists murder a man after handcuffing him."], ["2008.09.26", "Pakistan", "Karachi", 1, 0, "The body of a kidnapped truck driver is found tortured and murdered by Islamists."], ["2008.09.26", "Pakistan", "Punjab", 9, 15, "A woman and three children are among nine killed when suspected Islamists derail a train with an explosive device."], ["2008.09.26", "Pakistan", "South Waziristan", 1, 0, "A local tribesman is killed by the Taliban."], ["2008.09.26", "Philippines", "Maguindanao", 1, 7, "A civilian is killed when Moro Islamists attack an army patrol."], ["2008.09.26", "Thailand", "Narathiwat", 1, 0, "Islamists shoot a 27-year-old plantation worker to death."], ["2008.09.27", "India", "Delhi", 2, 25, "A young boy and an old man die following a bombing by Muslim radicals at an outdoor market."], ["2008.09.27", "Iraq", "Mosul", 1, 0, "Fundamentalists gun down a table tennis coach."], ["2008.09.27", "Pakistan", "Matta", 3, 0, "Sunni extremists kill three house servants when they blow up several homes."], ["2008.09.27", "Somalia", "Mogadishu", 9, 10, "Islamic militia fire mortars into an airport, killing at least nine."], ["2008.09.27", "Syria", "Damascus", 17, 14, "A suicidal Sunni bombs a Shia shrine, slaughtering seventeen innocents."], ["2008.09.28", "Afghanistan", "Kandahar", 1, 1, "A top policewoman is gunned down by the Taliban, who also put her young son in a coma during the attack."], ["2008.09.28", "Afghanistan", "Kandahar", 4, 0, "Taliban assassins take down four Afghan bodyguards."], ["2008.09.28", "Algeria", "Dellys", 4, 9, "al-Qaeda bombers murder four in a commercial district."], ["2008.09.28", "Algeria", "Tizi Wazu", 2, 0, "Two security guards are brutally slain by Muslim fundamentalists at a fake checkpoint."], ["2008.09.28", "Iraq", "Baghdad", 32, 97, "Three separate Jihad car bombings leave nearly three dozen Iraqi civilians dead."], ["2008.09.28", "Pakistan", "Attock", 3, 1, "Suspected Taliban abduct an engineer after murdering his three companions."], ["2008.09.28", "Somalia", "Mogadishu", 2, 0, "Two civilians are killed during a Mujahideen attack in a residential area."], ["2008.09.28", "Somalia", "Tayeglow", 0, 2, "Two Christians are seriously injured when a Muslim mob invades their church with spears and machetes."], ["2008.09.28", "Thailand", "Narathiwat", 1, 0, "A 33-year-old man is shot to death by Muslim extremists."], ["2008.09.28", "Thailand", "Pattani", 1, 0, "A 47-year-old man is murdered by Muslim terrorists."], ["2008.09.29", "Algeria", "Bomerdas", 3, 4, "Suicide car bombers take down three innocent people."], ["2008.09.29", "Iraq", "Mosul", 2, 0, "Two brothers are gunned down by Sunni radicals."], ["2008.09.29", "Lebanon", "Tripoli", 6, 30, "Six people are burned to a crisp, and thirty others injured by Islamic bombers targeting local soldiers."], ["2008.09.29", "Pakistan", "Chatto Chowk", 1, 0, "Fundamentalists bomb a music shop, killing a patron."], ["2008.09.29", "Thailand", "Narathiwat", 1, 0, "Islamists shoot a 47-year-old man to death while he is shopping for groceries."], ["2008.09.30", "Ingushetia", "Nazran", 1, 3, "A Fedayeen suicide bomber takes out a local civilian."], ["2008.09.30", "Iraq", "Baghdad", 4, 9, "Islamists bomb a movie theater, killing four Iraqis."], ["2008.09.30", "Iraq", "Mosul", 2, 0, "A coffee shop employee and a woman are taken down by Mujahideen."], ["2008.09.30", "Pakistan", "Sadar", 1, 0, "A woman is sprayed with acid and then set on fire by her in-laws in an 'honor' attack."], ["2008.09.30", "Somalia", "Baidoa", 1, 4, "A child standing along a city street is killed by Mujahideen bombers."], ["2008.09.30", "Thailand", "Yala", 2, 0, "Two young men in their 20's are gunned down in separate Muslim drive-by attacks."], ["2008.10.01", "India", "Agartala", 4, 76, "Harkat ul-Jihad-e-Islami is suspected in serial bomb blasts at civilian bus stops that leave at least four dead."], ["2008.10.01", "India", "Doda", 1, 0, "A shepherd is abducted by Mujahideen, who then slit his throat."], ["2008.10.01", "Iraq", "Balad", 4, 29, "Four Iraqis are taken out by a Jihad car bomb."], ["2008.10.01", "Philippines", "Mindanao", 3, 12, "Moro Islamists ambush a security patrol, killing three members."], ["2008.10.01", "Somalia", "Baidoa", 2, 4, "A child blown apart by an Islamist grenade, one of two people killed in separate attacks."], ["2008.10.02", "Iraq", "Baghdad", 26, 50, "Sunni suicide bombers target two Shia mosques, slaughtering at least twenty worshippers."], ["2008.10.02", "Iraq", "Wajihiya", 6, 3, "Women and children on a mini-bus are machine-gunned to death by Freedom Fighters."], ["2008.10.02", "Pakistan", "Charsadda", 5, 12, "A suicide bomber invades a home, killing five people."], ["2008.10.03", "Afghanistan", "Kunar", 1, 4, "Islamic militants gun down a civilian."], ["2008.10.03", "Algeria", "Theniet el-Had", 6, 0, "Six local security forces are killed when armed fundamentalists open up with machine-guns on their vehicle at point-blank range."], ["2008.10.04", "Ingushetia", "Rostov-on-don", 1, 0, "A cop is gunned down by religious extremists."], ["2008.10.04", "Iraq", "Mosul", 4, 0, "Islamists enter a Christian store and murder the owner.  Three tortured and executed kidnap victims are found elsewhere."], ["2008.10.04", "Iraq", "Tahrir", 1, 0, "A 15-year-old Christian boy is shot to death by Mujahideen while standing outside his home."], ["2008.10.04", "Somalia", "Baidoa", 1, 0, "A man strolling through a market is shot five times in the chest by Islamic militia men."], ["2008.10.04", "Somalia", "Mogadishu", 5, 7, "Five people are killed when Islamic militia lob mortars into the city airport."], ["2008.10.04", "Thailand", "Pattani", 2, 0, "Two local soldiers are brutally executed by Muslim radicals."], ["2008.10.05", "Egypt", "al-Tayeba", 1, 3, "A 19-year-old Christian is shot to death by a Muslim mob."], ["2008.10.05", "Iraq", "Mosul", 1, 1, "Fundamentalists gun down a butcher in his shop."], ["2008.10.05", "Iraq", "Zanjili", 4, 6, "Terrorists attack a funeral with automatic weapons, killing four innocents."], ["2008.10.06", "Iraq", "Mosul", 1, 0, "A disabled Christian is abducted from his shop by Islamists and then shot to death."], ["2008.10.06", "Pakistan", "Punjab", 17, 60, "Holy Warriors strike a party held at a home.  Seventeen people are blown to bits."], ["2008.10.06", "Somalia", "Merka", 1, 2, "Islamic militia attack a humanitarian vehicle, leaving one worker dead."], ["2008.10.06", "Somalia", "Mogadishu", 17, 35, "Children are among the seventeen civilians killed at a marketplace following an al-Shabaab mortar attack."], ["2008.10.07", "Algeria", "M'sila", 2, 0, "An army major is killed when fundamentalists booby-trap the dead body of another man kidnapped and murdered earlier."], ["2008.10.07", "Iraq", "Mosul", 1, 0, "Islamic extremists enter a Christian pharmacy and kill the owner."], ["2008.10.07", "Iraq", "Mosul", 2, 0, "A Christian man and his elderly father are shot to death at their workplace by Religion of Peace radicals."], ["2008.10.07", "Somalia", "Beledweyne", 1, 0, "Islamic militia are suspected of shooting a peaceful negotiator in the head at a marketplace."], ["2008.10.07", "Thailand", "Narathiwat", 1, 1, "Militant Muslims murder a man sitting in his pickup truck.  The victim's teenage son is severely injured."], ["2008.10.08", "Iraq", "Baquba", 10, 19, "A female Fedayeen murders ten Iraqis outside a courthouse."], ["2008.10.08", "Iraq", "Mosul", 2, 0, "Two more Christians are murdered by Muslim extremists in separate attacks."], ["2008.10.08", "Lebanon", "Ain al-Helweh", 1, 0, "Suspected fundamentalists gun down a Fatah activist."], ["2008.10.09", "Afghanistan", "Uruzgan", 6, 9, "Women and children are among the casualties during a shooting attack by religious extremists."], ["2008.10.09", "Iraq", "Habaniya", 3, 8, "A suicide bomber successfully takes out three Iraqis."], ["2008.10.09", "Iraq", "Tal Afar", 2, 3, "Mujahideen bomb a restaurant, killing two patrons."], ["2008.10.09", "Iraq", "Udhaim", 4, 5, "Two children are among four family members wiped out by Jihadi bombers."], ["2008.10.09", "Pakistan", "Bajaur", 4, 0, "Four tribal elders are abducted and beheaded in the name of Allah."], ["2008.10.09", "Pakistan", "Islamabad", 10, 21, "Four schoolgirls are among ten people killed in a Mujahideen bombing."], ["2008.10.10", "Afghanistan", "Khost", 2, 3, "Two people are blown up by a Taliban suicide bomber."], ["2008.10.10", "Iraq", "Baghdad", 12, 26, "Twelve Iraqis are murdered by Jihadi bombers at a commercial center."], ["2008.10.10", "Iraq", "Mosul", 2, 0, "Two Christians are shot to death by Islamists at a roadblock after being forced to identify themselves."], ["2008.10.10", "Iraq", "Mosul", 39, 53, "Mujahideen successfully kill about forty Iraqis with two marketplace car bombings."], ["2008.10.10", "Pakistan", "Charbagh", 1, 0, "Sunni hardliners burn down two girls schools and shoot a citizen to death."], ["2008.10.10", "Pakistan", "Orakzai", 82, 160, "A Fedayeen bomber sends over eighty souls to Allah at a tribal meeting."], ["2008.10.11", "Iraq", "Mosul", 3, 0, "The bodies of three Christians are discovered following their abduction by Islamic radicals."], ["2008.10.11", "Pakistan", "Mailsi", 1, 0, "A man is tortured and murdered by his girlfriend's son over illicit relations."], ["2008.10.11", "Philippines", "Sultan Kudarat", 5, 5, "Moro Islamists attack a Christian village, killing five innocents and kidnapping two others for use as human shields."], ["2008.10.12", "Afghanistan", "Khost", 2, 3, "A woman and child are killed when the Taliban fire a rocket into their home."], ["2008.10.12", "Iraq", "Baghdad", 9, 11, "Nine people are blown apart by a Jihad car bomb."], ["2008.10.12", "Iraq", "Mosul", 1, 1, "A Christian business owner is gunned down in his music store by Islamic fundamentalists."], ["2008.10.12", "Iraq", "Mosul", 5, 11, "Mujahideen bombers kill five Iraqis."], ["2008.10.12", "Pakistan", "Khyber", 3, 0, "Three men are shot to death by suspected Islamic radicals."], ["2008.10.12", "Somalia", "Kismayo", 1, 0, "Islamists brutally machine gun a man to death as he is being released from prison."], ["2008.10.12", "Thailand", "Pattani", 1, 0, "Islamists shoot a man to death in front of his 8-year-old daughter."], ["2008.10.13", "Afghanistan", "Ghazni", 6, 2, "Religious extremists take out six civilians with a roadside blast."], ["2008.10.13", "Pakistan", "Darra Adam Khel", 1, 4, "A sudden Sunni rocket attack leaves a local security staff member dead."], ["2008.10.13", "Pakistan", "Murid Wal", 1, 0, "A young man is forced by honor to kill his mother when she refuses to break off an 'illicit' relationship."], ["2008.10.13", "Somalia", "Mogadishu", 2, 23, "Two African Union mission members are killed when Muslim militia attack their vehicles."], ["2008.10.14", "Afghanistan", "Kandahar", 1, 0, "Religious extremists assassinate a government official who aids war widows."], ["2008.10.14", "Afghanistan", "Uruzgan", 9, 6, "Two children are among nine civilians murdered when Taliban bombers target a minibus."], ["2008.10.14", "India", "Poonch", 2, 0, "Mujahideen kill two local soldiers in separate ambushes."], ["2008.10.14", "Pakistan", "Kabal", 1, 0, "Sunni extremists abduct, torture and behead a local soldier."], ["2008.10.14", "Philippines", "North Cotabato", 1, 0, "Moro Islamists attack a Christian village, killing one civilian and driving many families from their homes."], ["2008.10.14", "Somalia", "Mogadishu", 1, 0, "Islamists murder the driver of an aid agency."], ["2008.10.15", "Afghanistan", "Lashkar Gah", 6, 0, "Six local police are taken out in a brutal Taliban ambush on their checkpoint."], ["2008.10.15", "Algeria", "Setif", 3, 2, "Fundamentalists murder three local guards with a bomb attack."], ["2008.10.15", "Iraq", "Baghdad", 7, 18, "A Mujahideen bomb blast and separate mortar attack on a mosque leave seven civilians dead."], ["2008.10.15", "Iraq", "Karbala", 22, 0, "A mass grave is discovered containing the bodies of twenty-two abducted shepherds"], ["2008.10.15", "Jordan", "Amman", 1, 0, "A Muslim man shoots his 16-year-old daughter to death over concerns that she has had sex."], ["2008.10.15", "Pakistan", "Swat", 2, 0, "The Taliban enter a home and murder a husband and wife."], ["2008.10.15", "Pakistan", "Swat", 3, 0, "Three people, including two brothers, are killed in two Jihad shooting attacks."], ["2008.10.16", "Afghanistan", "Maiwand", 31, 0, "Thirty-one passengers on a bus are stopped by the Taliban and calmly machine-gunned and beheaded."], ["2008.10.16", "Afghanistan", "Paktika", 1, 0, "A radicalized policeman stages a surprise suicide ambush on a group of US soldiers, killing one."], ["2008.10.16", "Algeria", "Algiers", 1, 0, "A young boy is kidnapped and beheaded by Islamic extremists."], ["2008.10.16", "Iraq", "Buhriz", 1, 1, "A 6-year-old shepherd boy is murdered by Mujahideen bombers.  Another child is injured."], ["2008.10.16", "Pakistan", "Miranshah", 1, 0, "An Afghan refugee is brutally beheaded by the Taliban."], ["2008.10.16", "Pakistan", "Swat", 5, 15, "A Fedayeen suicide car bomber rams into a police station, killing five Pakistanis."], ["2008.10.17", "India", "Jaipur", 0, 1, "A 'conservative Muslim' sets an 11-year-old girl on fire for wearing lipstick and being inappropriately dressed."], ["2008.10.17", "Iraq", "Baghdad", 3, 7, "Jihadis set off a bomb near a mosque, killing three civilians."], ["2008.10.17", "Iraq", "Kut", 1, 0, "Suspected fundamentalists shoot an unmarried pregnant woman to death."], ["2008.10.17", "Somalia", "Merka", 1, 0, "A humanitarian worker is shot to death by suspected fundamentalists."], ["2008.10.18", "Afghanistan", "Kandahar", 2, 0, "A father and son are shot to death by Sunni radicals outside a mosque."], ["2008.10.18", "Ingushetia", "Muzhichi", 2, 5, "Islamic militants ambush and kill two local soldiers."], ["2008.10.18", "Iraq", "Baquba", 1, 4, "A woman is taken out by Mujahideen bombers.  Four family members are badly injured."], ["2008.10.18", "Iraq", "Samarra", 11, 0, "Eleven Iraqis kidnapped a year earlier by sectarian Jihadis are found in a mass grave."], ["2008.10.18", "Jordan", "Aqaba", 1, 0, "A man is forced to kill his sister for leaving the house without his permission."], ["2008.10.18", "Thailand", "Narathiwat", 1, 0, "A young laborer is gunned down by Mujahideen."], ["2008.10.18", "Thailand", "Pattani", 1, 2, "Radical Muslims shoot at a family, killing the father and seriously injuring his wife and 5-year-old child."], ["2008.10.19", "Iraq", "Baghdad", 2, 15, "Mujahideen bombers take out two civilians."], ["2008.10.19", "Iraq", "Balad", 5, 3, "al-Qaeda gunmen attack a family home, killing five people."], ["2008.10.19", "Pakistan", "Khyber", 1, 1, "A woman is killed when Islamic militants bomb a marketplace."], ["2008.10.19", "Pakistan", "Swat", 1, 0, "A roadside ambush by the Taliban leaves one local soldier dead."], ["2008.10.19", "Somalia", "Hudur", 1, 0, "Islamic militia shoot a UNICIF worker twice in the head as he is drinking tea with relatives."], ["2008.10.19", "Thailand", "Pattani", 1, 1, "Islamists murder a 1-year-old baby when they fire into his home."], ["2008.10.19", "Thailand", "Yala", 1, 0, "A 60-year-old rubber tapper is shot to death by Muslim militants while returning from work."], ["2008.10.20", "Afghanistan", "Kabul", 1, 0, "A female aid worker is shot to death by Sunni extremists over fears that she was sharing her Christian faith."], ["2008.10.20", "Afghanistan", "Kunduz", 7, 0, "Five children are among seven people blown to death by a Fedayeen suicide bomber."], ["2008.10.20", "Dagestan", "Makhachkala", 5, 10, "Muslim militants ambush and kill five police officers in two attacks."], ["2008.10.20", "Iraq", "Baghdad", 4, 8, "Mujahideen kill four civilians with two bombs, one an attack on a bus."], ["2008.10.20", "Somalia", "Hudur", 1, 0, "An aid worker for UNICEF is gunned down by fundamentalists."], ["2008.10.20", "Thailand", "Narathiwat", 1, 0, "A civilian is shot to death by Islamists."], ["2008.10.20", "Thailand", "Narathiwat", 2, 6, "Islamists pepper a truck returning from a sporting event with machine-gun fire, killing two occupants."], ["2008.10.20", "Thailand", "Pattani", 3, 0, "Three men sitting in a house are murdered by Muslim radicals, who shoot through the walls to kill them."], ["2008.10.21", "Iraq", "Latifiya", 9, 0, "The bodies of nine people abducted and murdered by Jihadis are found in a grave."], ["2008.10.21", "Pakistan", "Sersenai", 2, 6, "Two people are murdered by Mujahideen bombers along a highway."], ["2008.10.22", "Iraq", "Mosul", 2, 0, "Two Christians, a father and son, are shot to death by Islamic radicals."], ["2008.10.22", "Iraq", "Mosul", 4, 3, "Four people are taken down by Mujahideen bombers."], ["2008.10.22", "Iraq", "Qaim", 34, 0, "Two women are among thirty-four al-Qaeda kidnap victims found executed in a mass grave."], ["2008.10.22", "Pakistan", "Khyber", 2, 0, "Two children are killed when Lashkar-e-Islam open fire at a checkpoint."], ["2008.10.22", "Pakistan", "Swat", 15, 20, "Sunni radicals take out fifteen local troops with a bombing on their convoy."], ["2008.10.22", "Thailand", "Yala", 1, 0, "A 40-year-old garbage truck driver is shot to death by Muslim extremists while riding to work."], ["2008.10.23", "Afghanistan", "Helmand", 0, 1, "The Taliban rip out a farmer's eyes in front of his family."], ["2008.10.23", "Iraq", "Baghdad", 10, 22, "A Fedayeen suicide bomber detonates in the middle of rush hour, killing ten commuters."], ["2008.10.23", "Iraq", "Kut", 3, 2, "Three children bleed to death after their house is hit by a Jihadi mortar."], ["2008.10.23", "Israel", "Mingora", 1, 1, "An 86-year-old Jewish man is stabbed to death at random by a Palestinian attacker."], ["2008.10.23", "Pakistan", "Mingora", 1, 0, "Sunnis abduct and behead a policeman."], ["2008.10.23", "Pakistan", "Orakzai", 8, 0, "Religious extremists force a car off the road, then shoot the eight occupants to death one by one."], ["2008.10.23", "Philippines", "Cotabato", 2, 0, "Two game hunters are shot to death by Moro Islamists."], ["2008.10.24", "Chechnya", "Serzhen-Yurt", 1, 10, "Mujahideen use a landmine to murder a local security officer."], ["2008.10.25", "Afghanistan", "Kabul", 2, 2, "Two civilians are shot to death in their office by a Sunni radical."], ["2008.10.25", "Pakistan", "Wah", 1, 0, "An 18-year-old girl is shot to death by her older brother on suspicion that she was having sex."], ["2008.10.25", "Somalia", "Gurilel", 1, 0, "A female activist for women's rights is murdered by suspected fundamentalists as she is walking home."], ["2008.10.25", "Thailand", "Pattani", 1, 4, "Muslim militants gun down a police officer."], ["2008.10.26", "Pakistan", "Khyber", 1, 0, "A tribal elder is shot to death by religious extremists."], ["2008.10.26", "Pakistan", "Matta", 11, 62, "Eleven innocent people are killed during a botched kidnapping attempt by the Taliban."], ["2008.10.26", "Pakistan", "Mohmand", 11, 5, "A Fedayeen suicide car bomber murders eleven people at a check point."], ["2008.10.26", "Pakistan", "North Waziristan", 5, 0, "Five civilians are brutally beheaded on video by al-Qaeda members."], ["2008.10.26", "Pakistan", "Sambat", 3, 0, "Fundamentalists target a barbershop, killing three civilians."], ["2008.10.26", "Somalia", "Mogadishu", 2, 2, "Two people are killed in an Islamic militia bombing."], ["2008.10.26", "Somalia", "Mogadishu", 6, 3, "Three civilians are among six people killed in a Mujahideen landmine attack."], ["2008.10.26", "Somalia", "Saydheelow", 5, 15, "Five local soldiers are killed in an ambush by Islamic militia."], ["2008.10.27", "Afghanistan", "Baghlan", 3, 6, "An 8-year-old boy is among three people blasted to death by a suicide bomber posing as a policeman."], ["2008.10.27", "Iraq", "Baghdad", 5, 19, "Jihad bombers take out five Iraqis in two separate blasts."], ["2008.10.27", "Pakistan", "Karachi", 4, 0, "Four locals are shot to death by sectarian rivals as they leave a mosque."], ["2008.10.27", "Somalia", "Kismayu", 2, 0, "Islamists quote from the Qur'an as they stone a 13-year-old rape victim to death and kill a young boy coming to her defense."], ["2008.10.27", "Thailand", "Narathiwat", 1, 0, "Islamists are suspected in the shooting death of a wood trader on his doorstep."], ["2008.10.28", "Iraq", "Habaniya", 2, 3, "A suicide bomber successfully takes out two Iraqis."], ["2008.10.28", "Iraq", "Tal Afar", 20, 0, "A mass grave containing twenty victims of al-Qaeda is discovered."], ["2008.10.28", "Sudan", "Darfur", 3, 0, "Three Chinese engineers are murdered in cold blood by their Janjiweed kidnappers."], ["2008.10.29", "Iraq", "Baghdad", 5, 17, "Mujahideen bomb a soda fountain, killing at least five patrons."], ["2008.10.29", "Iraq", "Balad Ruz", 3, 14, "al-Qaeda gunmen murder three children in their home."], ["2008.10.29", "Iraq", "Baqubah", 1, 16, "A 4-year-old child is murdered by Islamic bombers."], ["2008.10.29", "Pakistan", "Bannu", 2, 11, "Two local soldiers are blown to bits by a Fedayeen suicide bomber."], ["2008.10.29", "Pakistan", "Dera Ismail Khan", 3, 0, "Three Shiite civilians standing at a bus stop are gunned down in cold blood by Sunni militants."], ["2008.10.29", "Somalia", "Hargeisa", 28, 26, "Five separate suicide bombings leave over two dozen innocent people dead in commercial areas across the city."], ["2008.10.29", "Thailand", "Pattani", 1, 0, "Islamists shoot a 52-year-old man to death."], ["2008.10.30", "Afghanistan", "Kabul", 5, 23, "A woman is among five people killed when a Muslim terrorist throws a bomb into an office building."], ["2008.10.30", "India", "Assam", 81, 300, "Harkat-ul-Jehadi-e-Islami terrorists massacre over eighty people in six deadly blasts across several towns."], ["2008.10.30", "Iraq", "Mosul", 2, 6, "A random bombing along a traffic circle leaves two civilians dead."], ["2008.10.30", "Pakistan", "Charbagh", 1, 0, "The Taliban behead an abducted cop after holding him hostage for two days."], ["2008.10.31", "Afghanistan", "Helmand", 4, 4, "Four local security forces are killed in two separate attacks by Sunni militants."], ["2008.10.31", "Pakistan", "Mardan", 8, 25, "A suicide bomber walks into a home and detonates himself, killing at least eight other people."], ["2008.10.31", "Pakistan", "Orakzai", 4, 3, "Four people are killed in a sustained Taliban attack on their village."], ["2008.10.31", "Somalia", "Mogadishu", 3, 3, "Islamists successfully kill three civilians in separate grenade attacks on two markets."], ["2008.10.31", "Thailand", "Pattani", 1, 1, "A local man is shot to death by Muslim radicals."], ["2008.11.01", "Iraq", "Basra", 1, 1, "Jihadis take out a young child with a landmine."], ["2008.11.01", "Pakistan", "Peshawar", 2, 0, "Two residents are gunned down by Islamic militants."], ["2008.11.02", "Iraq", "Kirkuk", 2, 1, "Two children are taken out by Jihadi roadside bombers."], ["2008.11.02", "Pakistan", "Zalai", 8, 3, "A suicide bomber murders eight local soldiers at a checkpoint."], ["2008.11.02", "Somalia", "Baidoa", 5, 6, "Fundamentalists kill five Somalis with a roadside blast."], ["2008.11.02", "Thailand", "Narathiwat", 1, 1, "A Buddhist family is attacked by Muslim terrorists, who shoot the 72-year-old matriarch to death."], ["2008.11.03", "Afghanistan", "Kandahar", 1, 0, "Taliban gunmen murder a government official as he is riding a motorbike."], ["2008.11.03", "Iraq", "Baghdad", 6, 20, "Jihadis manage to kill six Iraqis with a double bombing."], ["2008.11.03", "Iraq", "Buhriz", 6, 0, "Four children are among six members of a family taken out in a brutal al-Qaeda bomb attack."], ["2008.11.03", "Iraq", "Saadiya", 2, 0, "Two women are kidnapped and murdered by suspected Sunni extremists."], ["2008.11.03", "Pakistan", "Kabal Khas", 4, 0, "A father and son are among four people detained, then shot to death by Islamic radicals."], ["2008.11.03", "Somalia", "Baidoa", 1, 0, "A women's rights activist is shot twice in the head and chest in front of her business by Islamic hardliners."], ["2008.11.03", "Thailand", "Narathiwat", 1, 0, "A 66-year-old tea shop owner is shot to death by Islamic separatists."], ["2008.11.04", "Afghanistan", "Kandahar", 1, 0, "A female anthropologist trying to learn local customs is doused with gas and burned to death (succumbs 1/7/09)."], ["2008.11.04", "Iraq", "Baghdad", 18, 47, "Eighteen Iraqis are killed in at least four Jihad bombings."], ["2008.11.04", "Iraq", "Madaen", 3, 0, "A woman and two children are killed when terrorists lob a mortar into their home."], ["2008.11.04", "Pakistan", "Hangu", 7, 6, "Seven people are killed by a Fedayeen suicide bomber."], ["2008.11.04", "Pakistan", "Mardan", 2, 2, "Two policemen are shot at point blank range by Muslim militants."], ["2008.11.04", "Pakistan", "Orakzai", 1, 0, "An elderly man is gunned down by Sunni extremists."], ["2008.11.04", "Pakistan", "Swat", 1, 0, "The Taliban tie a policeman to a pole and shoot him to death."], ["2008.11.04", "Thailand", "Narathiwat", 1, 72, "Islamists bomb a marketplace and a tea shop, killing at least one innocent and injuring over seventy."], ["2008.11.04", "Thailand", "Yala", 3, 0, "A 16-year-old boy is among three people ambushed and murdered by Muslim terrorists in separate attacks."], ["2008.11.05", "Iraq", "Baghdad", 6, 12, "Six people are blown to bits by a suicide bomber at an airport."], ["2008.11.05", "Pakistan", "FATA", 1, 0, "Mujahideen abduct and murder a local official."], ["2008.11.05", "Pakistan", "Waziristan", 5, 0, "Five civilians are hanged by religious fundamentalists."], ["2008.11.05", "Somalia", "Mogadishu", 1, 3, "Islamic militia kill a local guard with a hand grenade."], ["2008.11.05", "Thailand", "Yala", 1, 0, "A school janitor on his way to work is shot to death by Islamic extremists."], ["2008.11.06", "Algeria", "Cabilia", 1, 0, "A popular mayor is kidnapped, executed and then burned by Islamic fundamentalists."], ["2008.11.06", "Iraq", "Mosul", 1, 0, "A young woman is shot to death by suspected fundamentalists over immoral activity."], ["2008.11.06", "Pakistan", "Khar", 22, 45, "Fedayeen suicide bombers take out over twenty people at a gathering of tribal elders."], ["2008.11.06", "Russia", "Vladikavkaz", 11, 40, "A female suicide bomber strikes at a marketplace bus stop, murdering at least eleven passengers."], ["2008.11.06", "Thailand", "Yala", 1, 0, "The 47-year-old widow of a murdered man is herself gunned down by Muslim militants."], ["2008.11.07", "Afghanistan", "Ghor", 1, 1, "Talibanis assassinate a local official."], ["2008.11.07", "Iraq", "Baghdad", 6, 12, "Two Jihad bombings leave six civilians dead."], ["2008.11.07", "Pakistan", "Changa Manga", 1, 0, "A 15-year-old girl is stabbed to death by her brother on suspicion of sexual relations."], ["2008.11.07", "Pakistan", "Mingora", 2, 11, "Two local security personnel are dismembered by a suicide bomber."], ["2008.11.08", "Algeria", "Naciria", 1, 0, "A young man delivering bread is shot and beheaded by Islamic fundamentalists."], ["2008.11.08", "Iraq", "Ramadi", 8, 12, "A double suicide bombing by Fedayeen leave eight Iraqis dead."], ["2008.11.08", "Pakistan", "North Waziristan", 2, 0, "Two civilians are abducted, then riddled with bullets by religious extremists."], ["2008.11.08", "Somalia", "Jamame", 1, 0, "A aid worker, whose agency helps construct roads, is murdered by Islamic militia."], ["2008.11.08", "Somalia", "Lego", 3, 0, "Al-Shabaab terrorists kidnap and behead three local soldiers."], ["2008.11.09", "Afghanistan", "Herat", 2, 4, "A suicide bomber yells 'Allah Akbar' then detonates along a highway, killing two Spanish soldiers."], ["2008.11.09", "Algeria", "Jijel", 1, 0, "Islamic fundamentalists murder a 52-year-old civilian."], ["2008.11.09", "Iraq", "Fallujah", 3, 5, "Two woman and a 10-year-old girl are blown to bits by a Fedayeen suicide bomber."], ["2008.11.09", "Pakistan", "Matta", 1, 0, "A woman is pumped full of bullets after being found guilty of adultery by a Sharia court."], ["2008.11.09", "Philippines", "Maguindanao", 2, 0, "Two locals are abducted and shot to death by Moro Islamists."], ["2008.11.09", "Philippines", "Pikit", 2, 3, "A 12-year-old boy and 10-year-old girl are brutally gunned down by Islamic extremists."], ["2008.11.10", "Dubai", "Umm Suqeim", 1, 1, "A brother stabs his sister's lover to death in an honor killing.  (The woman is also stabbed, but survives)."], ["2008.11.10", "Iraq", "Baghdad", 30, 68, "Two Sunni suicide bombers massacre thirty Shia civilians outside a fine arts school."], ["2008.11.10", "Iraq", "Baqubah", 7, 12, "al-Qaeda sends a 13-year-old female suicide bomber to a gathering where seven people are killed."], ["2008.11.10", "Pakistan", "Orakzai", 1, 9, "Sunni extremists fire on a passenger bus, killing one person."], ["2008.11.10", "Thailand", "Narathiwat", 1, 5, "Islamists kill a local soldier with a roadside bomb."], ["2008.11.11", "Iraq", "Baghdad", 3, 15, "Mujahideen target newspaper vendors with bombs, killing at least three."], ["2008.11.11", "Pakistan", "Peshawar", 4, 13, "A suicide bomber murders four people outside a sports stadium."], ["2008.11.11", "Thailand", "Pattani", 1, 0, "A Buddhist civilian is shot to death at close range by Islamists."], ["2008.11.11", "Thailand", "Pattani", 2, 0, "A 79-year-old woman is murdered along with her son by Muslim terrorists as she is walking home."], ["2008.11.11", "Thailand", "Yala", 2, 0, "Two laborers are shot to death by Islamic militants in separate attacks."], ["2008.11.12", "Afghanistan", "Farah", 1, 0, "A religious cleric who condemned suicide bombings is kidnapped and executed in captivity by the Taliban."], ["2008.11.12", "Afghanistan", "Kandahar", 0, 3, "Religious extremists spray three teenage schoolgirls with acid while they are walking to school."], ["2008.11.12", "Afghanistan", "Kandahar", 6, 42, "Six people are killed when a suicide bomber flattens a commercial district."], ["2008.11.12", "Iraq", "Baghdad", 21, 87, "Nearly two dozen Iraqis are successfully killed by Mujahideen bombers in three attacks."], ["2008.11.12", "Iraq", "Mosul", 2, 0, "Two Christian sisters are shot to death inside their home by Muslim militants."], ["2008.11.12", "Pakistan", "Charsadda", 6, 15, "A half dozen people are murdered by a Fedayeen suicide car bomber."], ["2008.11.12", "Pakistan", "Peshawar", 2, 0, "An American humanitarian worker and his driver are murdered by Islamic radicals."], ["2008.11.13", "Afghanistan", "Nangarhar", 9, 74, "Islamic suicide bombers hit a livestock market, sending nine innocents to Allah."], ["2008.11.13", "Dagestan", "Urguba", 1, 1, "Suspected Islamists gun down a local cop at point-blank range."], ["2008.11.13", "Iraq", "Ramadi", 4, 3, "A Fedayeen suicide bomber murders four people."], ["2008.11.13", "Philippines", "Mindanao", 3, 0, "A 5-year-old boy is among three civilians killed by Moro Islamists during an assault."], ["2008.11.14", "Afghanistan", "Khost", 3, 0, "Three construction workers are shot to death by Sunni extremists."], ["2008.11.14", "Pakistan", "Ramora", 2, 0, "A young man is forced by honor to kill his sister and her lover after finding them in a compromising position."], ["2008.11.15", "Iraq", "Baghdad", 3, 25, "Three people are killed when terrorists detonate a bomb near a theatre."], ["2008.11.15", "Iraq", "Tal Afar", 9, 40, "Mujahideen plant a car bomb at a car dealership, killing nine employees and customers."], ["2008.11.15", "Philippines", "Sarangani", 2, 0, "Moro Islamists murder two local soldiers with a landmine."], ["2008.11.15", "Somalia", "Yaqshid", 2, 0, "Two civilians are killed during an ambush by Islamic extremists."], ["2008.11.16", "Iraq", "Baghdad", 3, 6, "Jihadis manage to kill three Iraqis with a roadside bomb."], ["2008.11.16", "Iraq", "Jalawla", 15, 20, "A Fedayeen detonates himself in a crowd, sending fifteen innocent souls to Allah."], ["2008.11.16", "Pakistan", "Anayat Kalley", 1, 0, "A tribal elder is killed in a brutal ambush by a group of Taliban."], ["2008.11.16", "Somalia", "Baidoa", 3, 10, "A child and two women are blown to bits by Muslim bombers at a marketplace."], ["2008.11.16", "Somalia", "Mogadishu", 2, 2, "Islamists open fire on a car, killing two businessmen."], ["2008.11.16", "Thailand", "Pattani", 1, 0, "Islamists shoot a man to death outside a mosque."], ["2008.11.16", "Thailand", "Yala", 1, 0, "A young man is murdered outside his home by Muslim gunmen."], ["2008.11.17", "Afghanistan", "Dand", 3, 2, "Three Afghans are murdered by a suicide bomber."], ["2008.11.17", "Afghanistan", "Farah", 6, 4, "Talibanis ambush a group of local soldiers, shooting some and beheading others."], ["2008.11.17", "Afghanistan", "Kandahar", 4, 8, "Religious extremists murder four civilians with a roadside bomb."], ["2008.11.17", "Ingushetia", "Nazran", 1, 1, "Islamic separatists shoot a married couple in their car, killing the man and putting his wife in the hospital."], ["2008.11.17", "Pakistan", "Swat", 4, 3, "Four Pakistanis are blown apart by a suicide car bomber."], ["2008.11.17", "Thailand", "Narathiwat", 1, 1, "A civilian is killed, and his 8-year-old daughter badly injured, when Islamic gunmen fire on their pickup truck."], ["2008.11.17", "Thailand", "Pattani", 1, 0, "A 44-year-old security guard is shot three times by Islamic terrorists while riding his motorbike."], ["2008.11.17", "Thailand", "Pattani", 3, 0, "A 73-year-old woman is among three civilians murdered by Religion of Peace gunmen in separate attacks."], ["2008.11.18", "Iraq", "Baghdad", 15, 0, "Fifteen bodies are found beneath a house controlled by the militia of a Shiite cleric."], ["2008.11.18", "Thailand", "Pattani", 1, 1, "Mujahideen gun down a woman and her son on their way to work at a plantation."], ["2008.11.18", "Thailand", "Pattani", 2, 0, "Two Buddhists are shot to death by Muslim militants, who then mutilate the bodies and take amputated arms."], ["2008.11.18", "Thailand", "Yala", 1, 1, "Islamists gun down a soldier shopping at a local market as well as his wife, who came to his defense."], ["2008.11.19", "Dagestan", "Buynaksk", 1, 0, "A local cop is gunned down by suspected Muslim militants."], ["2008.11.19", "England", "Woolwich", 1, 0, "A failed asylum seeker from Algeria beats a gay man to death who took him in."], ["2008.11.19", "Pakistan", "Islamabad", 2, 0, "Two men are shot to death by Mujahideen along a city street."], ["2008.11.19", "Yemen", "Joaar", 5, 0, "al-Qaeda terrorists gun down four local cops and a civilian."], ["2008.11.20", "Afghanistan", "Khost", 8, 13, "A Fedayeen suicide bomber detonates outside an office building, sending eight Afghans to Allah."], ["2008.11.20", "Iraq", "Kut", 5, 0, "Sunni extremists invade a home and kill five residents, including children."], ["2008.11.20", "Iraq", "Mosul", 5, 0, "Two women are among five people murdered by terrorists while sitting in their vehicle."], ["2008.11.20", "Pakistan", "Bajaur", 9, 6, "A suicide bomber enters a rival mosque and takes out nine innocents."], ["2008.11.20", "Pakistan", "Swat", 1, 0, "A local man is murdered by the Taliban for helping a Chinese engineer escape abduction."], ["2008.11.21", "Afghanistan", "Zabul", 3, 4, "Three civilians are blown to bits by a suicide car bomber."], ["2008.11.21", "Iran", "Tehran", 1, 0, "A 43-year-old businessman is tortured by police into a \"confession\" then executed as a spy."], ["2008.11.21", "Iraq", "Baghdad", 3, 15, "Mujahideen take out three Iraqis with a roadside bomb."], ["2008.11.21", "Pakistan", "Dera Ismail Khan", 11, 40, "Radical Sunnis gun down a Shia cleric, then bomb his funeral, murdering eight others."], ["2008.11.21", "Pakistan", "Hangu", 1, 0, "Religious extremists fire a rocket at a checkpoint, killing a policeman."], ["2008.11.21", "Somalia", "Mogadishu", 9, 20, "Five children are among nine civilians killed in a rolling series of attacks by Islamic militia in residential areas."], ["2008.11.22", "Afghanistan", "Ghazni", 1, 0, "A local civilian is captured and shot to death by Sunni radicals."], ["2008.11.22", "Afghanistan", "Kabul", 1, 1, "Sunni extremists kill a French de-miner with a landmine."], ["2008.11.22", "Afghanistan", "Khost", 2, 15, "A 15-year-old boy and a man are blown to bits when Holy Warriors bomb a vegetable market."], ["2008.11.22", "Afghanistan", "Kunar", 0, 0, "After being held in captivity for three months, the Taliban execute a local official when their demands are not met."], ["2008.11.22", "Ingushetia", "Nazran", 1, 0, "A cafe worker is gunned down by Muslim rebels."], ["2008.11.22", "Iraq", "Iskandariya", 10, 0, "Two women are among ten people found executed in a mass grave in a Sunni stronghold."], ["2008.11.22", "Pakistan", "Bannu", 3, 0, "A Taliban rocket attack on a police post leaves three dead."], ["2008.11.22", "Pakistan", "Hangu", 5, 8, "Two children are among five killed when Islamists set a bomb off inside a rival mosque."], ["2008.11.22", "Pakistan", "Mingora", 1, 0, "Religious extremists burn down a video store and shoot a civilian to death."], ["2008.11.22", "Somalia", "Mogadishu", 15, 75, "At least fifteen civilians are killed in attacks by Islamic militias on security forces."], ["2008.11.23", "Chechnya", "Sadovyi", 5, 4, "Mujahideen murder five security personnel and a civilian in two attacks."], ["2008.11.23", "Ingushetia", "Nazran", 1, 0, "Islamic militants kill an off-duty cop at a grocery store."], ["2008.11.23", "Iraq", "Muwaylaha", 9, 0, "Nine kidnap victims of an Islamic militia are found in a mass grave."], ["2008.11.24", "Dagestan", "Karabudakhent", 2, 3, "Muslim rebels open fire on a group of policemen, killing two."], ["2008.11.24", "India", "Doda", 1, 0, "A civilian is murdered in his home by Muslim terrorists."], ["2008.11.24", "Iraq", "Baghdad", 5, 24, "A female suicide bomber takes out five Iraqis."], ["2008.11.24", "Iraq", "Baghdad", 13, 6, "Women and children are heavily represented in the thirteen bus passengers massacred by Mujahideen bombers."], ["2008.11.24", "Pakistan", "Kabal", 1, 0, "Mujahid assassinate a local political activist."], ["2008.11.24", "Pakistan", "Mingora", 1, 0, "Religious extremists execute a woman in her home for immoral behavior."], ["2008.11.24", "Thailand", "Yala", 3, 1, "Islamists gun down three civilians and severely injure a teacher in separate attacks."], ["2008.11.25", "India", "Baramulla", 1, 2, "A 14-year-old boy is killed when Islamists throw a grenade into a road show."], ["2008.11.25", "India", "Mumbai", 4, 0, "Islamic terrorists hijack a boat in Pakistan and kill the four man crew."], ["2008.11.25", "Iraq", "Mosul", 2, 5, "Two Americans are shot to death while handing out humanitarian aid."], ["2008.11.25", "Pakistan", "Bara", 1, 0, "A Sikh father is brutally murdered two days after being abducted by Muslim radicals."], ["2008.11.25", "Pakistan", "Hangu", 4, 9, "Shia militants open fire in a hotel, murdering eight Sunni rivals."], ["2008.11.25", "Pakistan", "Kohat", 0, 0, "Four persons, including a mother and child, are killed when sectarian Jihadis fire into a vehicle."], ["2008.11.25", "Pakistan", "Matta", 3, 5, "A butcher is among three people gunned down by the Taliban in separate attacks."], ["2008.11.25", "Pakistan", "Shahdra", 1, 0, "A Muslim lad hacks his stepmother to death with an axe over 'illicit relations.'"], ["2008.11.25", "Somalia", "Baidoa", 1, 0, "A local officer is shot several times in the chest by Islamists at a market."], ["2008.11.26", "Chechnya", "Grozny", 6, 0, "Six women are shot in the head and chest over suspected immorality in separate attacks."], ["2008.11.26", "Dagestan", "Khasavyurt", 1, 2, "A police officer is gunned down outside a mosque by Jihad terrorists."], ["2008.11.26", "Dagestan", "Makhachkala", 1, 0, "A border guard is shot and killed by Muslim militants."], ["2008.11.26", "India", "Mumbai", 178, 370, "Mujahideen throw grenades and machine-gun over one-hundred and fifty civilians and tourists to death as they attack several sites, including a hotel, cafe, market and train station."], ["2008.11.26", "Iraq", "Diyala", 23, 0, "Twenty-three victims of sectarian terrorists are found in a mass grave."], ["2008.11.26", "Iraq", "Samarrah", 6, 0, "Six people are murdered by local Jihadists."], ["2008.11.26", "Pakistan", "Peshawar", 2, 6, "Two residents are killed when the Taliban fire rockets into their home."], ["2008.11.26", "Philippines", "Makir", 1, 3, "Moro Islamists ambush a group of local soldiers guarding a highway, killing one."], ["2008.11.26", "Russia", "Vladikavkaz", 1, 0, "A mayor is assassinated by local terrorists, who call him an \"enemy of Allah.\""], ["2008.11.27", "Afghanistan", "Badghis", 13, 11, "Thirteen local security personnel are killed in an ambush by religious extremists."], ["2008.11.27", "Afghanistan", "Kabul", 4, 18, "A suicide car bomber takes out four local civilians outside the US embassy."], ["2008.11.27", "Iraq", "Mosul", 2, 28, "Suicide bombers successfully take out two Iraqi civilians."], ["2008.11.27", "Pakistan", "Swat", 6, 0, "Six people are shot to death by Sunni extremists in separate attacks, including a brutal abduction."], ["2008.11.28", "India", "Mumbai", 5, 0, "Five Jewish hostages, including a rabbi and his wife, are murdered by Islamists."], ["2008.11.28", "Iraq", "Baghdad", 2, 10, "A Fedayeen suicide car bomber kills two civilians."], ["2008.11.28", "Iraq", "Kut", 1, 2, "A child is killed when Muslim militants fire a rocket into a home."], ["2008.11.28", "Iraq", "Mussayab", 12, 18, "Twelve people at a mosque are blown to bits by rival sectarian bombers."], ["2008.11.28", "Nigeria", "Jos", 2, 0, "Two Christians are hacked to death after a cleric inspires his followers to 'kill unbelievers.\""], ["2008.11.28", "Nigeria", "Jos", 6, 0, "Six Christian pastors are among hundreds killed when Muslim rioter stage a deadly church-burning rampage."], ["2008.11.28", "Pakistan", "Bannu", 7, 16, "Six civilians and a cop are murdered by a suicide bomber along a city street."], ["2008.11.28", "Pakistan", "Gharibabad", 6, 0, "Three women and a child are among six member of a family murdered in their home by the Mujahideen."], ["2008.11.29", "Chechnya", "Enginoy", 1, 0, "A woman is shot to death over suspected immoral behavior."], ["2008.11.29", "Iraq", "Albu Toma", 38, 0, "Thirty-eight victims of sectarian violence within the Religion of Peace are found in a mass grave."], ["2008.11.29", "Iraq", "Baghdad", 3, 12, "Three people are murdered by an Iranian-made rocket fired by Mujahideen."], ["2008.11.29", "Iraq", "Mosul", 3, 18, "Two brothers are among three killed in an attack on a jewelry shop by Sunni terrorists."], ["2008.11.29", "Somalia", "Baidoa", 2, 10, "Two people are killed in blasts by suspected Islamic militia."], ["2008.11.30", "Afghanistan", "Kabul", 2, 3, "A street sweeper is among two civilians blown up by a suicide bomber."], ["2008.11.30", "Dagestan", "Makhachkala", 4, 0, "Muslim gunmen shoot four people to death."], ["2008.11.30", "Pakistan", "Bannu", 6, 5, "Six local police are killed in two Taliban ambushes."], ["2008.11.30", "Pakistan", "North Waziristan", 1, 0, "The Taliban abduct and murder an Afghan civilian."], ["2008.11.30", "Pakistan", "Peshawar", 1, 1, "A local driver is killed when Sunni militants lob rockets into a terminal."], ["2008.12.01", "Afghanistan", "Ghazni", 1, 0, "A local official is assassinated by religious extremists."], ["2008.12.01", "Afghanistan", "Musa Qala", 10, 25, "Ten shoppers are blown up by a suicide bomber at a market."], ["2008.12.01", "Iraq", "Baghdad", 16, 35, "Sixteen police recruits are murdered by two Jihad bombers at their academy."], ["2008.12.01", "Iraq", "Mosul", 15, 25, "A Fedayeen suicide bomber takes out fifteen civilians along a city street."], ["2008.12.01", "Pakistan", "Peshawar", 2, 0, "Taliban militants attack a supply convoy, killing two drivers."], ["2008.12.01", "Pakistan", "Swat", 11, 66, "Women are among the casualties of a horrific suicide attack on a traffic checkpoint.  Eleven are killed."], ["2008.12.01", "Thailand", "Yala", 1, 0, "Muslim terrorists gun down a rubber tapper in his orchard."], ["2008.12.02", "Dagestan", "Makhachkala", 1, 4, "Suspected Muslim militants gun down a cop."], ["2008.12.02", "Iraq", "Mosul", 4, 12, "Two young children are among four killed when Mujahideen place a bomb outside a school."], ["2008.12.02", "Iraq", "Tal Afar", 5, 30, "Jihadis successfully kill five Iraqis with a car bomb."], ["2008.12.02", "Pakistan", "Kabal", 1, 0, "A civilian is shot to death by Islamic terrorists."], ["2008.12.02", "Pakistan", "Sunpag", 1, 0, "Religious extremists abduct a local official, keep him for a few days, then slaughter him and stuff his body in a bag."], ["2008.12.03", "Chechnya", "Grozny", 3, 0, "Three people are shot inside their home by suspected Mujahideen."], ["2008.12.03", "Iraq", "Albu Toma", 13, 0, "Thirteen victims of al-Qaeda kidnappings are found in a mass grave."], ["2008.12.03", "Pakistan", "Shabqadar", 5, 6, "Five locals are killed by a Fedayeen car bomber."], ["2008.12.04", "Afghanistan", "Khost", 5, 10, "Five people are killed in two suicide attacks by Sunni extremists."], ["2008.12.04", "Dagestan", "Khasavyurt", 1, 0, "A woman is killed by Islamic car bombers outside an apartment building."], ["2008.12.04", "Iran", "Bluchistan", 16, 0, "Jundullah terrorists kidnap and execute sixteen Iranian nationals."], ["2008.12.04", "Iraq", "Albu Toma", 25, 0, "Twenty-five al-Qaeda victims are found in mass graves."], ["2008.12.04", "Iraq", "Fallujah", 15, 147, "Women and children are among fifteen Iraqis blasted to death by Jihadi car bombers."], ["2008.12.04", "Pakistan", "Bahawalpur", 1, 0, "A young girl is clubbed to death by her uncle on suspicion of 'illicit relations.'"], ["2008.12.04", "Thailand", "Pattani", 2, 0, "A 60-year-old man is among two people gunned down by Muslim separatists."], ["2008.12.05", "Iraq", "Baghdad", 2, 2, "Mujahideen bombers take out two Iraqis."], ["2008.12.05", "Pakistan", "Bannu", 2, 3, "Taliban militants kill two policemen with a rocket attack."], ["2008.12.05", "Pakistan", "Mir Ali", 1, 0, "Sunni extremists abduct and murder an 30-year-old man."], ["2008.12.05", "Pakistan", "Orakzai", 10, 5, "Religious extremists take out ten shoppers at a bazaar with a suicide blast."], ["2008.12.05", "Pakistan", "Peshawar", 34, 131, "Twenty-nine people at a marketplace are blown to bits by sectarian car bombers."], ["2008.12.05", "Thailand", "Narathiwat", 5, 12, "Five people are killed at a grocery by Islamic bombers."], ["2008.12.06", "Afghanistan", "Kunar", 4, 2, "Four local soldiers are killed when religious extremists attack their vehicle with a roadside bomb."], ["2008.12.06", "Iraq", "Babel", 4, 0, "Four children are killed by a landmine planted near a soccer field by suspected Sunnis."], ["2008.12.06", "Iraq", "Kirkuk", 1, 15, "A Fedayeen suicide bomber kills only one other person."], ["2008.12.06", "Iraq", "Wajihiya", 3, 4, "al-Qaeda gunmen attack a Sunni village, killing three people."], ["2008.12.06", "Pakistan", "Swat", 3, 0, "Three civilians are gunned down by suspected Taliban."], ["2008.12.06", "Somalia", "Baidoa", 3, 0, "An Islamic militia member tosses a grenade into a market, killing three civilians."], ["2008.12.07", "Iraq", "Baquba", 3, 39, "Jihadis kill three Iraqis with a bomb hidden in a shop."], ["2008.12.07", "Pakistan", "Peshawar", 1, 0, "The Taliban murder a local security guard at a depot."], ["2008.12.08", "India", "Bharatpur", 2, 0, "A man reclaims his honor by shooting his daughter and her boyfriend after learning of their sexual relationship."], ["2008.12.09", "Pakistan", "Buner", 1, 4, "A 10-year-old child is murdered by a Fedayeen suicide bomber."], ["2008.12.09", "Philippines", "Maguindanao", 1, 8, "A local soldier is killed when Moro Islamists open fire on them with automatic weapons."], ["2008.12.10", "Iraq", "Jalawla", 1, 2, "A civilian is taken out in a Jihad bomb blast."], ["2008.12.11", "Iraq", "Kirkuk", 55, 120, "Fifty-five Iraqis are blown to bits at a restaurant by Shahid suicide bombers."], ["2008.12.11", "Pakistan", "Matta", 3, 4, "Tehrik-e-Taliban terrorists gun down three locals."], ["2008.12.11", "Somalia", "Mogadishu", 10, 11, "Children are among ten people killed during an attack by Islamic militia."], ["2008.12.11", "Yemen", "Reida", 1, 0, "A Jewish leader is gunned down by a Muslim shouting, 'Jew, receive the message of Islam.'"], ["2008.12.12", "Afghanistan", "Helmand", 4, 1, "Religious extremists trick a 13-year-old boy into carrying explosives to British troops, which were then detonated remotely."], ["2008.12.12", "Thailand", "Pattani", 1, 2, "Jihadis kill a man and seriously injure two others with a planted bomb in a karaoke bar."], ["2008.12.12", "Thailand", "Yala", 3, 3, "Three border guards are killed when Islamic militants open up on them with automatic weapons."], ["2008.12.13", "India", "Doda", 1, 2, "Mujahideen gun down a woman in her home."], ["2008.12.13", "Pakistan", "Matta", 4, 0, "Four tribesmen are shot to death by the Taliban."], ["2008.12.13", "Pakistan", "Miranshah", 2, 0, "Islamists slit one man's throat and shoot another to death."], ["2008.12.13", "Pakistan", "Swat", 5, 0, "Five civilians are killed in a terrorist landmine attack."], ["2008.12.13", "Philippines", "Basilan", 3, 3, "A woman is among three people murdered in their home by Moro Islamists."], ["2008.12.14", "Afghanistan", "Kandahar", 3, 11, "Three Afghans are murdered by a Taliban bomb hidden in a street vendor cart."], ["2008.12.14", "Afghanistan", "Paktika", 1, 0, "A musician is kidnapped and killed by Taliban fundamentalists for defying a ban on music."], ["2008.12.14", "England", "West Yorkshire", 0, 1, "A Muslim youth brutally stabs a 51-year-old at random after telling him that he is walking through an area of Britain that 'Muslims rule.'"], ["2008.12.14", "Pakistan", "Jamrud", 2, 1, "Mujahideen shoot two tribal elders to death along a road."], ["2008.12.14", "Pakistan", "Mandal Daag", 9, 3, "Sunni extremists murder a rival cleric and eight of his followers."], ["2008.12.15", "Iraq", "Khan Dhari", 9, 31, "Nine Iraqi police are blown apart by a Fedayeen car bomber at a checkpoint."], ["2008.12.15", "Iraq", "Sinjar", 7, 3, "Women and children are among seven members of a religious minority sect slaughtered in their home by suspected Sunnis."], ["2008.12.15", "Iraq", "Tarmiya", 1, 1, "A female suicide bomber takes out an Iraqi man and seriously injures his son."], ["2008.12.15", "Pakistan", "Swat", 6, 3, "Six locals are murdered - two beheaded - by Taliban fundamentalists in three attacks."], ["2008.12.15", "Thailand", "Narathiwat", 2, 1, "A 4-year-old child is among three people shot by Islamists in two attacks."], ["2008.12.15", "Thailand", "Yala", 1, 0, "A 53-year-old man is gunned down in front of a food shop by Islamic terrorists."], ["2008.12.16", "Iraq", "Baghdad", 1, 3, "A 13-year-old child is taken out by Islamic bombers."], ["2008.12.16", "Iraq", "Baghdad", 3, 15, "Jihadis place a bomb near a college campus, killing three people."], ["2008.12.16", "Iraq", "Mosul", 8, 16, "Two suicide bombings leave eight Iraqis dead."], ["2008.12.16", "Pakistan", "Swat", 2, 0, "Islamic terrorists gun down two people in separate attacks."], ["2008.12.16", "Thailand", "Pattani", 2, 0, "Two young guards escorting a teacher are gunned down by Muslim radicals."], ["2008.12.16", "Thailand", "Yala", 3, 1, "Muslim terrorists shoot three people to death at a market, including a woman"], ["2008.12.17", "Iraq", "Baghdad", 18, 53, "Eighteen innocent souls are snuffed out by Jihadi bombers along a city street."], ["2008.12.17", "Pakistan", "Jamrud", 1, 1, "A woman is killed, and a child injured, in a Taliban rocket attack on a vehicle."], ["2008.12.17", "Pakistan", "Kanju", 2, 0, "A couple is murdered for having unmarried sex."], ["2008.12.17", "Pakistan", "Matta", 2, 0, "Taliban militants abduct and kill two locals."], ["2008.12.17", "Pakistan", "Wana", 1, 0, "A civilian is shot to death by religious extremists."], ["2008.12.17", "Thailand", "Yala", 1, 0, "A 16-year-old boy is shot to death outside of a 7-Eleven by Mujahideen."], ["2008.12.18", "Iraq", "Diyala", 2, 17, "Two Iraqis are taken out by roadside bombers."], ["2008.12.18", "Iraq", "Kirkuk", 1, 0, "A female women's rights activist is beheaded in her home by Islamic terrorists."], ["2008.12.18", "Pakistan", "Hangu", 4, 1, "A child is among four people shot to death by Islamists in three attacks."], ["2008.12.18", "Philippines", "Iligan", 3, 47, "Islamists detonate nail-packed bombs at two shopping malls in Christian areas, killing at least three people."], ["2008.12.19", "Iraq", "Baghdad", 7, 0, "Islamists behead seven Iraqis."], ["2008.12.19", "Pakistan", "Khyber", 3, 0, "Three civilians are killed when Sunni militants open fire on an empty fuel tanker."], ["2008.12.19", "Somalia", "Mogadishu", 1, 10, "A civilian is shot to death during an attack by Jabalu Islamiya terrorists."], ["2008.12.20", "Thailand", "Pattani", 1, 7, "A woman standing outside a convenience store is murdered by Islamic bombers.  Children are injured as well."], ["2008.12.20", "Thailand", "Yala", 1, 0, "A 49-year-old security guard is shot to death by Muslim radicals as he leaves his home."], ["2008.12.21", "Pakistan", "Bannu", 2, 0, "Islamic militants rocket a government building, killing two people."], ["2008.12.21", "Pakistan", "North Waziristan", 2, 0, "Two brothers are brutally kidnapped and murdered by Sunni extremists."], ["2008.12.21", "Pakistan", "Swat", 3, 0, "Mujahideen drag three people out of their home and shoot them in cold blood.  The victims include a man and his son."], ["2008.12.21", "Thailand", "Pattani", 1, 0, "A 50-year-old civilian is murdered by Muslim gunmen on his way home."], ["2008.12.22", "Afghanistan", "Ghazni", 3, 4, "A suicide bomber takes out three civilians."], ["2008.12.22", "India", "Baramulla", 2, 0, "Two local soldiers are shot to death at close range by Muslim assassins at a market."], ["2008.12.22", "Pakistan", "Swat", 6, 8, "Two women are among six civilians killed by Mujahideen in three incidents."], ["2008.12.22", "Somalia", "Mogadishu", 7, 22, "Seven civilians are killed during an attack by Islamic guerrillas"], ["2008.12.23", "Iraq", "Kifl", 1, 0, "A man is kidnapped and tortured to death by Religion of Peace militants."], ["2008.12.23", "Iraq", "Mosul", 2, 6, "A child and doctor are murdered by Islamic terrorists."], ["2008.12.23", "Iraq", "Tarmiyah", 5, 4, "A man and his wife are among two people blasted to death by Jihad bombers."], ["2008.12.23", "Pakistan", "Mingora", 2, 0, "A beggar woman and her daughter are gunned down at point-blank range by Holy Warriors."], ["2008.12.23", "Pakistan", "Swat", 4, 0, "A man and his wife are among four people murdered by Mujahideen in three attacks."], ["2008.12.23", "Philippines", "Isabela", 0, 26, "Abu Sayyaf members toss two grenades into a group of people enjoying a musical performance."], ["2008.12.23", "Philippines", "Sultan Kudarat", 9, 8, "Moro Islamists storm two villages and shoot nine civilians to death."], ["2008.12.23", "Thailand", "Pattani", 1, 7, "An Islamist shooting and bombing leave one dead and seven injured."], ["2008.12.24", "Iraq", "Fallujah", 3, 4, "Three children are killed in a suspected al-Qaeda roadside attack."], ["2008.12.24", "Pakistan", "Lahore", 1, 4, "Muslim bombers take out a woman along a city street."], ["2008.12.24", "Philippines", "Kalamansig", 1, 0, "Moro Islamists fire at a motorboat, killing a passenger."], ["2008.12.25", "Iraq", "Baghdad", 4, 24, "Sunni extremists bomb a restaurant, killing four patrons."], ["2008.12.25", "Iraq", "Bishkan", 1, 1, "A 13-year-old is murdered in her home by Jihadi invaders."], ["2008.12.25", "Iraq", "Muqdadiyah", 3, 12, "A Fedayeen suicide bomber takes out three other people."], ["2008.12.26", "India", "Kishtwar", 1, 0, "Mujahideen abduct a man, then murder him in a wooded area."], ["2008.12.26", "Iran", "Mashhad", 2, 0, "Two men are buried up to their waists and stoned to death for adultery."], ["2008.12.26", "Pakistan", "Bajaur", 1, 9, "A child is killed during a Taliban rocket attack."], ["2008.12.26", "Pakistan", "Gilgit", 5, 0, "A child is among five people shot dead in a sectarian ambush."], ["2008.12.26", "Pal. Auth.", "Beit Lahiya", 2, 0, "Two young girls are killed when a Palestinian rocket hits their home."], ["2008.12.27", "Afghanistan", "Kabul", 3, 0, "Three teenage sisters are crushed to death by a Taliban rocket barrage."], ["2008.12.27", "Afghanistan", "Kandahar", 5, 5, "Five Afghans are blown up by a Fedayeen suicide bomber."], ["2008.12.27", "Iraq", "Baghdad", 24, 45, "Women and children are among two dozen people blasted to death by Jihadi car bombers."], ["2008.12.27", "Israel", "Netivot", 1, 4, "Hamas rockets kill an Israeli man and injure four others."], ["2008.12.28", "Afghanistan", "Khost", 16, 58, "Fourteen children on their way to school are deliberately murdered along with two adults by a suicidal Sunni bomber."], ["2008.12.28", "Iraq", "Fallujah", 4, 10, "Four Iraqis are murdered in two Jihad bombings."], ["2008.12.28", "Iraq", "Mosul", 4, 20, "A 12-year-old boy is among four civilians taken out by a suicide bomber on a bicycle."], ["2008.12.28", "Pakistan", "Buner", 43, 16, "Religious extremists take out over forty people at a polling station with car bombs. Five children are among the dead."], ["2008.12.28", "Pakistan", "Miranshah", 3, 0, "Three young civilians, including an 18-year-old, are kidnapped and hung by Taliban militants."], ["2008.12.28", "Thailand", "Yala", 1, 0, "Islamic gunmen murder a man in a tea shop."], ["2008.12.29", "Afghanistan", "Kabul", 2, 17, "Two Afghan civilians are blown to bits by a Fedayeen suicide bomber."], ["2008.12.29", "Iran", "Saravan", 2, 10, "Two police officers are killed by a Sunni suicide bomber."], ["2008.12.29", "Iraq", "Mahaweel", 3, 0, "A mother and daughter are among three people killed by Sunni bombers."], ["2008.12.29", "Iraq", "Mosul", 1, 0, "A Shahid suicide bomber takes out a shopper at a grocery."], ["2008.12.29", "Israel", "Ashdod", 1, 1, "A mother of four is killed by a Palestinian rocket."], ["2008.12.29", "Israel", "Ashkelon", 1, 7, "Hamas rockets hit an Israeli home, killing a resident."], ["2008.12.29", "Pakistan", "Gwalirai", 2, 0, "Two men, abducted days earlier, are murdered in captivity by the Taliban."], ["2008.12.29", "Somalia", "Mogadishu", 5, 10, "At least five civilians are killed, including a young child, when Islamists bomb a market."], ["2008.12.29", "Thailand", "Pattani", 1, 1, "A woman is shot to death on her way to work by Muslim terrorists.  Three others are killed elsewhere."], ["2008.12.30", "Egypt", "Cairo", 0, 1, "A woman who embraced Christianity is arrested, raped and tortured by police, who promise to release her if she will return to Islam."], ["2008.12.30", "Iraq", "Jalawla", 1, 0, "Suspected al-Qaeda gun down a tribal leader."], ["2008.12.30", "Pakistan", "Mingora", 1, 0, "A local official is assassinated by Muslim militants."], ["2008.12.30", "Philippines", "Esperanza", 1, 0, "A 17-year-old Christian taxi driver is killed by a bomb planted by Muslim radicals."], ["2008.12.31", "Afghanistan", "Helmand", 21, 0, "A mother pleading for her son's life is among twenty-one persons shot in cold blood by the Taliban."], ["2008.12.31", "Denmark", "Odense", 0, 2, "A Muslim shoots two Jewish vendors at a shopping mall."], ["2008.12.31", "Iraq", "Baghdad", 14, 66, "Four members of a religious minority are among fourteen killed by Islamists in four attacks."], ["2008.12.31", "Pakistan", "Darra Adamkhel", 4, 6, "Three women and a child are killed when Muslim terrorists fire a rocket into their home."], ["2008.12.31", "Pakistan", "Mir Ali", 1, 0, "A 28-year-old man is kidnapped and murdered by the Taliban."], ["2008.12.31", "Philippines", "Bagong", 1, 0, "Moro Islamists gun down a civilian."], ["2008.12.31", "Philippines", "General Santos", 0, 22, "Moro Islamists toss a grenade into a New Years Eve celebration, injuring over twenty."], ["2008.12.31", "Somalia", "Baidoa", 1, 0, "A woman is shot to death by Islamic fundamentalists over an 'illicit' relationship."]], "columns": ["Date", "Country", "City", "Killed", "Injured", "Description"], "year": 2008}