{"rows": [["2011.01.01", "Afghanistan", "Helmand", 1, 0, "Religious extremists at a mosque murder a British soldier."], ["2011.01.01", "Egypt", "Alexandra", 23, 77, "Twenty-three parishioners are incinerated by a Shahid suicide bomb attack on a New Year's Day church mass."], ["2011.01.01", "India", "Ramban", 2, 0, "Lashkar-e-Toiba abduct and murder two border policemen."], ["2011.01.01", "Iraq", "Baghdad", 2, 0, "Terrorists shoot two Iraqis to death in their car."], ["2011.01.01", "Iraq", "Baqubah", 1, 1, "A woman dies from a bombing in her own home."], ["2011.01.01", "Somalia", "Mogadishu", 19, 25, "Children are among at least nineteen civilians cut down by an al-Shabaab ambush along a city street."], ["2011.01.01", "Thailand", "Narathiwat", 2, 8, "Two cops are killed while trying to defuse an Islamic marketplace bomb."], ["2011.01.02", "Dagestan", "Makhachkala", 1, 0, "A folk healer is murdered by Islamists."], ["2011.01.02", "Iraq", "Balad", 1, 9, "One young man is killed by a bombing attack on the family home of a secular judge."], ["2011.01.02", "Iraq", "Kirukuk", 1, 0, "A man is abducted, tortured and murdered by suspected al-Qaeda."], ["2011.01.02", "Iraq", "Qayara", 2, 3, "A car bomb attack leaves two people dead."], ["2011.01.02", "Philippines", "Maguindanao", 2, 3, "A Christian farmer is gunned down while driving home."], ["2011.01.02", "Philippines", "Mamasapano", 1, 3, "Muslim rebels open fire on a family home, killing the father and injuring his wife and children."], ["2011.01.03", "Afghanistan", "Baghlan", 4, 2, "Hardliners attack a rival mosque, shooting four people to death."], ["2011.01.03", "Afghanistan", "Herat", 1, 5, "A civilian is taken down by Taliban bombers."], ["2011.01.03", "Iraq", "Baghdad", 1, 0, "A Christian woman who survived an Islamist church massacre a few weeks earlier is shot to death in her sleep."], ["2011.01.03", "Iraq", "Baghdad", 4, 2, "Four people are shot to death by Islamic insurgents."], ["2011.01.03", "Iraq", "Baqubah", 3, 26, "A Fedayeen suicide car bomber takes out three Iraqis."], ["2011.01.03", "Maldives", "Male", 0, 1, "Islamists stab a female activist in the back for opposing Sharia."], ["2011.01.03", "Pakistan", "Orakzai", 1, 0, "The Taliban decapitate a hostage with a knife."], ["2011.01.04", "Afghanistan", "Kabul", 1, 2, "An Afghan is killed by a remote-controlled bomb hidden in a rice sack."], ["2011.01.04", "Dagestan", "Makhachkala", 1, 0, "A Muslim sniper takes down a local cop."], ["2011.01.04", "Iraq", "Balad", 2, 0, "Two brothers are disassembled by a bomb."], ["2011.01.04", "Iraq", "Duluiya", 2, 0, "Jihadis take down two teenagers with an IED."], ["2011.01.04", "Kyrgyzstan", "Bishkek", 4, 0, "Four security personnel at a checkpoint are machine-gunned to death by religious extremists."], ["2011.01.04", "Pakistan", "Islamabad", 1, 0, "A regional governor is assassinated at a cafe for appealing on behalf of a Christian woman jailed for blasphemy."], ["2011.01.05", "Iraq", "Baghdad", 1, 2, "A civilian is murdered by Jihadi bombers."], ["2011.01.05", "Pakistan", "South Waziristan", 3, 0, "Islamic militants incinerate three members of a family with a roadside bomb."], ["2011.01.06", "Somalia", "Goobweyne", 1, 0, "A 20-year-old mentally ill man is executed by al-Shabaab gunmen."], ["2011.01.07", "Afghanistan", "Spin Boldak", 17, 23, "A suicide bomber at a bath house sends seventeen souls to Allah."], ["2011.01.07", "Bangladesh", "Chittagong", 0, 20, "Wahabbis and Sunnis clash over control over a mosque, beating rivals and setting fires."], ["2011.01.07", "Iraq", "Hussainya", 5, 1, "Three children are among five members of a family brutally murdered in a pre-dawn home invasion."], ["2011.01.07", "Iraq", "Nasariya", 2, 3, "Car bombers take down two members of a Shia family."], ["2011.01.07", "Somalia", "Hosingo", 1, 0, "A goat herder is shot in the head by al-Shabaab for refusing to pay zakat."], ["2011.01.07", "Somalia", "Warbhigly", 1, 0, "Islamic militants slit the throat of a Christian mother of four."], ["2011.01.07", "Thailand", "Narathiwat", 1, 0, "A villager is shot to death by Islamic 'separatists'."], ["2011.01.07", "Yemen", "Abyan", 4, 2, "An al-Qaeda ambush leaves four people dead."], ["2011.01.07", "Yemen", "Lawder", 13, 0, "At least a dozen local soldiers riding in a water supply convoy are machine-gunned to death by al-Qaeda."], ["2011.01.08", "Afghanistan", "Helmand", 3, 1, "A shop owner and two farmers are among three civilians murdered by Taliban bombers."], ["2011.01.08", "Iraq", "Diala", 2, 0, "Two children are torn into pieces when Muslim terrorists detonate a bomb in a chicken coop."], ["2011.01.08", "Thailand", "Yala", 1, 1, "Islamic militants gun down a policeman in a drive-by."], ["2011.01.08", "Yemen", "Lahj", 3, 9, "Islamists attack a local security post and kill three defenders."], ["2011.01.09", "Chechnya", "Grozny", 2, 6, "An electrician is among two people machine-gunned to death in their car by Mujahideen."], ["2011.01.09", "Niger", "Niamey", 2, 0, "A young French aid worker and his friend are kidnapped from a restaurant and murdered by al-Qaeda."], ["2011.01.09", "Nigeria", "Borno", 1, 2, "A guard at a church is shot to death in an Islamist drive-by."], ["2011.01.09", "Philippines", "Basilan", 5, 1, "Five traveling businessmen are flagged down and machine-gunned by Abu Sayyaf."], ["2011.01.09", "Sudan", "Abyei", 20, 30, "Twenty locals are killed in an ambush by Arab-Muslim militia."], ["2011.01.10", "Afghanistan", "Kandahar", 3, 0, "Three people are taken apart by a Fedayeen suicide bomber."], ["2011.01.10", "Somalia", "Mogadishu", 1, 3, "Woman and children are among the casualties when a Holy Warrior tosses a grenade into the street."], ["2011.01.10", "Thailand", "Narathiwat", 2, 0, "Two 'traitors to Islam' are shot to death on their way to work."], ["2011.01.11", "Dagestan", "Makhachkala", 1, 0, "A fortune teller is shot in the head by fundamentalists."], ["2011.01.11", "Dagestan", "Makhachkala", 1, 0, "A young traffic cop is murdered in an Islamist drive-by."], ["2011.01.11", "Egypt", "Samalout", 1, 5, "A policeman boards a train and opens fire on a group of elderly Christians while yelling 'Allah Akbar.'  A 71-year-old victim dies on the scene."], ["2011.01.11", "Nigeria", "Kuru Station", 19, 3, "Children are among the victims when Muslims attack a Christian village, hacking nineteen to death and burning their homes."], ["2011.01.11", "Pakistan", "Hangu", 2, 0, "A tribal elder and his driver are machine-gunned in their car by Mujahideen."], ["2011.01.11", "Pakistan", "Lahore", 0, 2, "Two Christian women are violently beaten and humiliated by a Muslim mob over claims they had 'abused' Muhammad."], ["2011.01.11", "Russia", "Kenzh", 1, 0, "A folk healer is killed in his home by suspected Islamic fundamentalists."], ["2011.01.11", "Sudan", "Abyei", 10, 18, "Ten Africans, on their way to vote for independence, are ambushed and slain by Arab tribesmen, including the mother of a 3-month-old baby - stabbed to death."], ["2011.01.11", "Thailand", "Yala", 2, 0, "Husband and wife plantation workers are murdered by Muslim terrorists."], ["2011.01.12", "Afghanistan", "Farah", 2, 0, "Two civilians are murdered by Sunni bombers."], ["2011.01.12", "Afghanistan", "Kabul", 2, 32, "Two civilians are taken down by a suicide bomber on a passenger bus."], ["2011.01.12", "Pakistan", "Bannu", 20, 14, "A Fedayeen suicide car bomber sends at least twenty souls to Allah."], ["2011.01.12", "Pakistan", "Peshawar", 2, 7, "Two women are blown to bits by Taliban roadside bombers.  Children are among the injured."], ["2011.01.13", "Afghanistan", "Bannu", 2, 3, "Fundamentalists use a bomb to kill two people."], ["2011.01.13", "Afghanistan", "Jalalabad", 1, 3, "A child bleeds out following a bombing at a market by Islamic extremists."], ["2011.01.13", "Dagestan", "Levashinsky", 1, 0, "Muslim gunmen murder a man in his own home."], ["2011.01.13", "Dagestan", "Makhachkala", 1, 1, "A police officer is gunned down by Mujahideen."], ["2011.01.13", "Iraq", "Baghdad", 2, 9, "Two people are killed in bombings near a mosque."], ["2011.01.13", "Pakistan", "Karachi", 1, 0, "A Shia is shot to death in a targeted attack by a Sunni."], ["2011.01.13", "Pakistan", "Khyber", 1, 4, "A policeman is machine-gunned to death by Islamic militants."], ["2011.01.13", "Pakistan", "Peshawar", 1, 1, "Terrorists murder a member of a peace committee outside a mosque."], ["2011.01.13", "Pakistan", "Sardikhel", 4, 5, "Hardliners take down five local police with a remote-controlled bomb."], ["2011.01.14", "Afghanistan", "Zabul", 7, 0, "Taliban bombers successfully kill seven civilians riding in a car."], ["2011.01.14", "Dagestan", "Khasavyurt", 4, 5, "Islamists bomb a cafe, leaving four people dead."], ["2011.01.14", "Pakistan", "Pakhtunkhwa", 6, 3, "Religion of Peace advocates slaughter a policewoman and her family in her home, including her children."], ["2011.01.15", "Afghanistan", "Helmand", 6, 3, "Six civilians are killed when religious extremists bomb their minivan."], ["2011.01.15", "Chechnya", "Grozny", 1, 2, "A roadside bomb leaves one civilian dead."], ["2011.01.15", "Iraq", "Mosul", 0, 1, "A Christian doctor is brutally shot and seriously injured in a targeted hospital attack."], ["2011.01.15", "Russia", "Kabardino-Balkariya", 1, 0, "An Islamic militant shoots a cattle-breeder to death for refusing to finance Jihad."], ["2011.01.15", "Thailand", "Narathiwat", 1, 0, "A 51-year-old man is machine-gunned to death in front of a mosque."], ["2011.01.15", "Thailand", "Pattani", 1, 0, "A young Buddhist math teacher is shot three times in the head by Islamic terrorists."], ["2011.01.16", "Afghanistan", "Baghlan", 9, 0, "Six women, two men and a child are blown to bits by Taliban bombers while traveling to a wedding."], ["2011.01.16", "Afghanistan", "Pakitya", 1, 2, "A Taliban mine dismembers an Afghan civilian."], ["2011.01.16", "Chechnya", "Grozny", 1, 5, "Jihadis fire into a checkpoint, killing a policeman."], ["2011.01.16", "Thailand", "Narathiwat", 1, 1, "A young man is shot in the head by Jihadis while drinking tea."], ["2011.01.17", "Iraq", "Anbar", 1, 9, "A Shahid suicide bomber kills at least one Iraqi."], ["2011.01.17", "Iraq", "Mosul", 3, 0, "Three religious minorities, a mother and two daughters, are found dead and suspected to have been murdered for their faith."], ["2011.01.17", "Pakistan", "Hangu", 18, 9, "Eighteen people on a bus are ripped apart by fundamentalist bombers."], ["2011.01.17", "Somalia", "Mogadishu", 5, 12, "Islamic militants fire a mortar into a residential area, killing five innocents."], ["2011.01.18", "Afghanistan", "Bala Murgab", 1, 1, "An Italian soldier is shot in the head by a terrorist wearing a friendly uniform."], ["2011.01.18", "Iraq", "Tikrit", 66, 160, "Sixty-six innocents are cut down by a religious radical with a ball-bearing packed suicide vest."], ["2011.01.18", "Pakistan", "Ghaziabad", 2, 0, "A man hacks his wife and 17-year-old daughter to death three months apart with a meat cleaver on suspicion of 'illicit relations'."], ["2011.01.18", "Pakistan", "Hangu", 4, 0, "Four men are brutally executed by Tehreek-e-Taliban radicals."], ["2011.01.18", "Pakistan", "Razmak", 3, 3, "Three Pakistanis are killed by a Taliban rocket attack."], ["2011.01.18", "Thailand", "Narathiwat", 1, 0, "Four terrorists, pretending to be customers, shoot a shop owner three times in the chest."], ["2011.01.18", "Thailand", "Pattani", 1, 0, "A 43-year-old Buddhist woman is shot in the head by militant Muslims."], ["2011.01.19", "Afghanistan", "Paktika", 20, 0, "Thirteen children and six women are among twenty civilians taken out by Taliban roadside bombers."], ["2011.01.19", "Iraq", "Baqubah", 15, 64, "Innovative Muslims use an explosives-packed ambulance to slaughter fifteen unsuspecting Iraqis."], ["2011.01.19", "Iraq", "Ghalbiyah", 2, 16, "Two Shiite pilgrims are sent to Allah by a Sunni suicide bomber."], ["2011.01.19", "Pakistan", "Khyber", 3, 0, "Three truck drivers are abducted and shot in the head at close range by Holy Warriors."], ["2011.01.19", "Pakistan", "Peshawar", 2, 14, "Children are among the casualties when fundamentalists bomb a school that teaches girls."], ["2011.01.19", "Philippines", "Albarka", 1, 0, "A local soldier dies from injuries suffered during an Abu Sayyaf ambush."], ["2011.01.19", "Thailand", "Narathiwat", 4, 6, "Four local soldiers are killed during a surprise assault by Muslim terrorists while they are eating and playing soccer with the locals."], ["2011.01.20", "Afghanistan", "Kandahar", 1, 0, "Sunni fundamentalists calmly walk up to a 50-year-old man and shoot him in the back of the head."], ["2011.01.20", "Afghanistan", "Kandahar", 3, 4, "A child is among three civilians taken down by a Taliban bomb."], ["2011.01.20", "Iraq", "Baghdad", 1, 10, "A Shia pilgrim on foot is murdered by Sunni bombers."], ["2011.01.20", "Iraq", "Baqubah", 3, 30, "Mujahideen detonate a car bomb outside a police station, killing three Iraqis."], ["2011.01.20", "Iraq", "Karbala", 51, 182, "At least fifty Shiites are wiped out by four separate Sunni bombings at entry points to their holy city."], ["2011.01.20", "Pakistan", "Karachi", 2, 0, "A Shia doctor is among two people killed in targeted sectarian attacks."], ["2011.01.20", "Pakistan", "Kohat", 6, 2, "Six oil workers are shot to death by Mujahideen."], ["2011.01.20", "Pakistan", "Kurram", 3, 0, "Three civilians are killed when their farm equipment rolls over a Taliban landmine."], ["2011.01.20", "Thailand", "Narathiwat", 2, 0, "Terrorists gun down a young married couple at an evening market."], ["2011.01.20", "Thailand", "Yala", 1, 0, "A 23-year-old man loses his life to an Islamic drive-by."], ["2011.01.21", "Pakistan", "Kurram", 2, 0, "Islamic militants shoot two villagers to death."], ["2011.01.22", "Afghanistan", "Ghazni", 2, 6, "Two children are crushed to death when Wahhabi militants fire a rocket into their home."], ["2011.01.22", "Afghanistan", "Helmand", 1, 9, "A local cop is taken down by a roadside bomb."], ["2011.01.22", "Pakistan", "Orakzai", 3, 6, "Three locals are cut down by a Taliban bomb."], ["2011.01.22", "Thailand", "Narathiwat", 1, 0, "A man riding a motorcycle is murdered by Muslim gunmen."], ["2011.01.23", "Iraq", "Baghdad", 10, 30, "Pilgrims are among ten people killed by a series of Sunni suicide bombings."], ["2011.01.23", "Iraq", "Taji", 2, 0, "Islamic terrorists murder a farmer and son on their way to sell their harvest."], ["2011.01.23", "Iraq", "Tarmiyah", 2, 0, "Two young boys are killed by a Jihad bomb planted outside a school."], ["2011.01.23", "Nigeria", "Biu", 1, 2, "Boko Haram radicals gun down a soldier at a checkpoint."], ["2011.01.23", "Nigeria", "Jos", 8, 5, "A woman and daughter are among six Christian villagers are hacked to death in the middle of the night during two separate Muslim raids."], ["2011.01.23", "Nigeria", "Maiduguri", 1, 0, "A guard outside a church is murdered by Islamic gunmen."], ["2011.01.23", "Pakistan", "Bahawalpur", 1, 0, "A 17-year-old girl is electrocuted by her family for falling in love with the wrong man."], ["2011.01.23", "Pakistan", "Hangu", 3, 4, "Religious militants ride up to a vehicle and machine-gun three civilians to death."], ["2011.01.24", "Iraq", "Karbala", 12, 32, "Sunnis send a dozen Shia pilgrims to Allah with a car bomb."], ["2011.01.24", "Iraq", "Karbala", 14, 164, "Fourteen Shia pilgrims on foot are shredded by another Sunni car bomb following an earlier blast."], ["2011.01.24", "Nigeria", "Maiduguri", 1, 0, "A soldier on sick leave is gunned down by Islamists along a city street."], ["2011.01.24", "Pakistan", "Landikotal", 1, 2, "A suspected Taliban mortar shell lands on a house, killing a young boy."], ["2011.01.24", "Russia", "Moscow", 37, 150, "Three dozen innocent people at an airport are cut to shreds by shrapnel from two suicide bombers."], ["2011.01.24", "Thailand", "Pattani", 1, 1, "A 48-year-old pickup truck driver is shot several times in the head by Islamic 'separatists' ."], ["2011.01.25", "Afghanistan", "Mullah Quli", 2, 0, "Video surfaces of a brutal stoning the previous August of two young lovers."], ["2011.01.25", "Pakistan", "Karachi", 4, 5, "A motorcycle bomb leaves four people dead."], ["2011.01.25", "Pakistan", "Lahore", 10, 70, "A 16-year-old Sunni suicide bomber from the terror group Fedayeen Islam sends ten Shia pilgrims to Allah."], ["2011.01.25", "Philippines", "Minila", 4, 14, "Abu Sayyaf militants plant a bomb on a packed bus, killing at least four passengers."], ["2011.01.25", "Thailand", "Yala", 9, 2, "Nine Buddhists returning from a hunting trip are blown to smithereens by Muslim bombers."], ["2011.01.26", "Nigeria", "Maiduguri", 1, 1, "Boko Haram extremists fire on a school, killing a guard."], ["2011.01.26", "Yemen", "Hadramout", 5, 3, "A vicious al-Qaeda ambush on a post office vehicle leaves five people dead."], ["2011.01.27", "Dagestan", "Khasavyurt", 4, 6, "Four people sitting at a cafe bleed out following an Islamist car bomb blast."], ["2011.01.27", "Iraq", "Baghdad", 2, 7, "In the aptly named Jihad neighborhood, a bomb left on a bus kills two passengers."], ["2011.01.27", "Iraq", "Baghdad", 48, 121, "Dedicated Sunni suicide bombers take down fifty Shiite mourners at a funeral."], ["2011.01.27", "Nigeria", "Barkin Ladi", 14, 8, "Muslim raiders invade four Christian villages and hack fourteen people to death in their own homes."], ["2011.01.27", "Nigeria", "Were", 2, 11, "Islamic radicals kill two people and burn down several Christian homes."], ["2011.01.27", "Somalia", "Lafole", 0, 10, "Ten people are severely thrashed by Islamists for 'anti-Islam' crimes, including watching porn."], ["2011.01.27", "Thailand", "Pattani", 2, 0, "Two men bleed out following an 'insurgent' drive-by."], ["2011.01.27", "Thailand", "Yala", 1, 0, "A Buddhist mother is shot to death in front of her child by Islamic militants."], ["2011.01.28", "Afghanistan", "Kabul", 8, 15, "Four children and their family member are slaughtered at a supermarket by a Shahid suicide bomber."], ["2011.01.28", "Nigeria", "Borno", 7, 0, "Boko Haram Islamists take credit for shooting seven people to death outside a mosque."], ["2011.01.28", "Nigeria", "Jos", 3, 0, "Two university students belonging to a local church are stabbed to death."], ["2011.01.28", "Thailand", "Yala", 1, 0, "Muslim 'insurgents' gun down a 35-year-old man in front of his home."], ["2011.01.29", "Afghanistan", "Kandahar", 1, 3, "A deputy governor is assassinated by a Fedayeen suicide bomber."], ["2011.01.29", "Nigeria", "Jos", 1, 0, "A Muslim soldier deliberately shoots a 6-year-old Christian boy to death before he is taken down by other soldiers."], ["2011.01.29", "Pakistan", "Pakhtunkhwa", 2, 6, "Two civilians are taken out by Islamic hardliners in an ambush."], ["2011.01.29", "Pakistan", "Peshawar", 4, 19, "Two women are among four civilians incinerated by twin truck bombs targeting a road tunnel."], ["2011.01.29", "Somalia", "Mogadishu", 5, 16, "al-Shabaab takes responsibility for an attack that leaves five civilians dead."], ["2011.01.29", "Thailand", "Pattani", 0, 4, "A Buddhist monk and three others are injured by a Mujahideen bomb blast while collecting alms."], ["2011.01.29", "Yemen", "Marib", 1, 4, "One member of a security patrol is killed by an al-Qaeda sniper."], ["2011.01.30", "Egypt", "Sharona", 11, 4, "Very young children are among eleven members of two Coptic families shot to death in their homes at point-blank range by Islamic radicals."], ["2011.01.30", "Israel", "Beersheba", 0, 1, "An 18-year-old girl is shot by her brother over Facebook pictures that he felt 'dishonored' the family."], ["2011.01.30", "Nigeria", "Ayaruje", 3, 0, "Three Christian villagers are hacked to death by Muslims with machetes."], ["2011.01.30", "Nigeria", "Maiduguri", 1, 0, "A checkpoint guard is shot to death by Islamic snipers."], ["2011.01.30", "Pakistan", "Jhanda Masood", 2, 0, "Two children are killed by a suspected Tehreek-e-Taliban landmine."], ["2011.01.31", "Bangladesh", "Shariatpur", 1, 0, "A 14-year-old girl is lashed to death on the orders of a Sharia council.  Her \"crime\" was having been raped by a 40-year-old married man."], ["2011.01.31", "India", "Sopore", 2, 0, "Two teenage daughters of a poor laborer are pulled out of their home and brutally executed by Lashkar-e-Toiba, reportedly for reading the Bible."], ["2011.01.31", "Ingushetia", "Nazran", 1, 0, "Islamic snipers shoot an administration official to death in his car near a market."], ["2011.01.31", "Iraq", "Baghdad", 1, 0, "An engineer is shot to death by Mujahideen."], ["2011.01.31", "Pakistan", "Hayat Abad", 1, 3, "Terrorists use a remote-controlled bomb to murder a traffic cop."], ["2011.01.31", "Pakistan", "Peshawar", 5, 19, "Five people are torn to shreds by a suicide bomber on foot."], ["2011.02.01", "Nigeria", "Maiduguri", 1, 1, "Islamic gunmen murder a police officer and critically injure his young daughter."], ["2011.02.01", "Pakistan", "Kharan", 2, 0, "Militants fire on an oil tanker, killing a driver and helper."], ["2011.02.01", "Somalia", "Banadir", 2, 0, "Mujahideen set off a bomb near a hospital, killing two civilians."], ["2011.02.01", "Somalia", "Mogadishu", 1, 0, "A convert to Christianity suffers deep injuries after being bound and assaulted with metal objects and rocks, then stomped."], ["2011.02.01", "Somalia", "Mogadishu", 1, 5, "al-Shabaab bombers take out a local cop."], ["2011.02.01", "Somalia", "Mogadishu", 3, 7, "Three Somalis are killed by Islamic militia in a roadside attack."], ["2011.02.01", "Thailand", "Yala", 4, 0, "Two Buddhist children, ages 7 and 15, are kidnapped and shot to death by Religion of Peace 'separatists'."], ["2011.02.02", "Iraq", "Baghdad", 6, 18, "Six Iraqis are killed in a series of Jihad attacks."], ["2011.02.02", "Pakistan", "Anargi", 3, 4, "Three local security forces are killed in a Tehreek-e-Taliban attack on their post."], ["2011.02.02", "Pakistan", "Peshawar", 10, 26, "Women and children are among a dozen innocents slain when Sunnis set off a bomb at a crowded market."], ["2011.02.02", "Pakistan", "Vehari", 1, 0, "A 14-year-old girl is slowly shocked to death by her family for refusing to marry a cousin."], ["2011.02.02", "Russia", "Chegem", 5, 0, "Islamic radicals burst into a cafe and gun down five traffic cops in cold blood."], ["2011.02.02", "Somalia", "Mogadishu", 3, 0, "Three civilians are murdered by Muslim roadside bombers."], ["2011.02.03", "Afghanistan", "Kunduz", 3, 0, "A man and his two young sons are ripped to shreds by Taliban bombers."], ["2011.02.03", "Iraq", "Baghdad", 6, 24, "Three Mujahid bombings take down six Iraqis."], ["2011.02.03", "Iraq", "Ramadi", 6, 19, "A Shahid suicide bomber murders six Iraqis."], ["2011.02.03", "Mauritania", "Bezoul", 1, 0, "A local cop is gunned down by al-Qaeda militants."], ["2011.02.03", "Pakistan", "Lahore", 3, 27, "Islamic militants bomb a rival shrine during food distribution, killing three."], ["2011.02.03", "Thailand", "Pattani", 1, 0, "Muslim radicals slit the throat of a 49-year-old plantation worker."], ["2011.02.03", "Thailand", "Pattani", 5, 2, "Muslim militants spray a group of elderly Buddhists at a market with machine-gun fire, killing five."], ["2011.02.04", "Afghanistan", "Kandahar", 1, 0, "The Taliban gun down a bank guard."], ["2011.02.04", "Afghanistan", "Kandahar", 1, 3, "Women and children are among the casualties when Jihadi bombers target a market."], ["2011.02.04", "Egypt", "Sinai", 4, 0, "Four local cops are kidnapped an murdered by Al Tawhid Wal Jihad members."], ["2011.02.04", "Iraq", "Tuz Khormato", 3, 0, "Two teenage boys are among three Iraqis blown to bits in a targeted bombing."], ["2011.02.04", "Pakistan", "Karachi", 1, 0, "A Shia leader dies from wounds suffered in a sectarian attack the night before."], ["2011.02.04", "Somalia", "Mudug", 1, 0, "A young boy is shot in the back by al-Shabaab for trying to flee forced prayer."], ["2011.02.04", "Thailand", "Pattani", 1, 2, "Militant Muslims fire into a Buddhist village, killing one."], ["2011.02.04", "Thailand", "Yala", 2, 0, "Two security personnel are murdered by Muslim bombers."], ["2011.02.05", "DRC", "Kivu", 12, 0, "ADF-NALU terrorists kidnap, torture and murder a dozen villagers."], ["2011.02.05", "Iraq", "Balad", 2, 3, "Sunni bombers target a Shia shrine, killing two pilgrims."], ["2011.02.05", "Pakistan", "Karak", 4, 0, "Four civilians are abducted and shot to death.  Notes pinned to their bodies accuse them of being Jewish spies."], ["2011.02.05", "Pakistan", "Khyber", 3, 2, "Three civilians are ripped to pieces by a car bomb."], ["2011.02.05", "Philippines", "M'lang", 2, 0, "Two farmers are shot to death in their field by Moro Islamists."], ["2011.02.06", "Indonesia", "Banten", 3, 6, "Three members of the Ahmadiyah minority sect are dragged out of their homes and beaten to death by a Sunni mob chanting 'Allah Akbar'."], ["2011.02.06", "Pakistan", "Nut Kallan", 1, 0, "A young Christian is tortured to death by several Muslims."], ["2011.02.06", "Pakistan", "Quetta", 1, 0, "Muslim radicals are suspected in the shooting death of a Hindu man."], ["2011.02.06", "Philippines", "Kabacan", 6, 6, "A 4-year-old boy is among six civilians killed in the crossfire when rival Religion of Peace groups shoot at each other."], ["2011.02.07", "Afghanistan", "Bak", 1, 0, "A local official is assassinated by Sunni fundamentalists."], ["2011.02.07", "Afghanistan", "Kandahar", 1, 5, "An customs official is taken out by a Fedayeen suicide bomber."], ["2011.02.07", "Iraq", "Iskandariya", 2, 0, "A woman is among two Iraqis murdered by Mujahideen bombers."], ["2011.02.07", "Pakistan", "Hangu", 2, 6, "Hardliners fire rockets into a police vehicle, killing two officers."], ["2011.02.08", "Afghanistan", "Balkh", 1, 3, "Islamists attack a bomb to a police vehicle which results in the death of an occupant."], ["2011.02.08", "India", "Thakurdwara", 1, 0, "A 19-year-old girl is stabbed to death by her brother on suspicion of having sex."], ["2011.02.08", "Indonesia", "Temanggung", 0, 7, "A Muslim mob viciously beats a priest trying unsuccessfully to keep them from burning three churches and an orphanage."], ["2011.02.08", "Philippines", "Manila", 1, 0, "A cop is hacked to death by a suspected Muslim separatist at a street market."], ["2011.02.08", "Somalia", "Galka'y", 1, 0, "A judge is assassinated by al-Shabaab gunmen."], ["2011.02.08", "Thailand", "Yala", 1, 1, "A 58-year-old Buddhist man and his wife are shot in their pickup truck by Muslim 'insurgents'."], ["2011.02.09", "Dagestan", "Makhachkala", 2, 0, "Two policemen are gunned down in cold blood by suspected Islamic 'rebels'."], ["2011.02.09", "Iraq", "Baghdad", 2, 0, "A man and his son are forced out of their home by Muslim terrorists and machine-gunned to death."], ["2011.02.09", "Iraq", "Kirkuk", 11, 104, "Three car bombs leave at least eleven Iraqis dead."], ["2011.02.09", "Pakistan", "Charsadda", 1, 3, "A civilian at a cattle market is killed by a remote-controlled bomb."], ["2011.02.09", "Pakistan", "Pakhtunkhwa", 4, 6, "Four security personnel are taken down in two remote-controlled bombings."], ["2011.02.10", "Afghanistan", "Kunduz", 7, 5, "Seven people lose their lives to a Shahid suicide bomber."], ["2011.02.10", "Iraq", "Dujail", 9, 39, "Nine Shia pilgrims on foot, mostly women and children, are brutally blown to bits by Sunni car bombers"], ["2011.02.10", "Nigeria", "Alice", 2, 3, "A father is among two Christians shot to death by militant Muslims in their homes."], ["2011.02.10", "Nigeria", "Kuru", 5, 9, "A 4-year-old is one of five Christian villagers hacked and shot to death by Islamic raiders."], ["2011.02.10", "Pakistan", "Mardan", 31, 50, "A teenage suicide bomber dressed as a schoolboy 'gives his life to Islam' - and takes thirty-one others with him."], ["2011.02.10", "Pakistan", "North Waziristan", 3, 0, "Sunni hardliners kidnap and execute three people, then throw the bodies into a sack."], ["2011.02.10", "Thailand", "Pattani", 3, 0, "Two women are among three Buddhist civilians viciously murdered and then burned by Muslim extremists."], ["2011.02.10", "Thailand", "Yala", 1, 0, "A 32-year-old is shot to death by Muslim 'separatists'."], ["2011.02.11", "Pakistan", "Mardan", 5, 0, "Five civilians are brutally executed in captivity by Taliban militants."], ["2011.02.11", "Thailand", "Narathiwat", 1, 0, "Muslim gunmen take down two men in separate attacks, one at a market and the other in front of a mosque."], ["2011.02.11", "Thailand", "Pattani", 1, 0, "A young mother is shot in the head by Islamists while carrying her 2-year-old daughter."], ["2011.02.12", "Afghanistan", "Kandahar", 21, 45, "Fedayeen gunmen with explosives vests attack a police station, killing at least twenty-one, including civilians."], ["2011.02.12", "Iraq", "Samarrah", 36, 64, "Three dozen Shia pilgrims on a bus are massacred by Sunni suicide bomber."], ["2011.02.13", "Iran", "Tehran", 1, 0, "A pro-democracy protester is shot to death by the government."], ["2011.02.13", "Somalia", "Mogadishu", 3, 10, "Three civilians die from shrapnel injuries suffered when Islamists throw a grenade into the street."], ["2011.02.13", "Thailand", "Yala", 0, 18, "Eighteen people are injured when Islamic radicals detonate a car bomb outside a bank."], ["2011.02.14", "Afghanistan", "Kabul", 2, 2, "Two guards at a shopping mall sacrifice themselves stopping a Shahid suicide bomber from entering."], ["2011.02.14", "Pakistan", "Pakhtunkhwa", 4, 0, "Four civilians are abducted and executed by Mujahideen Khurasaan terrorists."], ["2011.02.14", "Russia", "Gubden", 3, 26, "A female suicide bomber murders three people."], ["2011.02.15", "Iraq", "Baghdad", 4, 6, "A woman is among four civilians taken down by a pair of Jihad bomb blasts."], ["2011.02.15", "Iraq", "Kut", 1, 0, "A Mujahideen sniper kills an Iraqi interpreter."], ["2011.02.15", "Nigeria", "Maiduguri", 2, 0, "Two people are killed when Boko Haram gunmen attack two churches."], ["2011.02.15", "Pakistan", "North Waziristan", 2, 0, "Sunni hardliners kidnap and publicly execute two civilians."], ["2011.02.16", "Iraq", "Khalidiya", 2, 0, "Two brothers are murdered in their home by Islamic gunmen."], ["2011.02.16", "Yemen", "Hadramout", 1, 3, "A top intelligence official is shot to death in his car by al-Qaeda militants."], ["2011.02.17", "Afghanistan", "Kunduz", 2, 0, "The Taliban take down two Afghans with a well-placed bomb."], ["2011.02.17", "Iraq", "Baghdad", 1, 0, "A university professor is lynched in his home by 'insurgents'."], ["2011.02.17", "Iraq", "Baghdad", 3, 10, "Sectarian Jihadis stab three women to death in their home and detonate a bomb that injures ten Iranian pilgrims."], ["2011.02.17", "Iraq", "Mosul", 1, 0, "Terrorists shoot a journalist to death."], ["2011.02.17", "Iraq", "al-Maqdadiyah", 13, 35, "Thirteen souls at an auto trade fair are sent to Allah by suicide car bombers."], ["2011.02.17", "Pakistan", "Bannu", 1, 0, "One person is killed in two bombings by Islamic militants, one of which was at a girls' school."], ["2011.02.17", "Thailand", "Pattani", 1, 1, "A local soldier is shot in the head and neck by Islamists while riding to work with his wife."], ["2011.02.18", "Afghanistan", "Baghlan", 3, 7, "Three German soldiers working on a vehicle are machine-gunned at close range by a terrorist in a friendly uniform."], ["2011.02.18", "Afghanistan", "Khost", 11, 40, "Women and children are among the dead when a devout Sunni detonates in a commercial district, taking eleven others with him."], ["2011.02.18", "Afghanistan", "Nangahar", 3, 0, "Three Afghans are shredded by a Taliban roadside bomb."], ["2011.02.18", "Afghanistan", "Nangarhar", 2, 0, "Two bomb disposal team members are murdered by Taliban roadside bombers."], ["2011.02.18", "India", "Bandipora", 1, 0, "Islamists gun down a local political activist."], ["2011.02.18", "Nigeria", "Darazo", 2, 2, "A civilian and bank guard are killed in separate attacks by suspected Boko Haram."], ["2011.02.18", "Thailand", "Narathiwat", 1, 1, "A 19-year-old man is shot in the head and neck by Muslim 'separatists'."], ["2011.02.18", "Thailand", "Pattani", 1, 0, "Muslim gunmen take down a 44-year-old man."], ["2011.02.18", "Tunisia", "Tunis", 1, 0, "After receiving death threats from Muslim extremists, a priest is kidnapped and eventually has his throat slit."], ["2011.02.19", "Afghanistan", "Jalalabad", 42, 71, "Sunni hardliners send suicide bombers and gunmen into a bank to massacre over forty people."], ["2011.02.19", "Russia", "Zayukovo", 4, 1, "Caucasus Emirate terrorists stop a van full of ski tourists and then machine-gun them to death."], ["2011.02.20", "Iraq", "Shirqat", 2, 6, "A suicide bomber detonates at a rival mosque, killing two worshippers."], ["2011.02.20", "Iraq", "Shirqat", 2, 6, "A suicide car bomber cruises into a rival mosque, killing at least two."], ["2011.02.20", "Pakistan", "Mosakki", 2, 0, "Two villagers are murdered by Islamic militants."], ["2011.02.20", "Thailand", "Narathiwat", 0, 17, "Children are among the casualties when Muslim militants set off a car bomb a rake a restaurant with gunfire."], ["2011.02.21", "Afghanistan", "Kunduz", 31, 40, "A Fedayeen suicide bomber sends over thirty civilians to their death as they are lining up for identity cards."], ["2011.02.21", "Iraq", "Samarrah", 12, 18, "A dozen police sent to guard Shia pilgrims are blown to bits by a Sunni suicide bomber."], ["2011.02.21", "Pakistan", "Hajano", 1, 0, "A 55-year-old woman is murdered in her sleep by her son for having an affair."], ["2011.02.21", "Somalia", "Mogadishu", 14, 35, "al-Shabaab suicide attackers ram an explosives-laden vehicle into a soccer match, killing over fourteen people."], ["2011.02.21", "Thailand", "Narathiwat", 1, 0, "A 32-year-old Buddhist is murdered by Islamic gunmen while walking home from a tea shop."], ["2011.02.21", "Thailand", "Narathiwat", 1, 1, "A Buddhist couple is targeted by Muslim terrorists, with the husband dying from injuries."], ["2011.02.21", "Thailand", "Yala", 1, 12, "Muslim bombers set off a blast in front of a supermarket, killing a local woman."], ["2011.02.21", "Yemen", "Sanaa", 5, 6, "Five people, including civilians, are killed when al-Qaeda gunmen roll up on a checkpoint."], ["2011.02.22", "Iraq", "Baqubah", 1, 0, "An imam in murdered in his mosque by Religion of Peace rivals."], ["2011.02.22", "Nigeria", "Borno", 18, 7, "Eighteen Christian villagers are massacred during a Muslim raid."], ["2011.02.22", "Oman", "Coast", 4, 0, "A retired missionary couple is among four Americans taken hostage and executed in cold blood by Muslim pirates."], ["2011.02.22", "Pakistan", "Torghundai", 6, 10, "Three children, ages 3, 6 & 8, and two women are among six killed in their homes by a Taliban rocket attack."], ["2011.02.22", "Thailand", "Pattani", 1, 0, "A 38-year-old man is murdered in an 'insurgent' drive-by shooting."], ["2011.02.23", "Egypt", "Assiut", 1, 0, "A priest is brutally stabbed to death in his home by killers shouting 'Allah Akbar!'"], ["2011.02.23", "Nigeria", "Maiduguri", 1, 0, "A cop is gunned down by Boko Haram Islamists."], ["2011.02.23", "Pakistan", "Landikotal", 5, 2, "Five local security personnel are killed during a Taliban assault on their post."], ["2011.02.23", "Pal. Auth.", "Khan Younis", 1, 2, "A 10-year-old girl is killed when a Hamas bomb detonates prematurely."], ["2011.02.24", "Afghanistan", "Spin Boldak", 1, 26, "Two suicide car bombers kill only the guard managing to stop them."], ["2011.02.24", "Egypt", "Wadi el-Natroun", 0, 19, "Two monks are among nineteen injured when military forces storm a Coptic monastery with live ammunition."], ["2011.02.24", "Iraq", "Baghdad", 1, 0, "A 70-year-old Christian man is stabbed to death in his home by Muslim radicals."], ["2011.02.24", "Iraq", "Mahata", 4, 0, "A man and his three sons are brutally shot to death by al-Qaeda fundamentalists."], ["2011.02.24", "Iraq", "Ramadi", 11, 18, "A Sunni suicide bomber detonates at a Shia cultural center, shredding eleven innocent lives."], ["2011.02.24", "Pakistan", "Peshawar", 4, 0, "Four drivers and their assistants are incinerated when Islamists firebomb a group of fuel tankers."], ["2011.02.25", "Iraq", "Fallujah", 6, 1, "al-Qaeda gunmen storm a home and shoot six residents to death."], ["2011.02.25", "Russia", "Nalchik", 0, 12, "A dozen guards are injured when Islamists try to stage a grenade attack on a hospital."], ["2011.02.26", "Afghanistan", "Faryab", 4, 30, "A teenage suicide bomber detonates at a playing field, killing at least four civilian spectators."], ["2011.02.26", "Afghanistan", "Khost", 9, 0, "Three children and four women are among nine civilians pulverized by a roadside blast."], ["2011.02.26", "Iraq", "Baghdad", 1, 0, "A university professor is assassinated by suspected fundamentalists."], ["2011.02.26", "Iraq", "Baiji", 4, 0, "Terrorists attack an oil refinery and murder four employees."], ["2011.02.26", "Pakistan", "Peshawar", 4, 17, "Mujahideen attack a fuel station, killing four people."], ["2011.02.27", "Afghanistan", "Arghandab", 8, 25, "Taliban bombers take down eight civilians at a public event."], ["2011.02.27", "India", "Pulwama", 1, 0, "Islamic militants shoot a truck driver to death in his home."], ["2011.02.27", "Pakistan", "Landi Kotal", 1, 0, "A tribal elder is abducted and murdered by suspected Lashkar-e-Islam."], ["2011.02.27", "Somalia", "Mandera", 1, 10, "A woman is killed when Islamic militia attack a Red Cross office."], ["2011.02.27", "Thailand", "Pattani", 1, 0, "A 54-year-old salesman is shot to death by Muslim militants."], ["2011.02.28", "India", "Baramulla", 1, 0, "A shopkeeper is murdered by Mujahideen gunmen."], ["2011.02.28", "India", "Srinagar", 1, 0, "An engineer and father of three dies from shrapnel injuries suffered from an Islamist grenade attack at a market."], ["2011.02.28", "Nigeria", "Dabwak", 5, 0, "A Christian mother and four of her children are slaughtered in their home by Muslim militants.."], ["2011.02.28", "Nigeria", "Kaduna", 2, 0, "Two guards die from bullet wounds after Boko Haram gunmen roll up on a police station."], ["2011.02.28", "Turkey", "Mersin", 1, 0, "A 19-year-old woman is stabbed to death by her family after running away with her boyfriend."], ["2011.03.01", "Ethiopia", "Oma", 0, 17, "Seventeen students are beaten with rods and pelted with stones for distributing Bibles."], ["2011.03.01", "Nigeria", "Maiduguri", 1, 0, "A guard at a church is gunned down in an Islamist drive-by."], ["2011.03.01", "Nigeria", "Maiduguri", 1, 0, "Boko Haram gunmen murder an off-duty cop in his home."], ["2011.03.01", "Pakistan", "Bara", 1, 0, "Religion of Peace proponents behead a civilian and dump his head and torso in separate areas."], ["2011.03.01", "Pakistan", "Mardan", 1, 19, "One student is killed when the Taliban throw a grenade into a girl's school."], ["2011.03.01", "Pakistan", "Miranshah", 4, 0, "Four villagers are abducted and executed in captivity by Sunni fundamentalists."], ["2011.03.01", "Pakistan", "Mohmand", 3, 1, "Three tribesman are killed by a Taliban landmine."], ["2011.03.01", "Pakistan", "Pakhtunkhwa", 2, 0, "Islamists are suspected of shooting a farmer and one other person to death."], ["2011.03.01", "Yemen", "Abyan", 2, 11, "An ambulance driver is among two people slain in an al-Qaeda ambush."], ["2011.03.02", "Germany", "Frankfurt", 2, 2, "A gunmen yells 'Allah Akbar' and opens fire on unarmed US soldiers on a bus, killing two."], ["2011.03.02", "Iraq", "Baghdad", 1, 20, "A sectarian bombing leaves one person dead."], ["2011.03.02", "Iraq", "Mosul", 1, 0, "Mujahideen bombers blow up a home, killing a civilian."], ["2011.03.02", "Iraq", "Ramadi", 1, 3, "One victims bleeds out after a suicide bomber attacks a rival mosque."], ["2011.03.02", "Pakistan", "Islamabad", 1, 1, "A Catholic cabinet minister is brutally shot to death in his car after being accused of blasphemy."], ["2011.03.02", "Pakistan", "Karachi", 1, 0, "A seminary teacher is shot to death by sectarian rivals."], ["2011.03.03", "Iraq", "Haditha", 8, 10, "A suicide bomber wades into a crowd at a bank and sends eight customers to Allah."], ["2011.03.03", "Pakistan", "Hangu", 9, 31, "Women and children are among the casualties when a suicide car bomber detonates along a city street."], ["2011.03.03", "Pakistan", "Khyber", 6, 3, "Islamic militants ambush a vehicle and kill six security officers."], ["2011.03.04", "Egypt", "Sol", 2, 0, "A Muslim mob, angry over a relationship between a Muslim girl and Christian boy, kills the two fathers and burns down a church."], ["2011.03.04", "Pakistan", "Danda", 1, 0, "Terrorists shoot a man to death outside a cafe for the crime of insulting Islam two years earlier."], ["2011.03.04", "Pakistan", "Karachi", 1, 0, "A radical Sunni group is thought responsible for the murder of a factory guard."], ["2011.03.04", "Pakistan", "Nowshera", 10, 37, "Sunnis detonate a powerful bomb at a Sufi mosque during Friday prayers, taking down ten worshippers."], ["2011.03.05", "Iraq", "Abu Kamis", 1, 0, "Suspected al-Qaeda gunmen murder a civilian."], ["2011.03.05", "Iraq", "Hilla", 4, 0, "Terrorists take down four Iraqis with a roadside bomb."], ["2011.03.05", "Iraq", "Khalis", 2, 2, "Terrorists burst into a cafe and shoot dead two patrons."], ["2011.03.05", "Pakistan", "Karachi", 2, 0, "A cleric and his son are murdered by Religion of Peace rivals."], ["2011.03.05", "Pakistan", "Mohmand", 2, 7, "Two members of a peace committee are taken apart by a Taliban rocket attack."], ["2011.03.05", "Thailand", "Pattani", 1, 2, "A Buddhist monk is shot through the head in a Muslim drive-by.  Two others are injured."], ["2011.03.06", "Afghanistan", "Paktika", 12, 5, "Five children are among a dozen civilians who bleed out following a fundamentalist roadside bombing."], ["2011.03.06", "Iraq", "Baghdad", 2, 0, "Two students die in an 'insurgent' ambush."], ["2011.03.06", "Iraq", "Basra", 8, 12, "'Insurgents' attach a bomb to a passenger bus, killing eight innocents."], ["2011.03.06", "Thailand", "Pattani", 1, 0, "Islamists shoot a 23-year-old man to death in front of his mother."], ["2011.03.06", "Thailand", "Pattani", 1, 3, "A 64-year-old man is murdered when Muslim militants fire on a group of teachers."], ["2011.03.06", "Thailand", "Pattani", 1, 4, "Muslim militants open fire on a market, killing a guard and seriously injuring four patrons."], ["2011.03.06", "Yemen", "Marib", 4, 0, "Four security personnel are taken down by al-Qaeda."], ["2011.03.06", "Yemen", "Zinjibar", 2, 0, "Islamic militia murder two men, one at a vegetable market."], ["2011.03.07", "Afghanistan", "Jalalabad", 2, 19, "Hardliners plant a bomb in front of a rival mosque, killing two people."], ["2011.03.07", "Pakistan", "Karachi", 1, 0, "A sectarian attack leaves one dead."], ["2011.03.07", "Thailand", "Narathiwat", 1, 0, "Islamic 'separatists' shoot a man to death as he is returning home from work."], ["2011.03.07", "Thailand", "Pattani", 1, 0, "Islamists murder a 61-year-old man in an attack the leaves his young granddaughter seriously injured."], ["2011.03.07", "Thailand", "Pattani", 1, 1, "A Buddhist man is killed and his mother seriously wounded in an Islamic drive-by."], ["2011.03.08", "Algeria", "Djelfa", 5, 0, "Fundamentalist bombers attack a group of bird hunters, killing five."], ["2011.03.08", "Ethiopia", "Asendabo", 2, 0, "Two Christians are killed when angry Muslims rampage through their community, burning churches and homes."], ["2011.03.08", "Iraq", "Abu Ghraib", 1, 0, "A government employee is dragged out of his home and stabbed to death in front of his family."], ["2011.03.08", "Iraq", "Fallujah", 1, 0, "A civilian is cut down by sectarian gunmen."], ["2011.03.08", "Iraq", "Mosul", 1, 0, "Mujahideen assassinate a university professor."], ["2011.03.08", "Pakistan", "Faisalabad", 32, 125, "Islamists detonate a massive bomb at a gas station, incinerating over thirty innocents."], ["2011.03.08", "Thailand", "Yala", 1, 0, "Muslim 'separatists' knock a man off his motorcycle and then shoot him twice in the head."], ["2011.03.09", "Egypt", "Cairo", 9, 150, "Nine Copts, including a child, are killed and over a hundred more injured when a Muslim mob hurls firebombs and shoots into a group protesting a church burning."], ["2011.03.09", "Iraq", "Diyala", 1, 1, "A 3-year-old girl is dismembered, and her father seriously wounded by a targeted al-Qaeda blast outside their house."], ["2011.03.09", "Iraq", "al-Makheirja", 2, 2, "Mujahideen toss a grenade into a family home, killing a man and a woman."], ["2011.03.09", "Pakistan", "Adezai", 43, 52, "A Shahid suicide bomber detonates at the funeral of the wife of a peace committee member, sending over 40 souls to Allah."], ["2011.03.10", "Afghanistan", "Kunduz", 3, 8, "A local police chief on patrol is among three people ripped to shreds by a suicide bomber."], ["2011.03.10", "Iraq", "Baghdad", 6, 3, "Islamic terrorists rob a jewelry store to fund their operation, shooting six people to death in the process."], ["2011.03.10", "Nigeria", "Bauchi", 3, 5, "At least three residents are killed when Fulani raiders sweep their village, shooting and burning homes."], ["2011.03.10", "Pakistan", "Peshawar", 1, 1, "Mujahideen fire on a car containing a peace committee contingent, killing the driver."], ["2011.03.10", "Philippines", "Jolo", 3, 11, "Abu Sayyaf militants detonate a shrapnel bomb outside a school, killing three innocents."], ["2011.03.11", "Pakistan", "Karachi", 1, 0, "A seminary teacher is assassinated by sectarian rivals."], ["2011.03.11", "Pakistan", "Nawabshah", 1, 0, "A young Ahmadi is murdered for his faith in a market."], ["2011.03.11", "Yemen", "al-Deyo", 4, 5, "Four security personnel are taken out by an al-Qaeda ambush."], ["2011.03.12", "Afghanistan", "Kandahar", 4, 0, "Four civilians are cut to shreds by a roadside bomb."], ["2011.03.12", "Iraq", "Baghdad", 1, 6, "Jihad bombers take down a local."], ["2011.03.12", "Iraq", "Baghdad", 7, 0, "Seven Iraqi soldiers on their way to work are brutally machine-gunned in their car at point-blank range."], ["2011.03.12", "Israel", "Itamar", 5, 0, "A baby and two young children are slaughtered in their home along with their parents, who fought the Muslims in vain to keep their children from being stabbed to death."], ["2011.03.12", "Pakistan", "Hairdin", 6, 0, "A married couple and their four young children are turned into debris by an Islamist mortar attack on their home."], ["2011.03.13", "Afghanistan", "Helmand", 6, 0, "Six civilians are taken down by Taliban roadside bombers."], ["2011.03.13", "Nigeria", "Maiduguri", 1, 0, "A moderate cleric is shot to death by Islamic radicals in a drive-by attack outside his home.."], ["2011.03.13", "Pakistan", "Hangu", 9, 6, "Islamic militants fire indiscriminately into a van carrying Shia civilians, killing nine."], ["2011.03.13", "Yemen", "Zinjubar", 1, 2, "al-Qaeda gunmen murder a local cop."], ["2011.03.14", "Afghanistan", "Kunduz", 36, 42, "Four children are among three dozen innocents dismembered by a massive suicide blast at a recruitment center."], ["2011.03.14", "Iran", "Evin", 2, 0, "A Christian man and his Jewish wife are hung in captivity by Iranians."], ["2011.03.14", "Iraq", "Diyala", 11, 14, "Eleven Iraqi security personnel are blown to bits by a Fedayeen suicide bomber."], ["2011.03.14", "Nigeria", "Plateau", 6, 0, "Five family members are among six Christian villagers slaughtered by Muslim raiders."], ["2011.03.14", "Somalia", "Fiidow", 4, 9, "al-Shabaab militants fire on a public bus, killing four passengers."], ["2011.03.15", "Afghanistan", "Laghman", 1, 0, "A civilian is killed in a roadside bombing by Sunni hardliners."], ["2011.03.15", "Afghanistan", "Nangarhar", 1, 0, "The Taliban plant a bomb in a classroom, killing a teacher."], ["2011.03.15", "Indonesia", "Jakarta", 0, 4, "A bomb sent to a moderate scholar, deemed an 'enemy of Islam', injures four."], ["2011.03.15", "Thailand", "Narathiwat", 2, 0, "Religion of Peace gunmen open fire on a tea shop, killing two Buddhist patrons."], ["2011.03.15", "Thailand", "Pattani", 3, 0, "Three men sitting outside an auto repair shop are riddled with bullets by Muslim 'insurgents'."], ["2011.03.15", "Thailand", "Songkhla", 1, 0, "A Buddhist teacher is murdered by Mujahideen."], ["2011.03.15", "Thailand", "Songkhla", 1, 1, "Muslim radicals shoot a Buddhist plantation worker to death an injure his wife."], ["2011.03.15", "Thailand", "Yala", 1, 0, "Islamists gun down a 69-year-old man."], ["2011.03.16", "Iraq", "Buhriz", 1, 1, "Suspected al-Qaeda invade a home, murder a man and injure his wife."], ["2011.03.16", "Iraq", "Kirkuk", 2, 35, "A woman and her newborn baby are taken apart by a Jihad car bomb outside a hospital."], ["2011.03.16", "Somalia", "Mogadishu", 10, 50, "A pregnant woman is among ten civilians bleeding out following an al-Shabaab mortar attack."], ["2011.03.16", "Thailand", "Marib", 1, 1, "Muslim terrorists shoot a civilian off the back of a motorbike."], ["2011.03.17", "Yemen", "Marib", 3, 0, "al-Qaeda take out three policemen at a checkpoint with automatic weapons."], ["2011.03.18", "Dagestan", "Makhachkala", 2, 0, "Two law enforcement officials are gunned down by Holy Warriors in separate attacks."], ["2011.03.18", "Iraq", "Baiji", 3, 0, "Three shepherds are taken down by Sunni roadside bombers."], ["2011.03.18", "Iraq", "Mussayab", 2, 0, "Two brothers are shot to death in their own home by al-Qaeda gunmen."], ["2011.03.18", "Thailand", "Pattani", 3, 0, "Three Thais are shot to death by Islamic militants."], ["2011.03.19", "Iraq", "Baghdad", 3, 9, "A bomb blast leaves three Iraqis dead."], ["2011.03.19", "Iraq", "Mosul", 1, 1, "Terrorists open fire on a construction worker and his wife."], ["2011.03.19", "Thailand", "Pattani", 1, 0, "A street vendor is cut down by Muslim gunmen."], ["2011.03.20", "Egypt", "Qena", 0, 1, "A Christian has his ear torn off by Muslims enforcing Sharia law."], ["2011.03.20", "Iraq", "Baghdad", 2, 0, "Two oil company employees are shot to death."], ["2011.03.20", "Iraq", "Diala", 6, 0, "Six family members, including three children, are cut to shreds by a brutal suicide bombing at their home."], ["2011.03.20", "Iraq", "Kirkuk", 1, 0, "An 18-year-old woman is abducted and executed by suspected terrorists."], ["2011.03.20", "Nigeria", "Jos", 1, 0, "A Christian boy is shot to death by Islamic radicals."], ["2011.03.20", "Nigeria", "Jos", 2, 0, "Muslim extremists kill two worshippers with bombs placed at several churches."], ["2011.03.21", "Afghanistan", "Kandahar", 2, 0, "Two civilians are cut down by Sunni gunmen."], ["2011.03.21", "Afghanistan", "Kandahar", 4, 3, "Four employees of a security firm are shot to death by the Taliban."], ["2011.03.21", "Dagestan", "Makhachkala", 1, 0, "A court official is murdered by Muslim militants."], ["2011.03.21", "Iraq", "Baghdad", 1, 2, "Mujahideen kill a woman and wound her son and husband in a shooting attack."], ["2011.03.21", "Iraq", "Mosul", 3, 2, "Three people are killed by a Jihad bombing."], ["2011.03.21", "Iraq", "Najaf", 2, 0, "Two shop owners are gunned down by Muslim terrorists."], ["2011.03.21", "Nigeria", "Baten", 4, 0, "Two women and two children are hacked and shot to death during a Muslim raid on a Christian village."], ["2011.03.21", "Nigeria", "Maiduguri", 1, 2, "Boko Haram Islamists shoot a man to death in a drive-by."], ["2011.03.21", "Pakistan", "Datta Khel", 4, 0, "The Taliban kidnap, execute and mutilate four tribesmen."], ["2011.03.21", "Pakistan", "Gwader", 11, 2, "Islamic militants stage a rocket attack on a construction crew, killing eleven."], ["2011.03.22", "Pakistan", "Hyderabad", 2, 0, "After yelling abuse at worshippers outside a church, a Muslim mob opens fire, killing two."], ["2011.03.23", "Iraq", "Baghdad", 3, 9, "Three people are injured in a series of Mujahideen bomb blasts."], ["2011.03.23", "Israel", "Jerusalem", 1, 39, "Palestinian terrorists leave a bomb at a bus stop which kills a female Bible translator and injures thirty others."], ["2011.03.23", "Pakistan", "Peshawar", 1, 0, "Islamic bombers kill a man riding in an animal cart."], ["2011.03.23", "Thailand", "Narathiwat", 3, 0, "A married couple and a female friend are brutally machine-gunned in their own home by Muslim 'insurgents'."], ["2011.03.24", "Iraq", "Hilla", 4, 0, "Mujahideen kidnap, behead and execute four young men."], ["2011.03.24", "Pakistan", "Hangu", 8, 25, "A suicide bomber rams an explosives-packed car into a police station, killing two women and six other bystanders."], ["2011.03.24", "Somalia", "Mogadishu", 4, 7, "A woman is among four civilians cut down by al-Shabaab gunfire."], ["2011.03.24", "Thailand", "Yala", 1, 0, "A 25-year-old plantation worker is shot in the head by Muslim militants."], ["2011.03.25", "Afghanistan", "Nangarhar", 2, 1, "Two children are successfully taken out by a Taliban roadside bomb."], ["2011.03.25", "Iraq", "Mosul", 2, 5, "Islamic militants kill two civilians with a roadside bomb."], ["2011.03.25", "Pakistan", "Hyderabad", 2, 0, "A Muslim mob invades a Pentecostal church, burns Bibles and kills two worshippers."], ["2011.03.25", "Pakistan", "Karachi", 1, 0, "A Shia is taken down by Sunni snipers."], ["2011.03.25", "Pakistan", "Kurram", 13, 8, "A woman and child are among thirteen Shiites machine-gunned at point-blank range by Sunni gunmen."], ["2011.03.26", "Iraq", "Abu Ghraib", 3, 0, "Three family members are blown to bits by Mujahid bombers."], ["2011.03.26", "Iraq", "Baghdad", 1, 2, "A professor is killed in a Sunni bomb attack."], ["2011.03.26", "Iraq", "Muqdadiya", 1, 1, "Jihadi bombers take down a farmer and his son."], ["2011.03.26", "Thailand", "Pattani", 1, 0, "A man is shot five times by Islamists while riding a motorcycle."], ["2011.03.27", "Pakistan", "Shahidano", 4, 3, "A woman is among four people dismembered by a militant rocket on a family vehicle."], ["2011.03.27", "Thailand", "Narathiwat", 1, 0, "A plantation worker is murdered by Muslim extremists on his way to work."], ["2011.03.27", "Thailand", "Yala", 1, 1, "Religious extremists shoot two villagers at a market, killing one."], ["2011.03.27", "Yemen", "Marib", 6, 12, "An al-Qaeda ambush leaves six local soldiers dead."], ["2011.03.28", "Afghanistan", "Paktika", 23, 60, "Three holy warriors detonate amid a construction crew, sending at least twenty souls to Allah."], ["2011.03.28", "Iraq", "Mosul", 7, 0, "Fundamentalists attack a suspected brothel, shooting six women and one man to death."], ["2011.03.28", "Pakistan", "Khyber", 14, 0, "Fourteen security personnel die during a Taliban ambush."], ["2011.03.28", "Yemen", "Jaar", 150, 80, "al-Qaeda radicals blow up an ammunitions factory, killing over one-hundred and fifty people, including women and children."], ["2011.03.29", "Iraq", "Abu Ghraib", 2, 1, "Terrorists attack a family home, killing two brothers."], ["2011.03.29", "Iraq", "Tikrit", 56, 98, "Islamic militants invade a government building and go room-to-room shooting and blasting unarmed employees, leaving over fifty dead."], ["2011.03.30", "Afghanistan", "Kandahar", 1, 2, "A civilian is crushed to death when a terrorist tries to ram a NATO patrol."], ["2011.03.30", "Iraq", "Baghdad", 5, 1, "Five family members are murdered in their own home by suspected al-Qaeda."], ["2011.03.30", "Nigeria", "Jos", 2, 5, "Fulani raiders attack a college and murder two Christians."], ["2011.03.30", "Pakistan", "Swabi", 13, 20, "At least a dozen innocents are torn to shreds by a Fedayeen suicide bomber."], ["2011.03.30", "Somalia", "Mogadishu", 1, 0, "Fundamentalists fire randomly at a soccer match, killing a journalist."], ["2011.03.31", "Iraq", "Abu Ghraib", 1, 0, "Sunni militants toss a grenade into a home, killing an elderly man."], ["2011.03.31", "Iraq", "Diwaniya", 1, 2, "A civilian is killed by a Katyusha rocket."], ["2011.03.31", "Iraq", "Mosul", 1, 0, "A 13-year-old boy is beheaded by Islamic extremists."], ["2011.03.31", "Pakistan", "Charsadda", 12, 42, "A Holy Warrior detonates in a crowd of people, sending at least twelve souls to Allah."], ["2011.03.31", "Pakistan", "Khuzdar", 1, 0, "Islamic militants flag down a truck and shoot the driver."], ["2011.04.01", "Afghanistan", "Mazar-e Sharif", 12, 20, "Eight UN workers are among a dozen people beheaded or shot to death by a mob enraged over a Quran burning in Florida."], ["2011.04.01", "Iraq", "Fallujah", 3, 7, "Three Iraqis are taken out by a Shahid suicide bomber."], ["2011.04.01", "Pakistan", "Dara Adam Khel", 1, 5, "A suicide bomber takes out a 12-year-old boy at a market."], ["2011.04.01", "Pakistan", "Khyber", 3, 0, "Religious extremists capture and cut the throats of three night watchmen"], ["2011.04.02", "Afghanistan", "Kandahar", 10, 81, "Ten more people are killed by a rampaging mob protesting a Quran burning."], ["2011.04.02", "Iraq", "Kubisa", 6, 8, "Terrorists shoot six security guards to death."], ["2011.04.02", "Iraq", "Kut", 2, 0, "A merchant and his bodyguard are victims of a targeted sectarian assassination."], ["2011.04.03", "Afghanistan", "Kandahar", 2, 30, "Two people are killed in an arson attack by a mob protesting a Quran desecration."], ["2011.04.03", "Iraq", "Mosul", 1, 6, "Islamists fire a rocket into a house, killing a woman."], ["2011.04.03", "Iraq", "Ramadi", 1, 14, "Mujahideen blow up local cop and injure fourteen others."], ["2011.04.03", "Nigeria", "Bogoro", 2, 1, "A Muslim mob, angered over rumor of a local Quran desecration storms a Christian village and kills two people."], ["2011.04.03", "Pakistan", "Sakhi Sarwar", 50, 72, "Fifty Sufi worshippers are sent to Allah by two Sunni suicide bombers at their temple."], ["2011.04.03", "Philippines", "Maguindanao", 11, 3, "Moro Islamists ambush a group of villagers with automatic weapons, taking down eleven."], ["2011.04.04", "Afghanistan", "Faryab", 2, 0, "Two US soldiers are shot and killed by a terrorist in police uniform whom they were training."], ["2011.04.04", "Ethiopia", "Worabe", 1, 1, "Muslims beat a Christian evangelist to death and assault his pregnant wife."], ["2011.04.04", "Iraq", "Jurf al-Sakhar", 6, 0, "A bomb hidden on a booby-trapped corpse kills six Iraqis."], ["2011.04.04", "Pakistan", "Lower Dir", 8, 26, "A suicide bomber detonates at a car showroom, sending eight souls to Allah."], ["2011.04.04", "Pakistan", "Wana", 1, 0, "The body of an abducted tribal elder is found two months after his kidnapping by Mujahideen."], ["2011.04.04", "Pal. Auth.", "Jenin", 1, 0, "A Israeli-Arab activist is gunned down by Islamic radicals unhappy with the secular character of his work."], ["2011.04.05", "India", "Motijil", 0, 1, "A female convert to Christianity is stripped naked and beaten by angry Muslims."], ["2011.04.05", "Iraq", "Baaj", 3, 7, "Islamists bomb another car dealership, taking down three civilians."], ["2011.04.05", "Iraq", "Baghdad", 6, 3, "Four young children, ages 4,6,9 and 14 are slaughtered in their own home by Mujahid gunmen.  Their mother, widowed by an earlier attack is seriously wounded."], ["2011.04.05", "Iraq", "Mosul", 3, 2, "Three civilians at a car dealership are shredded by a suicide bomber."], ["2011.04.05", "Pakistan", "Darra Adam Khel", 1, 0, "A farmer bleeds out following a Mujahideen rocket attack."], ["2011.04.06", "Nigeria", "Maiduguri", 2, 0, "Boko Haram Islamists gun down two people in a drive-by."], ["2011.04.06", "Pakistan", "Jerma", 4, 3, "Four children playing near a pond are taken down by Mujahid bombers."], ["2011.04.06", "Pakistan", "Mohmand", 4, 0, "A woman and three children are crushed to death when a suspected Taliban rocket hits their home."], ["2011.04.06", "Pakistan", "Pir Kali", 3, 0, "The Taliban kidnap and brutally execute three villagers."], ["2011.04.06", "Pakistan", "Quetta", 1, 17, "A suicide car bomber rams into a house, killing a guard and injuring several children."], ["2011.04.07", "Afghanistan", "Kandahar", 6, 10, "Six Afghans are murdered by a Taliban bomb hidden in an ambulance."], ["2011.04.07", "Brazil", "Rio de Janeiro", 12, 20, "A convert to Islam walks into a school and guns down a dozen children, apparently inspired by fundamentalist websites."], ["2011.04.07", "Iraq", "al-Rida", 2, 4, "A sectarian blast near a mosque takes down two civilians."], ["2011.04.07", "Israel", "Ashkelon", 1, 1, "Hamas successfully hits a school bus with an anti-tank missile, severely injuring a teenage student who dies ten days later."], ["2011.04.07", "Pakistan", "Quetta", 1, 0, "Sunni fundamentalists hurl a grenade into a barbershop, killing one patron."], ["2011.04.07", "Somalia", "Bosasso", 1, 0, "A tribal elder is gunned down by suspected al-Shabaab."], ["2011.04.07", "Somalia", "Garowe", 1, 0, "A peace activist is shot to death by al-Qaeda linked militants."], ["2011.04.07", "Thailand", "Narathiwat", 1, 0, "Muslim 'insurgents' stage a drive-by attack on a veterans office, killing a guard."], ["2011.04.08", "Afghanistan", "Sari Pul", 1, 1, "Religious extremists machine-gun the local police chief to death."], ["2011.04.08", "India", "Srinagar", 1, 0, "A moderate cleric is assassinated by Lashkar-e-Toiba hardliners at his mosque."], ["2011.04.08", "Iraq", "Baghdad", 2, 0, "A TV network official is among two people murdered by Mujahid gunmen."], ["2011.04.08", "Nigeria", "Bogoro", 10, 0, "Muslims armed with machetes attack a Christian village and burn at least ten people to death, including several who were elderly."], ["2011.04.08", "Nigeria", "Shani", 4, 0, "Four election workers are ambushed and killed by Boko Haram militants."], ["2011.04.08", "Thailand", "Pattani", 1, 0, "A 52-year-old man is shot to death by Muslim \"separatists.\""], ["2011.04.08", "Thailand", "Yala", 2, 0, "A Buddhist man and his companion are shot full of holes by Muslim terrorists.."], ["2011.04.09", "Dagestan", "Kizlyar", 1, 0, "A local imam who spoke out against Islamic radicalism is gunned down outside his home."], ["2011.04.09", "Iraq", "Fallujah", 3, 0, "Jihadis take down three Iraqis with a sticky bomb."], ["2011.04.09", "Iraq", "Mosul", 2, 0, "Suspected fundamentalists shoot a university professor to death outside his home."], ["2011.04.10", "Afghanistan", "Farah", 3, 0, "Three tribal elders are dismantled by Taliban bombers."], ["2011.04.10", "India", "Baramulla", 1, 0, "A young man is shot to death by Islamic militants."], ["2011.04.10", "Iraq", "Baghdad", 2, 0, "al-Qaeda is suspected of killing a jeweler and his son at their shop."], ["2011.04.10", "Pakistan", "Mohmand", 2, 7, "Two security personnel bleed out following a Taliban ambush."], ["2011.04.11", "Dagestan", "Kidero", 3, 0, "Three policemen die when Islamic militants ambush them with machine-guns."], ["2011.04.11", "Iraq", "Baghdad", 4, 11, "A 10-year-old girl is among four Iraqis murdered in a terrorist blast along a city street."], ["2011.04.11", "Iraq", "Fallujah", 7, 19, "A triple bombing leaves seven dead."], ["2011.04.11", "Iraq", "Khan Bani Saad", 10, 2, "Ten women and children are killed in a home by Jihadi bombers."], ["2011.04.11", "Pakistan", "Kanrakai", 3, 13, "Women and children are among the casualties when religious radicals set off a roadside bomb."], ["2011.04.12", "Afghanistan", "Faryab", 4, 4, "Talibanis gun down three children and their father."], ["2011.04.12", "Dagestan", "Tsumadinsky", 2, 3, "Two cops die in a brutal ambush by Mujahideen."], ["2011.04.12", "Iraq", "Iskandariya", 2, 2, "Two local cops are dismantled by a Jihad bomb blast."], ["2011.04.12", "Iraq", "Khan Dhari", 5, 6, "A vicious double bombing at a home leaves three family members and two rescue workers dead."], ["2011.04.13", "Afghanistan", "Kunar", 10, 7, "Ten tribal elders are blown to bits by a Fedayeen suicide bomber who embraced one of his victims."], ["2011.04.13", "Iraq", "Kirkuk", 1, 16, "Terrorists set off a bomb in a restaurant, killing at least one."], ["2011.04.14", "Afghanistan", "Paktia", 3, 3, "Four Shahid suicide bombers detonate at a police training camp, leaving three recruits dead."], ["2011.04.14", "Iraq", "Yusufiya", 2, 13, "Two Iraqis are taken down by a double bombing."], ["2011.04.14", "Pakistan", "Quetta", 2, 2, "A cleric and his student are shot to death by Religion of Peace rivals."], ["2011.04.14", "Thailand", "Narathiwat", 1, 0, "Islamic militants spray the back of a 45-year old villager's head with automatic weapons fire."], ["2011.04.15", "Afghanistan", "Kandahar", 3, 2, "A religious fundamentalist wearing an explosives vest detonates in a group of policemen, killing three."], ["2011.04.15", "India", "Budgam", 1, 0, "Islamists drag a female political candidate out of her home and shoot her to death."], ["2011.04.15", "Indonesia", "Cirebon", 0, 29, "A suicide bomber blows himself up inside a mosque, injuring nearly thirty."], ["2011.04.15", "Iraq", "Kut", 1, 0, "A young man is shot three times in the head and chest by 'insurgents'."], ["2011.04.15", "Jordan", "Zarqa", 0, 51, "A mob of Islamists attack police and accused atheists with bats and knives, leaving at least fifty injured."], ["2011.04.15", "Nigeria", "Maiduguri", 2, 5, "Boko Haram Islamists gun down two innocents."], ["2011.04.15", "Pakistan", "Kurram", 2, 0, "The Taliban ambush a group of police, killing two."], ["2011.04.15", "Pal. Auth.", "Mareh Amer", 1, 0, "Salafis belonging to Jahafil Al-Tawhid Wal-Jihad fi Filastin kidnap and murder an Italian activist."], ["2011.04.16", "Afghanistan", "Laghman", 10, 8, "A Fedayeen suicide bomber kills nine soldiers and a civilian."], ["2011.04.16", "Algeria", "Azazga", 14, 12, "al-Qaeda fundamentalists assault a local security post, leaving at least 14 'apostates' dead."], ["2011.04.16", "Iraq", "Hawija", 1, 0, "An al-Qaeda opponent is kidnapped, tortured and murdered."], ["2011.04.16", "Nigeria", "Maiduguri", 1, 0, "A cop is gunned down by local Islamists."], ["2011.04.16", "Somalia", "Galkayo", 3, 2, "A government official is among three people dismantled by a bomb planted by Mujahideen."], ["2011.04.17", "Iraq", "Baghdad", 4, 0, "Four members of a Shiite family, including two teens, are viciously shot to death in their home by sectarian rivals."], ["2011.04.17", "Iraq", "Kirkuk", 2, 1, "Two bombings take down two Iraqis."], ["2011.04.17", "Pakistan", "Gujranwala", 0, 12, "Twelve worshippers at a Pentecostal church are pulled out and beaten by a Muslim mob."], ["2011.04.18", "Afghanistan", "Ghazni", 6, 0, "No one survives a brutal roadside ambush by fundamentalists on a vehicle carrying six."], ["2011.04.18", "Afghanistan", "Kabul", 2, 7, "A Fedayeen bomber attacks a defense ministry building, killing two."], ["2011.04.18", "Egypt", "Minya", 1, 11, "One Copt is killed by Muslim rioters, who throw a grandmother out of a second story balcony while shouting praises to Allah."], ["2011.04.18", "Iraq", "Baghdad", 10, 23, "A pair of suicide bombers send ten other souls to Allah."], ["2011.04.18", "Somalia", "Shalambod", 1, 0, "A 21-year-old convert to Christianity is pulled from his home and shot 10 times by Islamists yelling 'Allah Akbar'."], ["2011.04.18", "Thailand", "Yala", 1, 23, "Muslim 'insurgents' set off a car bomb, killing a passerby in a pickup truck."], ["2011.04.19", "Afghanistan", "Kabul", 2, 0, "A Taliban gunmen goes on a shooting spree inside a government building, killing two guards."], ["2011.04.19", "Dagestan", "Khasavyurt", 2, 0, "Two cops are gunned down by Muslim militants."], ["2011.04.19", "Iraq", "Baghdad", 1, 2, "Jihadis assassinate an official with the education department."], ["2011.04.19", "Iraq", "Kirkuk", 3, 0, "A teacher and her two Shia daughters shot to death by Sunni terrorists in their own home."], ["2011.04.19", "Nigeria", "Kaduna", 321, 575, "Angry Muslims go on a two-day bender, torching over forty churches and hacking and burning over three hundred Christians to death."], ["2011.04.19", "Pakistan", "Khyber", 1, 0, "Religion of Peace hardliners slit the throat of a tribesman."], ["2011.04.19", "Thailand", "Narathiwat", 1, 25, "Jihadis set off a bomb that leaves one dead."], ["2011.04.19", "Thailand", "Pattani", 5, 0, "Two teens are among five people who die from splinter injuries following an Islamist grenade attack."], ["2011.04.20", "Dagestan", "Makhachkala", 1, 0, "A cleric is murdered outside his home by Religion of Peace rivals."], ["2011.04.20", "Iraq", "Baghdad", 3, 10, "Sectarian Jihadis detonate a bomb in a Shia area, killing three."], ["2011.04.20", "Iraq", "Mosul", 4, 1, "A student is among four Iraqis shot to death by Mujahid gunmen."], ["2011.04.20", "Nigeria", "Bauchi", 10, 17, "Women are among a group of young Christians murdered by a Muslim mob."], ["2011.04.20", "Nigeria", "Maiduguri", 1, 0, "Islamists gun down a rival cleric."], ["2011.04.20", "Pakistan", "Karachi", 3, 0, "Three Shia civilians are gunned down in cold blood by Sunni assassins."], ["2011.04.20", "Pakistan", "Kurram", 7, 0, "Seven villagers are executed in captivity by the Taliban."], ["2011.04.20", "Pakistan", "Mohmand", 2, 0, "A rancher and his assistant are brutally murdered at a Taliban roadblock."], ["2011.04.21", "Afghanistan", "Ghazni", 3, 5, "The Taliban take down three civilians with a roadside bomb."], ["2011.04.21", "Afghanistan", "Jalalabad", 3, 6, "Sunni fundamentalists plant a bomb that kills three local cops."], ["2011.04.21", "Iraq", "Samarrah", 1, 4, "A child bleeds out following a Jihadi bomb blast."], ["2011.04.21", "Pakistan", "Peshawar", 1, 0, "A man is beheaded by Muslim terrorists."], ["2011.04.21", "Thailand", "Pattani", 1, 2, "Muslim 'insurgents' murder a Buddhist in his home."], ["2011.04.22", "Afghanistan", "Spin Boldak", 5, 0, "Five police officers are dismantled by a Taliban bomb."], ["2011.04.22", "Iraq", "Ramadi", 3, 3, "Mujahideen bombers take down three Iraqis."], ["2011.04.22", "Pakistan", "Karachi", 19, 40, "A Taliban-trained bomber blows up an illegal gambling den, killing nineteen patrons."], ["2011.04.22", "Pakistan", "Maskini", 14, 9, "Armed religious extremists assault two remote checkpoints, killing fourteen security personnel."], ["2011.04.22", "Pakistan", "Sindh", 2, 0, "Two men are shot to death in separate militant attacks."], ["2011.04.22", "Thailand", "Yala", 1, 4, "One person is killed when Muslim 'insurgents' detonate a bomb hidden in a drainage pipe."], ["2011.04.22", "Yemen", "Mareb", 8, 4, "Eight soldiers are shot to death by al-Qaeda extremists."], ["2011.04.23", "Afghanistan", "Helmand", 1, 0, "The Taliban assassinate a former government official."], ["2011.04.23", "Afghanistan", "Kunduz", 3, 1, "Three civilians are disassembled by Taliban bombers."], ["2011.04.23", "Iraq", "Baghdad", 6, 4, "Terrorists shoot six Iraqis to death in separate attacks."], ["2011.04.23", "Iraq", "Kirkuk", 1, 2, "A brutal attack on an off-duty copy leaves him dead, his wife injured and his son without legs."], ["2011.04.23", "Pakistan", "Hangu", 1, 1, "An 8-year-old boy dies from shrapnel injuries suffered during a Mujahid bombing of his home."], ["2011.04.23", "Pakistan", "Salarzai", 5, 0, "A Shahid suicide bomber sends five souls to Allah."], ["2011.04.24", "India", "Baramulla", 1, 0, "Islamic militants shoot a civilian to death."], ["2011.04.24", "Iraq", "Baghdad", 0, 7, "Seven people are injured when Muslim activists detonate a bomb outside a church."], ["2011.04.24", "Libya", "Tomina", 3, 0, "A father slits his three teenaged daughters throats after learning of their having been raped by Libyan soldiers."], ["2011.04.24", "Pakistan", "Dir", 1, 0, "A local trader is abducted and slain by suspected Islamists."], ["2011.04.24", "Pal. Auth.", "Nablus", 1, 3, "A Palestinian cop yells 'Allah Akbar' and opens fire on a group of orthodox Jewish pilgrims, killing one."], ["2011.04.24", "Somalia", "Bosasso", 1, 2, "al-Qaeda linked militants assassinate a local elder."], ["2011.04.25", "India", "Srinagar", 2, 1, "Two cops are gunned down along a city street by Muslim terrorists."], ["2011.04.25", "Iraq", "Baqubah", 2, 0, "A minibus driver is among two people blown to bits by Mujahid bombers."], ["2011.04.25", "Nigeria", "Maiduguri", 3, 8, "Boko Haram members bomb a bus stop and a hotel, killing three people."], ["2011.04.26", "Iraq", "Baghdad", 1, 0, "'Insurgents' assassinate a governor's secretary outside his home."], ["2011.04.26", "Iraq", "Hawija", 2, 6, "Two innocents are leveled in the rubble of their house by Jihadi bombers."], ["2011.04.26", "Iraq", "Kirkuk", 3, 30, "Mujahid bombers take down three Iraqis."], ["2011.04.26", "Pakistan", "Karachi", 4, 56, "A female doctor is among four people dismantled during two separate bus bombings."], ["2011.04.26", "Somalia", "Luuq", 8, 13, "A well-placed al-Shabaab landmine catches a civilian bus and sends at least eight passengers to Allah."], ["2011.04.27", "Afghanistan", "Kabul", 9, 0, "A 'very religious' Afghan pilot suddenly turns on his American trainers, gunning down nine in an attack claimed by the Taliban."], ["2011.04.27", "Algeria", "Boumelih", 2, 1, "Fundamentalists cut two local cops to shreds with a shrapnel bomb."], ["2011.04.27", "Iraq", "Falluajh", 3, 0, "Three Iraqis are kidnapped and brutally tortured to death by suspected al-Qaeda."], ["2011.04.27", "Pakistan", "Hamza", 0, 3, "Anti-Christian activists go on a spree, attacking a pastor, severely injuring his son and later raping a woman."], ["2011.04.27", "Thailand", "Yala", 1, 0, "Muslim 'insurgents' shoot a Buddhist hunter and his dog to death."], ["2011.04.27", "Yemen", "Zunjibar", 2, 5, "al-Qaeda militants attack a checkpoint and kill two soldiers."], ["2011.04.28", "Algeria", "Oued Djemaa", 5, 4, "Islamic extremists murder five security personnel with a bomb."], ["2011.04.28", "Iraq", "Balad Ruz", 12, 40, "A Sunni straps explosives to his body and walks into a Shia mosque.  A dozen are killed in the ensuing blast."], ["2011.04.28", "Iraq", "Shahria", 5, 12, "Five Iraqis are blown to bits by a Sunni bomb."], ["2011.04.28", "Morocco", "Marrakesh", 16, 23, "A Holy Warrior walks into a cafe and detonates.  Five women are among the sixteen massacred."], ["2011.04.28", "Pakistan", "Karachi", 6, 7, "Six innocents bleed out following an Islamist bombing attack on a bus."], ["2011.04.28", "Pakistan", "Lakki Marwat", 2, 0, "Two villagers are abducted and executed by religious militants."], ["2011.04.28", "Pakistan", "Peshawar", 2, 0, "Islamists gun down two local cops."], ["2011.04.29", "Iraq", "Buhriz", 4, 0, "Four Sunni brothers are shot to death in cold blood by sectarian rivals."], ["2011.04.29", "Iraq", "Diyala", 3, 0, "A family of three, including a girl, is exterminated in their home by terrorists."], ["2011.04.29", "Pakistan", "Karachi", 1, 0, "An imam is assassinated by Religion of Peace rivals."], ["2011.04.30", "Bulgaria", "Pazardjik", 0, 1, "A pastor who converted from Islam is beaten bloody in front of his church by a gang of Muslims."], ["2011.04.30", "India", "Baramulla", 1, 0, "Mujahideen shoot a vendor to death."], ["2011.04.30", "Iraq", "Kadhimiya", 4, 0, "A village defense volunteer and three family members are murdered in their home by suspected al-Qaeda."], ["2011.04.30", "Iraq", "Mosual", 8, 19, "A brutal Fedayeen bombing at a marketplace entrance leaves at least eight dead."], ["2011.04.30", "Iraq", "Qadiriya", 2, 2, "A man and his daughter are shot to death in their home by Islamic militants."], ["2011.04.30", "Iraq", "Taji", 3, 1, "A child and woman are among three killed when Islamists bomb a judge's home."], ["2011.04.30", "Pakistan", "Gujranwala", 0, 25, "Fueled by rumors of a Quran desecration, a Muslim mob of hundreds attacks a Christian village, burning homes and assaulting the innocent."], ["2011.04.30", "Pakistan", "Gujranwala", 0, 25, "Twenty-five Christian men and women suffer injury following an attack by an enraged Muslim mob of about 350."], ["2011.04.30", "Thailand", "Yala", 2, 9, "Two local soldiers are killed by Muslim roadside bombers."], ["2011.04.30", "USA", "Warren, MI", 1, 0, "A 20-year-old woman is shot in the head by her stepfather for not adhering to Islamic practices."], ["2011.05.01", "Afghanistan", "Ghazni", 4, 15, "A Taliban shooting and bombing leave four Afghans dead."], ["2011.05.01", "Afghanistan", "Kunar", 1, 1, "A woman is shot to death by Sunni fundamentalists."], ["2011.05.01", "Afghanistan", "Logar", 2, 13, "Two local cops are dismantled by a Taliban bomb.  Thirteen civilians are injured elsewhere."], ["2011.05.01", "Afghanistan", "Paktika", 4, 12, "At least four people are killed when a 12-year-old suicide bomber detonates at a crowded market."], ["2011.05.01", "Dagestan", "Sergokala", 1, 0, "Islamic rebels are suspected in the assassination of a police chief."], ["2011.05.01", "Iraq", "Baghdad", 7, 20, "A teacher is among seven Iraqis gunned down in various Mujahideen attacks."], ["2011.05.01", "Pakistan", "Punjab", 4, 0, "Four guards are killed when Islamists attack a NATO supply convoy."], ["2011.05.01", "Yemen", "Zinjibar", 3, 4, "Three local soldiers are killed by an al-Qaeda ambush."], ["2011.05.02", "India", "Birma Pul", 1, 7, "Holy Warriors take down a civilian with a roadside bomb."], ["2011.05.02", "Iraq", "Baghdad", 3, 14, "A bomb near a coffee shop leaves three people dead."], ["2011.05.02", "Iraq", "Baghdad", 6, 7, "A Jihad bomb at a hospital garage nearly wipes out an entire family."], ["2011.05.02", "Pakistan", "Charsadda", 4, 5, "A woman and three children are torn to shreds when religious rivals place a bomb at a mosque."], ["2011.05.03", "Iraq", "Baghdad", 2, 5, "A woman is among two who bleed to death in separate bombings."], ["2011.05.03", "Iraq", "Baghdad", 16, 37, "Sixteen Shiites in a poorer neighborhood are blown to bits by Sunni bombers while watching soccer at a cafe."], ["2011.05.04", "Iraq", "Halila", 2, 0, "Mujahideen stop two trucks and execute the drivers."], ["2011.05.04", "Iraq", "Karbala", 3, 4, "Three agricultural workers are murdered by Islamic bombers."], ["2011.05.04", "Nigeria", "Borno", 2, 0, "A woman is among two people taken down by Islamist assassins."], ["2011.05.04", "Nigeria", "Maiduguri", 3, 0, "Three guards are killed in a Boko Haram shooting at a prison."], ["2011.05.04", "Pakistan", "Bara", 1, 2, "Militants kidnap three civilians from a market and execute one."], ["2011.05.04", "Pakistan", "Karachi", 1, 0, "A 45-year-old Shia man is assassinated by Taliban gunmen."], ["2011.05.04", "Somalia", "Baidoa", 2, 0, "al-Shabaab executes two young 'apostates' at a soccer stadium, forcing children to watch."], ["2011.05.04", "Sudan", "Khartoum", 0, 2, "A husband and wife survive a violent knife attack in their home after converting from Islam to Christianity."], ["2011.05.04", "Thailand", "Yala", 4, 13, "Muslim militants roll up on a tea shop and machine-gun four people to death, including two teenagers."], ["2011.05.04", "Yemen", "Abyan", 7, 9, "Seven people at a market are laid out by al-Qaeda bombers."], ["2011.05.05", "Iraq", "Hilla", 24, 72, "Two dozen police are sent to Allah by a Holy Warrior in an explosives-packed vehicle."], ["2011.05.05", "Iraq", "Mosul", 1, 1, "A woman is shot to death in her home by 'insurgents'."], ["2011.05.05", "Nigeria", "Maiduguri", 2, 0, "A child is among two people shot to death by Boko Haram Islamists."], ["2011.05.05", "Pakistan", "Karachi", 2, 0, "An imam is among two people assassinated by Religion of Peace rivals."], ["2011.05.06", "Algeria", "Baghlia", 1, 0, "Armed fundamentalists gun down a journalist."], ["2011.05.06", "Iraq", "Fallujah", 1, 0, "An accused 'enemy of Allah' is kidnapped and beheaded."], ["2011.05.06", "Nigeria", "Kano", 17, 3, "Seventeen residents of a Christian village, including a pastor's wife and three children are massacred in a pre-dawn Muslim attack."], ["2011.05.06", "Pakistan", "Quetta", 8, 15, "Eight Shiites visiting a cemetery are targeted and killed in a Sunni rocket attack."], ["2011.05.06", "Sudan", "Abu Shouk", 0, 1, "After being spotted with a Bible, a female aid worker is arrested for apostasy and severely beaten."], ["2011.05.07", "Afghanistan", "Kandahar", 4, 45, "At least four people are killed during a sustained Fedayeen assault at a shopping mall."], ["2011.05.07", "Algeria", "El Kennar", 5, 5, "Islamic militants murder five security personnel with a roadside bomb."], ["2011.05.07", "Egypt", "Cairo", 12, 232, "Fundamentalists assault two churches with firebombs and gunfire, killing five Copt defenders and seven more in an ensuing rampage."], ["2011.05.07", "Iraq", "Baqubah", 6, 10, "Suspected al-Qaeda gunmen stage a deadly robbery on a market, killing six."], ["2011.05.07", "Thailand", "Narathiwat", 1, 0, "Religious separatists shoot a farmer to death."], ["2011.05.07", "Thailand", "Pattani", 4, 12, "Muslim militants detonate a bomb at a soccer field where police are playing a friendly game with villagers, killing four."], ["2011.05.07", "Thailand", "Yala", 3, 2, "A roadside bomb planted by Islamic radicals leaves three dead."], ["2011.05.08", "Dagestan", "Makhachkala", 2, 0, "A journalist is among two people slain by Jihadi gunmen in separate attacks."], ["2011.05.08", "Egypt", "Imbaba", 1, 0, "Islamists break into a Catholic church and slit a member's throat."], ["2011.05.08", "Egypt", "Imbaba", 1, 0, "Salafists shoot the 16-year-old nephew of a Catholic bishop in the head."], ["2011.05.08", "Iraq", "Baghdad", 9, 14, "al-Qaeda detainees stage a jailhouse revolt, leaving nine guards dead."], ["2011.05.08", "Thailand", "Pattani", 2, 0, "Islamists gun down two Buddhists in front of a mosque."], ["2011.05.09", "Afghanistan", "Ghazni", 6, 0, "The Taliban machine-gun a half-dozen policemen at point-blank range."], ["2011.05.09", "Afghanistan", "Khost", 4, 0, "Four villagers are beheaded by religious hardliners."], ["2011.05.09", "Afghanistan", "Laghman", 5, 3, "Three children are among five civilians torn to shreds by a Shahid suicide bomber."], ["2011.05.09", "Egypt", "Cairo", 1, 0, "A 60-year-old Catholic grandfather is beaten to death by enraged Muslims."], ["2011.05.09", "Iraq", "Baghdad", 3, 2, "A liquor store owner is among the casualties of various Mujahideen blasts."], ["2011.05.09", "Pakistan", "Nowshera", 4, 2, "A bombing at a courthouse leaves four dead, including a woman."], ["2011.05.09", "Pakistan", "Orakzai", 1, 0, "Tehreek-e-Taliban kidnap and brutally execute a tribesman."], ["2011.05.10", "Dagestan", "Makhachkala", 1, 1, "A suicide bomber detonates at a checkpoint, killing a cop."], ["2011.05.10", "Iraq", "Tikrit", 11, 8, "Jihad car bombers send eleven Iraqis to Allah."], ["2011.05.10", "Pakistan", "Peshawar", 1, 0, "A journalist is disassembled by a car bomb blast."], ["2011.05.10", "Somalia", "Mogadishu", 3, 7, "Islamic militia take out three civilians with a roadside bomb."], ["2011.05.11", "India", "Baghpat", 2, 0, "Two Muslim mothers strangle their own daughters for marrying Hindu men."], ["2011.05.11", "Iraq", "Tikrit", 2, 1, "Two Iraqis bleed out following a Mujahideen bombing."], ["2011.05.11", "Pakistan", "Karachi", 2, 0, "Two cops are gunned down in an Islamist drive-by."], ["2011.05.11", "Somalia", "Gal Gala", 5, 4, "Islamists ambush a group of government troops, killing five."], ["2011.05.12", "Afghanistan", "Helmand", 2, 0, "A religious Muslim in police uniform opens up on NATO soldiers eating lunch, killing two."], ["2011.05.12", "Iraq", "Hillah", 1, 0, "A teenager is tortured and murdered by suspected al-Qaeda."], ["2011.05.12", "Iraq", "Mussayab", 2, 0, "Two people are abducted and beheaded by Religion of Peace activists."], ["2011.05.12", "Nigeria", "Borno", 1, 1, "Muslim extremists assassinate a local elder."], ["2011.05.12", "Nigeria", "Maiduguri", 2, 0, "Boko Haram radicals murder a union official and his son."], ["2011.05.13", "Algeria", "Tizrarana", 7, 2, "Armed fundamentalists attack a military barracks, slaying seven dead."], ["2011.05.13", "India", "Kupwara", 1, 0, "Islamic militants ambush and kill a local soldier."], ["2011.05.13", "Nigeria", "Borno", 1, 0, "Religious radicals shoot a chauffeur to death."], ["2011.05.13", "Nigeria", "Maiduguri", 2, 0, "Two men waiting for a bus are blown to bits by Boko Haram Islamists."], ["2011.05.13", "Pakistan", "Bannu", 98, 124, "Two suicide bombers yelling 'Allah Akbar' murder ninety innocent people in \"revenge\" for the bin Laden killing."], ["2011.05.13", "Pakistan", "Karachi", 1, 0, "A Shiite is shot twelve times by Sunni militants while traveling to work."], ["2011.05.13", "Yemen", "Marib", 5, 0, "Five soldiers are dismantled by an Islamist RPG attack."], ["2011.05.14", "Pakistan", "Kharian", 7, 20, "Three women and a child are among seven bus passengers torn to shreds by fundamentalist bombers."], ["2011.05.14", "Somalia", "Bosasso", 3, 0, "al-Shabaab is blamed for the murder of three tribal elders along a city street."], ["2011.05.14", "Yemen", "Rada'a", 6, 1, "Six local soldiers lose their lives to an al-Qaeda ambush."], ["2011.05.15", "Egypt", "Cairo", 0, 50, "About fifty Christians are injured when a Muslim mob hurls rocks and homemade bombs into a peaceful protest."], ["2011.05.15", "Egypt", "Cairo", 2, 0, "Two Copts are gunned down in a Muslim drive-by attack."], ["2011.05.15", "Iraq", "Baghdad", 3, 0, "A family of three, including a 13-year-old boy, are murdered in their beds by sectarian Jihadis."], ["2011.05.15", "Iraq", "Shirqat", 1, 0, "A woman is beheaded by suspected al-Qaeda."], ["2011.05.15", "Israel", "Tel Aviv", 1, 17, "An Israeli is killed when an Arab driver rams him yelling 'Allah Akbar' and 'Death to Jews'."], ["2011.05.15", "Pakistan", "Datta Khel", 2, 0, "Tehreek-e-Taliban kidnap and execute two villagers."], ["2011.05.15", "Pakistan", "Uch Sharif", 2, 0, "Two sisters are shot to death in their sleep by their brother on suspicion of being sexually active."], ["2011.05.15", "Thailand", "Yala", 2, 0, "Two locals are murdered in separate attacks."], ["2011.05.16", "Afghanistan", "Kunar", 3, 8, "A woman and child are among three civilians crushed to death by a Taliban rocket attack."], ["2011.05.16", "India", "Kishtwar", 1, 0, "Lashkar-e-Toiba militants abduct and execute a 50-year-old civilian."], ["2011.05.16", "Iraq", "Kirkuk", 1, 0, "Muslim kidnappers gouge out the eyes of a Christian victim and then cut off his head."], ["2011.05.16", "Pakistan", "Jawaki", 1, 0, "A member of a peace committee is gunned down by Sunni hardliners."], ["2011.05.16", "Pakistan", "Karachi", 1, 0, "A Saudi diplomat is shot in the head by Shiite terrorists."], ["2011.05.16", "Pakistan", "Mohmand", 2, 1, "Two children are obliterated by a landmine."], ["2011.05.16", "Somalia", "Bosasso", 2, 0, "A tribal elder and a businessman are assassinated by suspected al-Shabaab gunmen."], ["2011.05.16", "Somalia", "Hodan", 10, 15, "al-Shabaab target a rival mosque with mortar shells, killing about ten clerics inside the building."], ["2011.05.16", "Somalia", "Mogadishu", 5, 0, "Five AU peacekeepers are killed in their barracks by an al-Shabaab bomb blast."], ["2011.05.16", "Thailand", "Yala", 2, 2, "Two Buddhist monks are dismantled by Religion of Peace bombers."], ["2011.05.17", "India", "Sopore", 1, 0, "A cop on duty in a town square is gunned down by Islamic terrorists."], ["2011.05.17", "Iraq", "Mosul", 1, 0, "A college employee is shot to death by 'insurgents'."], ["2011.05.17", "Kazakhstan", "Aktobe", 0, 3, "A suicide bomber detonates in 'revenge' for the recent arrest of Sunnis."], ["2011.05.17", "Pakistan", "North Waziristan", 2, 0, "Two tribesmen are abducted and murdered by Taliban."], ["2011.05.17", "Yemen", "Mukalla", 3, 0, "Three people are killed in an al-Qaeda ambush."], ["2011.05.18", "Afghanistan", "Jalalabad", 13, 20, "A holy warrior detonates along a congested city street, killing thirteen innocents."], ["2011.05.18", "Nigeria", "Maiduguri", 10, 6, "Boko Haram Islamists assault a police station, shooting ten people to death."], ["2011.05.18", "Pakistan", "Peshawar", 2, 5, "Seventy armed fundamentalists assault a police post, killing two defenders."], ["2011.05.18", "Pakistan", "Quetta", 6, 4, "Six Shias riding in a van are machine-gunned by Sunni co-religionists."], ["2011.05.18", "Sudan", "El Fasher", 10, 0, "Ten fatalities are reported following an air strike by the Islamic republic on two villages."], ["2011.05.18", "Tunisia", "Rouhia", 1, 2, "A military officer loses his life to an al-Qaeda ambush."], ["2011.05.19", "Afghanistan", "Paktia", 35, 20, "Thirty-five construction workers and guards are murdered by religious hardliners at a work site."], ["2011.05.19", "Egypt", "Cairo", 0, 3, "Three Catholics are severely injured by a rock-throwing Muslim mob intent on preventing a church from opening."], ["2011.05.19", "Iraq", "Abu Ghraib", 1, 3, "A woman and two children are among the casualties when Sunni militants bomb a house."], ["2011.05.19", "Iraq", "Baghdad", 1, 2, "A cleric is sent to Allah by Religion of Peace rivals."], ["2011.05.19", "Iraq", "Kirkuk", 4, 0, "Four Iraqis are laid low by a terrorist blast."], ["2011.05.19", "Iraq", "Kirkuk", 27, 90, "Mujahideen detonate a car bomb in a parking lot, killing almost thirty Iraqis."], ["2011.05.19", "Nigeria", "Maiduguri", 1, 7, "One person is killed in a Boko Haram bomb blast."], ["2011.05.19", "Pakistan", "Khyber", 2, 17, "Two bomb blasts take two lives."], ["2011.05.20", "Iraq", "Baghdad", 2, 0, "al-Qaeda assassins gun down two Iraqi government employees."], ["2011.05.20", "Iraq", "Baqubah", 2, 1, "Sectarian bombers target a rival imam, killing two people, including his son."], ["2011.05.20", "Pakistan", "Khyber", 16, 11, "Islamic militants blow up a fuel tanker on a highway, burning alive sixteen people, including five children."], ["2011.05.20", "Pakistan", "Peshawar", 1, 11, "The Taliban bomb a car outside the American consulate, killing one person."], ["2011.05.20", "Somalia", "Dharkenley", 2, 0, "Two young men are abducted and tortured to death by fundamentalists."], ["2011.05.20", "Thailand", "Narathiwat", 0, 12, "Muslim terrorists detonate a bomb under a truck at a market."], ["2011.05.21", "Afghanistan", "Kabul", 6, 30, "Holy Warriors detonate themselves inside a hospital, leaving six medical workers dead."], ["2011.05.21", "Iraq", "Kirkuk", 1, 0, "Suspected terrorists gun down a handicapped man."], ["2011.05.21", "Iraq", "Kirkuk", 2, 0, "Religion of Peace militants shoot a factory worker and his 3-year-old daughter to death."], ["2011.05.21", "Iraq", "Kirkuk", 2, 0, "Two brothers are brutally murdered during a Sunni home invasion."], ["2011.05.22", "Afghanistan", "Khost", 5, 7, "Three traffic cops and two civilians are taken down by a Fedayeen suicide assault."], ["2011.05.22", "Dagestan", "Khasavyurt", 2, 0, "Islamists gun down two local cops."], ["2011.05.22", "Iraq", "Baghdad", 5, 58, "A series of bomb blasts leave at least five Iraqis dead."], ["2011.05.22", "Iraq", "Kirkuk", 2, 0, "A man and his daughter are shot to death by Muslim terrorists."], ["2011.05.22", "Iraq", "Sadr City", 2, 12, "'Insurgents' place a bomb near a hospital, killing two people."], ["2011.05.22", "Iraq", "Taji", 12, 30, "A dozen Iraqi security personnel are murdered by a Shahid suicide bomber."], ["2011.05.22", "Pakistan", "Karachi", 13, 16, "Taliban militants assault a navy base for 14 hours, killing at least thirteen."], ["2011.05.23", "Afghanistan", "Laghman", 4, 14, "Four tribal elders at a restaurant are disassembled by a Fedayeen suicide bomber."], ["2011.05.23", "Iraq", "Kirkuk", 2, 12, "A well-placed bomb takes the lives of two Iraqi policemen."], ["2011.05.24", "Afghanistan", "Panjwaii", 10, 28, "Ten road construction workers are cut to pieces by a Taliban roadside bomb."], ["2011.05.24", "Iraq", "Baghdad", 4, 15, "Jihad bombers send four Iraqis to Allah."], ["2011.05.24", "Nigeria", "Maiduguri", 1, 0, "Islamists murder a guard outside a Catholic church."], ["2011.05.24", "Thailand", "Narathiwat", 2, 1, "Muslim 'separatists' murder two cops with a bomb hidden in a fire extinguisher."], ["2011.05.24", "Thailand", "Narathiwat", 2, 4, "Islamic 'separatists' detonate a bomb under a police vehicle, killing two occupants."], ["2011.05.25", "Indonesia", "Sulawesi", 2, 1, "Islamists on a motorbike gun down two policemen."], ["2011.05.25", "Pakistan", "Balishkhel", 4, 18, "A clash between Sunni and Shia leaves four dead."], ["2011.05.25", "Pakistan", "Peshawar", 9, 39, "Suicide truck bombers plow into a police station, killing at least nine."], ["2011.05.25", "Somalia", "Mogadishu", 7, 17, "al-Shabaab Islamists take down seven civilians with a vicious mortar attack."], ["2011.05.25", "Thailand", "Yala", 1, 0, "Thai Islamists ambush and kill a local soldier who was guarding teachers."], ["2011.05.26", "Iraq", "Abu Ghraib", 4, 11, "A Shahid suicide bomber sends four Iraqis to Allah."], ["2011.05.26", "Iraq", "Baghdad", 1, 0, "Sunnis gun down a Shia official."], ["2011.05.26", "Pakistan", "Hangu", 39, 60, "At least three dozen people are massacred by Holy Warriors, who detonate themselves outside a police station."], ["2011.05.26", "Russia", "Vladikavkaz", 1, 0, "Muslim extremists murder a poet for offending Islam."], ["2011.05.26", "Somalia", "Luq", 1, 0, "A villager and his donkey are taken apart by an al-Shabaab IED."], ["2011.05.27", "Afghanistan", "Balkh", 2, 0, "Two people are kidnapped, beaten and burned alive by the Taliban."], ["2011.05.27", "Afghanistan", "Takhar", 7, 9, "A Fedayeen suicide bomber detonates at a local governor's office, killing seven."], ["2011.05.27", "Lebanon", "Sidon", 1, 4, "Islamic militants are suspected in a blast that leaves a UN peacekeeper dead."], ["2011.05.27", "Nigeria", "Damboa", 13, 24, "At least thirteen people are killed when Muslim fundamentalists assault a bank building."], ["2011.05.27", "Thailand", "Narathiwat", 1, 2, "Muslim terrorists open fire on a civilian truck, killing the driver instantly."], ["2011.05.27", "Yemen", "Zinjibar", 5, 0, "Five local cops are executed in cold blood by al-Qaeda."], ["2011.05.28", "India", "Kupwara", 2, 0, "Mujahideen barge into a home and shoot a father and son to death."], ["2011.05.28", "Pakistan", "Bajour", 8, 12, "Sunni fundamentalists send a suicide bomber into a restaurant, slaughtering eight innocents."], ["2011.05.28", "Switzerland", "Einsiedeln", 1, 0, "A 24-year-old woman is shot to death by her strict Muslim father for leading an 'independent life'."], ["2011.05.29", "Iraq", "Abu Ghraib", 2, 11, "Fundamentalists blow up a liquor store, killing two inside."], ["2011.05.29", "Nigeria", "Maiduguri", 1, 0, "A civilian is killed in the crossfire when Boko Haram Islamists shoot at police."], ["2011.05.29", "Pakistan", "Quetta", 2, 3, "Lashkar-e-Jhangvi terrorists assassinate two Shia policemen."], ["2011.05.30", "Afghanistan", "Herat", 5, 45, "At least five Afghans lose their lives to a series of suicide bombers."], ["2011.05.30", "Iraq", "Abu Ghraib", 2, 6, "Two Iraqis are wiped out by a Mujahideen bomb blast."], ["2011.05.30", "Iraq", "Baghdad", 1, 5, "Terrorists bomb a minibus, killing at least one passenger."], ["2011.05.30", "Iraq", "Mosul", 2, 1, "A Christian father of four is murdered by Jihadi gunmen along with a bystander."], ["2011.05.30", "Iraq", "Saqlawaiya", 2, 0, "Islamists are thought to be behind the shooting death of two civilians."], ["2011.05.30", "Nigeria", "Bauchi", 10, 13, "Ten people are torn to shreds by an Islamist bomb planted in a bar."], ["2011.05.30", "Pakistan", "Miranshah", 1, 11, "A young girl dies of injuries suffered from a Religion of Peace bomb blast at a hotel."], ["2011.05.30", "Somalia", "Mogadishu", 2, 4, "Two African peacekeepers are killed by a Shahid suicide bomber."], ["2011.05.30", "Thailand", "Yala", 0, 7, "Two civilians and five members of a Buddhist monk protection patrol are wounded during a Muslim drive-by."], ["2011.05.31", "Thailand", "Narathiwat", 0, 0, "Two Muslims accidentally blow themselves up trying to exterminate a passing convoy of teachers."], ["2011.05.31", "Thailand", "Pattani", 1, 0, "A 27-year-old man is murdered by Muslim gunmen."], ["2011.05.31", "Thailand", "Pattani", 1, 0, "A 48-year-old Buddhist woman is shot to death by Muslim terrorists."], ["2011.05.31", "Yemen", "Zinjibar", 13, 21, "Thirteen local soldiers are slain by al-Qaeda militants."], ["2011.06.01", "Iraq", "Mussayab", 7, 12, "Militants plant a bomb at a wedding, killing seven celebrants."], ["2011.06.01", "Iraq", "Tikrit", 3, 0, "Three brothers are executed by al-Qaeda gunmen."], ["2011.06.01", "Pakistan", "Shaltalo", 8, 3, "At least eight innocents are killed when Taliban militants blow up two girls' schools and attack a police post."], ["2011.06.01", "Thailand", "Yala", 2, 4, "Two Thais are blown up by Islamic 'separatists'."], ["2011.06.02", "Afghanistan", "Uruzgan", 3, 1, "Three guards are slain when the Taliban attack a road construction crew."], ["2011.06.02", "Iraq", "Ramadi", 10, 21, "A series of well-place bombs take the lives of ten Iraqis."], ["2011.06.02", "Pakistan", "Orangi", 1, 0, "A Shia is shot to death by sectarian Jihadis."], ["2011.06.02", "Pakistan", "Shaltalo", 20, 80, "The second day of a sustained Taliban assault leaves twenty more dead."], ["2011.06.02", "Somalia", "Mogadishu", 17, 46, "Seventeen civilians are killed in the crossfire when al-Shabaab stages an attack from a market."], ["2011.06.03", "Iraq", "Tikrit", 17, 24, "Suicide bombers attack a hospital treating victims of an earlier attack.  Seventeen innocents are slaughtered."], ["2011.06.03", "Iraq", "Tikrit", 19, 52, "Nineteen people leaving Friday prayers are shredded by a bomb place outside their mosque."], ["2011.06.03", "Pakistan", "Karachi", 6, 31, "Six people are killed and thirty-one injured when Islamic militants target security personnel and a hotel hosting a casino."], ["2011.06.04", "Afghanistan", "Kandahar", 2, 0, "Fundamentalist bombers take down two university students on campus."], ["2011.06.04", "Afghanistan", "Kunar", 3, 0, "Three Afghans bleed to death following a detonation by a female suicide bomber."], ["2011.06.04", "Algeria", "Bordj Menaiel", 4, 1, "Fundamentalists murder four police officers with a roadside bomb."], ["2011.06.04", "Iraq", "Baghdad", 2, 0, "A pharmacist is among two people shot to death by terrorists."], ["2011.06.04", "Pakistan", "Peshawar", 6, 11, "Three women and a child are among six passengers ripped apart by an Islamist bomb blast on their bus."], ["2011.06.04", "Philippines", "Sulu", 1, 0, "A 42-year-old police officer is killed by Abu Sayyaf militants while searching for a kidnap victim."], ["2011.06.05", "Afghanistan", "Logar", 13, 0, "A tailor and a beheaded soldier are among thirteen Taliban kidnap victims discovered in a mass grave."], ["2011.06.05", "Afghanistan", "Maydan Shahr", 2, 5, "Two security guards are killed by a Taliban bombing at a bank."], ["2011.06.05", "Afghanistan", "Nimroz", 2, 5, "Two Afghan cops are ambushed and killed by religious hardliners."], ["2011.06.05", "Chechnya", "Alkhazurovo", 1, 2, "Islamic militants detonate a bomb next to a passing police patrol, killing at least one."], ["2011.06.05", "Iraq", "Baghdad", 5, 18, "Holy Warriors take down five Iraqis in various attacks."], ["2011.06.05", "Pakistan", "Kohat", 1, 0, "Islamic militants slay an off-duty cop shopping at a market."], ["2011.06.05", "Pakistan", "Nowshera", 19, 45, "Nineteen innocents at a bakery are massacred by Mujahideen bombers."], ["2011.06.06", "Algeria", "Sidi Abdelaziz", 3, 2, "Jihadis murder a soldier with a shotgun, then booby-trap his body with a bomb that kills two comrades."], ["2011.06.06", "India", "Srinagar", 1, 0, "Islamic terrorists gun down a civilian outside his home."], ["2011.06.06", "Iraq", "Baghdad", 5, 8, "Iranian-backed Shiites fire several rockets into a compound, killing five Americans."], ["2011.06.06", "Iraq", "Baghdad", 5, 26, "Five Iraqis are taken down by militant Muslims in two attacks."], ["2011.06.06", "Iraq", "Hamdhiyah", 4, 1, "Four family members are murdered when Mujahideen bomb their home."], ["2011.06.06", "Iraq", "Tikrit", 12, 20, "A suicide car bomber screams 'Allah Akbar' before ending the lives of a dozen others."], ["2011.06.06", "Nigeria", "Biu", 1, 0, "A cleric is shot to death by Religion of Peace rivals at his home."], ["2011.06.06", "Pakistan", "Bannu", 1, 2, "Fundamentalists shoot a security officer to death."], ["2011.06.07", "Dagestan", "Makhachkala", 2, 1, "A religious teacher and his nephew are brutally murdered in their own backyard by radicals."], ["2011.06.07", "Iraq", "Baghdad", 3, 3, "A family of three is among several Iraqis targeted by gunmen in two attacks."], ["2011.06.07", "Iraq", "Mosul", 2, 0, "Muslim extremists successfully take out two shepherds with a roadside bomb."], ["2011.06.07", "Nigeria", "Borno", 5, 5, "Boko Haram Islamists assault two police stations with bombs and bullets, killing five officers."], ["2011.06.07", "Nigeria", "Maiduguri", 2, 14, "Two innocents bleed to death after Islamists detonate a bomb outside a church."], ["2011.06.08", "Afghanistan", "Uruzgan", 2, 0, "A man and his son are murdered by Taliban militants as they leave a party."], ["2011.06.08", "India", "Sopore", 1, 0, "A guard at a market is executed in cold blood by Muslim gunmen."], ["2011.06.08", "Nigeria", "Bauchi", 1, 0, "A man is lured out of his home and then murdered by Boko Haram gunmen."], ["2011.06.08", "Somalia", "Mogadishu", 3, 0, "Three civilians are kidnapped and shot to death by suspected al-Shabaab."], ["2011.06.08", "Sudan", "Kadugli", 1, 0, "A young Christian man is dragged to a market and slaughtered by the sword by men yelling 'Allah Akbar'."], ["2011.06.08", "Sudan", "al Shaeer", 1, 0, "A Christian seminary student is shot to death in front of bystanders by agents of the Islamic government."], ["2011.06.08", "Thailand", "Narathiwat", 1, 0, "A man is murdered by Mujahid gunmen while sitting in his pickup truck."], ["2011.06.08", "Thailand", "Narathiwat", 2, 0, "Two elderly grocers are brought down in their stores by Muslim gunmen in separate attacks."], ["2011.06.08", "Thailand", "Pattani", 4, 12, "Four Buddhist policemen bleed to death following an 'insurgent'  bombing at a friendly soccer game."], ["2011.06.08", "Thailand", "Yala", 3, 2, "Three local soldiers are killed in their vehicle by Islamic bombers."], ["2011.06.08", "Yemen", "Lahj", 4, 2, "al-Qaeda militants fire heavy weapons into a security checkpoint, killing four officers."], ["2011.06.09", "Afghanistan", "Dur Baba", 9, 5, "Sunni terrorists shoot nine members of a wedding party to death, including the groom and his father."], ["2011.06.09", "Iraq", "Baghdad", 3, 2, "A judge is among three Iraqis killed in a series of shooting attacks and a bombing at a liquor store."], ["2011.06.09", "Iraq", "Hatra", 1, 0, "A taxi driver is kidnapped and shot in the head and chest by 'insurgents'."], ["2011.06.09", "Nigeria", "Maiduguri", 2, 0, "A pastor at a Church of Christ and his secretary are brutally gunned down by Religion of Peace loyalists."], ["2011.06.09", "Pakistan", "Darawar", 4, 3, "Islamic militants blow up a van carrying members of a peace committee, killing four."], ["2011.06.09", "Pakistan", "Landhi", 1, 0, "A Christian civilian is shot to death by Muslim gunmen."], ["2011.06.09", "Somalia", "Mogadishu", 2, 3, "Suicide bombers kill two people at a harbor."], ["2011.06.09", "Thailand", "Yala", 1, 1, "Islamic terrorists shoot a 27-year-old man to death in his car."], ["2011.06.10", "Afghanistan", "Kunduz", 4, 18, "A Shahid suicide bomber takes down four police officers saying prayers at a mosque."], ["2011.06.10", "Iraq", "Salman Pak", 10, 15, "Ten Iraqis are taken out by a roadside bomb."], ["2011.06.10", "Pakistan", "Balochistan", 1, 0, "An oil tanker driver dies of bullet wounds from a Mujahideen attack."], ["2011.06.10", "Pakistan", "Farmwala", 0, 1, "A Christian boy is beaten for refusing to embrace Islam."], ["2011.06.10", "Somalia", "Mogadishu", 1, 1, "al-Shabaab gunmen shoot vendors at a market who ignore their orders to stop selling khat."], ["2011.06.10", "Somalia", "Mogadishu", 1, 2, "A local official is murdered by a suicide bomber who was his niece."], ["2011.06.10", "Sudan", "Kadugli", 0, 1, "Islamists kidnap a pastor and torture him for two days."], ["2011.06.11", "Afghanistan", "Kandahar", 15, 1, "Eight children and four women are among those ripped apart by a Taliban bombing of their minivan."], ["2011.06.11", "Afghanistan", "Khost", 3, 8, "A 12-year-old boy is among three people murdered by a Fedayeen suicide bomber."], ["2011.06.11", "Indonesia", "East Java", 0, 1, "A young woman is kidnapped by Islamic hardliners on her way home from church, beaten, slashed, and held for two days."], ["2011.06.11", "Iraq", "Abu Ghraib", 2, 0, "Sunni militants shoot one civilian to death and behead another."], ["2011.06.11", "Iraq", "Al-Dour", 5, 0, "A teacher's family of five, including three children, are brutally slain in an overnight sectarian home invasion."], ["2011.06.11", "Iraq", "Mosul", 18, 47, "Eighteen innocents lose their lives to two Mujahid car bombers."], ["2011.06.11", "Iraq", "Samarra", 4, 0, "Four brothers are executed in cold blood by al-Qaeda."], ["2011.06.11", "Pakistan", "Khyber", 39, 88, "Nearly forty shoppers and vendors are obliterated by two terror blasts at a market."], ["2011.06.12", "India", "Chikkaballapur", 2, 0, "Two young Hindu students are kidnapped and brutally stabbed to death by the Student Islamic Movement of India."], ["2011.06.12", "Iraq", "Baghdad", 3, 14, "Jihadis take out three soccer-playing youth with two roadside bombs."], ["2011.06.12", "Iraq", "Baqubah", 3, 4, "Three Iraqis are taken out by Jihadi gunmen at a checkpoint."], ["2011.06.12", "Iraq", "Hillah", 2, 0, "A man and his wife are shot to death by Religion of Peace terrorists."], ["2011.06.12", "Yemen", "Zinjibar", 3, 5, "al-Qaeda militants attack a checkpoint and kill four defenders."], ["2011.06.13", "Iraq", "Baaj", 2, 0, "Two people are kidnapped and beheaded by sectarian terrorists."], ["2011.06.13", "Iraq", "Basra", 5, 29, "Five Iraqis are ripped to pieces by a suicide bomber."], ["2011.06.13", "Nigeria", "Bulunkutu", 4, 0, "Four drinkers at a beer garden are taken out by religious radicals."], ["2011.06.13", "Pakistan", "Islamabad", 1, 3, "A suicide bomber kills a guard at a bank."], ["2011.06.13", "Pakistan", "South Waziristan", 4, 8, "Four local cops are cut down in separate attacks by radical Sunnis."], ["2011.06.14", "Dagestan", "Mikheyevka", 1, 0, "Islamic extremists shoot dead a rival imam at his mosque."], ["2011.06.14", "Iraq", "Baqubah", 8, 27, "Eight people are killed in a multi-pronged Fedayeen assault on government office building."], ["2011.06.14", "Iraq", "Dujail", 4, 1, "Four family members are killed in their own home by sectarian Jihadis."], ["2011.06.14", "Sudan", "South Kordofan", 2, 5, "At least two church workers are killed when the Islamic republic bombs a village."], ["2011.06.15", "Afghanistan", "Mahmud Raqi", 7, 4, "A Shahid car bomber detonates himself along a city street, leaving seven innocents dead."], ["2011.06.15", "Afghanistan", "Paktia", 3, 0, "A 13-year-old boy is among three others sent to Allah by a suicide bomber."], ["2011.06.15", "India", "Shopian", 1, 0, "Mujahideen gunmen take out a local youth."], ["2011.06.15", "Iraq", "Mussayab", 1, 6, "Terrorists plant a bomb at a marketplace, killing a patron."], ["2011.06.15", "Somalia", "Mataban", 15, 24, "Fifteen people are killed in a sectarian clash between Sufis and Sunnis."], ["2011.06.15", "Yemen", "Houta", 3, 2, "al-Qaeda militants assault a village, killing at least three defenders."], ["2011.06.16", "Afghanistan", "Maruf", 4, 0, "Three women are among four members of a family murdered by Taliban bombers."], ["2011.06.16", "Iraq", "Hilla", 3, 0, "A suspected al-Qaeda home invasion leaves three people dead."], ["2011.06.16", "Nigeria", "Abuja", 2, 0, "A suicide bomber at a police station kills two officers."], ["2011.06.16", "Nigeria", "Damboa", 4, 1, "Four children leaving a church are brutally taken out by a Boko Haram blast."], ["2011.06.16", "Pakistan", "Bajaur", 6, 27, "Two women are among six people murdered when the Taliban storm a village."], ["2011.06.16", "Pakistan", "Quetta", 1, 0, "Sunnis shoot a Shia to death as he is riding a motorcycle."], ["2011.06.16", "Thailand", "Pattani", 4, 2, "Four local soldiers are slain by an Islamist ambush near a market."], ["2011.06.17", "Afghanistan", "Sirkanay", 4, 0, "Four children are killed when Pakistani militants fire a rocket across the border."], ["2011.06.17", "Iraq", "Baghdad", 3, 8, "Jihadis set off a blast in a Shiite neighborhood, ending the lives of three residents."], ["2011.06.17", "Pakistan", "Bara", 1, 0, "Islamists abduct and slit the throat of a telephone company employee."], ["2011.06.17", "Pakistan", "Quetta", 1, 0, "Talibanis open fire on a fuel tanker, killing the driver."], ["2011.06.17", "Pakistan", "Tirah", 3, 2, "Three women are killed, and two children injured, when Islamic militants shell their home."], ["2011.06.18", "Afghanistan", "Ander", 4, 2, "Four private security guards are blown to bits by Taliban bombers."], ["2011.06.18", "Afghanistan", "Kabul", 9, 12, "Five civilians are among nine dead when several suicide bombers attack a police station."], ["2011.06.18", "Iraq", "Baghdad", 2, 0, "A grocer and a city worker are gunned down in separate terror attacks."], ["2011.06.18", "Iraq", "Baqubah", 3, 2, "Three Iraqis are taken apart by Jihadi bombers."], ["2011.06.18", "Pakistan", "Quetta", 4, 28, "Two children are among four dismantled by Lashkar bombers."], ["2011.06.18", "Somalia", "Daynile", 2, 0, "Two young men are publicly executed by al-Shabaab Islamists."], ["2011.06.19", "Afghanistan", "Kunduz", 3, 11, "A Shahid suicide bomber sends three Afghan civilians to Allah."], ["2011.06.19", "Iraq", "Kirkuk", 1, 0, "al-Qaeda gunmen murder an Iraqi."], ["2011.06.19", "Iraq", "Mosul", 1, 0, "Mujahideen gun down a teenager outside his home."], ["2011.06.19", "Nigeria", "Maiduguri", 2, 5, "Boko Haram Islamists fire indiscriminately into a group of poker players, killing two."], ["2011.06.19", "Pakistan", "Hayatabad", 2, 4, "A 12-year-old girl and a woman are murdered in their home by Islamic militants."], ["2011.06.19", "Yemen", "Zinjibar", 7, 21, "A group calling itself 'Supporters of Sharia' kills seven government soldiers over the course of two days."], ["2011.06.20", "Dagestan", "Makhachkala", 2, 0, "Two men are shot to death by Islamic militants."], ["2011.06.20", "Iraq", "Baghdad", 2, 8, "A terrorist blast takes down two civilians."], ["2011.06.20", "Iraq", "Mosul", 2, 3, "Two boys are blown to bits in a bombing attack on their family vehicle."], ["2011.06.20", "Nigeria", "Kankara", 7, 0, "Seven people are gunned down at a local bank by 'robbers' chanting Islamic slogans."], ["2011.06.20", "Nigeria", "Maiduguri", 1, 0, "A local cop is stalked and murdered by Boko Haram gunmen."], ["2011.06.20", "Pakistan", "Masood", 6, 4, "A child is among six people killed when religious extremists roll hand grenades into two family homes."], ["2011.06.20", "Pakistan", "Matni", 4, 5, "Four people are cut to pieces by a suicide bomb attack on a house hosting a peace committee."], ["2011.06.20", "Thailand", "Pattani", 2, 0, "A Buddhist is among two killed in separate Muslim sniper attacks."], ["2011.06.20", "Thailand", "Pattani", 2, 0, "Two off-duty cops are murdered on their way to work by Islamic militants."], ["2011.06.20", "Thailand", "Yala", 1, 1, "Islamists murder a 55-year-old Buddhist outside a wedding reception - also severely injuring his wife."], ["2011.06.21", "Afghanistan", "Charikar", 2, 2, "A woman is among two people who bleed to death from shrapnel injuries following a Shahid suicide blast."], ["2011.06.21", "Iraq", "Diwaniya", 27, 57, "A Holy Warrior earns his spot in heaven with a suicide attack that leaves over two dozen Iraqis dead."], ["2011.06.21", "Iraq", "Mansouriya", 1, 0, "Terrorists bomb a bus, killing a passenger."], ["2011.06.21", "Iraq", "Mussayab", 5, 9, "A coffee shop is the target of a Sunni bomb blast that sends five souls to Allah."], ["2011.06.21", "Pakistan", "Lahore", 1, 0, "A Christian father of four who worked as a garbage collector is stabbed to death by an angry Muslim."], ["2011.06.21", "Somalia", "Mogadishu", 4, 6, "Four civilians in a minivan are pulverized by a Religion of Peace bomb blast."], ["2011.06.21", "Thailand", "Narathiwat", 1, 0, "Muslims lay out a 48-year-old cook with a pair of shotgun blasts."], ["2011.06.22", "Afghanistan", "Ghazni", 4, 0, "Four local cops are blown up by a Taliban roadside bomb while rushing to help their own caught in an ambush."], ["2011.06.22", "Afghanistan", "Ghazni", 8, 0, "Eight police officers are slain in an ambush after being betrayed by a fundamentalist in uniform."], ["2011.06.22", "Iraq", "Baghdad", 13, 43, "Thirteen Iraqis are brought down by a series of Mujahideen attacks."], ["2011.06.22", "Pakistan", "Hangu", 2, 5, "Two people riding in a van are shot to death in a suspected sectarian attack."], ["2011.06.22", "Pakistan", "Quetta", 4, 11, "Sunni gunmen fire into a bus carrying Shia pilgrims, killing four."], ["2011.06.22", "Thailand", "Yala", 1, 0, "A 37-year-old Buddhist is shot in the head by Muslim militants while riding to work."], ["2011.06.23", "Afghanistan", "Dhaddar", 2, 0, "Two civilians are shot to death by religious hardliners."], ["2011.06.23", "Algeria", "Kabylie", 1, 1, "Fundamentalists kill a local soldier with a bomb."], ["2011.06.23", "Iraq", "Baghdad", 6, 6, "Six Iraqis are torn to shreds by a Mujahideen bomb blast."], ["2011.06.23", "Iraq", "Baghdad", 35, 95, "Almost three dozen shoppers are massacred by a brutal triple bombing at a Baghdad market."], ["2011.06.23", "Pakistan", "Mastung", 3, 4, "Suspected fundamentalists toss a grenade into a drug den, killing three."], ["2011.06.24", "Afghanistan", "Kunduz", 6, 22, "Islamists detonate a bicycle bomb at a market, killing six patrons."], ["2011.06.24", "Iraq", "Tikrit", 2, 0, "A police officer and his wife are murdered in their home by 'insurgents'."], ["2011.06.24", "Sri Lanka", "Kattankudi", 0, 2, "A group of radical Islamists severely beat two teen girls for hours over allegations that they watched pornography."], ["2011.06.24", "Thailand", "Narathiwat", 2, 13, "Two Buddhist road construction workers are blown to bits by Muslim 'insurgents'."], ["2011.06.24", "Thailand", "Yala", 1, 0, "A 35-year-old man is shot in the head by Religion of Peace gunmen."], ["2011.06.24", "Yemen", "Aden", 3, 10, "Three security personnel are killed by an al-Qaeda car bomb blast."], ["2011.06.25", "Afghanistan", "Logar", 38, 53, "A huge car bomb at a hospital ends the lives of at least three dozen innocents and de-limbs many others."], ["2011.06.25", "Iraq", "Abu Ghraib", 2, 0, "Islamists shoot a councilman and his nephew to death in their home."], ["2011.06.25", "Pakistan", "Kolachi", 10, 5, "Ten defenders are killed when two suicide bombers attack a police station."], ["2011.06.25", "Pakistan", "Pak Colony", 4, 0, "Members of a religious party are thought responsible for the horrific torture and murder of four youth."], ["2011.06.25", "Philippines", "Isabela City", 2, 8, "Muslim militants are suspected of detonating a bomb outside a Catholic church that leaves two people dead."], ["2011.06.26", "Afghanistan", "Char Chino", 1, 0, "The Taliban detonate an 8-year-old girl near a checkpoint."], ["2011.06.26", "Algeria", "Legata", 2, 5, "Islamists hide a bomb in a phone book that kills two people."], ["2011.06.26", "Egypt", "Awlad Khalaf", 0, 3, "Three Christians are injured when a Muslim mob torches eight homes on a rumor that one was to become a church."], ["2011.06.26", "Iraq", "Mosul", 6, 4, "Mujahid car bombers successfully kill six Iraqis."], ["2011.06.26", "Iraq", "Riyadh", 2, 5, "Two people are taken out by Islamic bombers."], ["2011.06.26", "Iraq", "Tarmiya", 3, 18, "A suicide bomber hides his weapon in a wheelchair.  Three others are killed."], ["2011.06.26", "Italy", "Padua", 1, 0, "A Moroccan immigrant kills his wife for becoming 'too Western'.  Others support his right to 'stone the adulteress'."], ["2011.06.26", "Nigeria", "Maiduguri", 30, 25, "Islamists massacre about thirty patrons at a tavern serving alcohol by tossing in bombs and firing into the building."], ["2011.06.26", "Senegal", "Dakar", 0, 24, "About two dozen Christians are severely injured when a Muslim mob sets fire to their church during a service under orders from a local imam."], ["2011.06.26", "Sudan", "Meiram", 1, 4, "Arab militiamen attack a train carrying Southerners, killing one."], ["2011.06.27", "Afghanistan", "Ghazni", 7, 0, "Two children and a woman are among seven civilians torn apart by two Taliban roadside blasts."], ["2011.06.27", "India", "Ganderbal", 1, 0, "A civilian is gunned down by Mujahideen."], ["2011.06.27", "Iraq", "Bazawia", 3, 4, "Three Iraqis are murdered by an 'insurgent' bomb blast."], ["2011.06.27", "Iraq", "Jabalah", 1, 7, "Sunni bombers take out one mourner at a Shia funeral."], ["2011.06.27", "Nigeria", "Maiduguri", 2, 3, "Two young girls are blown to bits by Islamic bombers."], ["2011.06.27", "Pakistan", "Darra Adamkhel", 2, 0, "A woman is among two killed when Islamic militants send a shell into a home."], ["2011.06.27", "Pakistan", "Dera Ismail Khan", 12, 20, "A dozen police are taken hostage and then slaughtered by a husband and wife suicide team."], ["2011.06.28", "Afghanistan", "Kabul", 11, 50, "At least eleven innocents lose their lives to a coordinated Fedayeen attack on their luxury hotel."], ["2011.06.28", "Afghanistan", "Panjwai", 2, 1, "Two women are killed, and a child injured, by Taliban roadside bombers."], ["2011.06.28", "Iraq", "Mosul", 1, 0, "Sunnis gun down a young student for belonging to the Shabak religious minority."], ["2011.06.28", "Iraq", "Mosul", 3, 2, "Terrorists kill two Iraqis with a bomb attack."], ["2011.06.28", "Pakistan", "Peshawar", 1, 2, "Islamists shoot a rival as he is on his way to a funeral."], ["2011.06.28", "Pakistan", "Upper Dir", 1, 3, "Hardliners fire a shell into a family home, killing a boy and seriously injuring a woman."], ["2011.06.28", "Somalia", "Mogadishu", 2, 4, "Two Somalis die from shrapnel injuries following an al-Shabaab bomb blast."], ["2011.06.28", "Tunisia", "Tunis", 0, 2, "Islamic fundamentalists attack a group of lawyers over a film festival showing unIslamic material."], ["2011.06.29", "India", "Srinagar", 1, 0, "Mujahideen gun down a local cop."], ["2011.06.29", "Pakistan", "Rawalpindi", 2, 0, "Two abductees are executed in captivity by al-Qaeda."], ["2011.06.29", "Yemen", "Zinjibar", 26, 16, "al-Qaeda fighters assault a stadium, killing at least twenty-six guards."], ["2011.06.30", "Afghanistan", "Lashkar Gah", 6, 0, "A mother, father and four children are torn to pieces by a bomb planted by Islamic extremists."], ["2011.06.30", "Afghanistan", "Nimroz", 20, 36, "Twenty civilians riding on a passenger bus are ripped to shreds by a Taliban bomb."], ["2011.06.30", "Indonesia", "Bima", 1, 1, "A madrassah student stabs a police officer to death for being an \"enemy of Islam.\""], ["2011.06.30", "Pakistan", "Karachi", 3, 12, "Three people, including a woman, are killed when religious groups clash over a sectarian issue."], ["2011.06.30", "Pakistan", "Peshawar", 2, 13, "Two people bleed to death after Islamists detonate a car bomb outside a hotel."], ["2011.06.30", "Yemen", "Abyan", 6, 17, "A half-dozen civilians are killed during an al-Qaeda assault."], ["2011.07.01", "Afghanistan", "Maruf", 6, 6, "Islamists blow up two people riding a donkey and then two more rushing to their aid."], ["2011.07.01", "Algeria", "Nacira", 1, 2, "Fundamentalists kill one Algerian with a planted bomb."], ["2011.07.01", "Pakistan", "Karachi", 7, 7, "A second day of clashes between two religious groups leaves seven more dead."], ["2011.07.01", "Pakistan", "Peshawar", 2, 0, "Two civilians are abducted and executed by Islamic militants."], ["2011.07.01", "Philippines", "Maguindanao", 1, 0, "Muslim rebels are suspected of aerating a local mosque caretaker with shrapnel."], ["2011.07.02", "Nigeria", "Maiduguri", 9, 0, "Boko Haram go house to house, shooting victims.  At least nine die."], ["2011.07.02", "Sudan", "Pariang", 3, 17, "The Islamic Republic bombs a village in the south, killing three civilians."], ["2011.07.03", "Afghanistan", "Logar", 19, 0, "Nineteen road construction laborers are machine-gunned by the Taliban."], ["2011.07.03", "Afghanistan", "Maimana", 0, 17, "A terrorist on a motorbike tosses a grenade at a school, injuring seventeen children."], ["2011.07.03", "Afghanistan", "Zabul", 13, 33, "Four women and two children are among thirteen cut to shreds by a Taliban bomb blast."], ["2011.07.03", "Algeria", "Chebilia", 0, 24, "Dozens of innocent people, including children, choke on smoke or are beaten by fundamentalists who attack an apartment building suspected of housing prostitutes."], ["2011.07.03", "India", "Mubarikpur", 1, 1, "A young couple is dragged out of a mosque and beaten by their enraged families.  The woman dies."], ["2011.07.03", "India", "Saharanpur", 2, 0, "Two sisters are shot to death by their brother on suspicion of immoral activities."], ["2011.07.03", "Iraq", "Rutba", 10, 1, "Ten Iraqi cops are killed in separate terror attacks."], ["2011.07.03", "Nigeria", "Maiduguri", 10, 13, "Thirteen people at a tavern are sent to Allah by Islamist bombers."], ["2011.07.03", "Pakistan", "Lindhi", 1, 13, "One person is killed during a violent dispute between two group of members over control of a mosque."], ["2011.07.03", "Pakistan", "Pakhtunkhwa", 1, 3, "One person is killed in two attacks by fundamentalists, one on the house of a faith healer."], ["2011.07.03", "Pakistan", "Shangla", 3, 1, "Three defenders are killed when Muslim radicals attack a police post."], ["2011.07.03", "Pakistan", "Sindh", 1, 0, "An imam is murdered in a sectarian attack."], ["2011.07.03", "Yemen", "Zinjibar", 10, 24, "Ten local soldiers are killed during an al-Qaeda ambush."], ["2011.07.04", "Afghanistan", "Helmand", 1, 0, "A British soldier is snatched by the Taliban and murdered in captivity."], ["2011.07.04", "Algeria", "Kabylie", 1, 1, "Armed fundamentalists fire on two traffic cops, killing one."], ["2011.07.04", "Iraq", "Baghdad", 26, 9, "Over two dozen Iraqis are taken down by Mujahid in various attacks around the country."], ["2011.07.04", "Pakistan", "Mamond", 1, 1, "Sunni militants attack a checkpoint, killing a local soldier."], ["2011.07.05", "Iraq", "Kirkuk", 3, 0, "Three Iraqis are gunned down by al-Qaeda."], ["2011.07.05", "Iraq", "Taji", 35, 54, "Two Fedayeen suicide bombers blast three dozen Iraqis to bits as the victims are waiting in line for ID cards."], ["2011.07.05", "Nigeria", "Maiduguri", 2, 0, "Two local cops are shot to death by Boko Haram cadres."], ["2011.07.05", "Pakistan", "Karachi", 2, 0, "Two people are kidnapped and beheaded by sectarian rivals."], ["2011.07.05", "Pakistan", "Mamond", 1, 0, "Hardliners send a peace committee member to Allah by planting a bomb outside his house."], ["2011.07.05", "Pakistan", "Miranshah", 3, 14, "Islamists kill three security personnel with a landmine attack."], ["2011.07.05", "Pakistan", "Quetta", 9, 20, "The Taliban is suspected of staging three attacks on local security personnel that leaves nine dead."], ["2011.07.06", "Afghanistan", "Kamdesh", 38, 7, "Women are among three dozen Afghans who lose their lives to a vicious Taliban assault on two police posts."], ["2011.07.06", "Dagestan", "Makhachkala", 3, 6, "Two civilians are among three killed when Islamic snipers fire on a police vehicle."], ["2011.07.06", "India", "Sopore", 1, 6, "Islamists set off a bomb outside a police station, killing an officer."], ["2011.07.06", "Iraq", "Baqubah", 2, 19, "A Shahid suicide bomber takes out two Iraqis."], ["2011.07.06", "Pakistan", "Karachi", 10, 20, "Sectarian Jihadis pump machine-gun fire into a couple of buses, ending the lives of ten innocents."], ["2011.07.06", "Yemen", "Loder", 10, 0, "al-Qaeda militants ambush and execute ten local soldiers in cold blood."], ["2011.07.07", "Iraq", "Baqubah", 1, 1, "An Islamic drive-by shooting in front of their house leaves a woman dead and her husband injured."], ["2011.07.07", "Iraq", "Fallujah", 3, 6, "Mujahideen take down three civilians with a car bomb."], ["2011.07.08", "Iraq", "Jurf al-Sakhar", 2, 0, "Two civilians are killed by suspected al-Qaeda gunmen."], ["2011.07.09", "Dagestan", "Karamakhi", 1, 0, "A moderate cleric is gunned down during evening prayer by radicals."], ["2011.07.09", "Dagestan", "Sovetskoye", 1, 0, "A school principal is labeled an \"adversary of Islam\" and murdered for opposing hijabs in school."], ["2011.07.09", "Iraq", "Baqubah", 2, 17, "Planted bombs leave two Iraqis dead."], ["2011.07.09", "Pakistan", "Jawakai", 5, 11, "Islamic militants fire on civilian vehicles, killing five passengers including a father and son."], ["2011.07.09", "Pakistan", "Mastung", 1, 0, "A truck driver is murdered by Talibanis."], ["2011.07.09", "Thailand", "Yala", 1, 0, "A 47-year-old schoolteacher is shot to death by Islamic 'insurgents'."], ["2011.07.10", "Nigeria", "Suleija", 3, 0, "At least two women are among three Christians killed by a Boko Haram bomb detonated outside a church."], ["2011.07.10", "Pakistan", "Karachi", 2, 0, "A youth and woman are kidnapped and tortured to death by suspected sectarian rivals."], ["2011.07.10", "Pakistan", "Peshawar", 2, 4, "Two policemen are killed by Taliban bombers."], ["2011.07.10", "Pakistan", "Quetta", 3, 0, "Three Shias are gunned down by Sunni extremists."], ["2011.07.11", "Indonesia", "West Nusa Tenggara", 0, 0, "A bomb explodes at an Islamic boarding school, apparently killing the trainer."], ["2011.07.11", "Iraq", "Rutba", 3, 0, "A Sunni imam and his two brothers are beheaded by Religion of Peace rivals."], ["2011.07.11", "Nigeria", "Maiduguri", 3, 0, "Hardliners detonate a bomb under a van, killing three occupants."], ["2011.07.11", "Pakistan", "Bara", 1, 2, "Muslim militants roll a hand grenade into a house, killing at least one occupant."], ["2011.07.11", "Pakistan", "Battagram", 7, 19, "Children are among seven people disassembled by a Shahid suicide bomber at a political rally."], ["2011.07.11", "Pakistan", "Khyber", 2, 0, "Two men are killed when Islamists riddle their car with bullets."], ["2011.07.11", "Pakistan", "Quetta", 2, 0, "Two truck drivers are murdered by Taliban snipers."], ["2011.07.11", "Thailand", "Narathiwat", 2, 0, "Husband and wife laborers are brutally shot to death in their car by Muslim 'insurgents.'"], ["2011.07.11", "Thailand", "Pattani", 1, 0, "A 62-year-old man is murdered by Muslim terrorists while on a cigarette run."], ["2011.07.11", "Thailand", "Pattani", 1, 0, "A teacher is gunned down by Islamic 'insurgents' while drinking tea at a shop."], ["2011.07.12", "Afghanistan", "Kandahar", 1, 0, "The Taliban take credit for the assassination of the president's brother by a trusted bodyguard."], ["2011.07.12", "Iraq", "Abu Ghraib", 2, 4, "A Fedayeen suicide bomber takes out two Iraqis."], ["2011.07.12", "Iraq", "Karbalah", 2, 19, "Terror blasts at two gas stations leaves two dead."], ["2011.07.12", "Pakistan", "Bajaur", 2, 9, "Women and children are among the casualties when radicals send a shell into a family home."], ["2011.07.13", "Afghanistan", "Tagab", 6, 7, "Five French soldiers guarding a local council meeting are among six killed by a Shahid suicide bomber."], ["2011.07.13", "India", "Mumbai", 26, 126, "An opera house and two other commercial areas are targeted by Religion of Peace bombers.  Twenty-six are killed and over a hundred more maimed."], ["2011.07.13", "Iraq", "Mosul", 3, 1, "A woman and taxi driver are killed in separate bomb attacks while Mujahideen also gun down a farmer."], ["2011.07.13", "Thailand", "Pattani", 2, 0, "Two Buddhist brothers working as construction workers are brutally murdered by Muslim gunmen."], ["2011.07.14", "Afghanistan", "Kandahar", 6, 15, "A suicide bomber detonates at a memorial service at a mosque, killing six mourners, including a child."], ["2011.07.14", "Iraq", "Kirkuk", 1, 0, "Sunni gunmen murder a civilian outside his home."], ["2011.07.14", "Pakistan", "Chaman", 4, 9, "Three children are among four killed when a hidden cache of terrorist explosives detonates near their home."], ["2011.07.14", "Pakistan", "Zengara", 3, 3, "Islamists execute a person for stealing and blow up two security personnel in a separate attack."], ["2011.07.15", "Iran", "Tehran", 1, 0, "A prominent athlete is stabbed to death after 'insulting' the country's religious leader."], ["2011.07.15", "Iraq", "Karbalah", 6, 20, "Women are among six Shiite pilgrims sent to Allah by Sunni bombers."], ["2011.07.15", "Thailand", "Pattani", 1, 2, "'Insurgents' shoot a Buddhist teen to death in front of his mother at a supermarket."], ["2011.07.16", "Afghanistan", "Lashkar Gah", 1, 0, "A NATO soldier is shot in the back by a terrorist in an Afghan uniform."], ["2011.07.16", "Afghanistan", "Sangin", 5, 1, "Two children are blown to bits in their mini-bus along with three members of the family by religious hardliners."], ["2011.07.16", "Algeria", "Bordi Menaiel", 4, 15, "A pair of al-Qaeda suicide bombers kill four people, including rescue personnel rushing to help victims of the first blast."], ["2011.07.16", "Dagestan", "Gedzhukh", 1, 0, "A village head dies from injuries suffered from a Muslim shooting attack."], ["2011.07.16", "Dagestan", "Makhachkala", 0, 2, "Two moderate imams are seriously injured by their radical co-religionists."], ["2011.07.16", "Iraq", "Baghdad", 2, 8, "Mujahid bombers take out two Iraqis riding a bus."], ["2011.07.16", "Iraq", "Karbalah", 2, 26, "Sunni motorcycle bombers murder two Shia pilgrims."], ["2011.07.16", "Pakistan", "Boshehra", 11, 0, "Three women and a baby are among ten Sunnis shot at point blank range while sitting in a family van by suspected Shias."], ["2011.07.16", "Pakistan", "Peshawar", 3, 16, "Taliban militants incinerate three workers in the process of blowing up an oil tanker."], ["2011.07.17", "Afghanistan", "Baghlani Jadid", 2, 7, "Islamic militants open fire on a wedding party, killing two guests."], ["2011.07.17", "Afghanistan", "Kabul", 2, 0, "Taliban terrorists break into a home and shoot two people to death."], ["2011.07.17", "Iraq", "Mosul", 3, 0, "A woman is among three people machine-gunned to death at a police checkpoint."], ["2011.07.17", "Iraq", "Mosul", 3, 0, "Mujahideen murder a man, his wife, and their child with grenade shrapnel."], ["2011.07.17", "Pakistan", "Mann Talab", 1, 0, "A peace committee volunteer is tied to the back of a car and dragged to death by Lashkar-e-Islam."], ["2011.07.17", "Thailand", "Yala", 3, 0, "'Insurgents' pull up in a truck and open fire at point blank range on three vendors waiting to buy materials, killing all three."], ["2011.07.18", "Afghanistan", "Farah", 2, 0, "The Taliban send the beheaded bodies of two hostages to their families."], ["2011.07.18", "Afghanistan", "Lashkar Gah", 7, 0, "Seven local cops are poisoned by a Taliban operative in uniform and then shot point-blank while immobilized."], ["2011.07.18", "Afghanistan", "Registan", 4, 0, "Four police officers are murdered by Religion of Peace bombers."], ["2011.07.18", "Chechnya", "Vedono", 2, 7, "Two Russians are blown to bits by Jihadi bombers."], ["2011.07.18", "China", "Xingjian", 4, 1, "Muslim separatists, chanting 'Allah is the only god', attack a police station, hack two officers to death and two murder two others, including a woman and a teenage girl."], ["2011.07.18", "Pakistan", "Upper Dir", 16, 0, "Video surfaces of sixteen police hostages brutally executed for \"having left Islam.\""], ["2011.07.18", "Thailand", "Pattani", 1, 0, "A 64-year-old man is gunned down by 'insurgents' in front of his wife."], ["2011.07.19", "Ghana", "Yamata", 1, 0, "Calling the child \"haram\", a devout Muslim woman strangles a baby to death after finding out that it is illegitimate"], ["2011.07.19", "Pakistan", "Charkhel", 2, 0, "Religious radicals kill two hostages, burning a student and shooting the other civilian to death."], ["2011.07.19", "Pakistan", "Karachi", 1, 0, "A shopkeeper is killed when two religious groups shoot at each other following a funeral."], ["2011.07.19", "Pakistan", "Landi Kotal", 0, 9, "Islamic militants lob mortars into a town, injuring nine children playing cricket."], ["2011.07.19", "Somalia", "Mogadishu", 1, 2, "A guard loses his life to a Mujahid attack on the president's villa."], ["2011.07.19", "Thailand", "Pattani", 2, 2, "Islamists bomb a group of men trying to protect teachers, killing two of the guards."], ["2011.07.19", "Thailand", "Yala", 1, 15, "Sixteen Thais are injured when terrorists set off a motorcycle bomb next to a school. One later dies of injuries."], ["2011.07.20", "Afghanistan", "Kandahar", 3, 0, "Mujahideen attack a government building, killing at least three guards."], ["2011.07.20", "Iraq", "Zarkush", 2, 1, "Two Iraqis are dismantled by a roadside bomb."], ["2011.07.20", "Yemen", "Aden", 1, 0, "A British businessman is killed in a targeted car bombing."], ["2011.07.21", "India", "Alwar", 1, 0, "A Hindu girl is gang-raped and murdered by a Muslim gang."], ["2011.07.21", "Iraq", "Riyadh", 1, 2, "A bomb intended for first responders to an earlier attack kills a civilian."], ["2011.07.22", "Afghanistan", "Greshk", 1, 0, "Religious fundamentalists kidnap and hang the 8-year-old son of a local policeman."], ["2011.07.22", "Canada", "Toronto, ON", 1, 0, "A woman is 'honor killed' by her husband for seeking her independence (strangled in front of her child)."], ["2011.07.22", "Dagestan", "Makhachkala", 2, 0, "Islamic radicals murder two \"non-believers\" in a shooting attack."], ["2011.07.22", "Iraq", "Baghdad", 2, 8, "Two people are killed by shrapnel when fundamentalists bomb a liquor store."], ["2011.07.22", "Iraq", "Baghdad", 3, 9, "A Jihadi bomb targeting medical responders leaves three people dead."], ["2011.07.22", "Iraq", "Baqubah", 4, 0, "Four policemen are assassinated at point-blank range by terrorists with silencers."], ["2011.07.22", "Pakistan", "Surjani", 1, 0, "A Shiite doctor is shot to death by Sipah-e-Sahaba Wahhabis."], ["2011.07.23", "Iraq", "Baqubah", 1, 7, "A civilian is murdered by a suicide car bomber."], ["2011.07.23", "Nigeria", "Maiduguri", 8, 28, "At least eight people are blown to bits by Boko Haram bombers at a market."], ["2011.07.23", "Pakistan", "Kohat", 1, 2, "An 8-year-old girl is taken apart by a mortar fired by Islamic militants at a village hosting a peace committee."], ["2011.07.24", "Afghanistan", "Kandahar", 1, 0, "A young local woman is brutally shot to death on grounds that she worked for a Western humanitarian organization."], ["2011.07.24", "India", "Sopore", 1, 0, "A civilian is shot to death outside his home by Islamic militants."], ["2011.07.24", "Indonesia", "Pandajaya", 0, 2, "Two tour buses carrying foreigners is fired on by Jihadi snipers, badly injuring the drivers"], ["2011.07.24", "Jordan", "Zarqa", 1, 0, "A 35-year-old woman is murdered by her brother for having sex outside of marriage."], ["2011.07.24", "Pakistan", "Chak Malai", 1, 7, "A Fedayeen bomber takes out a Pakistani at a checkpoint."], ["2011.07.24", "Pakistan", "Naushki", 5, 0, "Sectarian Jihadis open fire outside a mosque, taking down five laborers."], ["2011.07.24", "Pakistan", "North Waziristan", 1, 0, "The Taliban kidnap and execute an Afghan civilian."], ["2011.07.24", "Yemen", "Aden", 9, 21, "An al-Qaeda suicide car bomber sends nine local security personnel to Allah."], ["2011.07.25", "Afghanistan", "Helmand", 2, 0, "Two young boys, ages 9 and 13, are taken out by a Taliban landmine."], ["2011.07.25", "Egypt", "Samalout", 0, 6, "A pregnant woman is among six Christians brutally assaulted with iron rods by a Muslim mob angered over a church bell."], ["2011.07.25", "Iraq", "Kirkuk", 2, 22, "Two people bleed to death following a Mujahideen bomb blast at a restaurant."], ["2011.07.25", "Iraq", "Muqdadiya", 5, 12, "Terrorists plant a bomb near a hospital which leaves five dead, including a child."], ["2011.07.25", "Thailand", "Yala", 0, 7, "Teachers are the targets of a bomb attack by Muslim 'insurgents'."], ["2011.07.26", "Afghanistan", "Musazai", 2, 3, "Two locals are killed when Taliban extremists assault a police post."], ["2011.07.26", "Iraq", "Diyala", 6, 27, "Islamic terrorists invade an office building and shoot at least six people indiscriminately before fleeing."], ["2011.07.26", "Iraq", "Hawija", 2, 0, "A terrorist accidentally kills his own children with a premature car bomb blast."], ["2011.07.26", "Iraq", "Kirkuk", 2, 0, "A young boy and his father are murdered by suspected al-Qaeda."], ["2011.07.26", "Iraq", "Mosul", 3, 4, "A female Shiite doctor is among three Iraqis killed by sectarian Jihadis."], ["2011.07.26", "Pakistan", "Faisalabad", 6, 0, "A conservative Muslim father murders his six teenage daughters as punishment for illicit relationships."], ["2011.07.26", "Pakistan", "Mohmand", 1, 0, "A teenage shepherd loses his life to an Islamist landmine."], ["2011.07.26", "Thailand", "Yala", 1, 0, "Muslim 'insurgents' shoot a civilian to death in front of his 6-year-old daughter."], ["2011.07.27", "Afghanistan", "Kandahar", 2, 1, "A suicide bomber embraces his target as he detonates, killing one other victim as well."], ["2011.07.27", "Afghanistan", "Kunduz", 3, 4, "Three children are blown to bits by a Taliban rocket.  Four others are injured."], ["2011.07.27", "India", "Hyhama", 1, 2, "An Indian officer is killed while defending an infiltration attempt by Pakistani-backed militants"], ["2011.07.27", "Kenya", "Mandera", 1, 3, "al-Shabaab militants kill a local cop with a remote-controlled bomb."], ["2011.07.27", "Thailand", "Pattani", 2, 0, "Two guards are shot to death outside a singing competition."], ["2011.07.28", "Afghanistan", "Gereshk", 5, 2, "Five people are killed when Sunni radicals ambush a police vehicle with civilians."], ["2011.07.28", "Afghanistan", "Oruzgan", 19, 37, "Ten children and two women are among nineteen people slaughtered during a coordinated Taliban attack."], ["2011.07.28", "Dagestan", "Makhachkala", 1, 0, "A village chief is machine-gunned in his home by a Muslim 'insurgent'."], ["2011.07.28", "Dagestan", "Makhachkala", 2, 0, "An elderly couple is stabbed to death in their home by an Islamic terrorist."], ["2011.07.28", "India", "Sopore", 1, 0, "A civilian is shot to death by Islamic militants."], ["2011.07.28", "Iraq", "Baghdad", 1, 8, "Fundamentalists car bomb a liquor store, killing one."], ["2011.07.28", "Iraq", "Tikrit", 15, 38, "Two suicide bombers detonate amid a line of Iraqis waiting for paychecks, killing at least fifteen."], ["2011.07.28", "Pakistan", "Quetta", 1, 0, "A prayer leader is gunned down by Religion of Peace rivals."], ["2011.07.28", "Philippines", "Sulu", 7, 21, "Abu Sayyaf cadres kill and barbarically mutilate seven local soldiers."], ["2011.07.29", "Afghanistan", "Nahr-e-Saraj", 19, 3, "Women and children are among nineteen torn to shreds by a Taliban bomb attack on their minibus."], ["2011.07.29", "Egypt", "Minya", 2, 2, "Two Christians are taken out by snipers while riding in a car."], ["2011.07.29", "Pakistan", "Saryab", 7, 0, "Seven Shia pilgrims waiting at a bus stop are shot like ducks in a row by determined Sunnis."], ["2011.07.29", "Yemen", "Dofas", 6, 9, "An al-Qaeda ambush leave six dead."], ["2011.07.29", "Yemen", "Shaqra", 9, 20, "Nine tribesmen are forced into a building by al-Qaeda gunmen and killed."], ["2011.07.30", "Afghanistan", "Muqur", 10, 6, "Ten private security guards lose their lives to Taliban attackers shouting 'Allah Akbar'."], ["2011.07.30", "Egypt", "Al Arish", 5, 19, "Children are among the casualties when fundamentalists on motorbikes go on a shooting spree while shouting Islamic slogans."], ["2011.07.30", "India", "Kupwara", 3, 0, "Three more security personnel die during an attack by Pakistani-backed terrorists."], ["2011.07.30", "Iraq", "Taji", 2, 5, "Jihad bombers take down a pair of Iraqis."], ["2011.07.30", "Pakistan", "Quetta", 11, 3, "Lashkar-e-Jhangvi militants fire into a van carrying Shiite pilgrims, taking out eleven."], ["2011.07.31", "Afghanistan", "Lashkar Gah", 13, 12, "A 10-year-old boy is among those killed in a suicide car bomb attack claimed by Sunni radicals."], ["2011.07.31", "Algeria", "Tissemsilt", 3, 6, "Fundamentalists bomb a vehicle carrying local soldiers, killing three."], ["2011.07.31", "China", "Kashgar", 3, 0, "Three people are killed by a Muslim bomb blast in a downtown district."], ["2011.07.31", "China", "Kashgar", 6, 0, "Members of the East Turkistan Islamic Movement kill a restaurant owner and waiter, then hack four others to death."], ["2011.07.31", "China", "Kashgar", 8, 22, "Muslim radicals hijack a truck and ram it into a crowd of Han (non-Muslims), then begin a stabbing spree that leaves eight dead."], ["2011.07.31", "Iraq", "Baghdad", 2, 0, "An education official and his son are executed by Muslim 'insurgents'."], ["2011.07.31", "Pakistan", "Tank", 1, 0, "A tribal elder is assassinated at a market by religious extremists."], ["2011.07.31", "Somalia", "Mogadishu", 1, 0, "al-Shabaab gunmen assassinate a lawmaker outside a hotel."], ["2011.07.31", "Thailand", "Narathiwat", 1, 0, "A juice trader is shot to death at a market by Islamic terrorists."], ["2011.08.01", "Afghanistan", "Nimroz", 3, 3, "Three Afghans are dismantled by a Taliban roadside bomb."], ["2011.08.01", "Iraq", "Baghdad", 0, 1, "Terrorists wound two children with a sticky bomb."], ["2011.08.01", "Pakistan", "Atariwal", 1, 1, "A woman dies from injuries when Taliban militants fire a rocket into her home."], ["2011.08.01", "Pakistan", "Dera Ismail Khan", 1, 2, "A prayer leader is shot and killed by Religion of Peace rivals."], ["2011.08.01", "Pakistan", "Munda", 3, 0, "Three civilians are cut down by Mujahid gunmen while gathering wood."], ["2011.08.01", "Pakistan", "Quetta", 2, 3, "al-Qaeda militants are suspected of planting a bomb at a garbage dump that leaves two children dead."], ["2011.08.01", "Somalia", "Mogadishu", 2, 5, "Two African peacekeepers are blown to bits by a Fedayeen suicide bomber."], ["2011.08.02", "Afghanistan", "Kunduz", 4, 10, "Four are killed when Muslim extremists stage a Shahid attack on a guesthouse used by foreigners."], ["2011.08.02", "Dagestan", "Buynaksk", 2, 1, "An Islamist bomb attack leaves two dead."], ["2011.08.02", "Iraq", "Abu Ghraib", 2, 16, "A liquor store is among the targets of two separate bombings in which two people are killed."], ["2011.08.02", "Iraq", "Kirkuk", 0, 23, "Two dozen are injured when radicals bomb a Catholic church."], ["2011.08.02", "Pakistan", "South Waziristan", 4, 1, "Tehreek-e-Taliban militants kill four local soldiers in two ambushes."], ["2011.08.02", "Philippines", "Cotabato", 2, 9, "A 7-year-old child is among two killed by a Jemaah Islamiyah bomb blast."], ["2011.08.03", "Afghanistan", "Kandahar", 3, 0, "Sunni bomb makers take down a child and two others."], ["2011.08.03", "Iraq", "Baghdad", 1, 0, "Holy warriors stab an army officer to death in his home."], ["2011.08.03", "Iraq", "Ramadi", 9, 13, "A brutal double bomb attack in a commercial district leaves nine dead."], ["2011.08.03", "Iraq", "Rasala", 4, 14, "Four Iraqis are killed when fundamentalists bomb a liquor store."], ["2011.08.03", "Pakistan", "Darra Adamkhel", 1, 7, "One person is killed when Islamic militants send dozens of mortar shells into a village."], ["2011.08.03", "Somalia", "Sar-Kuusta", 4, 8, "Four people lose their lives to an al-Shabaab attack."], ["2011.08.03", "Thailand", "Pattani", 1, 0, "A Buddhist teacher is shot twice in the head by warriors of Islam."], ["2011.08.04", "Afghanistan", "Ghazni", 2, 0, "Two civilians bleed to death following a Taliban bomb attack."], ["2011.08.04", "Afghanistan", "Kunduz", 1, 3, "Three young girls are among the casualties of a Taliban car bomb."], ["2011.08.04", "Ingushetia", "Nazran", 2, 2, "Islamic militants shoot two police officers to death as they are sitting in their car."], ["2011.08.04", "Iraq", "Baghdad", 1, 13, "Holy Warriors take down a child with a car bomb."], ["2011.08.04", "Pakistan", "Kukikhel", 1, 0, "A passerby is caught in the cross-fire when two Islamist groups clash at a market."], ["2011.08.04", "Thailand", "Pattani", 2, 0, "Muslim terrorists are suspected of murdering a married couple driving home from their job as laborers."], ["2011.08.04", "Thailand", "Yala", 1, 0, "A 38-year-old man is shot to death by Jihadi gunmen."], ["2011.08.05", "Iraq", "Khalis", 3, 2, "A sectarian mortar attack leaves three Iraqis dead."], ["2011.08.05", "Pakistan", "Adezai", 1, 0, "Islamists drag an infidel out of a mosque and execute him."], ["2011.08.05", "Pakistan", "Drigh Road", 1, 0, "A Catholic man with children is the target of an attack that leaves his driver dead."], ["2011.08.05", "Thailand", "Pattani", 3, 1, "Three Buddhists are shot point blank by Muslim radicals."], ["2011.08.06", "Iraq", "Baghdad", 2, 0, "A shop owner and his son are shot to death by Islamic 'insurgents'."], ["2011.08.06", "Iraq", "Ramadi", 2, 7, "Terrorists target a sports stadium with coordinated blasts, killing two Iraqis."], ["2011.08.06", "Pakistan", "Karachi", 2, 0, "Two Shias are gunned down in separate sectarian attacks."], ["2011.08.06", "Pakistan", "Mohmand", 1, 0, "A suicide bomber kills an innocent person at a market."], ["2011.08.07", "Iraq", "Abu Ghraib", 2, 2, "A father and son are taken out by a Jihad bomb attack on their home."], ["2011.08.07", "Iraq", "Iskandariyah", 6, 14, "Two children are among six Shia family members bleeding to death following a bombing of their home."], ["2011.08.07", "Pakistan", "Shalobar", 2, 0, "Two tribesmen are executed by religious extremists."], ["2011.08.08", "Dagestan", "Karamakhi", 1, 0, "A local cop is gunned down by Islamists."], ["2011.08.08", "Egypt", "Minya", 1, 1, "A Christian farmer has his throat slit in front of his son by a Muslim mob, who attack Christian homes and also severely beat a pastor."], ["2011.08.08", "Iraq", "Mosul", 4, 1, "A child and woman are among the dead victims of two Jihad bombings."], ["2011.08.08", "Nigeria", "Maiduguri", 1, 0, "A teacher is shot to death by Boko Haram Islamists."], ["2011.08.08", "Nigeria", "Maiduguri", 1, 0, "Boko Haram cadres assassinate a prison comptroller."], ["2011.08.09", "Afghanistan", "Bala Bulok", 4, 0, "Four civilians are kidnapped and beheaded by Sunni hardliners."], ["2011.08.09", "Afghanistan", "Dehrawod", 5, 1, "Taliban bombers take down five Afghans at a crowded market."], ["2011.08.09", "Dagestan", "Kadar", 1, 0, "A policeman is murdered on the doorstep of his home by Islamic 'insurgents'."], ["2011.08.09", "Pakistan", "Manshera", 1, 0, "Islamic radicals shoot a tribesman to death."], ["2011.08.09", "Thailand", "Pattani", 1, 0, "A 52-year-old man is shot several times in the head and chest by 'insurgents'."], ["2011.08.10", "Pakistan", "Shadman", 1, 0, "The caretaker of a shrine is shot to death by Muslim terrorists."], ["2011.08.11", "Indonesia", "Malei", 1, 0, "A Christian is killed while trying to salvage items from his home after it is destroyed by a Muslim mob."], ["2011.08.11", "Iraq", "Ramadi", 3, 24, "'Insurgents' kill three Iraqis in their home with two bombs."], ["2011.08.11", "Nigeria", "Ratsa Foron", 6, 0, "Six Christians are hacked to death in the middle of the night by Muslim raiders."], ["2011.08.11", "Pakistan", "Chapperi", 2, 0, "Two tribesmen are shot to death by terrorists."], ["2011.08.11", "Pakistan", "Peshawar", 1, 20, "A female Shahid suicide bomber tosses grenades before detonating, killing another woman."], ["2011.08.11", "Pakistan", "Peshawar", 6, 17, "A child is among six innocents blown to bits by Islamist bombers."], ["2011.08.11", "Pakistan", "Tirah Valley", 5, 1, "Three women and two children are dismantled by a militant bomb attack on their home."], ["2011.08.12", "Afghanistan", "Wardak", 8, 0, "Eight local security personnel are abducted and murdered by Sunni fundamentalists."], ["2011.08.12", "Dagestan", "Khasavyurt", 2, 0, "Two policemen standing outside a mosque are murdered by angry Muslims."], ["2011.08.12", "Dagestan", "Kurush", 2, 0, "Two civilians are murdered by Muslim 'separatists' wielding machine-guns."], ["2011.08.12", "Indonesia", "Sepe", 5, 2, "Jihad warriors attack a Christian village with bombs and knives, killing at least five residents and burning homes and churches."], ["2011.08.12", "Iraq", "Baghdad", 2, 13, "Terrorists bomb a cafe, killing two Iraqis."], ["2011.08.12", "Nigeria", "Ngala", 1, 0, "A 65-year-old cleric is shot to death by Islamic radicals."], ["2011.08.12", "Pakistan", "Bilal", 0, 12, "A small group of Catholics are beaten by fundamentalists after gathering to watch a religious film."], ["2011.08.12", "Pakistan", "Haridasnagar", 1, 1, "A man is beaten to death after being accused of sorcery."], ["2011.08.12", "Pakistan", "Peshawar", 3, 3, "Three guards escorting prisoners for medical attention are cut down by Taliban gunmen."], ["2011.08.13", "Afghanistan", "Helmand", 5, 0, "Three women are among five civilians taken apart by a Taliban bomb."], ["2011.08.13", "Dagestan", "Boatshyurt", 4, 0, "Four victims of Muslim 'insurgents' are found bound and shot to death."], ["2011.08.13", "Dagestan", "Khasavyurt", 1, 1, "A fireman is shot to death by suspected Islamic militants."], ["2011.08.13", "Dagestan", "Makhachkala", 2, 0, "Suspected Islamists shoot two civilians to death in front of their home."], ["2011.08.13", "India", "Kerala", 1, 0, "A Hindu woman is kidnapped, gang-raped and killed by Muslim militants."], ["2011.08.13", "Iraq", "Baghdad", 1, 0, "A Shiite cleric is gunned down by Religion of Peace rivals."], ["2011.08.13", "Pakistan", "Lahore", 1, 0, "A grown woman is shot to death by her nephew on suspicion of 'illicit relations'."], ["2011.08.14", "Afghanistan", "Charikar", 22, 34, "Five Fedayeen stage a suicide assault on a government compound, shooting and blasting at least twenty-two others to death."], ["2011.08.14", "Algeria", "Tizi Ouzou", 0, 33, "'Thanks to Allah' an al-Qaeda suicide bomber injures at least thirty-three people, including foreigners."], ["2011.08.14", "Ingushetia", "Dattykh", 4, 7, "Four security personnel are executed by Muslim gunmen."], ["2011.08.14", "Iraq", "Baghdad", 8, 13, "Separate bombings targeting security personnel leave at least eight dead."], ["2011.08.14", "Pakistan", "Karachi", 0, 1, "A Christian is beaten with iron rods after declining an offer to embrace Islam."], ["2011.08.14", "Pakistan", "Karachi", 0, 2, "Two Christians are beaten to unconsciousness with iron rods after refusing an offer to embrace Islam."], ["2011.08.14", "Pakistan", "Miramshah", 3, 25, "Three local soldiers are killed when Islamic militants fire rockets into their camp during a celebration."], ["2011.08.14", "Thailand", "Pattani", 1, 0, "'Insurgents' shoot a man to death outside a mosque."], ["2011.08.15", "Afghanistan", "Spin Boldak", 4, 8, "Four guards at a fuel depot die during a Fedayeen assault."], ["2011.08.15", "Iraq", "Bani Sa'ad", 12, 33, "Sunni car bombers take down eight Shia.  Four other Iraqis are gunned down in a separate attack."], ["2011.08.15", "Iraq", "Karbala", 3, 41, "A Jihad car bomb leaves at least three dead."], ["2011.08.15", "Iraq", "Karbala", 3, 41, "Three Iraqis are taken down by Mujahid car bombers."], ["2011.08.15", "Iraq", "Kirkuk", 0, 14, "Fourteen are injured when Muslims bomb a church."], ["2011.08.15", "Iraq", "Kut", 42, 75, "Over three dozen shoppers at a market are snuffed out by al-Qaeda bombers.  The dead include twelve children."], ["2011.08.15", "Iraq", "Najaf", 11, 74, "Seven Shias are left dead after a brutal bombing by Sunni militants."], ["2011.08.15", "Iraq", "Tikrit", 6, 10, "Suicide bombers send six Iraqis to Allah."], ["2011.08.15", "Iraq", "Yusufiya", 7, 0, "al-Qaeda kidnap seven Sahwa members from a mosque and execute them in cold blood."], ["2011.08.15", "Nigeria", "Foron", 3, 0, "Three people are hacked to death by angry Muslims with machetes"], ["2011.08.15", "Nigeria", "Heipang", 9, 1, "Seven children are among a Christian family of nine brutally murdered in their home by Muslim raiders."], ["2011.08.15", "Nigeria", "Sokoto", 6, 0, "A half-dozen Nigerians are taken out by Boko Haram terrorists."], ["2011.08.15", "Yemen", "al-Jouf", 14, 5, "An al-Qaeda suicide attack leaves fourteen Shiite tribesmen dead."], ["2011.08.16", "Afghanistan", "Kandahar", 1, 0, "Fundamentalist gunmen murder an 18-year-old teenager as she is getting into her car."], ["2011.08.16", "Afghanistan", "Uruzgan", 8, 8, "Eight innocents are dismantled by a Taliban motorcycle bomb at a market."], ["2011.08.16", "Iraq", "Buhriz", 2, 0, "Two boys are shot to death in their own home by 'insurgents'."], ["2011.08.16", "Iraq", "Mosul", 8, 12, "Eight local police are murdered in two separate bombings."], ["2011.08.16", "Pakistan", "Karachi", 1, 0, "Nasabi-Wahhabi terrorists gun down a Shia shopkeeper."], ["2011.08.17", "Algeria", "Beni Aissa", 2, 1, "A bus driver is among two people who lose their lives to a fundamentalist ambush."], ["2011.08.17", "Iraq", "Baghdad", 2, 3, "Jihad gunmen kill a cafe owner and marketplace patron in separate attacks."], ["2011.08.17", "Iraq", "Tarmiya", 2, 7, "A suicide bomber takes down two family members in their own home."], ["2011.08.17", "Pakistan", "Chamarkand", 2, 0, "A man and his son are gunned down by Muslim terrorists."], ["2011.08.17", "Thailand", "Narathiwat", 3, 0, "A rubber tapper is among three civilians shot to death by Muslim gunmen in separate attacks."], ["2011.08.17", "Thailand", "Pattani", 1, 0, "An elderly Buddhist school bus driver is murdered by Islamic snipers."], ["2011.08.18", "Afghanistan", "Gardez", 2, 0, "A Shahid suicide bomber kills two guards trying to stop him."], ["2011.08.18", "Afghanistan", "Herat", 24, 9, "Seven children are among two dozen bus passengers torn to shreds by Taliban bombers."], ["2011.08.18", "Egypt", "Sinai", 6, 0, "Terrorists fire on Egyptian police, killing six."], ["2011.08.18", "Ingushetia", "Nazran", 1, 0, "Three Muslim extremists shoot a cop to death in his home."], ["2011.08.18", "Israel", "Eilat", 8, 30, "Eight Israelis, including four family members, die when Arab snipers open fire on buses and cars."], ["2011.08.18", "Pakistan", "Karachi", 3, 0, "Three people are kidnapped, executed and dumped outside a mosque in a suspected sectarian attack."], ["2011.08.18", "Pakistan", "Quetta", 1, 0, "A mosque official is gunned down by rivals."], ["2011.08.18", "Pakistan", "Tirah", 1, 0, "The Taliban behead a man for 'crimes against Islam'."], ["2011.08.19", "Afghanistan", "Kabul", 9, 16, "Two Holy Warriors detonate themselves in front of the British council, killing nine innocents."], ["2011.08.19", "Israel", "Ashdod", 0, 10, "Gaza militants send rockets into an Israeli seminary, injuring ten."], ["2011.08.19", "Pakistan", "Jamrud", 56, 123, "A devout Shahid detonates a ball-bearing packed suicide vest at a crowded mosque, slaughtering over fifty others."], ["2011.08.19", "Pakistan", "Kurram", 3, 3, "A Taliban landmine takes out three locals."], ["2011.08.19", "Somalia", "Mogadishu", 7, 0, "Seven youth are beheaded by al-Shabaab fundamentalists."], ["2011.08.19", "Thailand", "Pattani", 2, 0, "Two Buddhist mattress salesmen, father and son, are shot in the head by Muslim 'activists'."], ["2011.08.20", "Afghanistan", "Ghazni", 3, 2, "Religious extremists take out three civilians with a roadside bomb."], ["2011.08.20", "Afghanistan", "Herat", 2, 8, "Two Afghan security personnel are killed by fundamentalist bombers."], ["2011.08.20", "Afghanistan", "Kunar", 2, 0, "Two Afghan soldiers returning home leave are stoned, hanged and shot by the Taliban."], ["2011.08.20", "India", "Gurez", 1, 2, "A local defender loses his life to an attack by Pakistani-backed militants."], ["2011.08.20", "Iraq", "Hadid", 3, 0, "Three family members are killed by Mujahideen bombers."], ["2011.08.20", "Israel", "Beersheba", 1, 8, "Children are among the casualties when Hamas sends rockets into an Israeli town."], ["2011.08.20", "Nigeria", "Borno", 4, 0, "Islamists burst into a home and murder four people watching television."], ["2011.08.21", "Afghanistan", "Helmand", 1, 0, "Taliban gunmen assassinate a court official on his way to work."], ["2011.08.21", "Afghanistan", "Trekh Zaber", 1, 0, "Religious extremists murder a 60-year-old Afghan farmer in front of his sons."], ["2011.08.21", "Dagestan", "Makhachkala", 0, 17, "Children are among the casualties when Islamic 'separatists' set off two bombs at a grocery store."], ["2011.08.21", "Nigeria", "Bajju", 2, 3, "Suspected Muslim radicals shoot two Christians to death in their homes, including a 10-year-old boy."], ["2011.08.21", "Nigeria", "Riyom", 6, 0, "Fulani raiders attack a Christian village, hacking six to death, including women and children."], ["2011.08.21", "Pakistan", "South Waziristan", 3, 6, "Three defenders are killed during an assault by Islamic militants on their police post."], ["2011.08.21", "Thailand", "Yala", 1, 0, "Islamic gunmen murder a 23-year-old man outside a shop."], ["2011.08.21", "Yemen", "Arqoup", 9, 20, "Nine members of a tribal gathering are sent to Allah by a Shahid suicide bomber."], ["2011.08.21", "Yemen", "Moudia", 4, 0, "Four people are torn to pieces by an al-Qaeda suicide bomber with a ball-bearing packed belt."], ["2011.08.22", "Afghanistan", "Gereshk", 2, 4, "A child and a shop owner are successfully killed by Mujahideen bombers at a market."], ["2011.08.22", "India", "Handwara", 1, 1, "A housewife is killed when Muslim terrorists open fire on security forces at a village."], ["2011.08.22", "Iraq", "Baqubah", 2, 0, "A 3-year-old girl and her father are shot to death by Islamic 'insurgents' in their home."], ["2011.08.22", "Iraq", "Mosul", 4, 3, "A car-bombing and separate shooting attack leave four Iraqis dead, including a teenager."], ["2011.08.22", "Pakistan", "Khyber", 2, 0, "Tahreek-e-Taliban militants kidnap, bind and then shoot two rivals."], ["2011.08.22", "Thailand", "Narathiwat", 1, 0, "A man is shot to death by Muslim terrorists while working a rubber plantation."], ["2011.08.23", "Afghanistan", "Balkh", 2, 3, "Sunni radicals kill two cops with a roadside bomb."], ["2011.08.23", "Algeria", "Taouarga", 1, 2, "Fundamentalists machine-gun a local soldier to death at a checkpoint."], ["2011.08.23", "Nigeria", "Maiduguri", 1, 1, "Boko Haram gunmen shoot a woman 7-months pregnant to death in her home."], ["2011.08.23", "Pakistan", "Datta Khel", 1, 0, "The Taliban shoot a refugee to death."], ["2011.08.23", "Thailand", "Pattani", 2, 14, "Buddhist monks are among the casualties of two bombings that claim two lives."], ["2011.08.23", "Yemen", "Abyan", 8, 28, "Eight security personnel are killed during an al-Qaeda ambush."], ["2011.08.24", "Afghanistan", "Paktia", 3, 9, "Islamists send rockets into a market, taking out at least three patrons, including a child."], ["2011.08.24", "India", "Avdesh", 2, 0, "Two brothers are abducted and murdered by Hizb-ul-Mujahideen."], ["2011.08.24", "Iraq", "Diyala", 5, 9, "A woman and child are among five innocents exterminated by Jihadi bombers."], ["2011.08.24", "Iraq", "Ramadi", 2, 7, "Sunni snipers fire on a car carrying civilians, killing two."], ["2011.08.24", "Iraq", "Ramadi", 6, 8, "A suicide car bomber takes out a half dozen Iraqis."], ["2011.08.24", "Thailand", "Pattani", 1, 0, "A 60-year-old man is shot in the head by Muslim 'insurgents' while walking home."], ["2011.08.24", "Thailand", "Pattani", 1, 0, "Mujahideen gun down a school guard."], ["2011.08.24", "Thailand", "Songkhla", 2, 0, "Two security personnel die during an Islamist ambush."], ["2011.08.25", "India", "Baramulla", 2, 15, "Two people die from splinter injuries after an Islamist tosses a grenade into a market."], ["2011.08.25", "Iraq", "Basra", 3, 50, "Holy Warriors detonate a car bomb outside a rival mosque, killing at least three."], ["2011.08.25", "Iraq", "Fallujah", 9, 34, "A series of Jihad car bombings leaves at least nine dead."], ["2011.08.25", "Iraq", "Jbela", 3, 1, "Islamic militants fire on a vehicle, killing a boy, his father and an uncle."], ["2011.08.25", "Nigeria", "Gombi", 16, 12, "Two banks and a police station are the target of 'Allah Akbar' screaming Islamists, who leave at least sixteen innocents dead."], ["2011.08.25", "Pakistan", "Nowshera", 12, 17, "A dozen people at a restaurant are sent to Allah by bombers who hid their device on a child's tricycle."], ["2011.08.25", "Somalia", "Mogadishu", 1, 0, "A 19-year-old man is beheaded by al-Shabaab."], ["2011.08.25", "Thailand", "Yala", 2, 9, "A 3-year-old girl and her father are shot to death by Holy Warriors."], ["2011.08.26", "Afghanistan", "Herat", 1, 10, "A woman is blown to bits by a Taliban bomb hidden in a handcart."], ["2011.08.26", "Algeria", "Cherchell", 18, 26, "Two al-Qaeda suicide bombers murder eighteen soldiers and civilians following the break of daily Ramadan fasting."], ["2011.08.26", "Nigeria", "Abuja", 23, 68, "Over two dozen people at a UN building housing humanitarian agencies are crushed to death by a suicide car bomber."], ["2011.08.26", "Norway", "Jaeren", 0, 1, "A Christian convert from Islam is scalded with boiling water and acid at a refugee center."], ["2011.08.26", "Somalia", "Mogadishu", 2, 0, "Two young boys are beheaded by Islamic radicals."], ["2011.08.26", "Thailand", "Narathiwat", 1, 0, "Muslim 'insurgents' shoot a Buddhist laborer to death."], ["2011.08.26", "Thailand", "Narathiwat", 5, 1, "Five rescue workers are blown apart by a bomb placed under their car."], ["2011.08.27", "Afghanistan", "Kandahar", 4, 19, "A suicide bomber manages to kill an Afghan child and three others."], ["2011.08.27", "Afghanistan", "Lashkar Gah", 4, 21, "Three children are among four civilians torn to shreds by a suicide bombing outside a bank."], ["2011.08.27", "Algeria", "Ataq", 2, 3, "Two guards at an oil facility are shot to death by al-Qaeda militants."], ["2011.08.27", "Iraq", "Baghdad", 8, 15, "Sunni bombers take down eight Iraqis in three attacks."], ["2011.08.27", "Iraq", "Fallujah", 2, 0, "Two Sunni leaders are gunned down by Muslim rivals."], ["2011.08.27", "Nigeria", "Maiduguri", 1, 0, "A Protestant evangelist is assassinated in his own home by Religion of Peace enthusiasts."], ["2011.08.27", "Pakistan", "Chitral", 32, 9, "A massive Taliban assault across the border leaves dozens of security personnel and civilians dead."], ["2011.08.27", "Pakistan", "Kohat", 1, 0, "A retired man is abducted by Muslim radicals and executed."], ["2011.08.27", "Somalia", "Mogadishu", 1, 1, "A woman dies from injuries suffered from an Islamic bomb attack."], ["2011.08.27", "Thailand", "Yala", 1, 0, "A 24-year-old civilian is shot to death by Muslim gunmen."], ["2011.08.28", "Afghanistan", "Takhar", 2, 0, "A doctor and medical worker are murdered by Taliban bombers."], ["2011.08.28", "Iraq", "Baghdad", 29, 37, "A Holy Warrior praises Allah before detonating at a Sunni mosque and laying out two dozen worshippers."], ["2011.08.28", "Iraq", "Salman Pak", 1, 4, "'Insurgents' shoot a woman to death at a checkpoint."], ["2011.08.28", "Pakistan", "Faisalabad", 0, 1, "A 64-year-old maid is beaten by madrassah students for hosting a Christian prayer meeting in her home."], ["2011.08.28", "Pakistan", "Punjab", 3, 6, "Sectarian Jihadis take down three rivals."], ["2011.08.28", "Thailand", "Pattani", 1, 0, "Muslim 'rebels' kill a plantation worker with a bomb."], ["2011.08.28", "Yemen", "Dofas", 17, 45, "Seventeen local soldiers die during the aftermath of an al-Qaeda ambush."], ["2011.08.29", "Iraq", "Baqubah", 3, 2, "Three Iraqis are gunned down by Mujahideen."], ["2011.08.29", "Iraq", "Mosul", 2, 9, "A Shahid suicide bomber sends two other souls to Allah."], ["2011.08.29", "Israel", "Tel Aviv", 0, 8, "A Palestinian shouting 'Allah Akbar' stabs eight nearby Israelis."], ["2011.08.29", "Nigeria", "Jos", 2, 1, "A pastor who preached religious tolerance is hacked to death by Islamic extremists along with his son at their church."], ["2011.08.30", "Chechnya", "Grozny", 9, 22, "Three suicide bombers detonate among bustling street crowd, killing nine."], ["2011.08.31", "Ingushetia", "Nazran", 2, 0, "Salafi bomber kill two people with a car bomb."], ["2011.08.31", "Iraq", "Baghdad", 5, 22, "Five shoppers at a mall are taken down by Jihadi bombers."], ["2011.08.31", "Pakistan", "Quetta", 11, 22, "Children are among the victims of a Sunni suicide blast at a Shia mosque during worship."], ["2011.09.01", "Dagestan", "Khasavyurt", 1, 3, "Women are among the casualties of an Islamist car bombing."], ["2011.09.01", "Pakistan", "Kurram", 7, 1, "Seven Shias riding a minibus are machine-gunned to death by Sunni rivals."], ["2011.09.01", "Pakistan", "Lakki Marwat", 5, 35, "Five civilians are crushed under collapsing buildings during by a Fedayeen suicide car bombing."], ["2011.09.02", "Ingushetia", "Nesterovskaya", 1, 0, "A local religious figure is shot to death by suspected Muslim militants."], ["2011.09.02", "Iraq", "Baghdad", 1, 0, "A government official is assassinated by Islamic terrorists."], ["2011.09.02", "Somalia", "Hudur", 1, 0, "A convert to Christianity is kidnapped and beheaded by Muslim activists."], ["2011.09.03", "Kenya", "Madera", 1, 3, "Somali Islamists are suspected of a bomb attack that leaves a Kenyan dead."], ["2011.09.03", "Yemen", "Aden", 3, 7, "A Shahid suicide bomber kills three local cops."], ["2011.09.04", "Afghanistan", "Kandahar", 3, 21, "A Holy Warrior detonates in the prayer area of a security office, killing three others."], ["2011.09.04", "Iran", "Ahvaz", 3, 0, "Three people are hung for 'forbidden acts against religion'."], ["2011.09.04", "Iraq", "Mosul", 1, 1, "A man is shot to death in his home by Mujahideen."], ["2011.09.04", "Nigeria", "Zannari", 1, 0, "Boko Haram Islamists assassinate a local scholar."], ["2011.09.04", "Pakistan", "Godhra", 5, 7, "Five people are killed when two rival Islamic groups work out their differences."], ["2011.09.04", "Pakistan", "Mariamabad", 1, 0, "A Catholic pilgrim is kidnapped and murdered while walking to a shrine."], ["2011.09.05", "Afghanistan", "Parwan", 2, 0, "The bodies of two German hikers are found three weeks after they were abducted and shot to death."], ["2011.09.05", "Afghanistan", "Qaisar", 5, 0, "Sunni militants take out five civilians with a well-placed roadside bomb."], ["2011.09.05", "Iraq", "Kirkuk", 2, 0, "Jihadis shoot a skilled neurologist to death along with his brother."], ["2011.09.05", "Nigeria", "Dabwak", 4, 0, "An elderly Christian couple and their two grandchildren are shot to death in their home by Muslim raiders."], ["2011.09.05", "Nigeria", "Tatu", 8, 0, "A Christian family of eight including the parents and six children are hacked to death by Muslim militants in their home."], ["2011.09.05", "Nigeria", "Zakalio", 7, 0, "Seven Christian villagers are murdered by Muslim extremists."], ["2011.09.05", "Pakistan", "Faisalabad", 1, 0, "Islamic seminary students shoot an innocent member of the Ahmadi sect to death."], ["2011.09.05", "Pakistan", "Humrang Beebak", 2, 0, "Two brothers are abducted and murdered by Islamic terrorists."], ["2011.09.05", "Thailand", "Pattani", 2, 1, "Muslim prisoners target and murder two Buddhist inmates."], ["2011.09.06", "Afghanistan", "Kabul", 1, 0, "The Taliban are suspected of killing a U.S. citizen."], ["2011.09.06", "Iraq", "Anbar", 9, 0, "Terrorists machine-gun a bus carrying Iraqi soldiers at point-blank range, killing all eight passengers and their driver."], ["2011.09.06", "Nigeria", "Kuru", 14, 13, "Fourteen residents of a Christian village are hacked and shot to death in an orgy of Islamic violence that lasts an hour."], ["2011.09.06", "Nigeria", "Zakaleo", 4, 0, "Four Christians are burned alive when militant Muslims set fire to their house."], ["2011.09.06", "Thailand", "Narathiwat", 2, 5, "A 9-year-old boy is among the victims of two attacks by Muslim gunmen, one at a teahouse."], ["2011.09.06", "Thailand", "Yala", 1, 0, "Islamists kill a 38-year-old Buddhist teacher, then set his body on fire."], ["2011.09.06", "Yemen", "Abyan", 5, 3, "An al-Qaeda attack leaves five local soldiers dead."], ["2011.09.07", "India", "New Delhi", 15, 89, "Harkat-ul-Jihad-al-Islami cadres use a suitcase bomb to murder fifteen others outside a packed courtroom."], ["2011.09.07", "Iraq", "Baghdad", 1, 6, "One Iraqi is killed when Jihadis bomb a marketplace."], ["2011.09.07", "Iraq", "Dujail", 1, 0, "Terrorists enter a home and shoot a man to death in front of his wife."], ["2011.09.07", "Pakistan", "Quetta", 26, 80, "Twin suicide bombers send over two dozen souls to Allah including a woman and three children."], ["2011.09.08", "Afghanistan", "Herat", 3, 0, "Sunni bombers take down an engineer and two other employees at a construction company."], ["2011.09.08", "Afghanistan", "Khost", 5, 0, "Five Afghans lose their lives to roadside bombers."], ["2011.09.08", "Afghanistan", "Sangin", 7, 5, "A Shahid suicide bomber takes out seven Afghans with a nail-packed car bomb."], ["2011.09.08", "Nigeria", "Tsohon Foron", 10, 0, "Muslim extremists murder a family of ten Christians."], ["2011.09.08", "Somalia", "Coast", 1, 2, "Muslim 'pirates' shoot an unarmed French sailor on his own yacht."], ["2011.09.08", "Thailand", "Narathiwat", 1, 0, "A man driving a pickup truck is shot in the head by Muslim 'insurgents'."], ["2011.09.09", "Afghanistan", "Manogai", 4, 0, "Four local security personnel are killed by Taliban bombers."], ["2011.09.09", "Nigeria", "Barkin Ladi", 9, 0, "A Christian father and his seven young children are among nine shot to death in a Fulani raid on their home."], ["2011.09.09", "Nigeria", "Kunsen Gashish", 3, 0, "Three Protestant farmers are hacked to death by machete-wielding Muslims."], ["2011.09.09", "Pakistan", "Islamabad", 1, 0, "A Christian imprisoned for 'offending the Quran' dies after being denied medical treatment by prison officials."], ["2011.09.09", "Somalia", "Mogadishu", 5, 10, "An al-Shabaab bomb left on the street sends five souls to Allah."], ["2011.09.09", "Thailand", "Narathiwat", 1, 0, "A 26-year-old policeman is shot to death by Muslim terrorists."], ["2011.09.10", "Afghanistan", "Bagram", 2, 0, "Two security guards are killed by a Taliban rocket."], ["2011.09.10", "Afghanistan", "Ghazni", 1, 0, "Religious radicals assassinate a police chief."], ["2011.09.10", "Nigeria", "Vwang Fwil", 14, 6, "Fourteen Christian villagers from the same family, including a woman in labor, are hacked to death during a midnight Muslim raid."], ["2011.09.10", "Yemen", "Zinjibar", 2, 4, "An al-Qaeda mine takes out two local soldiers."], ["2011.09.11", "Afghanistan", "Bermel", 6, 9, "The Taliban take out six civilians, including two women, with a roadside bomb."], ["2011.09.11", "Afghanistan", "Charkh", 6, 0, "The bodies of six civilian contract workers are found five days after being abducted by Sunni militants."], ["2011.09.11", "Afghanistan", "Gortepa", 5, 0, "Three children are among five civilians disassembled by a homemade Sunni bomb."], ["2011.09.11", "Afghanistan", "Herat", 3, 0, "Three policemen are shot to death by Religion of Peace hardliners."], ["2011.09.11", "Afghanistan", "Wardak", 5, 94, "Children are among the casualties when Fedayeen detonate a truck bomb."], ["2011.09.11", "England", "London", 0, 2, "Two activists are stabbed by Muslims after disparaging Islam."], ["2011.09.11", "Iraq", "Baquba", 1, 7, "A journalist at a cafe bleeds to death following a Mujahid bombing."], ["2011.09.11", "Iraq", "Taji", 3, 0, "Three civilians are shredded by a roadside bomb."], ["2011.09.11", "Kenya", "Lamu", 1, 1, "al-Shabaab radicals are suspected of shooting an unarmed man on his honeymoon and kidnapping his wife."], ["2011.09.11", "USA", "Waltham, MA", 3, 0, "Three Jewish men have their throats slashed by Muslim terrorists."], ["2011.09.12", "Indonesia", "Maluku", 6, 80, "Six people are killed when machete-wielding Muslims attack a Christian village on a false rumor."], ["2011.09.12", "Iraq", "Anbar", 22, 0, "Sunnis stop a bus carrying Shiite pilgrims and shoot twenty-two of them in the back of the head."], ["2011.09.12", "Iraq", "Mosul", 1, 0, "Mujahideen behead a man in his own home."], ["2011.09.12", "Nigeria", "Maiduguri", 4, 0, "Boko Haram Islamists shoot two bar workers and two patrons."], ["2011.09.12", "Nigeria", "Misau", 7, 7, "A suspected Boko Haram assault on a bank leaves seven dead."], ["2011.09.12", "Yemen", "Aden", 1, 0, "Suspected al-Qaeda gunmen assassinate a security official."], ["2011.09.13", "Afghanistan", "Kabul", 21, 31, "Over twenty people are killed when a wave of Fedayeen assault the US embassy."], ["2011.09.13", "Iraq", "Taji", 1, 9, "A Shahid suicide bomber kills a civilian."], ["2011.09.13", "Pakistan", "Khyber", 3, 3, "Three tribal elders are executed by radical Muslims."], ["2011.09.13", "Pakistan", "Lakki", 2, 0, "The Taliban kidnap and murder two villagers."], ["2011.09.13", "Pakistan", "Matani", 5, 19, "Sunni militants blast a school bus full of children with machine-gun fire, killing four kids and the driver."], ["2011.09.13", "Somalia", "Dhusamareb", 2, 6, "Two people are killed during an al-Shabaab attack."], ["2011.09.14", "Afghanistan", "Helmand", 2, 8, "Women are among the casualties of a Sunni car bomb."], ["2011.09.14", "Iraq", "Hillah", 17, 46, "Seventeen people die in a car bomb blast outside a restaurant, including three children."], ["2011.09.14", "Iraq", "Ramadai", 6, 10, "Six Iraqis at an airport are sent to Allah by Jihad bombers."], ["2011.09.14", "Pakistan", "Bannu", 3, 1, "The Taliban intercept a car carrying security officials and machine-gun them."], ["2011.09.14", "Pakistan", "Lahore", 1, 0, "A 15-year-old girl is strangled to death by her uncle for a suspected affair with a Christian boy."], ["2011.09.14", "Pakistan", "Tirah", 1, 0, "Islamists behead a civilian."], ["2011.09.14", "Thailand", "Narathiwat", 2, 2, "A Muslim soldier murders two Buddhists in a suicide attack."], ["2011.09.15", "Dagestan", "Kadar", 1, 0, "Muslim radicals enter an imam's home and shoot him 57 times."], ["2011.09.15", "Pakistan", "Lower Dir", 45, 62, "A suicide bomber detonates in the middle of a packed funeral, killing at least forty-five mourners."], ["2011.09.15", "Thailand", "Pattani", 5, 1, "'Islamic separatists' set off a landmine under a vehicle, then drag out five injured soldiers and shoot them in the head."], ["2011.09.16", "Iraq", "Baghdad", 4, 2, "Four people are shot to death by Muslim terrorists."], ["2011.09.16", "Nigeria", "Maiduguri", 1, 0, "Boko Haram radicals kill one of their own for holding peace talks."], ["2011.09.16", "Thailand", "Narathiwat", 6, 118, "Four tourists, including a 3-year-old child and his grandparents, are among six people blown apart when Islamist place a bomb outside a brothel,"], ["2011.09.16", "Thailand", "Yala", 2, 3, "Islamists gun down two persons at a mosque."], ["2011.09.17", "Afghanistan", "Faryab", 9, 1, "Five children are among nine civilians ripped to pieces by a Taliban bomb."], ["2011.09.17", "Iraq", "Mosul", 3, 0, "Three children are killed by a homemade bomb found in their yard."], ["2011.09.17", "Pakistan", "Akka Khel", 5, 3, "Four members of a peace committee are among five killed at point-blank range by Jihadi gunmen."], ["2011.09.18", "Dagestan", "Makhachkala", 1, 0, "A local security official is gunned down by Muslim assassins."], ["2011.09.18", "Nigeria", "Bitaro", 3, 8, "Muslim activists raid a village, pull members of a Christian family from their home and then hack and shoot them to death.  The victims included children."], ["2011.09.18", "Pakistan", "Haider Khan", 3, 0, "Three are killed when terrorists open up on a passenger bus with automatic weapons."], ["2011.09.19", "Afghanistan", "Aqcha", 4, 9, "A brutal suicide attack leaves four dead, including a woman and her child."], ["2011.09.19", "Afghanistan", "Jowzjan", 5, 0, "The Taliban take down five local policemen with roadside bombs."], ["2011.09.19", "Pakistan", "Bajaur", 1, 0, "Islamic militants abduct and execute a tribal elder and member of a peace committee."], ["2011.09.19", "Pakistan", "Karachi", 8, 9, "A teacher and her 8-year-old child are among eight who lose their lives to a Tehreek-e-Taliban suicide bombing outside a house."], ["2011.09.19", "Pakistan", "Khyber", 1, 1, "A truck driver is riddled with bullets during an Islamist drive-by."], ["2011.09.19", "Pakistan", "Miranshah", 1, 0, "A man is taken from a marketplace by local Islamists and executed in captivity."], ["2011.09.19", "Pakistan", "Peshawar", 5, 33, "Five people are killed when fundamentalists set off a bomb at a market selling DVDs and music."], ["2011.09.20", "Afghanistan", "Kabul", 1, 3, "The head of a peace council is killed by a Shahid who hid the bomb in his turban."], ["2011.09.20", "India", "Samba", 1, 1, "Pakistani backed militants fire on a security-patrol, killing one member."], ["2011.09.20", "Iraq", "Baghdad", 3, 0, "Terrorists gun down three policemen at point-blank range."], ["2011.09.20", "Iraq", "Ramadi", 4, 17, "Three Fedayeen suicide bombers murder four Iraqis at a government complex."], ["2011.09.20", "Pakistan", "Mastung", 26, 6, "Twenty-six Shia pilgrims are pulled off a bus, lined up and executed by Lashkar-e-Jhangvi Sunnis.."], ["2011.09.20", "Pakistan", "Quetta", 3, 1, "Three mourners, traveling to pick up bodies from an earlier Sunni ambush, are gunned down in route."], ["2011.09.21", "Dagestan", "Makhachkala", 6, 50, "A triple car-bomb attack by Muslim extremists leaves six dead and over fifty injured."], ["2011.09.21", "Israel", "Samaria", 0, 1, "Palestinian stone-throwers hit a 20-month-old Jewish baby girl in the face."], ["2011.09.21", "Nigeria", "Maiduguri", 2, 0, "Boko Haram gunmen riddle two men with bullets in their home."], ["2011.09.21", "Pakistan", "Khwezai", 3, 0, "The bodies of three abducted tribesman are found a month later - sans heads."], ["2011.09.22", "Iraq", "Iskandariyah", 2, 20, "Two Shiite pilgrims, a 5-year-old girl and her father, are murdered by Sunni bombers outside a restaurant."], ["2011.09.22", "Nigeria", "Madala", 5, 0, "Five Christian traders are executed by Boko Haram gunmen when they are unable to recite Quran verses as ordered."], ["2011.09.22", "Pakistan", "Chamarkand", 5, 8, "A 10-year-old boy is among five people blown to bit by a Taliban bomb."], ["2011.09.22", "Pakistan", "Landikotal", 2, 1, "Islamic radicals ambush a truck, killing the driver and a passenger."], ["2011.09.22", "Thailand", "Narathiwat", 1, 0, "'Insurgents' shoot a man twice in the head and then set his body on fire."], ["2011.09.22", "Thailand", "Pattani", 1, 0, "A young nurse is machine-gunned while riding to work at a hospital."], ["2011.09.23", "Dagestan", "Makhachkala", 4, 0, "Two children are among four people shot to death by Islamic 'separatists' in a targeted killing."], ["2011.09.23", "Iraq", "Baghdad", 5, 12, "Sectarian Jihadis take down five Iraqis in a Sunni neighborhood."], ["2011.09.23", "Iraq", "Husseiniya", 4, 17, "Four people are taken apart by a Shahid suicide car bomber."], ["2011.09.23", "Israel", "Kiryat Arba", 2, 0, "An infant and his father are killed when their car crashes after Palestinians throw a rock through the windshield."], ["2011.09.23", "Pakistan", "Peshawar", 2, 0, "Two policemen on guard duty are shot to death by Tehreek-e-Taliban."], ["2011.09.23", "Pakistan", "Quetta", 3, 2, "Sunni gunmen identify and execute three Shia laborers after forcing them off a bus."], ["2011.09.24", "Afghanistan", "Maywand", 7, 4, "Two women and three children are among seven civilians disassembled by Mujahid bombers."], ["2011.09.24", "Somalia", "Mogadishu", 1, 0, "Bombers kill a security guard outside a UN building."], ["2011.09.25", "Afghanistan", "Yahya Khel", 2, 2, "A suicide bomber sends two local souls to Allah."], ["2011.09.25", "Indonesia", "Solo", 2, 20, "A teenage girl is among two worshippers cut to pieces by a Shahid who wanders into a church service and detonates a bomb packed with nails and bolts."], ["2011.09.25", "Iraq", "Karbala", 17, 113, "al-Qaeda devotees target Shiites with four bomb blasts that leave nearly twenty dead."], ["2011.09.25", "Iraq", "Khalidiya", 2, 6, "Women and children are among the casualties when Mujahideen detonate a bomb outside a house."], ["2011.09.25", "Philippines", "Talipao", 3, 8, "A villager is among three people killed in an Abu Sayyaf ambush."], ["2011.09.25", "Somalia", "Deynile", 1, 0, "Islamists behead a 17-year-old whose family held secret Bible studies in their home."], ["2011.09.26", "Afghanistan", "Kabul", 1, 1, "An American security analyst is gunned down by a Fedayeen working as a trusted employee."], ["2011.09.26", "Iraq", "Diwaniya", 1, 1, "An imam nearly loses his life to Religion of Peace rivals, who do manage to kill his companion."], ["2011.09.26", "Iraq", "Kirkuk", 3, 1, "Holy Warriors take down three civilians traveling in a car."], ["2011.09.26", "Mali", "Bamako", 0, 7, "Several people are hurt when fundamentalists armed with Molotov cocktails destroy a bar located too close to a mosque."], ["2011.09.27", "Afghanistan", "Lashkar Gah", 2, 26, "A man and boy are torn apart by a Shahid suicide bomber."], ["2011.09.27", "Afghanistan", "Shindand", 16, 4, "Eleven children and four women are among a family of sixteen shredded by Mujahideen bombers."], ["2011.09.27", "Iraq", "Baghdad", 3, 10, "Sunni terrorists detonate a bomb outside a popular Shia restaurant, killing three members of the night crowd."], ["2011.09.27", "Pakistan", "Islamabad", 2, 0, "A woman seeking a divorce is shot to death along with her daughter in an 'honor killing'."], ["2011.09.27", "Pakistan", "Salarzai", 2, 6, "Two members of a peace committee are shot to death by Sunni hardliners."], ["2011.09.27", "Pakistan", "Swat", 2, 0, "Islamic radicals are suspected of making a bomb shaped like a toy that takes the lives of a young child and his grandfather."], ["2011.09.27", "Philippines", "Sumisip", 6, 5, "Abu Sayyaf members assault a village, killing six, including several residents."], ["2011.09.27", "Yemen", "Aden", 2, 10, "A suicide bombing near a hotel leaves two people dead."], ["2011.09.28", "Afghanistan", "Lashkar Gah", 8, 3, "Sunni hardliners roll up on a local police checkpoint and machine-gun eight officers."], ["2011.09.28", "Dagestan", "Hajjalmakhi", 8, 4, "An 11-year-old girl is among eight killed in a violent car bombing by Muslim extremists."], ["2011.09.28", "Dagestan", "Izberbash", 2, 0, "Two opponents of extremism are assassinated by Religion of Peace gunmen."], ["2011.09.28", "India", "Batmaloo", 1, 0, "An Islamist shoots a police officer to death in cold blood."], ["2011.09.28", "Iraq", "Abu Ghraib", 5, 7, "Three children are among five family members brutally shot to death in their home by al-Qaeda intruders."], ["2011.09.28", "Thailand", "Narathiwat", 4, 3, "A 6-year-old boy is among the casualties when Islamic terrorists open fire on guards outside a school."], ["2011.09.28", "Thailand", "Pattani", 1, 0, "A 48-year-old trader is shot to death at a market by Muslim 'insurgents'."], ["2011.09.29", "Afghanistan", "Herat", 3, 2, "Two women are among three killed in a Taliban bomb blast."], ["2011.09.29", "Egypt", "Tamia", 1, 2, "A guard at a church is taken out by a Muslim drive-by."], ["2011.09.29", "Iraq", "Kirkuk", 3, 76, "Jihadis detonate a massive truck bomb outside a bank.  Two women are among the dead."], ["2011.09.29", "Pakistan", "Chora", 1, 0, "The beheaded body of a young man is found three days after his abduction."], ["2011.09.30", "Iraq", "al-Khafaji", 17, 30, "Sunni car bombers blast a funeral procession for a Shia sheikh, killing at least seventeen mourners."], ["2011.10.01", "Iraq", "Buhriz", 3, 5, "Two family members are among three killed during an al-Qaeda home invasion."], ["2011.10.01", "Iraq", "Kirkuk", 1, 0, "A 60-year-old Christian is shot to death by Muslim assassins."], ["2011.10.01", "Kenya", "Manda Bay", 1, 0, "An elderly Frenchwoman in a wheelchair is kidnapped by al-Shabaab and later dies in captivity."], ["2011.10.01", "Nigeria", "Maiduguri", 2, 0, "Two civilians at a wedding are taken down by a Boko Haram bomb."], ["2011.10.01", "Pakistan", "Sheikhupura", 1, 0, "A schoolteacher is quickly murdered in front of students after being labeled 'liable to be killed' by local clerics for embracing the Ahmadi faith."], ["2011.10.01", "Pakistan", "Torghar", 4, 15, "Four police trainees are sent to Allah by Taliban bombers."], ["2011.10.01", "Philippines", "Patikul", 3, 0, "Abu Sayyaf militants claim credit for shooting down a helicopter and killing three people."], ["2011.10.01", "Somalia", "Dharkenley", 11, 24, "Eleven civilians are killed during an al-Shabaab attack."], ["2011.10.01", "Thailand", "Narathiwat", 1, 0, "Muslim gunmen assassinate a 50-year-old man outside a mosque."], ["2011.10.01", "Thailand", "Pattani", 1, 0, "Terrorists shoot a truck driver to death near a tea shop."], ["2011.10.02", "Afghanistan", "Gardez", 9, 4, "Nine Afghan soldiers are torn to shreds by Sunni fundamentalist roadside bombers."], ["2011.10.02", "Dagestan", "Kizilyurt", 2, 1, "A Shahid suicide bomber kill two local police officers."], ["2011.10.02", "Iraq", "Mishahda", 4, 3, "al-Qaeda bombers take down four Iraqis."], ["2011.10.02", "Iraq", "Mosul", 1, 0, "Islamists murder a 30-year-old restaurant employee in a targeted attack against Christians."], ["2011.10.02", "Nigeria", "Maiduguri", 1, 0, "A pharmacist is murdered in his store by Boko Haram Islamists."], ["2011.10.02", "Somalia", "Mogadishu", 2, 3, "An al-Shabaab roadside bomb takes out two civilians."], ["2011.10.02", "Syria", "Damascus", 1, 0, "The son of a prominent cleric is gunned down in a suspected sectarian attack."], ["2011.10.03", "Afghanistan", "Kandahar", 2, 19, "A Shahid suicide bomber takes two civilians with him, including a child."], ["2011.10.03", "Iraq", "Anbar", 6, 13, "At least six people are killed in a bank siege by a suicide squad from the 'Islamic State of Iraq'."], ["2011.10.03", "Iraq", "Arab Jobour", 1, 2, "Hardliners open fire on a schoolteacher, killing him and injuring his wife and young son."], ["2011.10.03", "Iraq", "Baghdad", 1, 5, "Terrorists kill a child with a bomb."], ["2011.10.03", "Nigeria", "Maiduguri", 2, 0, "A tea seller and customer are shot at point blank range by local Islamists."], ["2011.10.03", "Pakistan", "Khuzdar", 1, 1, "A schoolteacher is shot to death in a suspected sectarian attack."], ["2011.10.04", "Nigeria", "Tanjol", 1, 1, "Muslim militants gun down two Christian villagers."], ["2011.10.04", "Pakistan", "Quetta", 14, 6, "Fourteen Shia pilgrims are pulled off of a bus by Sunni gunmen, lined up and mowed down."], ["2011.10.04", "Somalia", "Mogadishu", 101, 122, "Over one-hundred people are blown to bits in a powerful truck bombing by Islamic fundamentalists.  Many victims were students."], ["2011.10.05", "Pakistan", "Mian Channu", 1, 38, "A Christian trying to build a church orphanage is murdered by Muslims in a \"land dispute.\""], ["2011.10.05", "Somalia", "Belet Hawo", 1, 0, "A man sitting at a tea shop is shot to death by Islamic assassins."], ["2011.10.05", "Thailand", "Narathiwat", 1, 5, "A Buddhist woman is shot to death in her own house by Muslim militants."], ["2011.10.05", "Yemen", "Abyan", 2, 0, "Two people are dismantled by terrorist bombers."], ["2011.10.06", "Afghanistan", "Gereshk", 1, 16, "Taliban snipers pick off a child riding a bus.  Sixteen other civilians survive with injuries."], ["2011.10.06", "Pakistan", "Faisalabad", 3, 0, "Three women are dragged out of a house and shot by a relative in an honor attack."], ["2011.10.06", "Thailand", "Narathiwat", 1, 1, "Islamic gunmen fire on a Buddhist couple sitting in their truck, killing the wife."], ["2011.10.07", "Iraq", "Itafiyah", 5, 20, "Mujahideen set off a bomb along a crowded street, killing five Iraqis."], ["2011.10.07", "Pakistan", "Malik Garhi", 2, 0, "A man and boy are tortured, thrown off a 30-foot bluff, and then shot to death for engaging in homosexual sex."], ["2011.10.07", "Pakistan", "Rawalpindi", 0, 24, "About two dozen students and teachers at a girls school are thrashed with iron rods by fundamentalists for dressing \"immodestly.\""], ["2011.10.08", "Iraq", "Kirkuk", 1, 1, "Muslim gunmen shoot an elderly Christian and a woman."], ["2011.10.08", "Yemen", "Aden", 1, 7, "A local soldier is killed in a bombing by Islamic extremists."], ["2011.10.09", "Egypt", "Cairo", 27, 329, "Military and Islamist gunmen massacre over two dozen Christians peacefully protesting a church burning."], ["2011.10.09", "Pakistan", "Maidan", 2, 0, "The Taliban kidnap and murder two young men."], ["2011.10.09", "Philippines", "Zamboanga", 0, 13, "Abu Sayyaf bombers injured thirteen people in separate attacks targeting Christians."], ["2011.10.09", "Somalia", "Mogadishu", 12, 40, "At least a dozen civilians are killed during an al-Shabaab mortar attack on a residential area."], ["2011.10.10", "Afghanistan", "Dangam", 6, 2, "A road construction crew is the target of a vicious double bombing that leaves six dead."], ["2011.10.10", "Iraq", "Baghdad", 13, 22, "Jihadi bombers murder thirteen Iraqis, including first responders, in a string of bombings."], ["2011.10.10", "Nigeria", "Maiduguri", 2, 2, "Two Nigerians are killed by a Boko Haram bomb."], ["2011.10.10", "Pakistan", "Chadrarh", 2, 0, "Two former members of a peace committee are shot to death by militant Muslims."], ["2011.10.11", "Dagestan", "Makhachkala", 1, 2, "Suspected Islamic 'rebels' murder one person in a drive-by attack."], ["2011.10.11", "Iraq", "Garma", 1, 0, "al-Qaeda gunmen murder a man outside his home."], ["2011.10.11", "Pakistan", "Dasht", 2, 0, "The Taliban set fire to an oil tanker, burning the driver and helper to death."], ["2011.10.11", "Pakistan", "Kalaya", 1, 9, "A mortar round fired by the Taliban reportedly slams into a home, killing one occupant."], ["2011.10.11", "Somalia", "Mogadishu", 1, 0, "Islamists send a mortar round into the maternity ward of a hospital, crushing a staff member."], ["2011.10.12", "Iraq", "Baghdad", 9, 27, "Nine people are reported dead after a Sunni suicide bombing in a Shia neighborhood."], ["2011.10.12", "Iraq", "Baghdad", 14, 28, "A powerful Shahid car bomb blast leaves at least fourteen Iraqis dead."], ["2011.10.12", "Iraq", "Illam", 6, 28, "Three Jihadi car bomb kill six Iraqis."], ["2011.10.12", "Pakistan", "Khyber Pakhtunkhwa", 1, 4, "Children are among the casualties of an Islamist drive-by and mortar attack."], ["2011.10.12", "Pakistan", "Korangi", 1, 0, "A Muslim slashes a Christian mother's throat after raping her."], ["2011.10.12", "Thailand", "Yala", 1, 0, "A civilian is shot to death on his way home by 'insurgents'."], ["2011.10.13", "Iraq", "Kirkuk", 1, 42, "A Shahid suicide bomber kills one other person near a bank."], ["2011.10.13", "Iraq", "Sadr City", 18, 43, "Eighteen people at a market are torn to shreds by Ansar al-Islam bombers."], ["2011.10.13", "Nigeria", "Maiduguri", 1, 0, "Boko Haram gunmen assassinate a man in his home."], ["2011.10.13", "Thailand", "Pattani", 3, 0, "A married couple and their relative are brutally cut to pieces in their own shop by Islamic gunmen."], ["2011.10.13", "Thailand", "Pattani", 3, 0, "Two people riding in a pickup truck and a teenager standing nearby are machine-gunned by Muslim militants."], ["2011.10.14", "Afghanistan", "Spin Boldak", 3, 5, "A Fedayeen suicide bomber murders three local police officers."], ["2011.10.14", "Iraq", "Hilla", 10, 40, "Sunni bombers target a Shia funeral procession near a mosque, killing at least ten mourners."], ["2011.10.14", "Pakistan", "Islamabad", 1, 1, "Terrorists gun down a neighborhood cop."], ["2011.10.14", "Pakistan", "Kharkai", 2, 6, "Islamic militants kill two civilians with a mortar attack on their village."], ["2011.10.15", "Afghanistan", "Panjshir", 2, 2, "Two civilians are taken out by Islamic Movement of Uzbekistan suicide bombers."], ["2011.10.15", "Iraq", "Baghdad", 1, 0, "An interior minister is assassinated by suspected al-Qaeda."], ["2011.10.15", "Nigeria", "Maiduguri", 1, 0, "A local official is shot to death by Boko Haram."], ["2011.10.15", "Thailand", "Narathiwat", 1, 0, "A 48-year-old woman is stalked and murdered by Muslim 'insurgents'."], ["2011.10.16", "Afghanistan", "Faryab", 1, 4, "A child of about 3 bleeds to death following a suicide blast."], ["2011.10.16", "Afghanistan", "Gardez", 1, 0, "A city worker is killed by a car bomb."], ["2011.10.16", "Egypt", "Mallawy", 1, 0, "A Coptic high school student is beaten to death after refusing to take off his cross."], ["2011.10.16", "Nigeria", "Gombe", 4, 0, "Boko Haram bombers set off a blast that kills three civilians and a cop."], ["2011.10.16", "Nigeria", "Jos", 1, 0, "Militant Muslims hack a local soldier to death with machetes."], ["2011.10.16", "Nigeria", "Maiduguri", 1, 0, "A lawmaker is assassinated by Islamic gunmen while standing outside his home."], ["2011.10.17", "Algeria", "Boumerdes", 1, 2, "A 7-year-old barely survives a fundamentalist bombing that leaves his mother dead."], ["2011.10.17", "Iraq", "Baghdad", 7, 18, "Fundamentalists set off a bomb near a liquor store, exterminating seven."], ["2011.10.17", "Pakistan", "Bara", 9, 3, "Sunni extremists ambush a group of local soldiers and gun down at least nine."], ["2011.10.17", "Pakistan", "Karachi", 1, 0, "A 45-year-old Shiite man is gunned down by Wahhabi terrorists."], ["2011.10.17", "Pakistan", "Orakzai", 1, 0, "The chief of a local peace committee is murdered by Islamists while on his way to a funeral."], ["2011.10.18", "Afghanistan", "Gozara", 2, 0, "Two women accused of 'immoral' activity are shot to death."], ["2011.10.18", "Iraq", "Mosul", 1, 0, "A Shiite baker is murdered by Sunni hardliners."], ["2011.10.18", "Pakistan", "Bara", 3, 3, "Islamic militants are thought responsible for shelling that kills a doctor and two others, including a child."], ["2011.10.18", "Pakistan", "Buner", 3, 2, "Fundamentalists open fire on a party hosting transvestites, killing three."], ["2011.10.18", "Pakistan", "Karachi", 1, 0, "A 32-year-old Shiite is murdered by Sipah-e-Sahaba assassins."], ["2011.10.18", "Pakistan", "Karachi", 3, 0, "Three seminary students are shot dead in a suspected sectarian attack."], ["2011.10.18", "Pakistan", "Marot", 2, 0, "A woman seeking a divorce is butchered along with her daughter by her husband's family in an honor killing."], ["2011.10.18", "Philippines", "Basilan", 19, 14, "Nineteen local soldiers are killed during an ambush by Moro Islamists."], ["2011.10.18", "Somalia", "Mogadishu", 4, 6, "A Holy Warrior detonates himself along a city street, cutting down four innocents."], ["2011.10.18", "Thailand", "Narathiwat", 1, 0, "Islamic 'separatists' put four bullets into the back of a wood trader."], ["2011.10.18", "Thailand", "Pattani", 1, 2, "Muslim militants open fire on a group of investigators looking into an earlier murder."], ["2011.10.19", "Afghanistan", "Badghis", 3, 2, "A father and son are among three civilians ripped apart by a suicide bomber."], ["2011.10.19", "Afghanistan", "Zarghun", 5, 0, "Five Afghan troops are blown to bits by Taliban bombers while returning to their base."], ["2011.10.19", "Iraq", "Mosul", 2, 0, "A judge and his driver are assassinated by Mujahideen."], ["2011.10.19", "Iraq", "Ramadi", 2, 5, "'Insurgents' bomb a health office, killing two innocents."], ["2011.10.19", "Nigeria", "Maiduguri", 2, 0, "Boko Haram gunmen murder two civilians in separate attacks."], ["2011.10.19", "Nigeria", "Maiduguri", 2, 0, "The owner and a patron are shot to death at a barber shop by Islamic terrorists."], ["2011.10.19", "Pakistan", "Karachi", 1, 0, "A Sunni activist is gunned down by sectarian Jihadis."], ["2011.10.19", "Yemen", "Lahj", 2, 12, "An al-Qaeda militant throws a grenade into a packed market, killing two civilians."], ["2011.10.20", "Nigeria", "Bauchi", 0, 1, "A Christian boy is shot at a soccer match by armed Muslims."], ["2011.10.20", "Nigeria", "Yelwa", 1, 0, "Three Muslim soldiers break into a home and shoot a Christian mother of five to death."], ["2011.10.20", "Pakistan", "Karachi", 1, 0, "A 22-year-old Shiite is shot to death outside his home by Wahhabis."], ["2011.10.20", "Pakistan", "Khyber", 4, 3, "A brutal Lashkar-e-Islam attack leaves four dead."], ["2011.10.20", "Philippines", "Alicia", 4, 6, "Four local soldiers are ambushed and murdered by Moro Islamists."], ["2011.10.20", "Somalia", "Mogadishu", 10, 2, "Ten African peacekeepers are murdered by al-Shabaab terrorists - some by beheading."], ["2011.10.21", "Iraq", "Mosul", 1, 0, "'Insurgents' murder a woman inside her home."], ["2011.10.21", "Pakistan", "Bazai", 3, 1, "Muslim extremists throw grenades into a home, killing three family members including a woman."], ["2011.10.21", "Philippines", "Kabasalan", 3, 8, "Moro Islamists gun down three local cops."], ["2011.10.22", "India", "Anantapur", 0, 1, "A school headmaster is severely beaten by Muslim activists after asking that women remove veils."], ["2011.10.22", "Iraq", "Ameriyat", 1, 1, "A civilian is cut down by automatic weapons fire from 'insurgents' in a passing car."], ["2011.10.22", "Israel", "Kfar Iksa", 0, 1, "A Jewish teenager is left with serious injuries after a stabbing attack by a Palestinian."], ["2011.10.22", "Nigeria", "Maiduguri", 1, 0, "A popular TV journalist is murdered in front of his home by Boko Haram assassins."], ["2011.10.22", "Nigeria", "Saminaka", 2, 0, "Radicals bomb and shoot up a bank, killing two, while yelling 'Allah Akbar'."], ["2011.10.23", "Afghanistan", "Shindand", 2, 0, "Two local cops are obliterated by a Taliban roadside bomb."], ["2011.10.23", "Afghanistan", "Zarghon", 4, 2, "A Taliban bomb takes out four civilians."], ["2011.10.23", "Iraq", "Tikrit", 2, 0, "A teacher and his daughter are brutally murdered by Mujahideen gunmen."], ["2011.10.23", "Philippines", "Cabengbeng", 5, 8, "Five Catholic plantation workers are massacred by Moro Islamists in a pre-dawn attack on their village."], ["2011.10.23", "Philippines", "Lanao del Norte", 3, 3, "Three members of a security patrol are killed by a Moro Islamist ambush."], ["2011.10.23", "Thailand", "Narathiwat", 2, 1, "Terrorists dressed as women open fire on a civilian defense patrol, killing two members before fleeing."], ["2011.10.23", "Thailand", "Narathiwat", 5, 8, "A child and his parents are among five people torn to pieces by two Muslim bombs at a grocery."], ["2011.10.24", "Afghanistan", "Maymanah", 1, 6, "A suicide bomber successfully takes out a child."], ["2011.10.24", "Iraq", "Abu Ghraib", 1, 3, "'Insurgents' murder a woman inside her home."], ["2011.10.24", "Iraq", "Baghdad", 1, 7, "A civilian is taken out by a Fedayeen suicide bomber."], ["2011.10.24", "Kenya", "Nairobi", 0, 14, "Fourteen people suffer horrific burns and shrapnel injuries when Islamists throw a grenade into a nightclub."], ["2011.10.24", "Kenya", "Nairobi", 1, 10, "Islamists throw a grenade into a bus stop, killing one person."], ["2011.10.24", "Nigeria", "Damaturu", 1, 0, "Muslim gunmen knock on the door of an off-duty cop, then blow him away when he answers."], ["2011.10.24", "Pakistan", "Khyber Pakhtunkhwa", 2, 2, "A cab driver and member of a peace committee are gunned down by terrorists in separate attacks."], ["2011.10.24", "Pakistan", "Korangi", 2, 1, "Islamic militants are suspected of shooting a 12-year-old and one other person to death."], ["2011.10.24", "Yemen", "Aden", 2, 0, "Two Yemeni soldiers are machine-gunned by suspected Ansar al-Sharia."], ["2011.10.25", "Iraq", "Baghdad", 5, 13, "Three Iraqis are killed in a two-day spree of bombings targeting traffic cops."], ["2011.10.25", "Pakistan", "Bara", 1, 0, "Tahreek-e-Taliban militants murder a member of a peace committee."], ["2011.10.25", "Pakistan", "Lower Dir", 4, 3, "Sunni fundamentalists take down four people with a roadside bomb, including a 12-year-old boy."], ["2011.10.25", "Thailand", "Yala", 3, 34, "Muslim 'rebels' set off a series of bombs in populated areas, killing at least three civilians."], ["2011.10.26", "Afghanistan", "Parwan", 6, 50, "Six locals are killed when Sunni fundamentalists detonate a fuel tanker."], ["2011.10.26", "Iraq", "Hilla", 2, 0, "A woman and her daughter are killed when terrorists blow up their home."], ["2011.10.26", "Iraq", "Iskandiriyah", 2, 2, "Sunnis enter the home of a Shiite cleric and brutally shoot his wife and daughter to death."], ["2011.10.26", "Iraq", "Khanaqin", 0, 7, "Seven Shia pilgrims are injured when Sunni radicals bomb their bus."], ["2011.10.26", "Iraq", "Mosul", 9, 16, "Two car bombs in the same neighborhood take down nine Iraqis."], ["2011.10.26", "Pakistan", "Bajaur", 1, 4, "Four children are among the casualties when Muslim radicals shell their home."], ["2011.10.26", "Pakistan", "Bara", 1, 0, "Lashkar-e-Islam abduct and behead a defense volunteer."], ["2011.10.26", "Pakistan", "Faqir Kalay", 0, 12, "Young children are among the casualties when religious extremists bomb a clothing market."], ["2011.10.26", "Pakistan", "Mohmand", 3, 0, "Three local soldiers are kidnapped and executed by Religion of Peace proponents."], ["2011.10.26", "Pakistan", "Tank", 2, 0, "Two members of a peace committee are machine-gunned in their sleep by Islamists."], ["2011.10.26", "Philippines", "Sangali", 1, 8, "Muslim terrorists are suspected of planting a bomb outside a lottery office."], ["2011.10.27", "Dagestan", "Tabasaransky", 1, 0, "A moderate cleric is shot to death by extremists."], ["2011.10.27", "Iraq", "Amiriya", 1, 2, "al-Qaeda bombers take down an opponent."], ["2011.10.27", "Iraq", "Baghdad", 36, 78, "Fundamentalists target a music store with twin blasts, slaughtering at least thirty innocents."], ["2011.10.27", "Iraq", "Iskandariya", 2, 2, "A child is among two Iraqis obliterated by 'insurgent' bombers."], ["2011.10.27", "Kenya", "Mandera", 4, 4, "A school principal is one of four killed when Islamists rocket a vehicle carrying student exam papers."], ["2011.10.27", "Kenya", "Nairobi", 0, 1, "A young convert from Islam is left for dead after being severely beaten with iron rods in front of his church."], ["2011.10.28", "Afghanistan", "Khost", 4, 0, "Four people riding in a car are exterminated by Sunni gunmen."], ["2011.10.28", "Bosnia", "Sarajevo", 0, 1, "A radical Islamist fires on the US embassy for 30 minutes with an assault rifle."], ["2011.10.28", "Dagestan", "Bairamaul", 1, 1, "Islamic 'separatists' fire on a group of policemen, killing one."], ["2011.10.28", "Iraq", "Baqubah", 2, 2, "Holy Warriors machine-gun a family, killing the two male members and leaving a child and mother with serious injuries."], ["2011.10.28", "Iraq", "Saadiyah", 3, 1, "Three family members are executed at point-blank range by Muslim terrorists."], ["2011.10.28", "Pakistan", "Karachi", 1, 1, "A Shia is shot in the head and neck by sectarian Jihadis in front of his wife."], ["2011.10.28", "Pakistan", "Nowshera", 2, 7, "Two local cops are murdered by a Fedayeen suicide bomber."], ["2011.10.28", "Pakistan", "Shindhand", 2, 0, "Two brothers are killed when religious militants fire a rocket into their car."], ["2011.10.28", "Yemen", "Aden", 1, 3, "Children are among the casualties of an al-Qaeda car bombing."], ["2011.10.29", "Afghanistan", "Kabul", 17, 8, "Women and children are among the dead as suicide bombers target a NATO bus, killing at least seventeen."], ["2011.10.29", "Afghanistan", "Kandahar", 4, 9, "A Taliban in uniform shoots three Australian police trainers and an interpreter to death."], ["2011.10.29", "Iraq", "Baghdad", 1, 0, "A technology worker is blown up 'insurgent' bombers."], ["2011.10.29", "Iraq", "Deli Abbas", 1, 0, "Fundamentalists shoot a liquor store owner to death in his home."], ["2011.10.29", "Iraq", "Khalis", 1, 2, "Jihadis take down a teenage girl riding in a family car."], ["2011.10.29", "Iraq", "Mosul", 1, 0, "A woman shopping at a market is gunned down by terrorists."], ["2011.10.29", "Nigeria", "Borno", 1, 0, "Islamists gun down a rival cleric in front of his home."], ["2011.10.29", "Pakistan", "Changa Manga", 1, 0, "Religious extremists are suspected of binding a local official and then burning him alive."], ["2011.10.29", "Pakistan", "Tank", 1, 0, "Islamic radicals murder a member of a local peace committee."], ["2011.10.29", "Somalia", "Mogadishu", 10, 0, "At least ten people are killed during a Fedayeen assault on an African Union base."], ["2011.10.30", "Iraq", "Bani Saad", 2, 1, "Terrorists shoot two brothers to death in their home."], ["2011.10.30", "Iraq", "Mosul", 5, 0, "Five Iraqis are sent to Allah by Mujahideen bombers."], ["2011.10.30", "Israel", "Ashkelon", 1, 4, "A 56-year-old father of four bleeds to death after Palestinians fire a rocket into an apartment building."], ["2011.10.30", "Pakistan", "Jahlum", 2, 0, "An Ahmadi doctor and his 11-year-old son are kidnapped and presumed murdered by Islamic fundamentalists."], ["2011.10.30", "Pakistan", "Malir", 1, 0, "Sectarian gunmen take down a civilian."], ["2011.10.30", "Thailand", "Narathiwat", 3, 0, "Three Buddhists are gunned down in brutal fashion by Muslims at a grocery, including a woman and an elderly man."], ["2011.10.30", "Thailand", "Songkla", 1, 0, "Muslims gun down a civilian in a drive-by attack."], ["2011.10.31", "Afghanistan", "Kandahar", 6, 5, "Suicide bombers kill three people outside a humanitarian aid office."], ["2011.10.31", "Pakistan", "Pakhtunkhwa", 3, 0, "Religious militants abduct and behead three locals."], ["2011.10.31", "Thailand", "Sri Sakhon", 0, 2, "A child loses a foot and another suffers deep shrapnel injuries following an Islamist bombing."], ["2011.11.01", "Pakistan", "Gilgit City", 1, 0, "A Shiite is shot to death by Sunnis."], ["2011.11.01", "Pakistan", "Sira Karpai", 2, 2, "Religious extremists attack a police checkpoint, killing two officers."], ["2011.11.02", "Dagestan", "Babayurt", 2, 3, "Two local cops are shot to death by Islamic extremists."], ["2011.11.02", "Iraq", "Basra", 12, 62, "A dozen Iraqis are torn to shreds by motorcycle bombs placed outside three cafes."], ["2011.11.02", "Iraq", "Kirkuk", 1, 1, "Islamists are suspected of killing a vegetable vendor and injuring his daughter."], ["2011.11.02", "Iraq", "Mosul", 2, 0, "Two civilians bleed to death following a Sunni roadside bombing."], ["2011.11.02", "Nigeria", "Maiduguri", 1, 0, "A robed fundamentalist pulls out an automatic weapon and murders a guard at a market."], ["2011.11.02", "Pakistan", "Gilgit City", 1, 0, "A second Shiite dies from a Sunni shooting attack."], ["2011.11.02", "Pakistan", "Nasirabad", 2, 6, "Sunni terrorists detonate a roadside bomb under a passing vehicle, killing two occupants."], ["2011.11.02", "Pakistan", "Peshawar", 1, 10, "Jihadis detonate a bomb in a packed marketplace."], ["2011.11.02", "Thailand", "Narathiwat", 6, 2, "Six Buddhist civilians are blown apart and then raked with gunfire by militant Muslims."], ["2011.11.03", "Afghanistan", "Ghazni", 1, 0, "A child is taken out by a Taliban rocket."], ["2011.11.03", "Afghanistan", "Herat", 2, 4, "A Shahid suicide attack on a construction company leaves two guards dead."], ["2011.11.03", "Iraq", "Baqubah", 10, 40, "A double suicide attack leaves ten Iraqis dead.  The second blast was intended to kill victims fleeing the first."], ["2011.11.03", "Iraq", "Karradah", 4, 7, "Sunni bombers take out four Shiites in a residential neighborhood."], ["2011.11.03", "Nigeria", "Kaduna", 2, 14, "Mujahideen gunmen attack a church, shooting two female worshippers to death."], ["2011.11.03", "Nigeria", "Zonkwa", 2, 12, ""], ["2011.11.03", "Pakistan", "Quetta", 1, 0, "A prayer leader is murdered by suspected sectarian rivals."], ["2011.11.04", "Nigeria", "Maiduguri", 4, 6, "At least four people are killed by coordinated Fedayeen attacks, one at a college."], ["2011.11.04", "Nigeria", "Potiskum", 2, 0, "At least two villagers are gunned down by Muslim raiders."], ["2011.11.04", "Nigeria", "Potiskum", 150, 200, "Two-hundred militants shout 'Allah Akbar' as they slaughter one-hundred and fifty in a bombing and shooting rampage that targeted six churches and a police station.  At least one-hundred and thirty of their victims were Christian."], ["2011.11.04", "Nigeria", "Zonkwa", 1, 1, "Nigerian Islamists shoot another Christian to death in a village raid."], ["2011.11.04", "Philippines", "Malabang", 2, 0, "Suspected Moro Islamists murder two Catholic roadside vendors."], ["2011.11.04", "Thailand", "Pattani", 2, 0, "Two men on motorcycles are murdered in separate 'insurgent' drive-by shootings."], ["2011.11.05", "Iraq", "Taji", 4, 11, "A woman is among four family members machine-gunned in their home by al-Qaeda."], ["2011.11.05", "Kenya", "Garissa", 2, 3, "A member of the choir is killed along with an 8-year-old girls when al-Shabaab terrorists toss a grenade into a church."], ["2011.11.05", "Pakistan", "Razmak", 5, 3, "Talibanis massacre five members of a security patrol."], ["2011.11.05", "Pakistan", "Speen Mella", 3, 7, "Three bomb disposal personnel are ambushed and murdered by Sunni hardliners."], ["2011.11.06", "Afghanistan", "Hassin Tal", 7, 18, "A suicide bomber on foot takes out seven people leaving a mosque."], ["2011.11.06", "Iraq", "Baghdad", 10, 29, "Islamic militants detonate several bombs at a shopping mall, killing ten patrons."], ["2011.11.06", "Nigeria", "Maiduguri", 1, 0, "Islamists shoot a man to death in front of his family."], ["2011.11.06", "Pakistan", "Abbottabad", 0, 1, "A pregnant Christian woman is tortured for three hours by police."], ["2011.11.06", "Pakistan", "Azam Warsak", 3, 3, "Muslim militants open fire in a bazaar, killing three people."], ["2011.11.06", "Pakistan", "Bara Kaman Gara", 1, 3, "A woman is shot to death by Mujahideen inside her home."], ["2011.11.06", "Pakistan", "Gilgit City", 1, 0, "Sunni gunmen pick off a Shiite."], ["2011.11.06", "Pal. Auth.", "Qalqiliya", 1, 0, "Islamic terrorists gun down a man outside a mosque."], ["2011.11.06", "Yemen", "Zinjibar", 2, 0, "al-Qaeda snipers take down a local patrol."], ["2011.11.07", "Afghanistan", "Garm Ser", 3, 0, "The Taliban end the lives of three Afghans with a roadside bomb."], ["2011.11.07", "Pakistan", "Sindh", 1, 0, "A Shiite is shot to death by Sunnis."], ["2011.11.07", "Pakistan", "Swabi", 3, 9, "A secular politician and his son are among three dismantled by a Fedayeen suicide bomber."], ["2011.11.07", "Pakistan", "Taluka Chak", 3, 1, "A doctor is among three Hindus gunned down by Muslims at a village clinic."], ["2011.11.07", "South Sudan", "Guffa", 7, 12, "Seven die when a refugee camp is bombed by the Islamic Republic of Sudan."], ["2011.11.08", "Afghanistan", "Badghis", 11, 3, "Six children are among eleven lives brutally ended by a Taliban bomb on Eid al-Adha."], ["2011.11.08", "Afghanistan", "Sar Howza", 2, 4, "Fundamentalist bombers kill a government official and his bodyguard."], ["2011.11.08", "Iraq", "Samarrah", 3, 7, "Three Shiite pilgrims are sent to Allah by Sunni bombers."], ["2011.11.08", "Russia", "Yaroslavl", 1, 0, "Suspected Islamists shoot a rival imam several times in the head."], ["2011.11.08", "Somalia", "Mogadishu", 2, 5, "Two person are killed when al-Shabaab militants throw a grenade at a house."], ["2011.11.09", "Indonesia", "Jakarta", 0, 1, "A deaf and disabled man is brutally attacked with a machete by Sunni fundamentalists for being Ahmadi."], ["2011.11.09", "Pakistan", "Mardan", 2, 0, "Two girls are 'honor killed' and dumped into a field."], ["2011.11.09", "Yemen", "Zinjibar", 2, 0, "Two local soldiers are killed by an al-Qaeda bomb."], ["2011.11.10", "Afghanistan", "Chamkani", 3, 3, "Fedayeen stage a suicide bombing, with supporting fire from a mosque, which leaves three locals dead."], ["2011.11.10", "Afghanistan", "Ghazni", 2, 0, "A mother and daughter are stoned to death for adultery following a fatwa."], ["2011.11.10", "Afghanistan", "Lashkar Gah", 2, 1, "Two civilians are incinerated by a suicide bomber.  A child is badly burned."], ["2011.11.10", "Iraq", "Baghdad", 2, 4, "A doctor and his son are dismantled by Mujahid bombers."], ["2011.11.10", "Kosovo", "Mitrovica", 1, 2, "Muslim snipers shoot a Serb twice in the back, killing him."], ["2011.11.10", "Nigeria", "Kafanchan", 2, 0, "Islamic raiders murder a village chief and his wife."], ["2011.11.10", "Pakistan", "Akakhel", 4, 0, "Four members of a local peace committee are ambushed and killed by Lashkar-e-Islam (Army of Islam).  One is beheaded."], ["2011.11.10", "Philippines", "Carmen", 1, 0, "A church elder and father of thirteen is beheaded by Religion of Peace activists at his farm."], ["2011.11.10", "South Sudan", "Yida", 12, 20, "The Islamic Republic of Sudan bombs a refugee camp from the air, killing about a dozen."], ["2011.11.11", "Iraq", "Hillah", 2, 6, "A 6-year-old boy is among the casualties of a series of Jihad bombings."], ["2011.11.12", "Afghanistan", "Khash Rod", 1, 0, "Holy Warriors shoot a village elder to death."], ["2011.11.12", "Afghanistan", "Mitram", 9, 0, "A woman and child are among eight civilians torn to shreds by a Taliban bomb."], ["2011.11.12", "Kazakhstan", "Taraz", 7, 0, "An orthodox Muslim kills seven people before blowing himself up."], ["2011.11.12", "Pakistan", "Charsadda", 1, 1, "A local cop bleeds to death following a Sunni bomb attack."], ["2011.11.12", "Pakistan", "Karachi", 1, 0, "A Shiite man is murdered by Sunni gunmen."], ["2011.11.13", "Dagestan", "Mutsalaul", 1, 0, "An imam's assistant is shot to death by suspected extremists."], ["2011.11.13", "India", "Kerala", 1, 0, "Fundamentalists tie a man to a tree and torture him to death over sexual indiscretion."], ["2011.11.13", "Iraq", "Kadhimiya", 1, 4, "A Shiite pilgrim bleeds to death following a bomb attack on his bus by Sunni radicals."], ["2011.11.13", "Iraq", "Tikrit", 3, 11, "'Insurgents' murder three Iraqis with a roadside bomb."], ["2011.11.13", "Pakistan", "Mastak", 9, 6, "Six people are sent to Allah when terrorists detonate a bomb at a marketplace."], ["2011.11.13", "Pakistan", "Spah Darri", 6, 0, "Four children and two women are crushed to death by a mortar attack on their home by Religion of Peace militants."], ["2011.11.14", "Iraq", "Mosul", 2, 3, "Two civilians are murdered by 'insurgents'."], ["2011.11.14", "Pakistan", "Chowrangi", 1, 1, "A prayer leader is gunned down by Religion of Peace rivals."], ["2011.11.14", "Pakistan", "Gharyal", 2, 0, "Bodies are found of a woman and her husband who were stabbed to death by her family after eloping against their will."], ["2011.11.14", "Pakistan", "Kohat", 1, 8, "Terrorists fire mortar shells into a residential neighborhood, killing a woman."], ["2011.11.14", "Pakistan", "Landhi", 1, 0, "A father of four is shot to death in a sectarian attack."], ["2011.11.14", "Pakistan", "Nala", 4, 5, "An Islamic drive-by leaves four local soldiers dead."], ["2011.11.14", "Thailand", "Narathiwat", 1, 0, "Islamic gunmen aerate an innocent plantation worker."], ["2011.11.15", "Afghanistan", "Ghormach", 1, 15, "One Afghan is killed by Taliban bombers."], ["2011.11.15", "India", "Kishtwar", 1, 0, "Hizb-ul-Mujahideen members open fire on a group of policemen, leaving one dead."], ["2011.11.15", "Israel", "Haifa", 0, 1, "An 82-year-old nun is tied up and severely beaten by a gang of four Muslims, including a father and son."], ["2011.11.15", "Pakistan", "Bahawalpur", 1, 0, "A woman is hacked to death by her three brothers for having a sexual affair."], ["2011.11.15", "Somalia", "Mogadishu", 1, 9, "A child is dies from splinter injuries after fundamentalists toss a grenade into a house hosting a television soccer match."], ["2011.11.16", "Iraq", "Baghdad", 2, 18, "Two Shiite pilgrims die following a bomb attack on their bus by militant Sunnis."], ["2011.11.16", "Jordan", "Tafilah", 1, 0, "An 18-year-old woman has her throat slit at a bus station by her brother for being sexually 'impure'."], ["2011.11.16", "Pakistan", "Karachi", 1, 0, "A pastor is shot in the neck and face in a targeted ambush."], ["2011.11.16", "Pakistan", "Karachi", 2, 0, "Two hero cops die from injuries suffered while stopping four Shahid suicide bombers."], ["2011.11.16", "Pakistan", "Spori", 6, 2, "Six villagers are disassembled by a Taliban landmine."], ["2011.11.16", "Russia", "Moscow", 1, 0, "A poet is shot five times in the head after 'angering' Islamic separatists in Chechnya."], ["2011.11.16", "Thailand", "Pattani", 2, 0, "Two men are machine-gunned by Islamic 'insurgents' while in their car."], ["2011.11.17", "Egypt", "Cairo", 0, 32, "Islamic radicals violently attack a group of Copts, marching to a memorial for slain victims of another massacre."], ["2011.11.17", "Iraq", "Mahmoudiya", 4, 8, "Jihadi car bombers take down four Iraqis."], ["2011.11.17", "Nigeria", "Gargari", 4, 6, "Three young girls are among four Christians murdered by Muslim extremists in their own homes."], ["2011.11.17", "Pakistan", "Qamber", 2, 0, "Two Sikhs are crushed to death by a Muslim militant rocket attack on their shop."], ["2011.11.17", "Somalia", "Mogadishu", 4, 12, "Children are among the casualties when al-Shabaab militants send mortars into a home."], ["2011.11.17", "Thailand", "Narathiwat", 0, 5, "Five Buddhist teachers are shot point-blank by Islamic 'insurgents'."], ["2011.11.17", "Yemen", "Aden", 1, 0, "al-Qaeda cadres shoot a Yemeni to death."], ["2011.11.18", "Afghanistan", "Nangarhar", 4, 6, "Four children are reportedly killed by a Taliban bomb at a playground."], ["2011.11.18", "Iraq", "Abu Ghraib", 4, 13, "Four people are killed when Muslim rivals bomb their mosque."], ["2011.11.18", "Iraq", "Fallujah", 5, 2, "A 55-year-old woman and children are among five members of a family blown apart by a Jihad bomb attack on their home."], ["2011.11.18", "Nigeria", "Maiduguri", 3, 0, "A child is among three people killed in a Boko Haram ambush."], ["2011.11.18", "Thailand", "Pattani", 1, 1, "A 43-year-old Buddhist is taken down by Muslim bombers."], ["2011.11.19", "Azerbaijan", "Baku", 1, 0, "A journalist is beaten and stabbed five times over an article deemed critical of Muhammad."], ["2011.11.19", "Iraq", "Mussayab", 2, 0, "'Insurgents' kidnap and behead two civilians."], ["2011.11.19", "Iraq", "Ramadi", 5, 4, "Terrorists attack a police checkpoint, shooing five officers to death."], ["2011.11.19", "Pakistan", "Shaidu", 1, 1, "A moderate cleric is shot to death in a mosque after telling radicals not to preach there."], ["2011.11.19", "Yemen", "al-Mukalla", 1, 0, "al-Qaeda assassins are suspected in a deadly shooting."], ["2011.11.20", "Iraq", "Hillah", 4, 0, "Three women are among four Iraqis executed at point-blank range by Mujahid gunmen."], ["2011.11.20", "Nigeria", "Razat", 3, 1, "Muslims hack three young Christians to death at an illegal roadblock."], ["2011.11.20", "Pakistan", "Karachi", 0, 5, "Fundamentalists bomb a cinema."], ["2011.11.20", "Pakistan", "Sindh", 1, 0, "Sunnis set up a fake roadblock and kill a Shiite driver."], ["2011.11.21", "Iraq", "Abbarah", 1, 3, "A civilian is taken out by Jihadi bombers."], ["2011.11.21", "Nigeria", "Barkin Ladi", 1, 0, "Islamic extremists behead a young Christian."], ["2011.11.21", "Pakistan", "Orakzai", 2, 11, "Tehrik-e-Taliban kill two local security personnel in a sustained assault on their post."], ["2011.11.21", "Thailand", "Pattani", 0, 9, "Three Buddhist monks and three elderly men are among nine injured by a Muslim bomb hidden in a flower pot."], ["2011.11.21", "Thailand", "Yala", 1, 0, "A 55-year-old businessman is torn to shreds by a Muslim bomb."], ["2011.11.22", "Afghanistan", "Alingar", 4, 2, "A woman and child are among four civilians murdered during a Taliban roadside attack."], ["2011.11.22", "Pakistan", "Dera Bugti", 5, 11, "Islamic militants are thought responsible for an attack on a group of Chinese engineers that leaves five dead."], ["2011.11.22", "Pakistan", "Karachi", 1, 0, "A father of three is shot to death by sectarian rivals."], ["2011.11.22", "Pakistan", "Mardan", 2, 7, "A guard and passerby are killed when religious radicals bomb a girl's school."], ["2011.11.22", "Pakistan", "Pasni", 2, 0, "Two members of a peace committee are abducted by Islamic militants, slaughtered and then dumped in a market."], ["2011.11.22", "Pakistan", "Quetta", 1, 0, "A mosque imam is gunned down after prayer by Religion of Peace rivals."], ["2011.11.22", "Somalia", "Mogadishu", 11, 4, "Three children are among eleven civilians disassembled by an al-Shabaab bomb."], ["2011.11.23", "Afghanistan", "Grishk", 1, 1, "A civilian is murdered by armed Sunni fundamentalists."], ["2011.11.23", "Iraq", "Diyala", 9, 0, "Nine torture victims of al-Qaeda are found buried together."], ["2011.11.23", "Nigeria", "Sabon Layi", 4, 0, "A Bible teacher is among four worshipers slaughtered at a church by Muslim radicals."], ["2011.11.23", "Nigeria", "Yobe", 2, 0, "Militants kidnap and kill two children to punish their father for being 'disloyal to Islam' by converting to Christianity."], ["2011.11.23", "Pakistan", "Darbaan Kalan", 2, 7, "Two local cops are exterminated by a Sunni rocket attack on their station."], ["2011.11.23", "Pakistan", "Khurda Renala", 1, 0, "Muslims torture and shoot to death a Catholic father of four."], ["2011.11.24", "Afghanistan", "Bakwah", 10, 7, "At least ten security guards are slaughtered by Taliban gunmen."], ["2011.11.24", "Iraq", "Baghdad", 1, 2, "A woman is murdered in her home by Islamic terrorists."], ["2011.11.24", "Iraq", "Basra", 25, 71, "Two dozen people are sent to Allah by Mujahid bombers at an outdoor market."], ["2011.11.24", "Kenya", "Mandera", 1, 4, "A Kenyan soldier loses his life to a cross-border IED attack by Islamic terrorists."], ["2011.11.24", "Nigeria", "Barkin Ladi", 18, 1, "A Christian family of sixteen, including children, is burned alive by Fulanis."], ["2011.11.24", "Nigeria", "Kwok", 26, 0, "Twenty-six Christian villagers are shot and hacked to death by Fulani herdsmen screaming 'Allah Akbar'."], ["2011.11.24", "Pakistan", "Gujrat", 2, 0, "A young couple is shot to death by the wife's family for marrying for love."], ["2011.11.24", "Saudi Arabia", "Qatif", 4, 9, "Sunni gunmen fire into a Shiite funeral, killing four mourners."], ["2011.11.24", "Thailand", "Narathiwat", 3, 0, "Three plantation workers are shot to death by suspected Muslim radicals while riding in a pickup truck."], ["2011.11.24", "Thailand", "Pattani", 2, 0, "Two drug manufacturers are gunned down by suspected Islamists."], ["2011.11.25", "Afghanistan", "Gereshk", 2, 0, "Two police officers are gunned down in cold blood by religious radicals."], ["2011.11.25", "Kenya", "Garissa", 1, 0, "One person is murdered outside of a church by Muslim radicals."], ["2011.11.25", "Kenya", "Garissa", 2, 27, "Islamists toss grenades into a restaurant, killing two patrons."], ["2011.11.25", "Mali", "Timbuktu", 1, 0, "A German tourist is shot to death at a restaurant by al-Qaeda."], ["2011.11.25", "Pakistan", "Karachi", 1, 0, "A 70-year-old Shia man is shot through the head in his shop by sectarian Jihadis."], ["2011.11.25", "Pakistan", "Muzaffargarh", 0, 2, "Two Christian women are beaten on their own land with clubs by a group of Muslim 'men'."], ["2011.11.26", "India", "Kakinara", 1, 0, "A 17-year-old Hindu girl is stabbed to death by a Muslim rapist."], ["2011.11.26", "Iraq", "Abu Ghraib", 8, 13, "Eight construction workers are permanently demolished by a Mujahid bombing attack."], ["2011.11.26", "Iraq", "Baghdad", 7, 28, "Holy Warriors take down seven Iraqis with well-planted bombs along a commercial district."], ["2011.11.26", "Nigeria", "Geidam", 4, 20, "Islamic radicals descend on a small town, burn eight churches and murder four defenders."], ["2011.11.26", "Pakistan", "Rawalpindi", 2, 0, "Two sisters have their throats slit by conservative in-laws after failing to conceive."], ["2011.11.27", "Nigeria", "Borno", 2, 0, "Boko Haram Islamists shoot two people to death."], ["2011.11.27", "Pakistan", "Karachi", 2, 0, "Two Shias are gunned down in separate sectarian attacks."], ["2011.11.27", "Pakistan", "Numaish Chowrangi", 2, 8, "Two people are killed during a sectarian incident between Sunni and Shia."], ["2011.11.27", "Philippines", "Zamboanga", 3, 27, "Holy Warriors bomb a hotel packed with wedding guests, killing at least three."], ["2011.11.27", "Somalia", "Afmadow", 2, 0, "Two youth are beheaded by al-Shabaab Islamists."], ["2011.11.27", "Somalia", "Mogadishu", 1, 5, "Religion of Peace proponents blow a hole in a hospital, killing a nurse treating famine victims."], ["2011.11.27", "Yemen", "Damaj", 30, 61, "Militant Shiites shell a Sunni town, killing thirty, including several students."], ["2011.11.28", "Iraq", "Baghdad", 5, 6, "A Shahid suicide bomber detonates himself outside the parliament building, killing five people."], ["2011.11.28", "Iraq", "Kirkuk", 1, 13, "One family member is killed when 'insurgents' throw a bomb into a house."], ["2011.11.28", "Iraq", "Taji", 19, 24, "Suicide bombers destroy a minibus, along with nineteen passengers."], ["2011.11.29", "Iraq", "Samarra", 5, 0, "Sunni extremists murder five family members of a Shia cleric in their home, including two women."], ["2011.11.29", "Pakistan", "Quetta", 1, 0, "Wahhabis murder a Shia professor."], ["2011.11.29", "Pakistan", "South Waziristan", 2, 3, "Two people are killed by a Taliban bomb while attending a funeral."], ["2011.11.29", "Thailand", "Narathiwat", 1, 0, "Islamic 'separatists' kill a 49-year-old civilian in a drive-by."], ["2011.11.30", "Egypt", "Ghorayzat", 2, 3, "Two Christian brothers are murdered in cold blood by a Muslim mob rampaging through Christian homes and businesses."], ["2011.11.30", "Pakistan", "Hangu", 1, 2, "A member of a peace committee gets a rude awakening from militant car bombers."], ["2011.11.30", "Somalia", "Mogadishu", 4, 12, "Four Somalis are sent to Allah by a Fedayeen suicide bomber."], ["2011.11.30", "Turkey", "Istanbul", 0, 2, "A man fires a shotgun at the guards of a palace complex while shouting 'Allah Akbar'."], ["2011.11.30", "Yemen", "Aden", 2, 0, "Two guards are shot to death by Islamists."], ["2011.12.01", "Iraq", "Jil al-Said", 8, 5, "al-Qaeda gunmen pull eight people from their homes, line them up against the wall and shoot them."], ["2011.12.01", "Iraq", "Khalis", 10, 25, "Ten patrons at a vegetable market are ripped apart by a well-placed bomb."], ["2011.12.01", "Thailand", "Yala", 1, 1, "A local soldier is killed by a bomb planted by Islamic 'insurgents'."], ["2011.12.02", "Afghanistan", "Logar", 1, 84, "A suicide truck bomber kills a carpenter and injures about eighty others."], ["2011.12.02", "Iraq", "Taji", 4, 7, "al-Qaeda bombers take down four Iraqis, including a man and his mother."], ["2011.12.02", "Iraq", "al-Sharqat", 3, 2, "Three civilian defense volunteers are machine-gunned at a checkpoint by al-Qaeda."], ["2011.12.02", "Pakistan", "Khyber", 5, 0, "Three women and two children are killed in the crossfire between two Islamist groups."], ["2011.12.02", "Pakistan", "Landi Kotal", 2, 2, "Two peace committee members are murdered by armed radicals."], ["2011.12.02", "Yemen", "Ghayl Ba Wazir", 2, 3, "al-Qaeda gunmen spray the inside of a coffee shop with bullets, leaving at least two dead."], ["2011.12.03", "Iraq", "Baaj", 3, 0, "Three brothers are shot to death in their home by Sunni militants."], ["2011.12.03", "Iraq", "Baghdad", 2, 0, "A man and his wife are murdered by Islamist gunmen."], ["2011.12.03", "Iraq", "Iskandariya", 3, 0, "Three innocent people are killed by an 'insurgent' roadside bomb."], ["2011.12.03", "Iraq", "Zakho", 0, 32, "Thirty-two people are injured during a rampage by fundamentalists against Christian-owned businesses."], ["2011.12.03", "Kazakhstan", "Boraldai", 2, 0, "Two policemen are shot to death by a group of Muslim radicals."], ["2011.12.03", "Nigeria", "Maiduguri", 2, 3, "Boko Haram Islamists fire into a wedding ceremony, killing the groom and a guest."], ["2011.12.03", "Pakistan", "Jaffarabad", 2, 0, "Two people are shot to death on suspicion of 'illicit relations'."], ["2011.12.03", "Pakistan", "Karachi", 2, 0, "Two men are shot to death by sectarian Jihadis."], ["2011.12.03", "Yemen", "Zinjibar", 5, 0, "Five local soldiers are taken out in a brutal al-Qaeda ambush."], ["2011.12.04", "Bangladesh", "Dhaka", 0, 1, "A man ties up his wife and then cuts off her fingers for seeking higher education without his approval."], ["2011.12.04", "Iraq", "Bayaa", 1, 9, "Sunni bombers manage to take down a Shia pilgrim on foot."], ["2011.12.04", "Nigeria", "Bauchi", 6, 2, "A boy is among six people killed by a Boko Haram bombing and shooting attack.."], ["2011.12.04", "Thailand", "Pattani", 1, 0, "Suspected fundamentalists smash in the head of a 24-year-old lesbian and throw her into a garbage dump."], ["2011.12.05", "Afghanistan", "Chora", 5, 6, "Four children and a woman are dismantled by a Taliban roadside bomb."], ["2011.12.05", "Iraq", "Baghdad", 3, 20, "Three Shiite pilgrims are killed by Sunni bombers."], ["2011.12.05", "Iraq", "Baghdad", 8, 18, "A Sunni roadside bomb attack on a Shia procession leaves eight pilgrims dead."], ["2011.12.05", "Iraq", "Hillah", 22, 63, "Two dozen pilgrims, mostly women and children, are ripped apart by three Sunni car bombs."], ["2011.12.05", "Iraq", "Latifiyah", 2, 3, "Sunni bombers take down two Shiite pilgrims on foot."], ["2011.12.05", "Kenya", "Dadaab", 1, 3, "An al-Shabaab roadside bomb leaves a refugee camp guard dead."], ["2011.12.05", "Kenya", "Nairobi", 0, 1, "A 23-year-old Christian is beaten into unconsciousness by seven Muslims for the crime of leaving Islam."], ["2011.12.05", "Nigeria", "Maiduguri", 2, 0, "Two people praying at a mosque are gunned down by Religion of Peace rivals."], ["2011.12.05", "Pakistan", "Jhang", 0, 8, "Sunni and Shia clash over religious differences."], ["2011.12.05", "Pakistan", "Kohat", 2, 11, "Muslim militants fire a rocket into a market, killing two people."], ["2011.12.05", "Somalia", "Bosaso", 1, 0, "al-Shabaab extremists gun down a rival cleric at a mosque."], ["2011.12.05", "Syria", "Homs", 36, 0, "Sectarian violence between the Farouq Brigade of Islamists and Alawites results in thirty-six people kidnapped, tortured and beheaded."], ["2011.12.06", "Afghanistan", "Kabul", 80, 134, "About eighty Shiite pilgrims, including women and children, are torn to shreds outside a shrine by a Sunni wearing an explosives vest packed with ball bearings."], ["2011.12.06", "Afghanistan", "Mazar-i-Sharif", 4, 21, "Four Shiites leaving a mosque are sent straight to Allah by Sunni bicycle bombers."], ["2011.12.06", "India", "Pulwama", 1, 0, "Islamic militants abduct and murder a civilian."], ["2011.12.06", "Iraq", "Kirkuk", 1, 0, "An oil company employee is blown up by Islamic 'insurgents'."], ["2011.12.06", "Iraq", "Kirkuk", 1, 8, "Sunnis fire mortars at a Shia mosque, killing one occupant."], ["2011.12.06", "Pakistan", "Jhang", 0, 6, "After offering prayers, two rival Islamic groups pelt each other with stones."], ["2011.12.06", "Somalia", "Mogadishu", 4, 10, "A Fedayeen suicide bomber scatters the body parts of at least four victims along a city street."], ["2011.12.07", "Afghanistan", "Sangin", 19, 6, "Holy Warriors massacre nineteen bus passengers, including five children, with a landmine."], ["2011.12.07", "Iraq", "Fallujah", 3, 2, "Three local cops are taken out by Jihadi bombers."], ["2011.12.07", "Iraq", "Mosul", 2, 0, "A professor is among two people shot to death by suspected Islamists."], ["2011.12.07", "Nigeria", "Kaduna", 10, 12, "Very young children are among the casualties of a Shahid suicide bombing in a commercial district."], ["2011.12.07", "Thailand", "Pattani", 1, 0, "A Buddhist cop is murdered by a Muslim drive-by."], ["2011.12.07", "Yemen", "Dammaj", 3, 0, "Sunni Islamists open fire on a group of Shia, killing three."], ["2011.12.08", "Pakistan", "Khyber", 1, 0, "The Abdullah Azam Brigade claim responsibility for the murder of a women's rights advocate."], ["2011.12.08", "Yemen", "Dammaj", 7, 15, "Seven are killed when Salafists and Shiites lob shells at each other."], ["2011.12.09", "Afghanistan", "Ghazi Abad", 6, 8, "A Shahid suicide bomber detonates inside a mosque, killing six."], ["2011.12.09", "Pakistan", "Karachi", 1, 0, "A 45-year-old Shia man is gunned down in his own home by Wahhabis."], ["2011.12.09", "Pakistan", "Karachi", 3, 4, "A roadside attack by suspected Islamists leaves three security personnel dead."], ["2011.12.09", "Thailand", "Yala", 1, 0, "Militant Muslims shoot a 28-year-old man to death outside a rubber plantation."], ["2011.12.10", "Afghanistan", "Khakrez", 3, 0, "Sunni bombers murder three civilians riding a taxi."], ["2011.12.10", "Afghanistan", "Kunduz", 2, 16, "Islamists attach a bomb to a bicycle that manages to kill two innocents."], ["2011.12.10", "Afghanistan", "Maiwand", 1, 0, "A civilian on a motorcycle is taken out by a Taliban bomb."], ["2011.12.10", "Iraq", "Kirkuk", 7, 4, "Seven Iraqis are killed in a series of sectarian attacks."], ["2011.12.10", "Nigeria", "Jos", 1, 11, "A young fan is killed when Islamic bombers target several Christian areas, including an outdoor viewing of a televised soccer match."], ["2011.12.10", "Nigeria", "Kukum Gida", 1, 2, "Muslim gunmen ambush Christian villagers in the middle of the night, murdering a 50-year-old woman."], ["2011.12.10", "Nigeria", "Sapele", 0, 1, "A bomb is thrown into a mosque to settle a disagreement between members over 'mode of worship'."], ["2011.12.10", "Nigeria", "Sapele", 0, 1, "A disagreement at a mosque leads to a bombing that leaves one badly injured."], ["2011.12.10", "Pakistan", "Karachi", 1, 7, "A 45-year-old man is killed when Islamists detonate a bomb at a university."], ["2011.12.10", "Pakistan", "Karachi", 3, 0, "A victim of torture is among three people killed in sectarian violence."], ["2011.12.10", "Pakistan", "Landikotal", 1, 0, "Religious extremists tear down two Sufi shrines and murder an elderly caretaker."], ["2011.12.10", "Pakistan", "Sham", 1, 3, "Terrorists take down a child and injure three women with a landmine."], ["2011.12.10", "Yemen", "Zinjibar", 2, 36, "Two local soldiers are murdered in a violent al-Qaeda assault on a barracks."], ["2011.12.11", "India", "Srinagar", 1, 3, "Muslim terrorists are responsible for a shooting attack that leaves one dead."], ["2011.12.11", "Kenya", "Mandera", 1, 12, "One person is killed when al-Shabaab bombers target humanitarian workers outside a refugee camp."], ["2011.12.11", "Nigeria", "Gombe", 1, 0, "Muslim gunmen murder a Christian as he is putting gas in his car."], ["2011.12.11", "Nigeria", "Kagoro", 1, 2, "Fulani extremists gun down a Christian mother."], ["2011.12.11", "Pakistan", "Kharhy Mela", 3, 0, "Three tribal elders are shot to death by Islamic activists, including one in captivity."], ["2011.12.12", "Afghanistan", "Greshk", 6, 2, "The Taliban slaughter six women and children with a roadside bomb."], ["2011.12.12", "India", "Sujna", 1, 0, "Mujahideen shoot a police officer to death."], ["2011.12.12", "Indonesia", "Jakarta", 0, 2, "A man stabs members of a TV crew for supposedly insulting Allah."], ["2011.12.12", "Iraq", "Baghdad", 2, 6, "Terrorists gun down two people and attempt to blow up six others."], ["2011.12.12", "Nigeria", "Borno", 4, 0, "A woman is among four people machine-gunned by suspected Islamists in a surprise drive-by attack."], ["2011.12.12", "Pakistan", "Dadar", 1, 0, "The driver of an oil tanker is pulled out of his truck and shot to death by Taliban militants."], ["2011.12.12", "Pakistan", "Hangu", 4, 4, "Militant Muslims kill four people in two attacks, which include firing rockets into a commercial district."], ["2011.12.12", "Pakistan", "Karachi", 0, 53, "Fifty-three people, some children as young as 7, are chained and tortured in the basement of a seminary by the staff."], ["2011.12.12", "Pakistan", "Quetta", 1, 0, "A young Hindu is abducted and murdered in captivity."], ["2011.12.13", "Iraq", "Baghdad", 1, 5, "A Fedayeen suicide bombing leaves one other person dead."], ["2011.12.13", "Iraq", "Fallujah", 3, 5, "Three bus passengers are riddled with bullets by al-Qaeda assassins."], ["2011.12.13", "Iraq", "Ishaqi", 2, 3, "Muslim bombers take out two Iraqis."], ["2011.12.13", "Iraq", "Mosul", 2, 2, "A Christian man and his wife are gunned down in their car by Jihad warriors.  Their children survive with injuries."], ["2011.12.13", "Nigeria", "Maiduguri", 4, 11, "A 9-year-old child is among four reported dead from a suicide attack."], ["2011.12.13", "Pakistan", "Bara", 4, 4, "Two children and a woman are among four civilians killed when Islamic militants shell their home."], ["2011.12.13", "Pakistan", "Satellite Town", 1, 0, "The body of a young Hindu is found, three weeks after his abduction by Muslim militants."], ["2011.12.13", "Pakistan", "Shalobar", 2, 7, "Two women are killed in a Taliban rocket attack on their neighborhood."], ["2011.12.13", "Thailand", "Pattani", 1, 0, "Muslim 'insurgents' gun down a Buddhist mechanic riding a motorcycle."], ["2011.12.13", "Yemen", "Zinjibar", 3, 11, "al-Qaeda gunmen murder several local troops in a shooting attack."], ["2011.12.14", "Afghanistan", "Khanishin", 3, 3, "Three Afghans lose their lives to a Taliban roadside bomb."], ["2011.12.14", "Dagestan", "Caspiisk", 1, 0, "Muslim 'separatists' murder a man in his own home."], ["2011.12.14", "Iraq", "Mosul", 2, 0, "Two more Christians are shot to death."], ["2011.12.14", "Iraq", "Tal Afar", 5, 33, "Jihadis take down five Iraqis with two car bombs - the first of which was intended to attract more victims."], ["2011.12.14", "Lebanon", "Ain al-Helweh", 1, 0, "A man is shot to death by Jund al-Sham gunmen."], ["2011.12.14", "Nigeria", "Maiduguri", 2, 3, "Boko Haram members fire on a group of people playing cards, killing two."], ["2011.12.14", "Pakistan", "Bara", 2, 1, "Two peace committee members are murdered by Islamic terrorists."], ["2011.12.14", "Pakistan", "Landikotal", 2, 0, "Two cemetery guards are shot to death by Abdullah Ezaam terrorists."], ["2011.12.14", "Pakistan", "Quetta", 1, 0, "The son of a cleric is murdered by Religion of Peace rivals."], ["2011.12.14", "Thailand", "Narathiwat", 1, 0, "A local politician is assassinated by Muslim radicals."], ["2011.12.15", "Nigeria", "Kano", 4, 2, "Four security personnel are killed by a surprise Boko Haram assault on their school."], ["2011.12.15", "Nigeria", "Maiduguri", 5, 0, "Gunmen from an Islamic sect fire on a group of civilians outside a shop, killing two."], ["2011.12.15", "Saudi Arabia", "Jeddah", 0, 6, "At least six Ethiopian Christians are beaten when police storm a prayer meeting.  Twenty-nine women are strip-searched."], ["2011.12.15", "Thailand", "Yala", 2, 1, "Suspected Islamists riddle a family vehicle with bullets, killing a mother and son."], ["2011.12.16", "Afghanistan", "Kabul", 1, 0, "A 7-year-old girl dies from splinter injuries from a grenade thrown by Sunni radicals."], ["2011.12.16", "Iraq", "Mosul", 1, 0, "A man is shot to death in his home by Mujahideen."], ["2011.12.16", "Pakistan", "Bara", 1, 4, "Terrorists take out a 6-year-old girl in a rocket attack on her home."], ["2011.12.16", "Pakistan", "Muslim Dhand", 3, 0, "A woman is among three killed when Talibanis mortar a residential neighborhood."], ["2011.12.17", "Afghanistan", "Kandahar", 1, 0, "A government official is shot to death by Taliban militants while walking home."], ["2011.12.17", "Iraq", "Abu Ghraib", 3, 2, "Jihadis bomb a minibus, killing two passengers."], ["2011.12.17", "Iraq", "Baghdad", 1, 0, "A secular judge is assassinated by suspected religious radicals."], ["2011.12.17", "Pakistan", "Katasarai", 3, 0, "Tehreek-e-Taliban terrorists kill three local soldiers with an IED."], ["2011.12.17", "Pakistan", "Loralali", 1, 0, "A woman is honor-killed by her two brothers-in-law."], ["2011.12.17", "Thailand", "Yala", 1, 0, "Islamic 'separatists' kill a 35-year-old man in a drive-by."], ["2011.12.18", "Lebanon", "Ain al-Helweh", 1, 3, "A child is among the casualties of a Jund al-Sham shooting attack."], ["2011.12.18", "Nigeria", "Kano", 6, 10, "A half-dozen victims result from a terror attack by Islamic fundamentalists."], ["2011.12.18", "Pakistan", "Jhang", 2, 0, "Two women are murdered by relatives on suspicion of illicit relations."], ["2011.12.18", "Pakistan", "Muzaffargarh", 1, 3, "One person is killed in a fight between two groups of worshippers over control of a mosque."], ["2011.12.19", "Iraq", "Balad", 1, 2, "Sunnis bomb a minibus carrying Shia pilgrims, killing at least one."], ["2011.12.19", "Iraq", "Kokjali", 1, 1, "A teenager is murdered by Muslim terrorists while walking home from school."], ["2011.12.19", "Iraq", "Mosul", 4, 4, "A grocer is among four left dead after separate Mujahideen attacks."], ["2011.12.19", "Kenya", "Dadaab", 1, 2, "al-Shabaab bombers take out a guard at a refugee camp."], ["2011.12.19", "Nigeria", "Ungwan Rami", 5, 6, "Five Christian villagers are hacked and shot to death by Muslim raiders.  The victims include a mother and her baby."], ["2011.12.19", "Pakistan", "Mastung", 1, 0, "Wahhabis gun down a Shia civilian waiting for a bus."], ["2011.12.20", "Iraq", "Fallujah", 4, 0, "Four contractors are kidnapped and murdered."], ["2011.12.20", "Pakistan", "Huta", 1, 0, "A government official is assassinated by al-Qaeda gunmen."], ["2011.12.21", "Afghanistan", "Rawza", 5, 0, "Five Polish soldiers are killed by Taliban bombers in a roadside attack."], ["2011.12.21", "Pakistan", "Karachi", 1, 7, "One person is killed during a clash between Sunni and Shia."], ["2011.12.21", "Thailand", "Pattani", 2, 11, "Two Thais are killed during a wave of Mujahid bombing and shootings."], ["2011.12.21", "Thailand", "Yala", 1, 1, "A villager is shot and killed by Muslim 'insurgents'."], ["2011.12.22", "Iraq", "Baghdad", 72, 217, "Over seventy Iraqis are massacred by 'freedom fighters' in a series of bombings and rocket attacks across the city following the departure of U.S. troops."], ["2011.12.22", "Iraq", "Baqubah", 5, 0, "Five family members are machine-gunned in their home by al-Qaeda gunmen."], ["2011.12.22", "Iraq", "Kirkuk", 1, 0, "A young man is kidnapped and executed by 'insurgents'."], ["2011.12.22", "Nigeria", "Chibok", 2, 0, "Islamists invade a family home and murder a father and son simply because they are Christian."], ["2011.12.22", "Nigeria", "Damaturu", 4, 0, "Four Nigerians are taken down by Boko Haram bombers."], ["2011.12.22", "Pakistan", "Hangu", 0, 4, "Terrorists bomb the clinic of a female doctor, injuring four, including a young girl."], ["2011.12.22", "Pakistan", "Lahore", 0, 1, "A young Christian is stabbed several times after having been falsely accused of insulting Islam."], ["2011.12.22", "Pakistan", "Punjab", 0, 16, "Two student Islamic groups clash over sectarian differences."], ["2011.12.23", "Nigeria", "Damaturu", 4, 0, "Boko Haram militants open fire on a group of police, killing four."], ["2011.12.23", "Nigeria", "Potiskum", 1, 7, "A 10-year-old boy is among the casualties of a shooting attack by Muslim militants."], ["2011.12.23", "Pakistan", "Shadman", 2, 2, "Two employees at a telecom office are gunned down in cold blood by orthodox Muslims because they worked for a Norwegian firm."], ["2011.12.23", "Pakistan", "Tank", 1, 17, "The Taliban take hostages after a deadly attack on a post, threatening to cut them into pieces."], ["2011.12.23", "Somalia", "Mataban", 3, 0, "A Religion of Peace 'activist' shoots three aid workers to death."], ["2011.12.23", "Syria", "Damascus", 44, 166, "Over forty people are torn to shreds by two Shahid suicide bombers in an upscale district."], ["2011.12.24", "Afghanistan", "Takhta Pul", 3, 0, "Three locals are killed by a Taliban bomb."], ["2011.12.24", "India", "Srinagar", 1, 0, "The Islamic Movement of Kashmir assassinate a local official."], ["2011.12.24", "Iraq", "Kirkuk", 3, 1, "Two brothers are kidnapped and murdered by 'insurgents', who also kill a school principal."], ["2011.12.24", "Iraq", "Mosul", 4, 3, "Four Iraqis are shot to death in a series of Mujahideen shootings."], ["2011.12.24", "Kenya", "Wajir", 0, 6, "A half-dozen people are injured when fundamentalists throw a grenade into a bar."], ["2011.12.24", "Nigeria", "Maiduguri", 11, 0, "A pastor and his young daughter are incinerated when Islamists fire bomb three churches."], ["2011.12.24", "Pakistan", "Bannu", 9, 17, "A Fedayeen suicide car bomber murders nine others."], ["2011.12.24", "Pakistan", "Urmur", 1, 3, "A toy bomb planted by religious extremists leaves a father dead and three children injured."], ["2011.12.24", "Uganda", "Namasuba", 0, 1, "A young pastor, who left Islam after having been born the son of an imam, is blinded by acid in a vicious Christmas Eve attack."], ["2011.12.25", "Afghanistan", "Talaqan", 22, 50, "Two dozen mourners at a funeral are sent to Allah by a Fedayeen suicide bomber."], ["2011.12.25", "Iraq", "Dujail", 2, 20, "A Fedayeen suicide bomber sends two Iraqis to Allah."], ["2011.12.25", "Iraq", "Garma", 6, 2, "Six local cops at a checkpoint are machine-gunned at point-blank range by Sunni terrorists."], ["2011.12.25", "Iraq", "Mosul", 1, 0, "Muslim snipers pick off a Christian just outside his home."], ["2011.12.25", "Nigeria", "Damaturu", 3, 1, "A Shahid suicide bomber detonates near a security compound, killing three people."], ["2011.12.25", "Nigeria", "Jos", 1, 0, "Muslim militants fire on a protestant church, killing a guard."], ["2011.12.25", "Nigeria", "Madalla", 45, 73, "Religion of Peace bombers strike a Catholic church during a morning Christmas mass, slaughtering forty-five worshippers."], ["2011.12.25", "Pakistan", "Gilgit", 1, 0, "A Shiite is gunned down by Sunni rivals."], ["2011.12.25", "Pakistan", "Loralai", 1, 0, "A civilian is kidnapped and executed by Tehreek-e-Taliban."], ["2011.12.25", "Sri Lanka", "Sammanthurai", 1, 0, "A Muslim father beats his daughter to death for dating a non-Muslim."], ["2011.12.26", "Iraq", "Baghdad", 7, 37, "Seven people are blown to bits by a Shahid suicide car bomber."], ["2011.12.26", "Iraq", "Baiji", 1, 0, "A man is shot in the head by al-Qaeda."], ["2011.12.26", "Pakistan", "Banaras", 1, 0, "The caretaker of a seminary is murdered by sectarian gunmen."], ["2011.12.26", "Pakistan", "Kohat", 1, 1, "Two members of a peace committee are fired on by Islamic militants."], ["2011.12.26", "Pakistan", "Peerabad", 1, 0, "A school clerk is murdered by religious fundamentalists."], ["2011.12.27", "Iraq", "Kirkuk", 2, 1, "Mujahideen kill two civilians with a car bomb."], ["2011.12.27", "Iraq", "Mosul", 2, 0, "A man and his father are murdered in their home by 'insurgents'."], ["2011.12.27", "Pakistan", "Gulbahar", 2, 0, "A prayer leader is among two gunned down by sectarian rivals."], ["2011.12.27", "Pakistan", "Peshawar", 1, 0, "Islamists gun down a security official as he is leaving a mosque."], ["2011.12.27", "Pakistan", "Tank", 1, 2, "Terrorists fire on a local peace committee, killing one member."], ["2011.12.27", "Thailand", "Yala", 1, 1, "One person is killed when Muslim 'insurgents' bomb a group of teachers and their security."], ["2011.12.28", "Iraq", "Mosul", 4, 0, "Four local police officers are killed in and around the city by Muslim terrorists."], ["2011.12.28", "Nigeria", "Sapele", 0, 7, "Seven children at a religious school are injured when a bomb is thrown to settle a dispute over mosque leadership."], ["2011.12.28", "Pakistan", "Plateau", 3, 0, "A baby is among three members of a Christian family shot and hacked to death by machete-wielding Muslims."], ["2011.12.29", "Afghanistan", "Kapisa", 3, 0, "Two French and one local troops are murdered by a terrorist in an Afghan uniform."], ["2011.12.29", "Afghanistan", "Nad Ali", 10, 1, "Ten police recruits are torn to shreds by a Taliban bomb."], ["2011.12.29", "Egypt", "Assiut", 0, 5, "At least five people are hurt when a Muslim mob burns Christian homes over a Facebook cartoon."], ["2011.12.29", "Pakistan", "Khairpur", 0, 10, "Ten are injured when two religious groups clash over a Quran reading."], ["2011.12.29", "Pakistan", "Orakzai", 1, 0, "Religious radicals murder a tribal elder."], ["2011.12.30", "Afghanistan", "Trinkot", 4, 1, "Holy Warriors take out four civilians riding in a car."], ["2011.12.30", "Nigeria", "Maiduguri", 2, 1, "Suspected Boko Haram gun down two civilians at a market."], ["2011.12.30", "Nigeria", "Maiduguri", 3, 0, "Boko Haram gunmen invade the home of a rival cleric and murder three of his family members."], ["2011.12.30", "Nigeria", "Maiduguri", 4, 4, "At least four people are killed when Islamists set off a bomb outside a rival mosque."], ["2011.12.30", "Pakistan", "Dara Bazar", 2, 3, "A bomb explodes on the main road leading into a village, leaving two dead."], ["2011.12.30", "Pakistan", "Quetta", 16, 35, "A suicide bomber slaughters thirteen innocents, including women and children."], ["2011.12.30", "Pakistan", "Salarzai", 2, 1, "Two children are burned to a crisp when a militant Muslim detonates an incendiary device in a store."], ["2011.12.30", "Pakistan", "Salarzai", 2, 3, "Women are among the casualties when Islamic bombers target a peace committee."], ["2011.12.30", "Pakistan", "Shakoi", 2, 4, "Talibanis mortar a neighborhood, killing two residents."], ["2011.12.30", "Thailand", "Yala", 1, 0, "A 23-year-old man is picked off in front of his home by Muslims on motorcycles."], ["2011.12.30", "Yemen", "Zinjibar", 2, 3, "Two local soldiers are killed by 'Partisans of Sharia' gunmen."], ["2011.12.31", "Iraq", "Diyala", 5, 0, "Five Iraqis are murdered in cold blood by al-Qaeda gunmen."], ["2011.12.31", "Pakistan", "Karachi", 1, 1, "A Shia leader is gunned down by Religion of Peace rivals."], ["2011.12.31", "Pakistan", "Khugakhel", 2, 13, "Two children bleed to death following a bomb blast outside the home of a tribal elder."]], "columns": ["Date", "Country", "City", "Killed", "Injured", "Description"], "year": 2011}