{
  "rows": [
    [
      "2001.09.11",
      "Israel",
      "Bachan",
      2,
      0,
      "Two policemen (ages 19 and 26) are killed when Palestinian gunmen opened fire at a border checkpoint."
    ],
    [
      "2001.09.11",
      "USA",
      "Arlington, VA",
      184,
      53,
      "Nearly 200 people are killed when Islamic hijackers steer a plane full of people into the Pentagon."
    ],
    [
      "2001.09.11",
      "USA",
      "New York, NY",
      2752,
      251,
      "Islamic hijackers steer two planes packed with fuel and passengers into the World Trade Center, killing hundreds on impact and eventually killing thousands when the towers collapsed.  At least 200 are seriously injured."
    ],
    [
      "2001.09.11",
      "USA",
      "Shanksville, PA",
      40,
      0,
      "Forty passengers are killed after Islamic radicals hijack a plane in an attempt to steer it into the U.S. Capitol building."
    ],
    [
      "2001.09.12",
      "Israel",
      "Habla",
      1,
      0,
      "Jewish woman shot to death while driving home."
    ],
    [
      "2001.09.12",
      "Pakistan",
      "Karachi",
      3,
      0,
      "A religious scholar and his two sons are killed by rivals in the ongoing violence between Shia and Sunni."
    ],
    [
      "2001.09.13",
      "Pakistan",
      "Karachi",
      3,
      4,
      "Three civilians are killed and four others injured when Muslim gunmen open fire on a religious gathering."
    ],
    [
      "2001.09.13",
      "Pakistan",
      "Quetta",
      1,
      1,
      "A scholar is injured and his young son killed by Islamic terrorists in an attack on their vehicle."
    ],
    [
      "2001.09.14",
      "India",
      "Kashmir",
      4,
      4,
      "Four civilians are killed in separate Mujahideen attacks across the region."
    ],
    [
      "2001.09.15",
      "Israel",
      "Jerusalem",
      1,
      0,
      "23-year-old Israeli is killed by a Palestinian."
    ],
    [
      "2001.09.15",
      "Pakistan",
      "Hyderabad",
      1,
      17,
      "One person is killed and seventeen others injured, including three children when militants bomb a bus."
    ],
    [
      "2001.09.16",
      "India",
      "Gousu",
      1,
      1,
      "Terrorists kill a woman in her village.  Her husband is injured in the attack."
    ],
    [
      "2001.09.17",
      "India",
      "Handwara",
      9,
      0,
      "Personnel sleeping inside the basement of a building are attacked by two LeT Fedayeen using grenades. Nine SF personnel and one Fedayeen were killed."
    ],
    [
      "2001.09.20",
      "India",
      "Budgam",
      2,
      0,
      "Mujahideen gun down two civilians over a two day period."
    ],
    [
      "2001.09.20",
      "Israel",
      "Tekoa",
      1,
      1,
      "Wife killed, husband injured in shooting attack by Palestinian gunmen."
    ],
    [
      "2001.09.22",
      "Pakistan",
      "Karachi",
      4,
      24,
      "A pro-Taliban mob kills four people and injures several dozen."
    ],
    [
      "2001.09.23",
      "England",
      "Cambridge",
      1,
      0,
      "17-year-old beaten with a hammer and stabbed to death by Muslim gang in Britain.  (Ross Parker murder)."
    ],
    [
      "2001.09.24",
      "Bangladesh",
      "Mollarhat",
      8,
      100,
      "Fundamentalists are behind a high-intensity bomb blast at an election rally that leaves eight dead and over 100 injured."
    ],
    [
      "2001.09.24",
      "India",
      "Kashmir",
      4,
      0,
      "Four civilians are killed in separate attacks across the region."
    ],
    [
      "2001.09.24",
      "Israel",
      "Shadmot Mehol",
      1,
      0,
      "Islamic Jihad members murder 28-year-old Israeli."
    ],
    [
      "2001.09.25",
      "Bangladesh",
      "Sunamganj",
      4,
      2,
      "Four people, including an 8-year-old boy, are killed in a bomb planted by religious fundamentalists"
    ],
    [
      "2001.09.25",
      "Bangladesh",
      "Sylhet",
      2,
      0,
      "Two persons are killed in a bomb blast."
    ],
    [
      "2001.09.25",
      "India",
      "Doda",
      2,
      2,
      "The Mujahideen murder a civilian and abduct two others.  A schoolboy is also killed in the same district."
    ],
    [
      "2001.09.26",
      "Algeria",
      "Larbaa",
      22,
      7,
      "Armed Islamists kill twenty-two civilians and wound seven."
    ],
    [
      "2001.09.27",
      "India",
      "Chitti Bandi",
      1,
      0,
      "A civilian is attacked and killed by militant Muslims."
    ],
    [
      "2001.09.28",
      "India",
      "Kashmir",
      2,
      6,
      "Six civilians are injured in a bomb explosion in Thathri and the bodies of two other Mujahideen victims are recovered elsewhere."
    ],
    [
      "2001.09.29",
      "India",
      "Panjtirthi",
      2,
      0,
      "The bodies of two brothers abducted by the Mujahideen are found."
    ],
    [
      "2001.09.30",
      "India",
      "Gokahama",
      2,
      0,
      "Two civilians are abducted from their home and killed by Islamic terrorists."
    ],
    [
      "2001.09.30",
      "India",
      "Sangla",
      3,
      1,
      "Lashkar-e-Toiba terrorists kill three members of the same family in a brutal attack."
    ],
    [
      "2001.10.01",
      "India",
      "Srinagar",
      38,
      60,
      "Suicide bomber and additional Islamic militants kill and injure mostly civilians at the J&K; State Assembly."
    ],
    [
      "2001.10.01",
      "Indonesia",
      "Tomata",
      3,
      0,
      "Terrorists attack a Christian church, killing three women."
    ],
    [
      "2001.10.02",
      "Israel",
      "Alei Sinai",
      2,
      15,
      "Two young men (19 and 20) were killed in their homes by grenade attack. Fifteen others were wounded."
    ],
    [
      "2001.10.03",
      "Indonesia",
      "Peleru",
      10,
      0,
      "Jihad warriors kill 10 Christian villagers and injure an unknown number."
    ],
    [
      "2001.10.03",
      "Pakistan",
      "Karachi",
      1,
      1,
      "Terrorists ambush two men, killing one."
    ],
    [
      "2001.10.04",
      "India",
      "Sogam",
      2,
      0,
      "Jamiat-ul-Mujahideen terrorists abduct and kill two policemen."
    ],
    [
      "2001.10.04",
      "Israel",
      "Afula",
      3,
      13,
      "Palestinian terrorist disguised as Israeli paratrooper opens fire on crowded bus stop and kills three, injures thirteen."
    ],
    [
      "2001.10.04",
      "Pakistan",
      "Azam",
      6,
      7,
      "Six people, including two children, are killed in a sectarian attack by militant Muslims."
    ],
    [
      "2001.10.05",
      "Israel",
      "Avnei Hefetz",
      1,
      0,
      "Palestinian machine-gun ambush kills Israeli civilian."
    ],
    [
      "2001.10.06",
      "India",
      "Udhyanpur",
      1,
      0,
      "A civilian is abducted and killed by three Mujahideen."
    ],
    [
      "2001.10.07",
      "Israel",
      "Sheluhot",
      1,
      0,
      "Hamas (Islamic Resistance) suicide bomber kills one civilian."
    ],
    [
      "2001.10.07",
      "Pakistan",
      "Karachi",
      4,
      7,
      "Militant Muslims open fire on a group of people standing outside a religious school, killing four and injuring seven."
    ],
    [
      "2001.10.07",
      "Saudi Arabia",
      "Khobar",
      2,
      4,
      "Parcel bomb kills two, including an American, and injures four."
    ],
    [
      "2001.10.09",
      "India",
      "Bharti",
      2,
      0,
      "Two civilians are abducted and killed by Muslim terrorists."
    ],
    [
      "2001.10.11",
      "Pakistan",
      "Liaquatabad",
      2,
      1,
      "Islamists lob an explosive device into a police vehicle, killing two officers."
    ],
    [
      "2001.10.14",
      "India",
      "Baramulla",
      2,
      1,
      "In separate attacks, the Mujahideen abduct and kill a civilian while also killing a shopkeeper and injuring his wife."
    ],
    [
      "2001.10.14",
      "Indonesia",
      "Tentena",
      1,
      8,
      "Jihad warriors attack passenger bus. They kill a 22-year-old woman and injure eight other people."
    ],
    [
      "2001.10.14",
      "Pakistan",
      "Karachi",
      2,
      0,
      "Two policeman killed by gunman. This occurs two days after several security force personnel were killed by pro-Islamic demonstrators."
    ],
    [
      "2001.10.15",
      "India",
      "Salora",
      3,
      0,
      "A young girl is killed by Islamists after refusing to marry one of them.  Her brother and father are killed in an earlier attack."
    ],
    [
      "2001.10.15",
      "Nigeria",
      "Kano",
      32,
      51,
      "Scores of Christians are murdered by Muslim mobs.  Dozens of others are injured and at least five churches are burned down."
    ],
    [
      "2001.10.16",
      "India",
      "Kulgam",
      1,
      25,
      "A young boy is killed, and about twenty-five others injured when a Muslim tosses a grenade into the street."
    ],
    [
      "2001.10.16",
      "Indonesia",
      "Madale",
      1,
      1,
      "A Muslim mob burns down a Christian refugee barracks, killing one and seriously injuring another."
    ],
    [
      "2001.10.17",
      "India",
      "Anone Chaba",
      1,
      1,
      "A woman is killed by the Mujahideen in an attack that also injures her father."
    ],
    [
      "2001.10.17",
      "Israel",
      "Jerusalem",
      1,
      0,
      "Israeli Tourism Minister, 75, assassinated in the hallway of the Hyatt Hotel."
    ],
    [
      "2001.10.17",
      "Mauritania",
      "Nouakchott",
      1,
      1,
      "The Mauritania director of the international relief organization, World Vision, is gunned down while walking with his young daughter. She was also shot, but did not die."
    ],
    [
      "2001.10.18",
      "India",
      "Kremhore",
      3,
      0,
      "The Mujahideen attack a camp, killing two security force personnel and a civilian."
    ],
    [
      "2001.10.18",
      "Israel",
      "Mar Saba",
      1,
      2,
      "Palestinian terrorists kill one and seriously injure two by firing on their vehicle in the Judean desert."
    ],
    [
      "2001.10.20",
      "Indonesia",
      "Betalemba",
      2,
      0,
      "At least two killed in a Muslim attack on Christian village."
    ],
    [
      "2001.10.21",
      "Indonesia",
      "Toyado",
      1,
      0,
      "A Christian is pulled from a car and hacked to death by Jihad warriors."
    ],
    [
      "2001.10.22",
      "India",
      "Awantipora",
      2,
      2,
      "Two civilians killed by Fedayeen suicide attack."
    ],
    [
      "2001.10.22",
      "Indonesia",
      "Toyado",
      2,
      0,
      "Two men murdered by Jihad terrorists."
    ],
    [
      "2001.10.25",
      "India",
      "Banihal",
      2,
      11,
      "Two people including a civilian are killed in an attack on a convoy by the Mujahideen."
    ],
    [
      "2001.10.26",
      "India",
      "Srinagar",
      1,
      12,
      "Twelve civilians are injured by a grenade thrown onto the road by a militant.  Another succumbs to injuries five days later."
    ],
    [
      "2001.10.26",
      "Pakistan",
      "Lahore",
      1,
      4,
      "Bomb blast kills a doctor and injures four other people."
    ],
    [
      "2001.10.27",
      "India",
      "Nageen",
      1,
      0,
      "A civilian is abducted and executed by the Mujahideen."
    ],
    [
      "2001.10.27",
      "Israel",
      "Ariel",
      3,
      19,
      "A Muslim suicide bomber kills three and injures nineteen at a gas station."
    ],
    [
      "2001.10.28",
      "Israel",
      "Hadera",
      4,
      39,
      "Palestinian terrorists open fire on a bus-stop killing four and wounding nearly 40."
    ],
    [
      "2001.10.28",
      "Israel",
      "Metzer",
      1,
      0,
      "Fatah terrorists kill one Jew in a machine gun attack."
    ],
    [
      "2001.10.28",
      "Pakistan",
      "Bahawalpur",
      18,
      9,
      "A policeman and seventeen Christians, including five children, are killed and nine others injured when six gunmen opened fire on a church."
    ],
    [
      "2001.10.28",
      "Pakistan",
      "Quetta",
      3,
      25,
      "A Taliban blast inside a bus kills three and injures another twenty-five."
    ],
    [
      "2001.10.30",
      "India",
      "Kashmir",
      2,
      0,
      "Two civilians are killed by Muslim militants in separate attacks."
    ],
    [
      "2001.11.01",
      "Indonesia",
      "Palu",
      4,
      0,
      "Four Christians murdered by Jihad terrorists at an illegal roadblock."
    ],
    [
      "2001.11.01",
      "Indonesia",
      "Tomata",
      3,
      12,
      "Jihad warriors attack Christian village and kill three."
    ],
    [
      "2001.11.01",
      "Indonesia",
      "Waimulang",
      5,
      2,
      "Jihad warriors attack Christian village, killing five and wounding at least two."
    ],
    [
      "2001.11.02",
      "India",
      "Khangund",
      1,
      0,
      "A civilian is abducted and killed by the Mujahideen."
    ],
    [
      "2001.11.02",
      "Israel",
      "Ofra",
      1,
      0,
      "19-year-old soldier killed when Palestinian gunmen open fire at a roadblock."
    ],
    [
      "2001.11.04",
      "India",
      "Kashmir",
      9,
      0,
      "In four separate attacks across Kashmir, five civilians and four security force personnel are killed by Islamic militants."
    ],
    [
      "2001.11.04",
      "Israel",
      "Jerusalem",
      2,
      45,
      "Two boys, ages 14 and 16, where gunned down by Palestinian terrorists at a bus-stop. Forty-five others were injured."
    ],
    [
      "2001.11.04",
      "Pakistan",
      "Mehargam",
      5,
      2,
      "Five persons, including a former District Council chairman, are killed and two more injured in firing by gunmen."
    ],
    [
      "2001.11.05",
      "India",
      "Banikhet",
      1,
      0,
      "A mentally-ill woman is accused of being an informer and killed by Islamic terrorists."
    ],
    [
      "2001.11.06",
      "Israel",
      "Nablus",
      1,
      0,
      "Israeli Captain killed in Palestinian ambush."
    ],
    [
      "2001.11.06",
      "Pakistan",
      "Karachi",
      3,
      3,
      "Three people are killed in a shooting attack by Islamists."
    ],
    [
      "2001.11.07",
      "India",
      "Khanpora",
      1,
      0,
      "Terrorists gun down a civilian."
    ],
    [
      "2001.11.08",
      "India",
      "Nowhatta Chowk",
      1,
      6,
      "A Muslim militant kills a civilian and injures six others with a lobbed grenade in a commercial area."
    ],
    [
      "2001.11.09",
      "India",
      "Rajouri",
      3,
      21,
      "Three civilians are killed in separate attacks, including a terrorist bombing of a bar."
    ],
    [
      "2001.11.09",
      "Israel",
      "Samaria",
      1,
      0,
      "A Woman is shot and killed by Muslim terrorists as she is driving home from work."
    ],
    [
      "2001.11.12",
      "India",
      "Bareri",
      2,
      0,
      "The Mujahideen stage a home invasion and kill two civilians."
    ],
    [
      "2001.11.12",
      "Indonesia",
      "Ambon",
      3,
      19,
      "Package bomb kills three and injures nineteen."
    ],
    [
      "2001.11.13",
      "India",
      "Kashmir",
      4,
      0,
      "Four civilians are killed in three separate attacks by militant Muslims."
    ],
    [
      "2001.11.13",
      "Indonesia",
      "Ambon",
      2,
      5,
      "A Muslim attack kills two Christians and injures five more."
    ],
    [
      "2001.11.14",
      "India",
      "Baramulla",
      4,
      0,
      "Two attacks by Islamic terrorists leave three security force personnel and one civilian dead."
    ],
    [
      "2001.11.14",
      "India",
      "Poonch",
      3,
      0,
      "Three civilians are killed in two senseless Mujahideen attacks."
    ],
    [
      "2001.11.17",
      "India",
      "Mangota",
      1,
      0,
      "A civilian is attacked and killed by the Mujahideen."
    ],
    [
      "2001.11.18",
      "Afghanistan",
      "Kunduz",
      8,
      0,
      "Eight youth are killed by the Taliban for laughing."
    ],
    [
      "2001.11.18",
      "India",
      "Ramban",
      14,
      32,
      "Lashkar-e-Toiba cadres murder fourteen people in an attack on two buses that they trap on a bridge."
    ],
    [
      "2001.11.19",
      "Afghanistan",
      "Tangi Abrishum",
      4,
      0,
      "Four journalists are abducted and shot to death.  In April of 2003 the men responsible (Taliban supporters) are finally taken into custody."
    ],
    [
      "2001.11.21",
      "India",
      "Srinagar",
      1,
      0,
      "A young girl is attacked and killed by Islamic militants."
    ],
    [
      "2001.11.24",
      "India",
      "Rajouri",
      2,
      2,
      "Two civilians are killed by the Mujahideen in separate attacks.  One was a school teacher."
    ],
    [
      "2001.11.24",
      "India",
      "Srinagar",
      1,
      23,
      "A Militant Muslim lobs a grenade onto a sidewalk, killing at least one person."
    ],
    [
      "2001.11.25",
      "India",
      "Bandipore",
      3,
      1,
      "An explosive device detonates inside a house, killing three members of a family."
    ],
    [
      "2001.11.25",
      "India",
      "Banihal",
      4,
      5,
      "The Mujahideen stage an attack on a security camp, killing four and injuring five."
    ],
    [
      "2001.11.27",
      "India",
      "Baramulla",
      3,
      0,
      "Two civilians and a police officer are killed by the Mujahideen in separate attacks."
    ],
    [
      "2001.11.27",
      "India",
      "Kalaali",
      11,
      0,
      "Eleven policemen are killed in an ambush by Islamic militants."
    ],
    [
      "2001.11.27",
      "India",
      "Sopore",
      8,
      3,
      "Eight members of a search team are killed by the Mujahideen in a heavily-wooded area."
    ],
    [
      "2001.11.27",
      "Israel",
      "Afula",
      2,
      50,
      "Fatah and Islamic Jihad terrorists fire assault rifles at a crowded bus-stop, killing two and injuring about fifty."
    ],
    [
      "2001.11.27",
      "Israel",
      "Gush Katif",
      1,
      3,
      "Palestinians kill a woman while she is driving home. Three others injured in the ambush."
    ],
    [
      "2001.11.28",
      "India",
      "Chakalwala",
      1,
      1,
      "Islamic militants kill a man and seriously injure his son."
    ],
    [
      "2001.11.29",
      "Israel",
      "Hadera",
      3,
      9,
      "Three are killed and nine wounded in a Palestinian attack on a bus-stop."
    ],
    [
      "2001.11.30",
      "India",
      "Galyot",
      7,
      0,
      "Seven civilians are massacred by Muslim terrorists, who infiltrate their village."
    ],
    [
      "2001.12.01",
      "India",
      "Bandipore",
      0,
      44,
      "Forty-four people are injured when militants toss a grenade into a taxi stand."
    ],
    [
      "2001.12.01",
      "India",
      "Kandi",
      3,
      0,
      "Two women are killed and a man is beheaded by militant Muslims."
    ],
    [
      "2001.12.01",
      "Israel",
      "Jerusalem",
      11,
      180,
      "Eleven teenagers are killed by two \"holy warrior\" suicide bombers. Most of the one-hundred and eighty injuries are also to teenagers."
    ],
    [
      "2001.12.02",
      "India",
      "Trinagal",
      7,
      0,
      "At least seven members of a marriage party are slaughtered by Hizb-ul-Mujahideen terrorists in route to the wedding."
    ],
    [
      "2001.12.02",
      "Indonesia",
      "Sepe",
      6,
      0,
      "Six Christians are murdered by a Muslim mob while fleeing their homes."
    ],
    [
      "2001.12.02",
      "Israel",
      "Haifa",
      15,
      40,
      "Muslim terrorists blow apart a passenger bus.  Fifteen Israelis are killed in the fireball and about forty others lose limbs or are badly burned."
    ],
    [
      "2001.12.05",
      "India",
      "Donar",
      4,
      0,
      "Islamic terrorists kill four people traveling in a car.  The victims included a judge."
    ],
    [
      "2001.12.05",
      "India",
      "Shrakwara",
      1,
      0,
      "A court worker is abducted from his building late at night and murdered by Islamists."
    ],
    [
      "2001.12.05",
      "Pakistan",
      "Karachi",
      1,
      0,
      "One person is killed in a sectarian attack."
    ],
    [
      "2001.12.07",
      "Indonesia",
      "Ewiri",
      2,
      3,
      "Jihadists attack a Christian village, killing two and wounding three."
    ],
    [
      "2001.12.08",
      "India",
      "Baramulla",
      6,
      0,
      "Fedayeen snipers destroy the lives of six villagers and a policeman."
    ],
    [
      "2001.12.10",
      "Nigeria",
      "Northern",
      1,
      0,
      "A truck driver is killed because the exhaust from his truck drifted into an open-air Islamic meeting, thus 'desecrating' the Qur'an."
    ],
    [
      "2001.12.11",
      "Indonesia",
      "Bay of Ambon",
      7,
      42,
      "Muslims bomb a boat and then attempt to stab the survivors to death in the water."
    ],
    [
      "2001.12.12",
      "Israel",
      "Samaria",
      11,
      30,
      "Fatah and Hamas (Islamic Resistance) attackers used roadside bomb, anti-tank grenades and light arms fire to kill eleven and injure thirty passengers on a bus."
    ],
    [
      "2001.12.13",
      "India",
      "New Delhi",
      7,
      30,
      "Militant Muslims execute a suicide attack on the Indian parliament, killing seven and injuring over thirty."
    ],
    [
      "2001.12.13",
      "Pakistan",
      "Karachi",
      0,
      19,
      "Nineteen persons injured in a \"holy warrior\" bomb blast in a residential area."
    ],
    [
      "2001.12.14",
      "India",
      "Kalaroos",
      2,
      0,
      "Hizb-ul-Mujahideen murder two civilians."
    ],
    [
      "2001.12.15",
      "India",
      "Pulwama",
      4,
      15,
      "Jaish-e-Mohammed terrorists slaughter four Indians in three separate attacks."
    ],
    [
      "2001.12.15",
      "India",
      "Takiabal",
      3,
      2,
      "Lashkar-e-Toiba terrorists kill two civilians and a security officer in an ambush."
    ],
    [
      "2001.12.17",
      "India",
      "Srinagar",
      3,
      14,
      "Terrorists kill two Indians in separate attacks and then kill another in a grenade attack (Achhabal)."
    ],
    [
      "2001.12.19",
      "India",
      "Dankot",
      2,
      0,
      "A policeman and his brother are attacked and killed by Islamists."
    ],
    [
      "2001.12.19",
      "India",
      "Pulwama",
      1,
      60,
      "A civilian is killed, and about sixty others injured in a grenade attack by militants."
    ],
    [
      "2001.12.19",
      "Indonesia",
      "Kapaha",
      9,
      1,
      "Nine Christians aboard a boat are killed by Jihad attackers."
    ],
    [
      "2001.12.19",
      "Pakistan",
      "Kurram",
      6,
      6,
      "Five Pakistani troops and a driver are killed by the al-Qaeda militants they are transporting, after their weapons are seized."
    ],
    [
      "2001.12.21",
      "India",
      "Hogam",
      2,
      2,
      "Two Hindu women are shot to death by Muslim terrorists.  Two young girls are injured in the senseless attack."
    ],
    [
      "2001.12.21",
      "India",
      "Mankot",
      1,
      1,
      "A woman is killed by the Mujahideen and her daughter is seriously injured."
    ],
    [
      "2001.12.21",
      "India",
      "Poshkreeri, Anantnag",
      3,
      1,
      "Hizb-ul-Mujahideen terrorists kill three girls (ages 12, 16, 18) and injure their mother because they were Sikhs."
    ],
    [
      "2001.12.24",
      "India",
      "Kashmir",
      4,
      4,
      "Four civilians, including two doctors, are killed by the Mujahideen in several attacks across the region."
    ],
    [
      "2001.12.25",
      "Israel",
      "Beit Shean",
      1,
      4,
      "One Israeli reservist is killed and four others wounded in a shooting attack."
    ],
    [
      "2001.12.26",
      "India",
      "Chakor",
      2,
      0,
      "Two civilians are abducted and killed by the Mujahideen."
    ],
    [
      "2001.12.28",
      "Pakistan",
      "Karachi",
      1,
      1,
      "Islamists gun down a police officer."
    ],
    [
      "2001.12.29",
      "India",
      "Jammu",
      1,
      8,
      "A militant throws a grenade into a road, killing a civilian and injuring eight others."
    ],
    [
      "2001.12.30",
      "India",
      "Kantha",
      4,
      1,
      "The Mujahideen invade a home and massacre four members of the same family."
    ],
    [
      "2001.12.30",
      "Nigeria",
      "Vwang",
      5,
      0,
      "Armed Muslims attack Christian community, kill five and destroy much of the town."
    ],
    [
      "2001.12.31",
      "India",
      "Mangnar Top",
      6,
      1,
      "Islamic militants massacre six members of a family in their home.  A seventh is badly injured, but survives."
    ],
    [
      "2001.12.31",
      "Pakistan",
      "Karachi",
      0,
      15,
      "Fifteen persons injured in a bomb blast in a residential area."
    ]
  ],
  "columns": [
    "Date",
    "Country",
    "City",
    "Killed",
    "Injured",
    "Description"
  ],
  "year": 2001
}