{"rows": [["2009.01.01", "Iraq", "Mosul", 3, 5, "A Shahid takes out three Iraqis."], ["2009.01.01", "Pakistan", "Bajaur", 4, 16, "Four civilians are killed when Mujahideen fire rockets into an office complex."], ["2009.01.01", "Pakistan", "Bajaur", 6, 0, "Six locals are blown to bits by a Taliban roadside bomb."], ["2009.01.01", "Pakistan", "Ghania", 2, 0, "A young man chops his mother and daughter into pieces after they ignore his warning to end an illicit affair with a local man."], ["2009.01.01", "Pakistan", "Peshawar", 3, 6, "Three policemen are killed by two Religion of Peace bombs."], ["2009.01.01", "Pakistan", "Swat", 1, 0, "Militants drag a man out of his home and cut off his head in a public square."], ["2009.01.01", "Pakistan", "Swat", 3, 0, "Three people are shot to death by Islamic terrorists in separate attacks."], ["2009.01.01", "Somalia", "Afgoye", 1, 0, "A journalist is killed during an attack by Islamic militia."], ["2009.01.01", "Somalia", "Baidoa", 1, 0, "A member of a reconciliation committee is murdered by Islamic militia."], ["2009.01.01", "Somalia", "Mogadishu", 2, 0, "Two local officials are assassinated by Mujahideen."], ["2009.01.02", "Iraq", "al-Yusufiyah", 23, 110, "A Fedayeen suicide bomber wades into a lunch crowd at a reconciliation meeting between Sunni and Shia leaders, killing twenty-three."], ["2009.01.02", "Pakistan", "Bajaur", 1, 0, "Muslim terrorists shoot a tribal elder to death."], ["2009.01.02", "Pakistan", "Balogram", 2, 0, "Two policemen are abducted by Islamists and gruesomely tortured to death."], ["2009.01.02", "Pakistan", "Mingora", 1, 0, "A local dancing girl is quickly gunned down by Islamists after her husband kicks her out of the house."], ["2009.01.02", "Pakistan", "Swat", 3, 0, "Three civilians are shot to death in two attacks."], ["2009.01.02", "Somalia", "Mogadishu", 1, 0, "A local cleric is shot to death by al-Shabaab radicals in his home in front of his blind mother."], ["2009.01.02", "Somalia", "Mogadishu", 9, 0, "Two soldiers and seven civilians are killed in an Mujahid bombing and the ensuing fire fight."], ["2009.01.03", "Iraq", "Baghdad", 4, 16, "Shia pilgrims are among the victims of two Sunni bombing attacks."], ["2009.01.04", "Iraq", "Baghdad", 36, 72, "Dozens of women and children are blown to bits by a Shahid suicide bomber targeting a crowd of Shiite pilgrims near a shrine."], ["2009.01.04", "Pakistan", "Di Khan", 10, 25, "Islamic bombers blast at least ten people to death in an attack at a college campus."], ["2009.01.04", "Pakistan", "Matta", 3, 0, "Three persons are murdered by suspected Taliban gunmen."], ["2009.01.04", "Pakistan", "Swat", 2, 0, "Muslim fundamentalists abduct and brutally execute two police officers, beheading one and hanging his head from a pole."], ["2009.01.04", "Pal. Auth.", "Gaza", 35, 75, "The Islamic terror group, Hamas, 'executes' thirty-five rivals and maims over seventy others over the course of several days."], ["2009.01.04", "Thailand", "Pattani", 1, 1, "Muslim gunmen murder a Buddhist man and injure his wife as they are riding in their vehicle."], ["2009.01.05", "Afghanistan", "Kandahar", 1, 0, "A pro-government mosque leader is taken out by Islamic gunmen"], ["2009.01.05", "Afghanistan", "Kandahar", 3, 1, "Religious extremists attack a police post, killing three local officers."], ["2009.01.05", "Eritrea", "Mitire", 1, 0, "A 37-year-old man dies from torture after refusing to recant his Christian faith."], ["2009.01.05", "Iraq", "Baghdad", 3, 6, "Jihadis plant a bomb outside a soccer stadium, killing three Iraqis."], ["2009.01.05", "Pakistan", "Bannu", 3, 0, "Three family men are abducted and executed by the Taliban."], ["2009.01.05", "Pakistan", "Quetta", 2, 0, "Two Shia civilians are shot to death by Sunni militants."], ["2009.01.05", "Pakistan", "Swat", 2, 0, "Two persons are murdered by Mujahideen in separate attacks, including a woman in her home."], ["2009.01.05", "Thailand", "Narathiwat", 1, 1, "Islamists shoot at a married couple with automatic weapons, killing the husband and injuring his wife."], ["2009.01.05", "Thailand", "Narathiwat", 1, 1, "Religious radicals gun down a 51-year-old cop."], ["2009.01.05", "Thailand", "Yala", 1, 2, "A villager is shot to death by Mujahid while standing with his neighbors."], ["2009.01.06", "Iraq", "Baghdad", 4, 6, "Four Iraqis are taken out by roadside bombers."], ["2009.01.06", "Iraq", "Mosul", 2, 6, "A Shahid successfully kills two civilians with a suicide bomb."], ["2009.01.06", "Pakistan", "Mingora", 6, 0, "Six local cops are kidnapped and brutally executed by Sunni radicals."], ["2009.01.06", "Thailand", "Pattani", 1, 0, "An Islamic terror attack leaves a 47-year-old security man dead."], ["2009.01.07", "Pakistan", "Hungu", 4, 1, "Four policemen die from burns and shrapnel during a Taliban rocket attack."], ["2009.01.07", "Pakistan", "North Waziristan", 2, 0, "Two Afghan civilians are kidnapped and brutally executed by religious radicals."], ["2009.01.07", "Pakistan", "Swat", 2, 0, "Two civilians are shot to death by terrorists in separate incidents."], ["2009.01.07", "Pal. Auth.", "Gaza", 6, 0, "Three brothers are among six people shot to death by Hamas militants."], ["2009.01.07", "Somalia", "Yaqshid", 4, 2, "Four local soldiers are killed when Islamists stop their vehicle with a roadside bomb, then toss a grenade at the survivors."], ["2009.01.07", "Somalia", "Yubsan", 1, 0, "A humanitarian worker and father of five is shot to death in cold blood by Islamic terrorists."], ["2009.01.08", "Afghanistan", "Kandahar", 3, 21, "A Holy Warrior takes out three civilians with an explosives belt."], ["2009.01.08", "Iraq", "Jalawla", 6, 7, "Six Iraqis are blown up in a Jihad bomb attack."], ["2009.01.09", "Afghanistan", "Nimroz", 10, 3, "A Shahid blows himself up in a fruit shop, taking out ten patrons and employees."], ["2009.01.09", "Iraq", "Baghdad", 9, 15, "A child is among nine Iraqis taken out be Jihadi bomber in three attacks."], ["2009.01.09", "Israel", "Rehovot", 0, 1, "A Muslim yells 'Allah Akbar' and strikes a Jewish teen with an axe."], ["2009.01.09", "Pakistan", "Lahore", 0, 5, "Fundamentalists bomb movie theaters accused of showing 'anti-Islamic' films."], ["2009.01.09", "Pakistan", "Swat", 2, 0, "Two locals are abducted and butchered by Islamic militants."], ["2009.01.09", "Somalia", "Gedo", 1, 5, "Islamic militants assassinate a local mayor with a rocket."], ["2009.01.10", "Pakistan", "Chak", 0, 1, "Six Muslim men gang-rape a 14-year-old girl in front of her parents because they are Christian."], ["2009.01.10", "Pakistan", "Hangu", 47, 60, "A Muslim group attacks a rival funeral, setting off Sunni-Shia violence that leaves nearly fifty dead over the next four days."], ["2009.01.10", "Pakistan", "Sibi", 2, 0, "Two Shias are assassinated by Sunni terrorists."], ["2009.01.10", "Thailand", "Pattani", 1, 0, "A 54-year-old civilian is gunned down by Mujahideen."], ["2009.01.11", "Algeria", "Merine", 2, 2, "A mother and child are gunned down by armed Islamists at a fake roadblock."], ["2009.01.11", "Iraq", "Mosul", 5, 4, "Five Iraqis are murdered by Islamic militants in two attacks."], ["2009.01.11", "Pakistan", "Bajaur", 0, 4, "Religious extremists abduct and then chop the ears off of four private security guards."], ["2009.01.11", "Pakistan", "Mohmand", 6, 7, "Taliban militants overrun a military base, killing at least six local soldiers."], ["2009.01.11", "Pakistan", "Swat", 4, 0, "A father and son are among four civilians shot to death by Taliban militants in three attacks."], ["2009.01.11", "Somalia", "Guriel", 30, 50, "al-Shabaab hardline fundamentalists attack a rival group, leaving about thirty people dead."], ["2009.01.11", "Thailand", "Yala", 3, 2, "Two Buddhists are among three farmers shot to death by Islamic terrorists."], ["2009.01.12", "Ingushetia", "Nazran", 1, 1, "Islamic snipers pick off a local soldier."], ["2009.01.12", "Iraq", "Baghdad", 8, 31, "Eight Iraqis are burned or blasted to death in three Jihad bombings."], ["2009.01.12", "Pakistan", "Hangu", 5, 21, "Five more people are killed in sectarian violence between Sunni and Shia."], ["2009.01.12", "Pakistan", "North Waziristan", 2, 0, "Two brothers are abducted and brutally murdered by Mujahideen."], ["2009.01.12", "Somalia", "Mogadishu", 13, 30, "At least thirteen people are killed in a brutal mortar attack by Islamic militia."], ["2009.01.13", "Pakistan", "Matta", 3, 4, "A beheaded rickshaw driver is among three people killed in separate terror attacks."], ["2009.01.13", "Pakistan", "Miranshah", 1, 0, "A civilian is abducted and brutally beheaded by religious radicals."], ["2009.01.13", "Thailand", "Narathiwat", 1, 4, "A local soldier succumbs to shrapnel injuries following a Religion of Peace bombing attack."], ["2009.01.13", "Thailand", "Pattani", 2, 0, "Two civilians are shot to death by Mujahideen."], ["2009.01.13", "Thailand", "Pattani", 2, 0, "Two village chiefs are shot to death in Muslim drive-by attacks."], ["2009.01.14", "Iraq", "Mosul", 2, 4, "A Holy Warrior takes out two Iraqis with a suicide belt."], ["2009.01.14", "Pakistan", "Quetta", 4, 0, "Four Shia are ambushed and killed by Sunni militants with automatic weapons."], ["2009.01.14", "Somalia", "Mogadishu", 6, 18, "A half-dozen civilians are killed due to an Islamist mortar attack on the presidential palace."], ["2009.01.15", "Pakistan", "Miranshah", 1, 0, "A 30-year-old civilian is abducted and murdered by Islamic radicals."], ["2009.01.15", "Somalia", "Kismayo", 1, 0, "Islamists assassinate a former statesman after 'sentencing' him to death."], ["2009.01.16", "Eritrea", "Mitire", 1, 0, "A 42-year-old man dies after being tortured in prison for his Christian faith."], ["2009.01.16", "Iraq", "Mosul", 1, 0, "The local Christian owner of a car repair shop is brutally murdered by Islamic terrorists."], ["2009.01.16", "Iraq", "Mosul", 1, 2, "Mujahideen storm a home and murder a woman inside."], ["2009.01.17", "Afghanistan", "Kabul", 4, 23, "A woman and child are among four civilians killed outside the German embassy when a Holy Warrior detonates beside them."], ["2009.01.17", "Afghanistan", "Nangarhar", 1, 2, "A civilian is taken down by a Fedayeen suicide bomber in a minivan."], ["2009.01.17", "Algeria", "Miliana", 1, 0, "A man has his throat slit by Islamic fundamentalists at a fake roadblock."], ["2009.01.17", "Iraq", "Baghdad", 1, 1, "Jihad bombers kill the driver of a municipal vehicle."], ["2009.01.17", "Iraq", "Mosul", 2, 0, "Two innocent guards at a cell phone tower are gunned down by Sunni extremists."], ["2009.01.17", "Pakistan", "Matani", 1, 0, "A faith healer is abducted and beheaded by Islamists."], ["2009.01.17", "Pakistan", "Miranshah", 1, 0, "An Afghan civilian is murdered by the Taliban."], ["2009.01.17", "Somalia", "Mogadishu", 2, 9, "al-Shabaab militants take out two civilians during an attack on African peacekeepers."], ["2009.01.18", "Pakistan", "Swat", 4, 2, "Two brothers murdered in their home are among four people taken out by Mujahideen."], ["2009.01.19", "Iraq", "Tikrit", 2, 0, "Two young civilians are taken out in a roadside bombing."], ["2009.01.20", "Afghanistan", "Bala Mughab", 3, 7, "Talibanis ambush a police post, killing three local officers and kidnapping seven others."], ["2009.01.20", "Afghanistan", "Kandahar", 2, 3, "Religious extremists murder two Afghans with a bicycle bomb."], ["2009.01.20", "Iraq", "Baghdad", 3, 5, "Three civilians are taken down by Jihadi bombers."], ["2009.01.20", "Iraq", "Mosul", 2, 1, "A real estate agent brutally gunned down in his office is among two civilians murdered by the Mujahideen."], ["2009.01.20", "Pakistan", "Miranshah", 6, 0, "Six civilians are rounded up and shot to death by Islamic extremists."], ["2009.01.20", "Pakistan", "Sindh", 1, 0, "A 55-year-old member of the Ahmadiyya is killed merely on account of his faith."], ["2009.01.21", "Afghanistan", "Baghlan", 0, 5, "A suicide bomber injures five children at a wedding."], ["2009.01.21", "Afghanistan", "Herat", 2, 1, "Two local soldiers are killed by a suicide bomber."], ["2009.01.21", "Iraq", "Baghdad", 4, 8, "Islamic bombers take out four students near a university."], ["2009.01.21", "Iraq", "Khalis", 18, 0, "Eighteen al-Qaeda victims are found in a mass grave."], ["2009.01.21", "Jordan", "Amman", 1, 0, "A 17-year-old stomps and stabs his 13-year-old sister to death in an honor killing."], ["2009.01.21", "Thailand", "Pattani", 1, 0, "An older man walking home with his cattle is shot to death by Muslim militants."], ["2009.01.22", "Iraq", "Kut", 4, 0, "Parents and their two children are wiped out inside their home by Jihadi gunmen."], ["2009.01.22", "Jordan", "Amman", 1, 0, "A man kills his 19-year-old divorced sister for \"having a bad reputation.\""], ["2009.01.22", "Pakistan", "Derpakhel", 1, 0, "A civilian is kidnapped and brutally murdered by Sunni radicals."], ["2009.01.22", "Pakistan", "Swat", 5, 8, "Two people beheaded are among five civilians taken out by Mujahideen in three attacks."], ["2009.01.22", "Thailand", "Pattani", 1, 0, "A shop owner is murdered in his store by Mujahideen gunmen."], ["2009.01.23", "Afghanistan", "Kabul", 6, 0, "Six people, including an Indian husband and wife are shot dead when the Taliban fire into a home."], ["2009.01.23", "Iraq", "Baghdad", 1, 1, "A 7-year-old boy is killed, and his mother injured, by a hidden bomb."], ["2009.01.23", "Iraq", "Baghdad", 8, 0, "Five women and a 12-year-old girl are among eight Sunni family members murdered in their home by sectarian rivals."], ["2009.01.23", "Pakistan", "Mingora", 2, 22, "A Fedayeen suicide bomber kills two local soldiers."], ["2009.01.23", "Pakistan", "Mingora", 3, 1, "A woman is among three civilians murdered in a Jihad roadside attack."], ["2009.01.23", "Pakistan", "Swat", 2, 0, "Fundamentalists stab a man to death over his 'un-Islamic' style of dress, then travel to his house where they murder his father."], ["2009.01.23", "Thailand", "Yala", 3, 0, "A 65-year-old woman is among three civilians gunned down in separate Mujahideen drive-by attacks."], ["2009.01.24", "Iraq", "Fallujah", 5, 14, "Five Iraqis are taken out in a vicious Fedayeen truck bombing."], ["2009.01.24", "Israel", "Ashkelon", 1, 0, "A young Arab mother is stabbed to death over suspected immorality"], ["2009.01.24", "Pakistan", "Bannu", 1, 0, "Suspected Islamists kidnap and murder a local civilian."], ["2009.01.24", "Pakistan", "Khairabad", 1, 0, "A night cleaner at a police station is killed by a Sunni rocket."], ["2009.01.24", "Pal. Auth.", "Gaza", 1, 0, "Hamas executes a 46-year-old human rights activist."], ["2009.01.24", "Somalia", "Mogadishu", 15, 24, "Fifteen bus passengers on a public bus are blown to bits by a Shahid suicide bomber."], ["2009.01.24", "Thailand", "Narathiwat", 1, 0, "A 28-year-old lesbian is stabbed and suffocated."], ["2009.01.24", "Thailand", "Yala", 4, 0, "Four construction workers are murdered by Islamist gunmen at a building site."], ["2009.01.25", "Iran", "Saravan", 12, 0, "A dozen policemen are killed by a Sunni terror group, 'Soldiers of Allah.'"], ["2009.01.25", "Thailand", "Narathiwat", 1, 1, "A factory worker is shot to death by Mujahideen while driving with his wife."], ["2009.01.26", "Pakistan", "Dera Ismail Khan", 6, 22, "Sunni radicals detonate a bicycle bomb in a public area, killing six civilians."], ["2009.01.26", "Pakistan", "Lahore", 1, 0, "A 45-year-old woman is stabbed to death by her son on suspicion of an illicit relationship."], ["2009.01.26", "Pakistan", "North Waziristan", 1, 0, "Religious militants kidnap a man, chop off his hand and then execute him."], ["2009.01.26", "Pakistan", "Quetta", 1, 0, "A Shia leader is assassinated by Sunni gunmen."], ["2009.01.26", "Somalia", "Baidoa", 4, 10, "Four people are killed when al-Shabaab terrorists hurl a grenade into a bus stop."], ["2009.01.26", "Thailand", "Narathiwat", 1, 1, "Islamists gun down a 26-year-old civilian."], ["2009.01.27", "Afghanistan", "Kandahar", 4, 10, "Taliban bombers blow up a minibus killing four civilians."], ["2009.01.27", "Iraq", "Mosul", 3, 3, "Three Iraqis are killed in a car bomb attack on Kurds by suspected Sunnis terrorists."], ["2009.01.27", "Israel", "Kissufim", 1, 2, "Palestinian bombers murder an Israelis border guard."], ["2009.01.27", "Pakistan", "Dera Ismail Khan", 1, 0, "A second Shia civilian is gunned down in as many days by sectarian extremists."], ["2009.01.27", "Thailand", "Pattani", 2, 0, "A Buddhist married couple is brutally murdered by Muslim gunmen in a drive-by attack."], ["2009.01.28", "Iraq", "Kirkuk", 2, 0, "Sunni extremists attack a polling station, killing two guards."], ["2009.01.28", "Pakistan", "Mingora", 8, 0, "Eight bullet-ridden victims of Taliban justice are found."], ["2009.01.29", "Pakistan", "Miranshah", 1, 0, "Sunni radicals kidnap and shoot a 30-year-old local man."], ["2009.01.29", "Pakistan", "Tal", 1, 4, "Religious extremists slit the throat of a policeman."], ["2009.01.30", "Iraq", "Baiji", 1, 1, "Sunni terrorists open fire on a polling station, killing an American guard."], ["2009.01.31", "Pakistan", "Swat", 3, 1, "Taliban militants ambush and kill three local security personnel."], ["2009.02.01", "Dagestan", "Makhachkala", 4, 0, "Suspected Islamists open fire on a cafe, killing four patrons."], ["2009.02.01", "Pakistan", "Shajwal Chak", 1, 0, "A Christian man begging for wages owed is murdered by Muslim employers as they deride his faith."], ["2009.02.01", "Philippines", "Siocon", 4, 1, "Moro Islamists capture four gold prospectors, hog-tie them and then hack them to death with machetes."], ["2009.02.02", "Afghanistan", "Uruzgan", 21, 8, "A Fedayeen suicide bomber murders over twenty local police trainees at their facility."], ["2009.02.02", "Iraq", "Mosul", 3, 9, "Three Iraqis are murdered by Mujahideen roadside bombers."], ["2009.02.02", "Pakistan", "Punjab", 1, 0, "A local leader is gunned down is a sectarian incident."], ["2009.02.02", "Pakistan", "Quetta", 1, 0, "A Shia businessman is shot to death by Sunni extremists."], ["2009.02.02", "Pakistan", "Swat", 8, 0, "Eight people are shot to death by Taliban militants in various attacks."], ["2009.02.02", "Thailand", "Pattani", 2, 0, "Two security personnel are beheaded by Muslim militants, who also burn the bodies."], ["2009.02.03", "Algeria", "Ait Chaafa", 1, 9, "Fundamentalists kill a security officer with a bombing attack."], ["2009.02.03", "Pakistan", "Dera Ismail Khan", 1, 18, "One person is killed when an Islamic radical tosses a grenade into a rival mosque."], ["2009.02.03", "Pakistan", "Orakzai", 1, 0, "Fundamentalists behead a local civilian."], ["2009.02.03", "Pakistan", "Swat", 3, 5, "Islamic militants assault a police post, killing three local officers."], ["2009.02.03", "Thailand", "Narathiwat", 1, 0, "Islamic gunmen chase down a man with a pickup truck then shoot him to death."], ["2009.02.03", "Thailand", "Pattani", 2, 0, "Two civilians are shot inside their homes by Mujahideen."], ["2009.02.04", "Afghanistan", "Helmand", 6, 0, "A brutal Taliban roadside bombing leaves six Afghanis dead."], ["2009.02.04", "Iraq", "Baqubah", 8, 0, "Eight decapitated al-Qaeda victims are found in a mass grave."], ["2009.02.04", "Somalia", "Mogadishu", 1, 0, "A journalist is assassinated by al-Shabaab gunmen."], ["2009.02.04", "Somalia", "Mogadishu", 1, 0, "The head of a radio station is gunned down by suspected Islamists."], ["2009.02.05", "Iraq", "Khanaqin", 16, 12, "A horrific suicide bombing at a restaurant leaves sixteen Iraqi patrons dead."], ["2009.02.05", "Pakistan", "Orakzai", 1, 0, "Islamists kidnap and murder the head of a teachers association."], ["2009.02.05", "Pakistan", "Punjab", 32, 48, "A suicide bomber at a rival religious procession sends more than 30 innocent souls to Allah."], ["2009.02.05", "Pakistan", "Swat", 3, 3, "Religious extremists barge into a home, kill three women and kidnap three survivors."], ["2009.02.06", "Afghanistan", "Laghman", 2, 0, "Taliban gunmen ambush and kill two local security men."], ["2009.02.06", "Pakistan", "Kohat", 1, 2, "Sunni radicals open fire on a passing bus, killing a passenger."], ["2009.02.06", "Pakistan", "Miranshah", 2, 0, "The Taliban abduct two civilians, kill them, then dump their bodies at a bus stop."], ["2009.02.07", "Afghanistan", "Nangarhar", 2, 1, "Two people are killed in two attacks by Islamic terrorists."], ["2009.02.07", "Pakistan", "Punjab", 7, 0, "Seven local cops are murdered by Islamist attackers."], ["2009.02.07", "Thailand", "Narathiwat", 1, 0, "Mujahideen gun down a 48-year-old rubber plantation worker."], ["2009.02.08", "Afghanistan", "Kabul", 1, 0, "The Taliban release a video showing the beheading of a kidnapped Polish Christian who declined the offer to save his life by converting to Islam."], ["2009.02.08", "Iraq", "Baghdad", 2, 12, "Two Shia pilgrims are murdered by Sunni bombers while walking along the side of a road."], ["2009.02.08", "Pakistan", "Lakorain", 1, 1, "A truck driver is shot to death by Taliban while on the job."], ["2009.02.08", "Pakistan", "Swat", 1, 0, "Jihadis kidnap and decapitate a civilian."], ["2009.02.08", "Pakistan", "Swat", 3, 0, "Mujahideen ambush and kill three local soldiers."], ["2009.02.08", "Somalia", "Mogadishu", 3, 7, "A child is among three people killed in two attacks following calls for holy war."], ["2009.02.08", "Thailand", "Yala", 1, 0, "Islamic rebels shoot a 29-year-old civilian in the head along the side of a road."], ["2009.02.09", "Afghanistan", "Kabul", 1, 0, "An Indian Christian, who worked for a food chain, is reported dead four months after being abducted by Sunni extremists."], ["2009.02.09", "Afghanistan", "Khogyani", 2, 3, "Islamic extremists detonate a bomb near a police vehicle, killing two local cops."], ["2009.02.09", "Afghanistan", "Nimroz", 3, 0, "Three Afghans are taken out by a Fedayeen suicide bomber."], ["2009.02.09", "Iraq", "Mosul", 3, 7, "Mujahideen murder three Iraqis with a mortar strike."], ["2009.02.09", "Iraq", "Mosul", 5, 3, "Four US soldiers and a local interpreter are killed by a Shahid suicide bomber."], ["2009.02.09", "Pakistan", "Baran Pul", 5, 17, "A religious extremist detonates himself in a crowd, killing five other people."], ["2009.02.09", "Pakistan", "Darra Adamkhel", 13, 38, "Eleven children are among thirteen killed when Islamic militants shell a girl's school."], ["2009.02.09", "Pakistan", "Khyber Agency", 10, 10, "Rival Islamist groups clash, leaving ten people dead."], ["2009.02.09", "Pakistan", "North Waziristan", 2, 0, "Holy Warriors shoot two civilians to death in separate attacks."], ["2009.02.09", "Thailand", "Narathiwat", 1, 0, "A 26-year-old woman is shot to death by Islamic terrorists."], ["2009.02.10", "Iraq", "Mosul", 2, 0, "Sunni extremists gun down two policemen at a checkpoint."], ["2009.02.10", "Pakistan", "Hangu", 17, 30, "Seventeen people are killed when Shia and Sunni rivals clash."], ["2009.02.10", "Thailand", "Pattani", 2, 1, "Muslim extremists murder two people is separate drive-by attacks."], ["2009.02.11", "Afghanistan", "Kabul", 28, 57, "Suicidal Sunnis attack two government buildings, randomly shooting nearly thirty office workers to death."], ["2009.02.11", "Afghanistan", "Logar", 4, 0, "Four local soldiers are killed in a Taliban roadside bombing on their vehicle."], ["2009.02.11", "Iraq", "Baghdad", 2, 18, "Two Shia pilgrims are murdered by Sunni bombers in separate attacks."], ["2009.02.11", "Iraq", "Baghdad", 16, 44, "Jihadis explode a pair of bombs at a bus station, slaughtering sixteen Iraqis."], ["2009.02.11", "Jordan", "Amman", 1, 0, "A 24-year-old woman is stabbed to death in bed by her brother, who suspects her of having an affair."], ["2009.02.11", "Pakistan", "Peshawar", 1, 8, "A local lawmaker is murdered by a bomb planted by suspected Islamists."], ["2009.02.11", "Thailand", "Pattani", 1, 0, "A 40-year-old man is gunned down in a Muslim drive-by attack."], ["2009.02.11", "Thailand", "Pattani", 2, 0, "Religion of Peace terrorists shoot two men to death as they are standing in front of a school."], ["2009.02.12", "Afghanistan", "Paktika", 1, 5, "A suicide bomber murders a police officer who stops to help him."], ["2009.02.12", "Ingushetia", "Nazran", 4, 2, "Four Russians are killed when Islamic militants detonate a bomb during a raid."], ["2009.02.12", "Iraq", "Mosul", 4, 5, "Jihadis take out four local cops with a roadside bomb."], ["2009.02.12", "Pakistan", "North Waziristan", 1, 1, "Taliban militants murder a police officer in an unprovoked rocket attack.  A second policeman is killed elsewhere."], ["2009.02.12", "Somalia", "Mogadishu", 2, 6, "Two laborers die from shrapnel injuries when Mujahideen mortar a seaport."], ["2009.02.12", "Thailand", "Pattani", 3, 1, "Islamic bombers kill three policemen guarding teachers from attacks."], ["2009.02.12", "USA", "Buffalo, NY", 1, 0, "The founder of a Muslim TV station beheads his wife in the hallway for seeking a divorce."], ["2009.02.13", "Afghanistan", "Kandahar", 4, 0, "Four Afghan policemen are killed by the Taliban in a roadside bombing."], ["2009.02.13", "Afghanistan", "Kohat", 2, 0, "The Taliban shoot dead two women for 'immoral' behavior, then dump their burka-clad bodies in a ditch."], ["2009.02.13", "Algeria", "Fum", 7, 0, "An infant and two women are among seven people blown up by Islamic fundamentalists."], ["2009.02.13", "Iraq", "Baghdad", 2, 0, "A man and his son are murdered in their home by Sunni gunmen."], ["2009.02.13", "Iraq", "Karbala", 39, 60, "A female suicide bomber detonates in a tent full of Shia pilgrims, sending nearly forty souls to Allah."], ["2009.02.13", "Pakistan", "Peshawar", 2, 3, "Two more policemen are killed by religious extremists in separate attacks."], ["2009.02.14", "Afghanistan", "Khost", 1, 2, "Sunni radicals assassinate a local governor."], ["2009.02.14", "Iraq", "Baghdad", 40, 0, "Forty Shiite abductees are found in a mass grave in a Sunni stronghold."], ["2009.02.14", "Lebanon", "Beirut", 1, 0, "A minority Druse is stabbed to death by Hezbollah supporters at a memorial rally."], ["2009.02.15", "Algeria", "Boumerdes", 3, 0, "Three off-duty soldiers are stopped a roadblock and machine-gunned to death by fundamentalists."], ["2009.02.15", "Algeria", "Tebessa", 5, 4, "Religious radicals detonate a bomb under a passing truck, killing five occupants."], ["2009.02.15", "Iraq", "al-Taji", 10, 0, "Ten victims of al-Qaeda militia are found in a mass grave."], ["2009.02.16", "Iraq", "Baghdad", 8, 24, "Eight Shia pilgrims are blown apart by Sunni bombers in two attacks."], ["2009.02.16", "Pakistan", "Karamkot", 1, 0, "A 35-year-old civilian is kidnapped and killed in captivity by Islamic extremists."], ["2009.02.17", "Iraq", "Baqubah", 2, 10, "Jihadi bombers manage to take out two Iraqi civilians."], ["2009.02.17", "Iraq", "Mosul", 1, 1, "A Christian is gunned down by suspected Islamists."], ["2009.02.17", "Pakistan", "Khar", 4, 4, "A woman is among four civilians killed when the Taliban rocket homes and a school."], ["2009.02.17", "Pakistan", "Peshawar", 4, 16, "Four people are murdered in a Mujahideen car bombing in a residential neighborhood."], ["2009.02.18", "Jordan", "Petra", 1, 0, "A 19-year-old man shoots his divorced sister to death over 'immoral' behavior."], ["2009.02.18", "Pakistan", "Quetta", 1, 0, "A local Sunni leader is gunned down by Shia militants."], ["2009.02.18", "Pakistan", "Swat", 1, 0, "Muslim radicals shoot a journalist thirty-two times following a peace rally."], ["2009.02.19", "Afghanistan", "Khost", 1, 0, "A member of a road construction crew is taken out by Islamic bombers."], ["2009.02.19", "Afghanistan", "Khost", 3, 0, "Three local guards are murdered by Sunni extremists."], ["2009.02.19", "Iraq", "Mosul", 1, 0, "A Christian businessman is gunned down in his shop."], ["2009.02.19", "Iraq", "Mosul", 1, 7, "A suicide bomber takes out an Iraqi policeman."], ["2009.02.19", "Pakistan", "Dera Ismail Khan", 1, 0, "A local Shia leader is shot to death by Sunni militants."], ["2009.02.19", "Pakistan", "Mohmand", 1, 0, "Religious extremists assassinate a tribal elder."], ["2009.02.20", "Iraq", "Mosul", 2, 0, "Jihadis kill a man and his son in a roadside bombing."], ["2009.02.20", "Pakistan", "Dera Ismail Khan", 32, 145, "A suicidal Sunni detonates at a Shia funeral, massacring thirty-two mourners."], ["2009.02.20", "Pakistan", "Karachi", 1, 2, "A boy is gunned down in a sectarian dispute."], ["2009.02.20", "Somalia", "Mogadishu", 1, 2, "A civilian is killed in a terror attack by Islamic hardliners."], ["2009.02.20", "Thailand", "Yala", 2, 0, "Two soldiers guarding teachers are shot and beheaded by Religion of Peace radicals."], ["2009.02.21", "Afghanistan", "Torkham", 1, 2, "A passerby is blown up when Sunni bombers target an oil tanker."], ["2009.02.21", "Iraq", "Baaj", 5, 0, "Five Iraqi security personnel are murdered when Islamists booby-trap a building."], ["2009.02.21", "Iraq", "Tikrit", 2, 0, "Two policemen are killed in separate Jihad attacks."], ["2009.02.21", "Nigeria", "Bauchi", 11, 38, "A Muslim mob goes on a rampage, burning churches and killing Christians."], ["2009.02.21", "Pakistan", "Dera Ismail Khan", 2, 5, "Sunnis open fire on a Shia funeral procession, killing at least two mourners."], ["2009.02.21", "Pakistan", "Dera Ismail Khan", 4, 0, "Suicide bombers murder four more innocents."], ["2009.02.21", "Pakistan", "Multan", 2, 0, "Two adults are beheaded when it is discovered that they are having 'illegitimate' sex."], ["2009.02.21", "Somalia", "Yonday", 2, 0, "Two young Christian boys (ages 11 and 12) are beheaded by Religion of Peace extremists."], ["2009.02.22", "Afghanistan", "Zaranj", 1, 3, "A local guard is taken down by suicide bombers."], ["2009.02.22", "Algeria", "Spas", 9, 3, "Islamic fundamentalists machine-gun nine local guards to death in an ambush."], ["2009.02.22", "Egypt", "Cairo", 1, 21, "Islamists bomb a market, killing a 17-year-old French girl."], ["2009.02.22", "Pakistan", "Karachi", 1, 0, "A man chops his 60-year-old sister into pieces on suspicion that she was having unmarried sex."], ["2009.02.22", "Somalia", "Mogadishu", 11, 15, "al-Shabaab suicide bombers take out eleven Burundi peacekeepers on their base."], ["2009.02.22", "Thailand", "Yala", 2, 0, "A married couple are beheaded by Muslim militants on their way home from work at a rubber plantation."], ["2009.02.23", "Afghanistan", "Helmand", 8, 17, "Eight civilians are killed when Taliban gunmen attack an ISAF patrol."], ["2009.02.23", "Afghanistan", "Kandahar", 3, 0, "Three children are blasted to death by a Taliban IED."], ["2009.02.23", "Iraq", "Baghdad", 5, 15, "Jihadis take down five Iraqis in two terror attacks."], ["2009.02.23", "Pakistan", "Bannu", 1, 2, "A policeman is murdered by a Shahid suicide bomber."], ["2009.02.23", "Sudan", "Darfur", 2, 4, "Two Doctors without Borders humanitarian workers are shot to death by suspected Janjaweed militia."], ["2009.02.23", "Thailand", "Narathiwat", 1, 1, "A rubber tapper is brutally shot to death by Muslim radicals, who also shoot his wife."], ["2009.02.24", "Afghanistan", "Helmand", 5, 0, "Religious extremists kill four US soldiers and a civilian with a roadside bomb."], ["2009.02.24", "Pakistan", "Kohat", 2, 0, "Two civilians on a motorcycle are taken out by Sunni bombers."], ["2009.02.24", "Pakistan", "Landikotal", 2, 0, "Two women who may have been prostitutes are tortured to death after having their faces disfigured."], ["2009.02.24", "Pakistan", "Quetta", 4, 0, "A Shia trader and his three sons are brutally shot to death by Sunni extremists while on their way home."], ["2009.02.24", "Somalia", "Mogadishu", 18, 78, "Eighteen people, including woman and children, are killed when Islamic hardliners attack peacekeepers."], ["2009.02.24", "Thailand", "Yala", 1, 0, "A 41-year-old woman is shot to death by Islamic terrorists."], ["2009.02.24", "Thailand", "Yala", 1, 3, "Muslim militants storm a food shop and murder the owner."], ["2009.02.25", "Afghanistan", "Kandahar", 2, 8, "Two civilians are killed in a Taliban bombing along a city street."], ["2009.02.25", "Ingushetia", "Karabulak", 1, 0, "Fundamentalists gun down the owner of a local bowling alley."], ["2009.02.25", "Somalia", "Mogadishu", 2, 4, "Two schoolchildren under the age of ten are taken out by an Islamic mortar shell on a school."], ["2009.02.25", "Thailand", "Narathiwat", 3, 0, "Three people are beheaded by Muslim radicals."], ["2009.02.26", "Iraq", "Baghdad", 2, 10, "Two Iraqis are killed when Islamists explode a bomb near a university."], ["2009.02.26", "Jordan", "Ajlun", 1, 0, "A teenager strangles his 30-year-old sister to death on suspicion that she is in a sexual relationship."], ["2009.02.26", "Pakistan", "Mohmand", 2, 0, "Islamic militants kill two tribesmen and blow up a girl's school."], ["2009.02.26", "Pakistan", "Razmak", 1, 0, "The Taliban behead a 35-year-old Afghan civilian as a 'gift' to the new American President."], ["2009.02.27", "Iraq", "Hawija", 2, 2, "Two Iraqis are taken down by al-Qaeda gunmen."], ["2009.02.27", "Pakistan", "Hangu", 4, 5, "Mujahideen open fire on a school van, killing three students and their driver."], ["2009.02.27", "Somalia", "Mogadishu", 42, 125, "Forty-two civilians are killed in three days of Islamic militia violence."], ["2009.02.28", "Afghanistan", "Uruzgan", 1, 0, "A civilian contractor is killed by Taliban bombers."], ["2009.02.28", "Iraq", "Baghdad", 2, 7, "Jihadis murder two Iraqis in a restaurant bombing."], ["2009.03.01", "India", "Doda", 1, 0, "A local police officer is abducted, tortured and murdered by Lashkar-e-Toiba."], ["2009.03.01", "Iraq", "Fallujah", 1, 0, "A civilian is killed in his home by an intruding suicide bomber."], ["2009.03.01", "Pakistan", "Quetta", 2, 0, "Sunni radicals shoot a Shia man and his son to death in their shop."], ["2009.03.02", "Germany", "Rees", 1, 0, "A 20-year-old girl is clubbed to death by her brother for having sex."], ["2009.03.02", "Iraq", "Khalis", 3, 16, "Sectarian Jihadis plant a bomb near a mosque, killing five rivals."], ["2009.03.02", "Pakistan", "Kili Karbala", 6, 6, "A 15-year-old suicide bomber takes out a half dozen people at a girl's school."], ["2009.03.02", "Pakistan", "Songo", 1, 28, "Muslim radicals open fire on a Presbyterian church, then enter the building and beat a 45 woman to death."], ["2009.03.02", "Philippines", "Mindanao", 2, 0, "Two local security personnel are murdered in an ambush by Moro Islamists."], ["2009.03.03", "Pakistan", "Lahore", 8, 6, "Eight people are gunned down when Mujahideen stage a brutal attack on a visiting cricket team."], ["2009.03.03", "Pakistan", "Quetta", 5, 0, "Five members of a Shia family are shot to death by Sunni radicals in a sectarian drive-by attack."], ["2009.03.03", "Pakistan", "Swat", 2, 0, "Taliban militants kill two local soldiers in an ambush along a highway."], ["2009.03.03", "Thailand", "Yala", 2, 0, "Two civilians are murdered by Mujahideen gunmen while riding home from work."], ["2009.03.04", "Iraq", "Baghdad", 5, 24, "Two Shahid suicide bombers leave five Iraqis dead."], ["2009.03.04", "Iraq", "Samarrah", 4, 0, "Four members of a family are eliminated by al-Qaeda gunmen."], ["2009.03.04", "Somalia", "Galkacyo", 1, 0, "A cleric is gunned down by Islamist rivals."], ["2009.03.04", "Thailand", "Pattani", 3, 0, "Two truck drivers are among three people shot to death by Islamic terrorists."], ["2009.03.05", "Egypt", "Qalubiya", 2, 0, "Muslims set a young Christian on fire and also stab his 60-year-old father to death."], ["2009.03.05", "Ingushetia", "Nazran", 6, 2, "Six policemen are killed trying to defuse an Islamist bomb."], ["2009.03.05", "Iraq", "Hillah", 12, 40, "Holy Warriors send a dozen souls to Allah with a car bombing at a livestock market."], ["2009.03.05", "Pakistan", "Dera Ismail Khan", 1, 19, "Radicals throw a hand grenade into a rival mosque, killing at least one."], ["2009.03.05", "Philippines", "Basilan", 3, 2, "Three fisherman are killed when suspected Islamists storm their boat."], ["2009.03.05", "Thailand", "Yala", 1, 0, "Muslim terrorists murder a 33-year-old civilian in a drive-by attack."], ["2009.03.06", "Iraq", "Tikrit", 2, 0, "Mujahideen bombers take out two civilians."], ["2009.03.06", "Pakistan", "Bannu", 1, 1, "Sunni militants take out a local official with a bomb blast."], ["2009.03.06", "Pakistan", "North Waziristan", 2, 0, "Religious extremists abduct and murder two civilians."], ["2009.03.06", "Somalia", "Mogadishu", 3, 0, "Three civilian bystanders are killed when Islamic militia attack African peacekeepers."], ["2009.03.06", "Thailand", "Yala", 1, 0, "The 52-year-old owner of a tea shop is shot to death at his business by Mujahideen."], ["2009.03.07", "Afghanistan", "Nimroz", 2, 3, "Two Afghans are take out by a Fedayeen suicide bomber."], ["2009.03.07", "Algeria", "Kabylie", 2, 8, "An elderly woman is among two people killed by a Shahid bomber."], ["2009.03.07", "Iraq", "Mosul", 3, 8, "Three local security personnel are killed in two Sunni militant attacks."], ["2009.03.07", "Pakistan", "Darra Adam Khel", 2, 7, "Two civilians are murdered by Jihadi car bombers."], ["2009.03.07", "Pakistan", "Khyber", 5, 8, "Lashkar-e-Islam terrorists bomb a shop, killing five people."], ["2009.03.07", "Pakistan", "Mohmand", 14, 0, "Fourteen Pakistani soldiers are killed in an ambush by Sunni fundamentalists.  Some are executed in captivity."], ["2009.03.07", "Pakistan", "Peshawar", 8, 5, "Islamists kill an elderly man, then booby-trap the body, killing seven investigating police."], ["2009.03.07", "Thailand", "Pattani", 2, 0, "Two Buddhist brothers riding a motorcycle are shot and then burned by Religion of Peace militants."], ["2009.03.08", "Algeria", "Tizi Ouzou", 1, 0, "A policeman is shot and then set on fire by Islamic fundamentalists."], ["2009.03.08", "Iraq", "Baghdad", 28, 57, "An al-Qaeda suicide bomber attacks new police recruits, leaving nearly thirty innocent people dead."], ["2009.03.08", "Iraq", "Khalis", 25, 0, "Twenty-five victims of al-Qaeda abductions are found in several mass graves."], ["2009.03.08", "Iraq", "Mosul", 3, 3, "Jihadi bombers take down three local soldiers at a traffic stop."], ["2009.03.08", "Russia", "St. Petersburg", 1, 0, "A Muslim man has his 21-year-old woman shot to death for wearing miniskirts."], ["2009.03.08", "Thailand", "Yala", 1, 1, "Islamists fire on a pair of teachers, killing one."], ["2009.03.09", "Iraq", "Baghdad", 2, 0, "Two moderate Sunnis are gunned down by al-Qaeda militants."], ["2009.03.09", "Iraq", "Mosul", 2, 0, "Two policemen are shot to death at their post by Islamic terrorists."], ["2009.03.09", "Pakistan", "Kohat", 1, 4, "Islamists fire a rocket at a passenger bus traveling through the Kohat Friendship Tunnel, killing one rider."], ["2009.03.09", "Pakistan", "Quetta", 2, 0, "Two Shias are shot to death by Sunni rivals."], ["2009.03.09", "Pakistan", "South Waziristan", 3, 0, "Two brothers are among three civilians abducted and murdered by religious extremists."], ["2009.03.09", "Thailand", "Pattani", 1, 0, "A 25-year-old man is murdered by Muslim gunmen."], ["2009.03.10", "Afghanistan", "Helmand", 4, 6, "Four civilians are killed when fundamentalists detonate a roadside bomb."], ["2009.03.10", "Afghanistan", "Khost", 7, 2, "Seven local soldiers are killed by Taliban roadside bombers."], ["2009.03.10", "Iraq", "Abu Ghraib", 33, 34, "A Shahid detonates an explosive belt in the midst of Sunni and Shia tribal leaders, murdering over thirty people."], ["2009.03.10", "Iraq", "Mosul", 3, 6, "A woman is killed inside her home by Mujahideen.  Two other civilians are killed elsewhere."], ["2009.03.10", "Pakistan", "Dera Ismail Khan", 1, 0, "A policeman is gunned down in revenge for preventing a suicide bombing."], ["2009.03.11", "Algeria", "Barika", 1, 1, "Islamic fundamentalists attack an approaching group of policemen with machine guns."], ["2009.03.11", "India", "Reasi", 1, 0, "A man is murdered in his home by Islamic gunmen."], ["2009.03.11", "Iraq", "Kirkuk", 2, 8, "Two Iraqis are killed in a Jihad car bombing."], ["2009.03.11", "Iraq", "Mosul", 4, 10, "Mujahideen car bombers take out four civilians along a city street."], ["2009.03.11", "Pakistan", "Peshawar", 4, 2, "Two women are among four killed by a Fedayeen suicide bomber."], ["2009.03.11", "Somalia", "Mogadishu", 4, 0, "Islamists trigger a roadside bomb, killing four people."], ["2009.03.12", "Ingushetia", "Nazran", 1, 0, "A Russian policeman is murdered by suspected Mujahid."], ["2009.03.12", "Iraq", "Basra", 1, 0, "Shia gunmen take down a Sunni official."], ["2009.03.13", "Iraq", "Baghdad", 1, 1, "Islamic radicals kill a woman and wound a boy with a planted bomb."], ["2009.03.13", "Iraq", "Orakzai", 2, 0, "Two civilians are murdered by the Taliban."], ["2009.03.13", "Pakistan", "Bajaur", 3, 0, "Three tribesmen are abducted and beheaded by Sunni hardliners."], ["2009.03.13", "Thailand", "Narathiwat", 3, 1, "Three local soldiers are killed in an ambush by Muslim militants."], ["2009.03.13", "Thailand", "Yala", 1, 0, "A woman dies from injuries a day after being shot by Muslim extremists."], ["2009.03.14", "Afghanistan", "Helmand", 2, 0, "Sunni hardliners attack a police post, killing two officers."], ["2009.03.14", "Pakistan", "Dera Ismail Khan", 2, 0, "Sunnis spray a Shiite couple on a motorcycle with automatic weapons, killing both the husband and wife."], ["2009.03.15", "Afghanistan", "Kabul", 2, 9, "A suicide bomber kills two civilians outside a high school."], ["2009.03.15", "Afghanistan", "Kandahar", 1, 6, "A bystander is killed by a Taliban wheelbarrow bomb."], ["2009.03.15", "England", "London", 0, 1, "A Christian minister critical of Islam is brutally beaten by local Muslims."], ["2009.03.15", "Iraq", "Baghdad", 1, 0, "Mujahideen bombers murder an oil engineer."], ["2009.03.15", "Israel", "Masua", 2, 0, "Two Israelis are shot to death by Palestinian gunmen while riding in a car."], ["2009.03.15", "Pakistan", "Dera Ismail Khan", 2, 0, "Two Sunnis are shot to death outside a mosque by Shia gunmen."], ["2009.03.15", "Pakistan", "Multan", 2, 0, "A young husband and his pregnant wife, both doctors, are brutally murdered by Islamists for being minority Ahmadiyya."], ["2009.03.15", "Yemen", "Shibam", 5, 4, "Four Korean tourists and a local are murdered by fundamentalist bombers."], ["2009.03.16", "Afghanistan", "Lashkar Gah", 11, 28, "Eleven Afghans are blown to bits by a Shahid suicide bomber."], ["2009.03.16", "Algeria", "Oued Essania", 2, 0, "Two people are killed in a bomb blast."], ["2009.03.16", "Algeria", "Tadmait", 4, 5, "Four local soldiers are taken out in an Islamist bombing."], ["2009.03.16", "Algeria", "Tebessa", 5, 0, "Fundamentalists slit the throat of a shepherd, then kill his family with a bomb."], ["2009.03.16", "Iraq", "Kirkuk", 1, 0, "Sunni militants murder a doctor with a grenade."], ["2009.03.16", "Iraq", "al-Mukhifa", 5, 0, "Five al-Qaeda kidnap victims are found executed."], ["2009.03.16", "Philippines", "Jolo", 2, 4, "Abu Sayyaf militants toss a grenade into a karaoke bar, killing two patrons."], ["2009.03.17", "Iraq", "Mosul", 1, 0, "A university student is gunned down by Mujahideen."], ["2009.03.17", "Pakistan", "NWFP", 5, 3, "Islamic extremists fire rockets at a university, killing five people."], ["2009.03.17", "Pakistan", "Pirwadhai", 14, 25, "At least fourteen people are killed when a suicide bomber detonates at a crowded bus stop."], ["2009.03.17", "Philippines", "Mindanao", 2, 0, "Moro Islamists attack a government patrol, killing two local troops."], ["2009.03.18", "Iraq", "Mosul", 1, 4, "A Fedayeen suicide bomber kills a local policeman."], ["2009.03.18", "Iraq", "Mosul", 2, 0, "An older married couple is killed within their home by Mujahideen."], ["2009.03.18", "Somalia", "Mogadishu", 1, 2, "al-Shabaab terrorists murder an AU peacekeeper in a roadside ambush."], ["2009.03.19", "Afghanistan", "Helmand", 5, 0, "A lawmaker who stood up to the Taliban is assassinated in a targeted bombing along with four others."], ["2009.03.19", "Iraq", "Mosul", 1, 1, "A woman is killed, and her daughter injured, by Sunni gunmen along a city street."], ["2009.03.19", "Pakistan", "Landi Kotal", 8, 30, "Islamic militants lob mortars into a town's commercial district, murdering at least eight innocents"], ["2009.03.19", "Somalia", "Balad", 2, 0, "Two men are beheaded by al Shabaab terrorists."], ["2009.03.19", "Somalia", "Mogadishu", 1, 0, "An aid worker is gunned down in his car by Islamic militia assassins."], ["2009.03.19", "Thailand", "Pattani", 4, 0, "Islamic bombers murder four local soldiers riding in a pickup truck."], ["2009.03.20", "Afghanistan", "Kandahar", 1, 1, "Sunnis murder a carpenter with a mortar."], ["2009.03.20", "Afghanistan", "Kandahar", 1, 6, "A civilian is killed when Sunni hardliners rocket an airport."], ["2009.03.20", "India", "Kupwara", 8, 15, "Lashkar-e-Toiba terrorists Indian troops, killing eight."], ["2009.03.20", "Iraq", "Fallujah", 1, 2, "An Iraqi is blown to bits by a suicide bomber."], ["2009.03.20", "Iraq", "Rasht", 1, 0, "A man is stoned to death for adultery."], ["2009.03.20", "Pakistan", "Lahore", 1, 0, "A mother of three is shot to death by her brothers on suspicion of having an affair with a neighbor."], ["2009.03.20", "Thailand", "Pattani", 1, 0, "Muslim terrorists gun down a man riding his motorcycle home."], ["2009.03.21", "Afghanistan", "Khost", 5, 5, "Islamists murder five civilians when they bomb a celebration for the Persian new year."], ["2009.03.21", "Afghanistan", "Nangarhar", 6, 5, "Six Afghans are murdered by a Shahid suicide bomber while waiting in line at a checkpoint."], ["2009.03.21", "Afghanistan", "Nauroz", 2, 4, "A second attack on people celebrating the Persian new year leaves two dead."], ["2009.03.21", "Bahrain", "Ma'ameer", 1, 0, "An innocent foreigner dies from injuries suffered in a 3/8 petrol bomb attack by Islamic terrorists."], ["2009.03.21", "Iraq", "Hilla", 1, 0, "An Iraqi is killed in a suspected al-Qaeda bombing."], ["2009.03.21", "Jordan", "Amman", 1, 0, "A man and his two sons beat his 19-year-old daughter to death for talking to a strange man."], ["2009.03.21", "Thailand", "Yala", 1, 0, "An older man is murdered by Mujahid gunmen while working outside his home."], ["2009.03.22", "Iraq", "Diyala", 5, 2, "Five Iraqis are killed in two Jihad bombings."], ["2009.03.23", "Afghanistan", "Spin Boldak", 8, 1, "Eight local police are killed in a brutal ambush by Sunni hardliners."], ["2009.03.23", "India", "Bandipora", 1, 0, "A civilian is shot to death inside his home by Mujahideen."], ["2009.03.23", "Iraq", "Abu Ghraib", 9, 19, "Jihad bombers kill nine Iraqis in a commercial district."], ["2009.03.23", "Iraq", "Fallujah", 8, 9, "Two children are among eight killed when Islamists bomb a residence."], ["2009.03.23", "Iraq", "Jalula", 24, 28, "A suicide bomber strikes a Kurdish funeral, killing at least twenty-four mourners."], ["2009.03.23", "Lebanon", "Saida", 1, 3, "Iranian agents are suspected in the assassination of a Palestinian official at a refugee camp."], ["2009.03.23", "Pakistan", "Dera Ismail Khan", 1, 1, "A Sunni is gunned down by Shia militants."], ["2009.03.23", "Pakistan", "Markez", 1, 4, "A Shahid suicide bomber takes out a local policeman."], ["2009.03.23", "Pakistan", "Miranshah", 2, 0, "Religious extremists kidnap and kill two civilians in separate attacks."], ["2009.03.23", "Thailand", "Saida", 1, 1, "A young man is murdered by Muslim gunmen while talking to a friend in front of his home."], ["2009.03.24", "India", "Ghaziabad", 1, 0, "A 16-year-old girl is burned alive by Muslim moral police over a suspected affair."], ["2009.03.24", "Iraq", "Mosul", 1, 0, "Mujahid murder a woman inside her home."], ["2009.03.24", "Pal. Auth.", "Gaza", 1, 0, "A Palestinian is tortured and beaten to death in the hospital by Hamas."], ["2009.03.24", "Somalia", "Mogadishu", 4, 1, "al-Shabaab terrorists shoot four local policemen to death in a drive-by."], ["2009.03.25", "Afghanistan", "Khost", 10, 6, "Ten civilians, including women and children, are blown to bits when Islamic hardliners bomb their passenger bus."], ["2009.03.25", "Chechnya", "Vedeno", 1, 0, "A policeman is abducted and killed by Jihad warriors."], ["2009.03.25", "Iraq", "Mosul", 4, 7, "Four schoolgirls are murdered by Islamic bombers.  Seven other children are injured."], ["2009.03.25", "Sudan", "Abu Zor", 2, 2, "Suspected Janjiweed militia torch a refugee camp, killing two people."], ["2009.03.25", "Thailand", "Pattani", 1, 0, "Mujahideen gun down a Buddhist man."], ["2009.03.26", "Afghanistan", "Helmand", 9, 6, "Nine local police are gunned down when armed religious extremists attack a checkpoint."], ["2009.03.26", "Algeria", "Kabylie", 2, 3, "Separate al-Qaeda ambushes leave two people dead."], ["2009.03.26", "Iraq", "Baghdad", 4, 0, "Four homosexual men are shot to death following a call by clerics for a crackdown."], ["2009.03.26", "Iraq", "Baghdad", 26, 37, "Sunni car bombers massacre over two dozen Shiites, including women and children, at an outdoor market."], ["2009.03.26", "Iraq", "Mosul", 7, 2, "Three children are among seven Iraqis killed in two Muslim terror bombings."], ["2009.03.26", "Pakistan", "Dera Ismail Khan", 3, 3, "Three Sunnis are shot to death in a sectarian drive-by attack."], ["2009.03.26", "Pakistan", "Tank", 11, 25, "A Shahid suicide bomber detonates at a restaurant, killing a dozen patrons."], ["2009.03.26", "Thailand", "Narathiwat", 1, 1, "Militant Muslims shoot a female grocery owner to death and injure her 70-year-old husband."], ["2009.03.26", "Thailand", "Pattani", 1, 1, "Mujahideen storm a school, injure the principal and shoot a teacher to death."], ["2009.03.26", "Thailand", "Yala", 1, 0, "Muslims shoot a 46-year-old Buddhist woman, then set her on fire."], ["2009.03.27", "Iraq", "Jalawla", 1, 1, "A cleric is gunned down by al-Qaeda assassins."], ["2009.03.27", "Pakistan", "Jamrud", 71, 115, "Over seventy people are slaughtered by a horrific Taliban suicide attack on a rival mosque."], ["2009.03.27", "Pakistan", "North Waziristan", 3, 0, "Three civilians are shot to death by armed fundamentalists."], ["2009.03.27", "Philippines", "Maguindanao", 7, 2, "Moro Islamists ambush a security patrol, killing seven members."], ["2009.03.27", "Thailand", "Narathiwat", 1, 16, "A local farmer is shot to death as he returns from work and sixteen others injured in a separate bombing."], ["2009.03.27", "Thailand", "Pattani", 3, 0, "Mujahideen gunmen murder three civilians in two attacks."], ["2009.03.28", "Afghanistan", "Paktia", 7, 5, "Seven local security personnel are killed by Sunni hardliners in two separate attacks."], ["2009.03.28", "Iraq", "Fallujah", 2, 0, "Two farmers are murdered by Muslim extremists while working in their fields."], ["2009.03.28", "Thailand", "Yala", 1, 0, "A 51-year-old man is gunned down in his home by Muslim radicals."], ["2009.03.28", "Yemen", "Jaar", 4, 3, "Islamists ambush and kill four local policemen."], ["2009.03.29", "Iraq", "Basra", 5, 6, "Five Iraqis are blown apart by a Jihad roadside bomb."], ["2009.03.30", "Afghanistan", "Kandahar", 9, 8, "A Fedayeen bomber calmly walks into a government office and detonate, leaving at least nine dead."], ["2009.03.30", "Afghanistan", "Paktia", 3, 0, "Three local cops are killed by a Taliban roadside bomb."], ["2009.03.30", "Iraq", "Baqubah", 3, 9, "Mujahid bombers murder three people outside a real estate office."], ["2009.03.30", "Iraq", "Hillah", 3, 0, "Three al-Qaeda victims are found dead in a car."], ["2009.03.30", "Pakistan", "Bannu", 5, 3, "A Shahid rams an explosives-laden vehicle into a police checkpoint, killing five officers."], ["2009.03.30", "Pakistan", "Lahore", 9, 93, "Civilians are among at least nine innocents slain in a Fedayeen attack on a police academy."], ["2009.03.30", "Somalia", "Saydhelow", 3, 10, "A woman is among three people killed in an al-Shabaab ambush."], ["2009.03.30", "Thailand", "Narathiwat", 1, 0, "Muslim gunmen murder a civilian as he is walking home."], ["2009.03.30", "Thailand", "Pattani", 1, 1, "A vendor is murdered by Muslim gunmen while riding on his cart with his 14-year-old son."], ["2009.03.30", "Thailand", "Pattani", 2, 0, "A married couple is brutally shot to death by Islamic extremists."], ["2009.03.31", "Iraq", "Kirkuk", 1, 0, "A 71-year-old Christian man is killed in his own home by Muslim intruders."], ["2009.03.31", "Iraq", "Kirkuk", 1, 0, "An elderly Christian is gunned down by Muslim radicals."], ["2009.03.31", "Iraq", "Mosul", 7, 40, "A suicide truck bomber takes out seven Iraqis."], ["2009.03.31", "Pakistan", "Samundri", 1, 0, "A father of four young children is murdered by suspected Islamists."], ["2009.03.31", "Philippines", "Alamada", 1, 3, "Moro Islamists gun down a local soldier guarding a town square."], ["2009.04.01", "Afghanistan", "Kandahar", 13, 17, "A Fedayeen attack on a government office leaves thirteen people dead."], ["2009.04.01", "Iraq", "Mashtal", 1, 0, "A Christian man is gunned down in front of his restaurant by Islamic terrorists."], ["2009.04.01", "Iraq", "Mosul", 4, 0, "Two bombings and a shooting leave four dead, including a schoolteacher and a 7-year-old child."], ["2009.04.01", "Pakistan", "Upper Dir", 5, 2, "Five police are slaughtered in a brutal Taliban ambush."], ["2009.04.01", "Somalia", "Mogadishu", 1, 1, "A civilian is killed when al-Shabaab terrorists fire at a vehicle carrying a lawmaker."], ["2009.04.02", "Afghanistan", "Herat", 4, 0, "Sunni fundamentalists kill three civilians and a local cop in an ambush."], ["2009.04.02", "Dagestan", "Khasavyurt", 3, 0, "A local cop and his two brothers are kidnapped and murdered by Islamic separatists."], ["2009.04.02", "Iraq", "Baghdad", 2, 0, "Two homosexuals are killed by their tribes in a bid to \"restore family honor.\""], ["2009.04.02", "Iraq", "Baghdad", 2, 0, "Two older Christian sisters are murdered by Mujahideen gunmen."], ["2009.04.02", "Iraq", "Baqubah", 3, 0, "Terrorists plant a bomb at a car dealership, killing three people."], ["2009.04.02", "Israel", "Bat Ayin", 1, 1, "A 45-year-old Muslim slips into a Jewish settlement, stabs a 7-year-old and axes a 13-year-old to death."], ["2009.04.02", "Pakistan", "Koral", 1, 0, "A Muslim man stabs his sister to death for marrying without the family's permission."], ["2009.04.03", "Afghanistan", "Ghazni", 4, 0, "Four construction crew workers are killed in a Taliban bombing."], ["2009.04.03", "Iraq", "Baghdad", 2, 5, "Jihadi bombers successfully kill two Iraqis."], ["2009.04.03", "Philippines", "Basilan", 2, 8, "A woman is among two people killed when Islamic militants bomb a fast food shop near a Catholic cathedral."], ["2009.04.04", "Iraq", "Mosul", 1, 0, "A Christian repairman is shot to death by Muslim gunmen in front of his workshop."], ["2009.04.04", "Pakistan", "Islamabad", 8, 4, "Eight embassy guards are blown to bits by a Shahid suicide bomber."], ["2009.04.04", "Pakistan", "Miranshah", 7, 30, "Children are among seven people murdered by a Fedayeen bomber."], ["2009.04.04", "Thailand", "Pattani", 2, 0, "A 60-year-old man and his teenage son are shot to death outside their home by Islamic terrorists."], ["2009.04.05", "Iraq", "Abu Ghraib", 1, 2, "A civilian is taken out in an al-Qaeda bombing in a residential area."], ["2009.04.05", "Iraq", "Mosul", 2, 1, "A child and his mother are among three casualties of two terror attacks."], ["2009.04.05", "Jordan", "Sahab", 1, 0, "A 22-year-old woman is stabbed to death by her brother for 'spending too much time out of the house.'"], ["2009.04.05", "Pakistan", "Chakwal", 24, 35, "Two dozen innocents, including four children, are blown to bits in a religious center by a Shahid suicide bomber."], ["2009.04.05", "Somalia", "Mogadishu", 1, 6, "A child is killed in an Islamist mortar attack."], ["2009.04.06", "Afghanistan", "Khost", 2, 1, "Taliban bombers take out two local security personnel."], ["2009.04.06", "Iraq", "Baghdad", 37, 100, "Six coordinated terror bombings leave thirty-seven Iraqis dead."], ["2009.04.06", "Iraq", "Jalawla", 3, 0, "Three civilians are gunned down in a Sunni drive-by."], ["2009.04.06", "Pakistan", "Manghopir", 1, 0, "A 35-year-old Hindu faith healer is brutally murdered in suspected sectarian violence."], ["2009.04.06", "Pakistan", "Mansehra", 4, 0, "Three female aid workers and their driver are brutally murdered by suspected Muslim militants."], ["2009.04.06", "Pakistan", "Mingora", 1, 1, "A village guard is murdered by Islamic gunmen."], ["2009.04.06", "Philippines", "Basilan", 3, 9, "Three laborers are cut down by automatic weapons at point-blank range by Abu Sayyaf militants."], ["2009.04.07", "Iraq", "Baghdad", 7, 14, "Mujahideen blow seven people to bit with a car bomb."], ["2009.04.07", "Iraq", "Fallujah", 3, 7, "A suicide bomber takes out three Iraqis."], ["2009.04.08", "Algeria", "Kabylie", 1, 0, "A cop is killed in a Mujahideen bombing."], ["2009.04.08", "Iraq", "Baghdad", 7, 19, "Jihadis bomb a marketplace, murdering seven patrons."], ["2009.04.08", "Pakistan", "Buner", 5, 0, "Taliban fighters attack a local village, killing five people."], ["2009.04.08", "Pakistan", "Lahore", 1, 0, "A Muslim man guns down his niece to keep her from marrying against the family's permission."], ["2009.04.09", "Afghanistan", "Lashkar Gah", 5, 17, "Two children are among five Afghans blown apart by a Shahid suicide bomber."], ["2009.04.09", "Algeria", "Jijel", 3, 0, "Three brothers are massacred by Islamic fundamentalists at a fake checkpoint."], ["2009.04.09", "Pal. Auth.", "Gaza", 3, 0, "A 5-year-old boy is among three family members gunned down over immoral behavior."], ["2009.04.09", "Thailand", "Pattani", 1, 0, "A teenager is kidnapped and beheaded by Mujahideen."], ["2009.04.10", "Afghanistan", "Helmand", 6, 7, "Religious extremists attack a police post, killing six local officers."], ["2009.04.10", "Iraq", "Mosul", 7, 20, "Five Americans are among seven murdered by a Fedayeen suicide bomber."], ["2009.04.10", "Pakistan", "Bannu", 1, 2, "Islamists bomb a tribal elder meeting, killing one member."], ["2009.04.10", "Pakistan", "North Waziristan", 2, 0, "Two civilians are kidnapped and beheaded by Taliban militants."], ["2009.04.10", "Philippines", "Basilan", 1, 8, "Muslim terrorists attack a Christian village, killing one and kidnapping several young children."], ["2009.04.10", "Somalia", "Mogadishu", 2, 9, "The 'Mujahideen Youth Movement' take out two civilians in a mortar attack."], ["2009.04.10", "Thailand", "Narathiwat", 1, 2, "Mujahideen gunmen fire into a passenger train, killing one railway worker."], ["2009.04.11", "Iraq", "Iskandariya", 12, 32, "A dozen innocents waiting in line for pay are blown apart by an al-Qaeda suicide bomber."], ["2009.04.12", "Afghanistan", "Kandahar", 1, 0, "A women's rights activist is murdered by four fundamentalist gunmen."], ["2009.04.12", "Iran", "Shiraz", 14, 160, "The Sunni Jihadi Movement bombs a Shia prayer gathering, killing fourteen people."], ["2009.04.12", "Iraq", "Mosul", 3, 2, "Mujahideen gun down a civilian and two policemen."], ["2009.04.12", "Iraq", "Yathrib", 2, 0, "al-Qaeda terrorists murder two Iraqis with a roadside bomb."], ["2009.04.12", "Jordan", "Basira", 1, 0, "A 28-year-old pregnant woman is stabbed to death by her younger brother in an 'honor killing.'"], ["2009.04.12", "Pakistan", "Peshawar", 1, 7, "Islamic militants attack a trucking terminal, killing a security guard."], ["2009.04.12", "USA", "Phoenix, AZ", 2, 0, "A man shoots his brother-in-law and another man to death after finding out that they visited a strip club, in contradiction to Islamic values."], ["2009.04.13", "Afghanistan", "Herat", 4, 0, "Four civilians are blown to bits when Sunni hardliners bomb a passenger bus."], ["2009.04.13", "Afghanistan", "Khost", 2, 0, "Two construction crew guards are murdered by Islamic militants."], ["2009.04.13", "Afghanistan", "Nimruz", 2, 0, "A man and woman are publicly executed by the Taliban for eloping."], ["2009.04.13", "Iraq", "Baghdad", 0, 4, "Fundamentalists toss a grenade into a liquor shop."], ["2009.04.13", "Pakistan", "Jandola", 2, 0, "Two people are kidnapped and shot to death by Mujahid."], ["2009.04.13", "Philippines", "Basilan", 1, 0, "Abu Sayyaf terrorists behead a kidnapped Christian."], ["2009.04.13", "Somalia", "Mogadishu", 1, 3, "A woman is among the casualties as Islamists set off a bomb along a city street."], ["2009.04.13", "Somalia", "Mogadishu", 1, 5, "Terrorists send a rocket into a Red Cross building, killing one civilian."], ["2009.04.14", "Pal. Auth.", "Gaza", 1, 0, "A 28-year-old woman is murdered by her family in an honor killing."], ["2009.04.14", "Thailand", "Yala", 1, 0, "A villager is murdered by Mujahid gunmen."], ["2009.04.15", "Iraq", "Kirkuk", 11, 22, "Eleven Iraqis are murdered by a Fedayeen suicide bomber near an oil facility."], ["2009.04.15", "Pakistan", "Charsadda", 18, 5, "A suicide bomber drives an explosives-laden car into a police checkpoint, killing both officers and civilians."], ["2009.04.15", "Pakistan", "Jacobabad", 1, 0, "A young girl is killed by her uncle on suspicion of sexual immorality."], ["2009.04.15", "Pakistan", "Karachi", 1, 0, "A lawyer is gunned down in a suspected sectarian attack."], ["2009.04.15", "Philippines", "Elian", 2, 0, "Moro Islamists ambush and kill two locals."], ["2009.04.15", "Somalia", "Mogadishu", 1, 0, "A government official is assassinated by al-Shabaab terrorists."], ["2009.04.16", "India", "Anantnag", 1, 1, "A woman is murdered, and her son wounded, when Mujahideen intrude into the home and open fire on the family."], ["2009.04.16", "Iraq", "Baquba", 1, 4, "One person is killed in an al-Qaeda bombing."], ["2009.04.16", "Pakistan", "Lahore", 1, 0, "An 18-year-old woman is shot dead by her brother-in-law for trying to leave the marriage."], ["2009.04.16", "Pakistan", "Mardan", 1, 0, "A woman is killed when Islamic militants bomb the offices of a humanitarian organization."], ["2009.04.17", "Afghanistan", "Nimroz", 3, 3, "A suicide bomber takes out three civilians."], ["2009.04.17", "Afghanistan", "Parwan", 5, 5, "Five security guards are gunned down by suspected Sunni radicals."], ["2009.04.17", "Iraq", "Baghdad", 7, 15, "Seven people are killed when Jihadis lob mortars into a residential neighborhood."], ["2009.04.18", "Afghanistan", "Kandahar", 2, 4, "A woman is among two people blown to bits by a planted bicycle bomb."], ["2009.04.18", "Pakistan", "Hangu", 27, 55, "A Holy Warrior rams an explosives-laden truck into a local checkpoint, sending at least twenty-seven souls to Allah."], ["2009.04.18", "Pakistan", "Khyber", 4, 0, "Four men are killed in a remote-controlled bomb attack."], ["2009.04.19", "Afghanistan", "Zabul", 2, 3, "Three local police are murdered in a Taliban ambush."], ["2009.04.19", "India", "Doda", 2, 0, "Lashkar-e-Toiba militants open fire on local security forces, killing two."], ["2009.04.19", "India", "Pulwama", 1, 0, "A former terrorist who renounced violence is shot to death by Islamists."], ["2009.04.19", "Ingushetia", "Rostov-on-Don", 2, 0, "A faith healer is one of two people murdered by suspected Islamic militants."], ["2009.04.19", "Ingushetia", "Sunzhen", 1, 1, "Mujahideen stage a grenade attack on a home, killing a woman."], ["2009.04.19", "Iraq", "Baghdad", 1, 0, "Terrorists assassinate a government official."], ["2009.04.19", "Iraq", "Baghdad", 3, 0, "Three Christian jewelers are brutally murdered in their shop by Muslim gunmen."], ["2009.04.19", "Iraq", "Mussayib", 2, 0, "Two Sunnis are gunned down by suspected al-Qaeda."], ["2009.04.19", "Pakistan", "Hangu", 2, 0, "A man and woman are executed by the Taliban for having relations outside of marriage."], ["2009.04.19", "Pakistan", "Orakzai", 2, 0, "Two women are killed when fundamentalists blow up a house on suspicion of sexual activity."], ["2009.04.19", "Somalia", "Merka", 1, 0, "Islamic gunmen murder a humanitarian worker."], ["2009.04.20", "Afghanistan", "Khost", 2, 8, "Islamists bomb a passenger bus, killing two civilians."], ["2009.04.20", "Afghanistan", "Uruzgan", 1, 2, "Religious extremists kill a civilian with a roadside bomb."], ["2009.04.20", "Iraq", "Baqubah", 11, 15, "Eleven Iraqis are blasted to death by a Fedayeen suicide bomber."], ["2009.04.20", "Iraq", "Fallujah", 2, 0, "Jihadis manage to kill two young girls with an IED."], ["2009.04.20", "Pakistan", "Lahore", 2, 0, "An 18-year-old girl is among two women shot to death by their family member on suspicion of illicit relations with men."], ["2009.04.20", "Pakistan", "South Waziristan", 3, 0, "A woman and child are among three people killed during a Taliban ambush."], ["2009.04.20", "Somalia", "Kismayo", 7, 15, "Seven people are killed during an al-Shabaab assault."], ["2009.04.21", "India", "Poonch", 5, 7, "A young girl and mother are among two people blown to bits by a Lashkar-e-Toiba landmine."], ["2009.04.21", "Iraq", "Mosul", 2, 0, "A female professor and butcher are brutally murdered by Islamic extremists in separate attacks."], ["2009.04.21", "Pakistan", "Taseer", 3, 0, "A mob of Islamic hardliners invade a Christian neighborhood and terrorize the residents.  Two Christians are killed as they attempt to defend women from rape.  An 11-year-old boy dies a few days later."], ["2009.04.22", "Chechnya", "Bamut", 3, 0, "Three Russian soldiers are shot at point-blank range by Islamic ambushers."], ["2009.04.22", "Iraq", "Duluiya", 5, 12, "A child suicide bomber takes out five people at a rival mosque."], ["2009.04.22", "Thailand", "Yala", 2, 0, "Two local police are killed in a combination shooting and bombing attack by Muslim militants."], ["2009.04.23", "Afghanistan", "Farah", 1, 0, "A local policeman is killed in a Taliban ambush."], ["2009.04.23", "Iraq", "Baghdad", 32, 52, "A female suicide bomber successfully blasts thirty-two Iraqis to death.  Her toddler is used as a disguise and dies in the blast."], ["2009.04.23", "Iraq", "Diyala", 55, 67, "A Sunni murders fifty-three Shia pilgrims and two employees at a restaurant with a suicide vest."], ["2009.04.23", "Iraq", "Udhaim", 3, 3, "A planted al-Qaeda bomb kills three local Sunnis."], ["2009.04.23", "Pakistan", "Buner", 2, 0, "Religious extremists open fire on a pair of local cops, killing both."], ["2009.04.23", "Somalia", "Jawle", 3, 0, "al-Shabaab terrorists assassinate three rival clerics."], ["2009.04.24", "India", "Pulwama", 1, 0, "A 55-year-old man is shot to death inside his home by suspected Mujahideen."], ["2009.04.24", "Iraq", "Baghdad", 66, 127, "Two female Fedayeen massacre over 60 Shiite pilgrims at a mosque with explosives hidden in their purse."], ["2009.04.24", "Iraq", "Jalawla", 7, 24, "A Fedayeen car bomber takes out seven Shiite pilgrims."], ["2009.04.24", "Pakistan", "Kala Dhaka", 2, 0, "A man and woman are killed for having an unauthorized sexual relationship."], ["2009.04.25", "Afghanistan", "Kabul", 2, 1, "A young American contractor, working on a septic system for impoverished locals, is killed along with another innocent in an ambush."], ["2009.04.25", "Afghanistan", "Kandahar", 5, 3, "Three Shahid suicide bombers kill five local guards at a government building."], ["2009.04.25", "Iraq", "Tal Keef", 1, 0, "A Christian woman is abducted and beheaded by Islamic radicals."], ["2009.04.25", "Somalia", "Mogadishu", 3, 8, "Three civilians are shot to death in a sustained attack by a religious extremist group."], ["2009.04.25", "Somalia", "Mogadishu", 8, 15, "Islamic hardliners murder eight people in a mortar attack on a residential area."], ["2009.04.26", "Afghanistan", "Kandahar", 7, 0, "Civilians and local police are among seven killed in a Taliban landmine attack."], ["2009.04.26", "Afghanistan", "Khost", 3, 3, "Three local border guards are murdered by Taliban bombers."], ["2009.04.26", "Iraq", "Kirkuk", 1, 2, "A Christian man is gunned down by Mujahid."], ["2009.04.26", "Iraq", "Kirkuk", 2, 0, "Islamists slit the throats of a Christian woman and her daughter-in-law."], ["2009.04.26", "Iraq", "Mosul", 3, 0, "Two brothers are among three people gunned down by Sunni radicals."], ["2009.04.26", "Pakistan", "Datta Khel", 6, 5, "Six people are blown to bits by a Mujahideen roadside bomb."], ["2009.04.26", "Pakistan", "Dir", 12, 0, "A dozen children are blown apart by a bomb hidden in a football planted by Sunni hardliners to punish their families."], ["2009.04.26", "Pakistan", "Peshawar", 1, 0, "A young woman is murdered by her family for choosing a singing career against their approval."], ["2009.04.26", "Philippines", "Sultan Kudarat", 1, 3, "Moro Islamists plant a bomb near a beach, killing one passerby."], ["2009.04.27", "Thailand", "Yala", 5, 0, "A man watching a soccer game and Buddhist plantation worker are among five people murdered separately by Muslim gunmen."], ["2009.04.28", "Iraq", "Mosul", 1, 0, "An elderly man is murdered by Sunni gunmen."], ["2009.04.28", "Pakistan", "Karachi", 1, 0, "A 15-year-old kills his 19-year-old sister on his family's orders for eloping with a non-Muslim man."], ["2009.04.28", "Thailand", "Pattani", 1, 0, "A Buddhist man is gunned down by Mujahideen."], ["2009.04.28", "Thailand", "Yala", 4, 1, "A 16-year-old girl is among four members of a family brutally shot to death in their home by Islamic terrorists."], ["2009.04.29", "Afghanistan", "Baghlan", 2, 0, "A man shoots his daughter and boyfriend to death after finding them in bed together."], ["2009.04.29", "Iraq", "Baghdad", 12, 21, "Twelve Iraqis are killed in three Mujahideen bombings in Shia neighborhoods."], ["2009.04.29", "Iraq", "Baghdad", 48, 68, "Sunni bombers massacre nearly fifty Shiites with three bombs planted in two crowded markets and a packed minibus."], ["2009.04.29", "Iraq", "Mosul", 1, 0, "A girl is beheaded over a suspected moral issue."], ["2009.04.29", "Somalia", "Galkayo", 5, 7, "Suspected Islamists hurl a grenade at a government car, killing five occupants."], ["2009.04.30", "Afghanistan", "Khost", 2, 0, "Two car dealers are shot to death by Jihad terrorists."], ["2009.04.30", "England", "Manchester", 1, 0, "A Sikh dies from injuries suffered when a Muslim gang severely beats him in what police call an unprovoked 'racist' attack."], ["2009.04.30", "Iraq", "Tal Afar", 3, 0, "Islamic militants shoot three brothers to death inside their car."], ["2009.04.30", "Pakistan", "Kohat", 1, 6, "Sunnis bomb a minivan carrying Shia pilgrims, murdering at least one passenger."], ["2009.04.30", "Thailand", "Yala", 1, 1, "Muslim terrorists gun down a 51-year-old businessman."], ["2009.05.01", "Afghanistan", "Kunar", 10, 8, "Ten security force personnel are killed when Islamic militants attack a base."], ["2009.05.01", "Iraq", "Mosul", 5, 6, "A Shiite family of five is blown to bits by a Fedayeen suicide bomber in a cafe."], ["2009.05.01", "Pakistan", "Miranshah", 1, 0, "A civilian is murdered by Sunni extremists on suspicion of spying."], ["2009.05.02", "India", "Baramulla", 1, 2, "A 10-year-old boy is killed by a Jihadi bomb."], ["2009.05.02", "Iraq", "Kirkuk", 3, 0, "Three civilians are taken down in a Mujahideen roadside blast."], ["2009.05.02", "Iraq", "Mosul", 2, 3, "Two US soldiers are shot to death by a local imam wearing a Coalition uniform."], ["2009.05.02", "Pakistan", "Bajaur", 1, 5, "Sunni militants kill a man and injure five women in a rocket attack on their homes."], ["2009.05.02", "Pakistan", "Mingora", 2, 0, "Two government officials are kidnapped and beheaded by religious extremists."], ["2009.05.03", "Afghanistan", "Helmand", 4, 7, "An 8-year-old girl and 10-year-old boy are among four murdered in a Taliban bomb blast."], ["2009.05.03", "Iraq", "Mosul", 3, 4, "Terrorists take out three Iraqis with a car bomb."], ["2009.05.03", "Israel", "Ramat Gan", 0, 1, "An Israeli soldier riding a bus is stabbed in the neck by an Arab attacker."], ["2009.05.03", "Pakistan", "North Waziristan", 2, 0, "The bodies of two Taliban kidnap victims are found riddled with bullets."], ["2009.05.03", "Pakistan", "Swat", 2, 0, "Two security officers are kidnapped and beheaded by Islamists."], ["2009.05.03", "Somalia", "Mogadishu", 11, 15, "Eleven African peacekeepers are murdered in a Mujahid suicide attack."], ["2009.05.03", "Thailand", "Narathiwat", 1, 1, "Islamic fundamentalists shoot a 59-year-old pork vendor to death and injure an accompanying minor."], ["2009.05.03", "Thailand", "Narathiwat", 2, 1, "A construction worker is among two people killed in separate Muslim attacks."], ["2009.05.04", "Afghanistan", "Zabul", 7, 10, "A mayor is among seven people blown to bits by a 14-year-old suicide bomber."], ["2009.05.04", "Afghanistan", "Zabul", 8, 0, "The Taliban murder eight people working a construction crew in a brutal ambush."], ["2009.05.04", "Afghanistan", "Zabul", 12, 0, "Women and children are represented among the twelve victims of Sunni fundamentalist bombers."], ["2009.05.04", "Iraq", "Baghdad", 4, 6, "Muslim bombers take out four Iraqis."], ["2009.05.04", "Pakistan", "Peshawar", 5, 12, "Five local cops are murdered in two attacks, including a Fedayeen bombing."], ["2009.05.04", "Philippines", "Tulunan", 3, 6, "Moro Islamists attack a banana plantation, killing three civilians."], ["2009.05.04", "Thailand", "Yala", 1, 0, "Muslim insurgents shoot a 70-year-old man to death inside his home."], ["2009.05.05", "Iraq", "Kirkuk", 1, 0, "A man is kidnapped and tortured to death by suspected al-Qaeda."], ["2009.05.05", "Pakistan", "Mohmand", 2, 6, "Sunni militants attack a check post, killing at least two defending officers."], ["2009.05.05", "Pakistan", "Peshawar", 7, 48, "Two children are among seven people blown apart by a Holy Warrior car bomber."], ["2009.05.06", "Iraq", "Baghdad", 15, 46, "Jihadis successfully kill fifteen patrons of an outdoor marketplace with a well-placed bomb."], ["2009.05.06", "Iraq", "Mosul", 1, 2, "An 11-year-old boy is taken out by Mujahideen bombers."], ["2009.05.06", "Pakistan", "Buner", 4, 0, "A woman is among four civilians murdered by fundamentalists in two incidents."], ["2009.05.06", "Pakistan", "Dera Ismail Khan", 0, 14, "A Muslim militant throws a grenade into a rival mosque during prayer time, injuring fourteen."], ["2009.05.06", "Pakistan", "Nazar Muhalla", 1, 0, "A woman is shot to death in an honor killing when 'illicit' relations are suspected."], ["2009.05.07", "Afghanistan", "Helmand", 16, 32, "Sixteen people at an outdoor market are blown to bits by a Shahid suicide bomber."], ["2009.05.07", "Pakistan", "Hangu", 5, 7, "Islamic militants abduct three tribesmen, then shoot five others to death as they are searching for their peers."], ["2009.05.07", "Philippines", "Jolo", 5, 3, "Abu Sayyaf terrorists ambush and murder five local police."], ["2009.05.08", "India", "Reasi", 3, 0, "Hizb-ul-Mujahideen terrorists abduct three civilians, including a woman, from their homes and then shoot them to death."], ["2009.05.08", "Iraq", "Kut", 1, 0, "A boy is deliberately murdered by suspected Sunni gunmen."], ["2009.05.08", "Pakistan", "Darra Adam Khel", 4, 3, "Two women and a child are among four killed when Taliban militants fire a rocket into a refugee camp."], ["2009.05.09", "Afghanistan", "Zabul", 4, 8, "Religious extremists kill four local police in two roadside attacks."], ["2009.05.09", "Iraq", "Mosul", 1, 3, "Terrorists gun down an off-duty police officer at a market."], ["2009.05.09", "Jordan", "Amman", 1, 0, "A 30-year-old woman is stabbed to death by her brothers in an honor killing after she states her desire to live as she pleases."], ["2009.05.09", "Pakistan", "Machharkay", 1, 0, "A Christian man is beaten to death with pipes by Muslims angry that he drank tea at a 'Muslim-only' establishment."], ["2009.05.09", "Pakistan", "Shikarpur", 2, 0, "Two women are tortured and then strangled by family members for having 'illicit' relations."], ["2009.05.10", "Afghanistan", "Helmand", 7, 20, "Two suicide bombers take out seven civilians in an attack on a taxi stand."], ["2009.05.10", "Afghanistan", "Nangarhar", 8, 0, "Eight construction crew workers are murdered in a Taliban bomb blast."], ["2009.05.10", "Afghanistan", "Zabul", 3, 0, "Three civilians are blown apart in a Jihad bombing."], ["2009.05.10", "Iraq", "Taji", 2, 0, "Suspected al-Qaeda kill two innocent Iraqis in a roadside attack."], ["2009.05.10", "Somalia", "Mogadishu", 39, 60, "Islamists pour mortars and machine-gun fire into eliminating the 'enemies of Allah.'  At least thirty-nine people are killed, including civilians at a mosque."], ["2009.05.11", "Dagestan", "Kizilyurt", 1, 3, "A policeman is gunned down in a marketplace by suspected Islamic separatists."], ["2009.05.11", "Iraq", "Mosul", 1, 0, "Muslim kidnappers murder a 5-year-old Christian boy."], ["2009.05.11", "Iraq", "Mosul", 3, 7, "Three Iraqis are killed in two Mujahid bombings."], ["2009.05.11", "Pakistan", "Peshawar", 10, 12, "A 6-year-old girl is among ten locals massacred by a suicide car bomber."], ["2009.05.11", "Somalia", "Mogadishu", 2, 3, "Islamists lob a mortar shell into a cafe, ending the lives of two patrons."], ["2009.05.12", "Afghanistan", "Khost", 7, 13, "Four religious extremists blow themselves up, killing seven laborers."], ["2009.05.12", "Iraq", "Baqubah", 1, 0, "A 13-year-old girl is kidnapped and brutally murdered by al-Qaeda."], ["2009.05.12", "Iraq", "Kirkuk", 7, 18, "A child suicide bomber, recruited by al-Qaeda, takes out seven Iraqis along a city street."], ["2009.05.12", "Pakistan", "Nishat Chowk", 1, 0, "The Taliban murder a rival mosque leader."], ["2009.05.12", "Pakistan", "Suhrab Khan", 6, 0, "Islamists behead six people."], ["2009.05.12", "Pakistan", "Swat", 7, 0, "Seven civilians are shot to death by the Taliban on suspicion betraying Islam."], ["2009.05.12", "Pal. Auth.", "Ramallah", 1, 0, "A 30-year-old woman, and mother of seven, is stabbed to death by her nephew in an honor killing."], ["2009.05.13", "Chechnya", "Vedeno", 3, 0, "Islamic bombers take out three people."], ["2009.05.13", "Iraq", "Baghdad", 3, 1, "A young boy is among three Iraqis murdered by Mujahid gunmen."], ["2009.05.13", "Pakistan", "Mingora", 5, 0, "Five more people are beheaded by Sunni radicals."], ["2009.05.14", "Afghanistan", "Ghazni", 1, 1, "A Taliban attack leaves a security guard dead."], ["2009.05.14", "Iraq", "Baqubah", 3, 0, "al-Qaeda gunmen shoot two men and their mother to death inside their home."], ["2009.05.14", "Pakistan", "Miranshah", 3, 4, "Three local soldiers are murdered by Taliban roadside bombers."], ["2009.05.14", "Somalia", "Mogadishu", 26, 98, "Twenty-six civilians are killed in a series of street battles as al-Shabaab Islamists fight for Allah."], ["2009.05.15", "Afghanistan", "Khost", 3, 4, "Sunni terrorists strike a mosque with a rocket, killing three civilians."], ["2009.05.15", "India", "Kupwara", 1, 0, "A park ranger is kidnapped and beheaded by Islamic extremists."], ["2009.05.15", "India", "Kupwara", 2, 0, "Mujahideen shoot two civilians to death in their home."], ["2009.05.15", "Iraq", "Mandali", 1, 0, "A young woman is the victim of a suspected honor killing."], ["2009.05.15", "Iraq", "Mosul", 1, 0, "A Christian is kidnapped and beheaded."], ["2009.05.15", "Pakistan", "Punjab", 1, 0, "A Christian man is raped and murdered for refusing to convert to Islam."], ["2009.05.16", "Chechnya", "Grozny", 4, 5, "Four people are killed by a Shahid suicide bomber."], ["2009.05.16", "Iraq", "Baghdad", 1, 2, "A child is killed when Muslim terrorists lob a mortar into a family home."], ["2009.05.16", "Iraq", "Baghdad", 4, 12, "Jihad bombers take our four Iraqis in two attacks."], ["2009.05.16", "Pakistan", "Peshawar", 11, 31, "Women and children are among those murdered when Islamists bomb a commercial district near an Internet cafe."], ["2009.05.17", "Afghanistan", "Helmand", 6, 0, "Six local police are murdered in a Sunni bomb attack."], ["2009.05.17", "Iraq", "Baghdad", 4, 10, "Four innocents are blown up at a coffee shop by Religion of Peace bombers."], ["2009.05.17", "Iraq", "Mosul", 9, 3, "Nine Iraqis are taken down by Islamic terrorists."], ["2009.05.18", "Afghanistan", "Kandahar", 1, 0, "A Taliban machine-gun attack leaves one person dead."], ["2009.05.18", "India", "Mumbai", 1, 0, "A 14-year-old Hindu boy is strangled for dating a Muslim girl.  His face is subsequently smashed with rocks."], ["2009.05.18", "Pakistan", "Mohmand", 2, 0, "Two hostages held by the Tehrik-e-Taliban are executed and left by a roadside."], ["2009.05.18", "Philippines", "Basilan", 1, 0, "The beheaded body of a 61-year-old Christian farmer is found following his abduction by Islamic militants."], ["2009.05.18", "Thailand", "Narathiwat", 1, 0, "A 39-year-old civilian is gunned down by Muslim terrorists while on his way to play soccer."], ["2009.05.19", "Iraq", "Taji", 2, 5, "Terrorists kill two Iraqis with a roadside bomb."], ["2009.05.19", "Thailand", "Pattani", 2, 0, "Islamists ambush and kill two rangers."], ["2009.05.19", "Thailand", "Yala", 1, 0, "Three Mujahideen murder an elementary school teacher."], ["2009.05.20", "Afghanistan", "Kabul", 2, 0, "Two Americans are murdered in a Mujahideen bombing."], ["2009.05.20", "Algeria", "Medea", 5, 1, "Five local policemen are killed in an ambush by armed Islamic fundamentalists."], ["2009.05.20", "Iraq", "Baghdad", 40, 83, "Sunni bomber take out at least forty Shias with a car bomb near a packed restaurant."], ["2009.05.20", "Somalia", "Mogadishu", 3, 0, "A 6-year-old child sleeping in his home is among three civilians murdered in an Islamic attack."], ["2009.05.20", "Thailand", "Pattani", 2, 0, "Two elderly women are shot off their motorbike, then set on fire by Muslim militants."], ["2009.05.21", "Iraq", "Baghdad", 12, 25, "A dozen people are blasted to death by a Fedayeen suicide bomber."], ["2009.05.21", "Iraq", "Kirkuk", 8, 7, "Eight Iraqis are blown to bits by a Shahid suicide bomber."], ["2009.05.21", "Iraq", "Mosul", 2, 1, "Suspected Sunni extremists storm a home and kill a woman and her daughter."], ["2009.05.21", "Pakistan", "Jandola", 9, 25, "A Holy Warrior detonates himself near a bazaar, killing nine people."], ["2009.05.21", "Philippines", "Zamboanga", 3, 5, "Islamists are suspected in the brutal ambush of a civilian vehicle that leaves three dead."], ["2009.05.22", "Israel", "Qaryut", 1, 0, "al-Aqsa Martyrs Brigade takes credit for shooting a Jewish settler in the back."], ["2009.05.22", "Pakistan", "Mingora", 2, 0, "Two local cops are executed by Sunni fundamentalists."], ["2009.05.22", "Pakistan", "Peshawar", 10, 75, "Ten people are killed when religious fundamentalists detonate one of their own outside a cinema."], ["2009.05.23", "Afghanistan", "Ghazni", 2, 0, "The Taliban are able to bag two civilians with a rocket attack on their vehicle."], ["2009.05.23", "Iraq", "Mosul", 4, 3, "Mujahideen take out four Iraqi police with a roadside bomb."], ["2009.05.23", "Israel", "Beit Jan", 1, 0, "A 23-year-old girl is shot to death by her father for 'violating the tenets of Islam.'"], ["2009.05.24", "Iraq", "Fallujah", 1, 3, "Sunni insurgents toss a grenade into a home, killing a 2-month-old baby."], ["2009.05.24", "Iraq", "Mosul", 1, 0, "Terrorists gun down a university professor."], ["2009.05.24", "Iraq", "Mosul", 2, 0, "A woman and her daughter are murdered in their home by Mujahideen."], ["2009.05.24", "Iraq", "Mosul", 8, 26, "Eight lives are snuffed out by a suicide bomber at a restaurant."], ["2009.05.24", "Pakistan", "Karachi", 1, 0, "A Sunni activist is shot to death in a sectarian attack."], ["2009.05.24", "Pakistan", "South Waziristan", 2, 0, "Two local security personnel are murdered in a Taliban ambush."], ["2009.05.24", "Somalia", "Mogadishu", 7, 7, "Seven people are murdered by a suicide car bomber."], ["2009.05.25", "Dagestan", "Makhachkala", 1, 0, "A moderate cleric is murdered by Islamic radicals."], ["2009.05.25", "Ingushetia", "Sunzha", 4, 0, "Mujahid plant a landmine that kills four local police."], ["2009.05.25", "Pakistan", "Dera Ismail Khan", 3, 0, "Three Shia laborers are shot dead in a Sunni drive-by attack."], ["2009.05.26", "Afghanistan", "Kabul", 6, 3, "Three civilians are among six people blown up a suicide car bomber."], ["2009.05.26", "Iraq", "Anbar", 7, 0, "Seven victims of sectarian violence are found in a mass grave."], ["2009.05.26", "Pakistan", "Dera Ismail Khan", 1, 2, "Sunnis roll a hand grenade into the home of a local Shia, killing him and injuring two family members."], ["2009.05.26", "Somalia", "Mogadishu", 9, 10, "Nine people die from shrapnel during an Islamists mortar attack."], ["2009.05.26", "Uzbekistan", "Andijan", 1, 1, "A Fedayeen suicide attack leaves one other dead."], ["2009.05.27", "Afghanistan", "Paktika", 5, 1, "A man and his three sons are among five shot to death by religious extremists."], ["2009.05.27", "Algeria", "Biskra", 9, 7, "Islamic fundamentalists ambush and kill nine Algerian soldiers."], ["2009.05.27", "Iraq", "Abu Ghraib", 5, 10, "Five people are blown to bits by a Jihadi car bombing."], ["2009.05.27", "Pakistan", "Karachi", 1, 1, "A man is gunned down in a suspected sectarian attack that also leaves his son injured."], ["2009.05.27", "Pakistan", "Lahore", 27, 326, "A child is among two dozen people massacred in a coordinated shooting and bombing attack by Fedayeen."], ["2009.05.27", "Pakistan", "Mingora", 2, 0, "Two local security personnel are murdered in a Taliban landmine attack."], ["2009.05.27", "Uzbekistan", "Khanabad", 4, 0, "Four border policemen are killed in a drive-by attack by Islamic militants."], ["2009.05.28", "Iraq", "Mosul", 1, 0, "A woman is shot to death by Mujahideen."], ["2009.05.28", "Iraq", "Mosul", 2, 0, "A 15-year-old girl and her mother are brutally gunned down in their own home by Muslim terrorists."], ["2009.05.28", "Pakistan", "Barikot", 4, 0, "Four members of a food convoy are shot to death in a Taliban ambush."], ["2009.05.28", "Pakistan", "Peshawar", 6, 22, "Six people are killed in two suicide attacks."], ["2009.05.28", "Pakistan", "Peshawar", 8, 68, "Islamists kill at least eight people, including a little girl, in a series of violent bomb blasts."], ["2009.05.29", "Iran", "Zahedan", 25, 125, "A Shahid suicide bomber blows up twenty-five innocents at a mosque."], ["2009.05.29", "Iraq", "Khalis", 7, 13, "Seven people are killed in two Jihad bombings."], ["2009.05.30", "Afghanistan", "Kandahar", 4, 0, "Sunni extremists take out four civilians with a roadside bomb."], ["2009.05.30", "Iraq", "Baqubah", 1, 0, "A 6-year-old boy is murdered by al-Qaeda gunmen."], ["2009.05.30", "Iraq", "Mosul", 4, 0, "Four local police are murdered by Islamic terrorists."], ["2009.05.30", "Pakistan", "Pacha Killay", 3, 0, "Three residents are beheaded by religious radicals."], ["2009.05.30", "Somalia", "Mogadishu", 2, 5, "A child is among two civilians killed in an al-Shabaab attack along a city street."], ["2009.05.31", "Afghanistan", "Nabi Popal", 4, 0, "Four local security personnel are ambushed and machine-gunned to death by Talibanis."], ["2009.05.31", "India", "Kashmir", 3, 1, "Muslim terrorists shoot three people to death in separate attacks, including one at a bus stop."], ["2009.05.31", "Iraq", "Kirkuk", 1, 0, "A woman is gunned down by suspected Islamists."], ["2009.05.31", "Iraq", "Mosul", 1, 2, "A sports reporter is murdered in a terror bombing."], ["2009.05.31", "Iraq", "Samarrah", 4, 2, "Mujahideen take out four police with a roadside bomb."], ["2009.05.31", "Pakistan", "Hangu", 1, 0, "Fundamentalists barge into a school and kill a guard."], ["2009.06.01", "Iran", "Zahedan", 5, 0, "Five people are killed in an arson attack aimed at stirring up sectarian tensions."], ["2009.06.01", "Iraq", "Baghdad", 4, 15, "Four innocents are blown apart by bombing at a marketplace."], ["2009.06.01", "Iraq", "Mosul", 1, 12, "A child is murdered when Sunni insurgents throw a grenade into the street."], ["2009.06.01", "Mali", "Anderamboukane", 1, 0, "A British man attending an African music festival is kidnapped and beheaded by al-Qaeda."], ["2009.06.01", "Pakistan", "Kohat", 4, 13, "Four people are blown to bits by Jihadi bombers at a bus stand."], ["2009.06.01", "Somalia", "Mogadishu", 7, 20, "Holy warriors take down seven Somalis in two attacks."], ["2009.06.01", "USA", "Little Rock, AR", 1, 1, "A Muslim with 'religious motives' guns down a local soldier in a drive-by attack."], ["2009.06.02", "Afghanistan", "Bagram", 6, 0, "Two children are among six members of a family are annihilated by a Shahid suicide bomber."], ["2009.06.02", "Afghanistan", "Paktia", 8, 0, "Eight local security guards are murdered by roadside bombers."], ["2009.06.02", "Iran", "Zahedan", 1, 2, "Sunni terrorists open fire on a passenger bus, killing one."], ["2009.06.02", "Pakistan", "Chaman", 2, 0, "A raid by suspected Islamists on a NATO depot leaves two local guards dead."], ["2009.06.02", "Pakistan", "Dera Ismail Khan", 2, 0, "Two men are murdered by sectarian Jihadis in a drive-by attack."], ["2009.06.02", "Somalia", "Mogadishu", 3, 20, "Three civilians are shot to death by al-Shabaab militants."], ["2009.06.02", "Thailand", "Narathiwat", 1, 0, "A Buddhist scrap dealer is cut down by Mujahid gunmen."], ["2009.06.02", "Thailand", "Narathiwat", 1, 0, "A man is shot to death by Islamists while sitting in a tea shop."], ["2009.06.02", "Thailand", "Narathiwat", 2, 3, "Two Buddhist women are brutally murdered by Muslims while riding to work in a pickup truck."], ["2009.06.03", "Afghanistan", "Spin Boldak", 5, 0, "A Shahid martyr blows himself up next to a convoy, killing five Afghans."], ["2009.06.03", "Afghanistan", "Wardak", 1, 0, "A political candidate is kidnapped by Sunni fundamentalists and murdered."], ["2009.06.03", "Algeria", "Timezrit", 10, 0, "Two teachers are among ten people butchered at point-blank range by armed fundamentalists."], ["2009.06.03", "India", "Shopian", 1, 0, "A teenaged girl is shot to death inside her home by Islamic terrorists."], ["2009.06.03", "Ingushetia", "Nazran", 1, 1, "Suspected Islamic militants kill a police officer and injure his wife with a car bomb."], ["2009.06.03", "Iraq", "Baghdad", 9, 31, "Nine patrons of a cafe are blown to bits by Mujahid bombers while watching a televised soccer match."], ["2009.06.03", "Philippines", "Maguindanao", 2, 4, "A woman is among two people killed in a Moro Islamist bomb blast."], ["2009.06.03", "Somalia", "Mogadishu", 2, 7, "Two African peacekeepers are murdered by Islamic radicals."], ["2009.06.04", "Afghanistan", "Kandahar", 4, 0, "Four farmers are blown to bits when Talibanis attach a bomb to their vehicle."], ["2009.06.05", "Dagestan", "Dagestan", 2, 0, "Two government officials are machine-gunned at point-blank range."], ["2009.06.05", "India", "Pulwama", 1, 0, "A 56-year-old man is shot to death inside his home by Mujahideen."], ["2009.06.05", "Iraq", "Jalawla", 1, 0, "A local policeman is kidnapped and murdered by Muslim militants."], ["2009.06.05", "Pakistan", "South Waziristan", 5, 4, "Five security personnel are killed by Islamic fundamentalists in two IED attacks."], ["2009.06.05", "Pakistan", "Upper Dir", 49, 41, "A suicide bomber manages to infiltrate a rival mosque and massacre fifty worshippers, including a dozen children."], ["2009.06.05", "Thailand", "Pattani", 5, 0, "Three civilians and two rangers are murdered in four attacks by Islamic terrorists."], ["2009.06.06", "Afghanistan", "Spin Boldak", 5, 11, "Five people are blown to bits by a Fedayeen bomber at a market."], ["2009.06.06", "Iraq", "Suwayra", 9, 15, "A man and his wife are among nine people blown up in the name of Allah in various attacks."], ["2009.06.06", "Pakistan", "Islamabad", 2, 4, "Two local cops are taken down by a Shahid suicide bomber."], ["2009.06.07", "Afghanistan", "Faryab", 4, 0, "Taliban ambush a police post and murder four local officers."], ["2009.06.07", "Afghanistan", "Kandahar", 2, 0, "Mujahideen manage to kill a mother and son with a landmine."], ["2009.06.07", "Algeria", "Kabylia", 3, 1, "Three security personnel are killed in two bombings by fundamentalists."], ["2009.06.07", "Iraq", "Mosul", 2, 0, "Two hospital guards are kidnapped and murdered."], ["2009.06.07", "Pakistan", "Dera Ismail Khan", 3, 9, "Two Shias are killed in a Sunni drive-by.  A Sunni is killed in a Shia grenade attack."], ["2009.06.07", "Pakistan", "Peshawar", 3, 5, "Three people are killed when Taliban militants attack a convoy carrying prisoners."], ["2009.06.07", "Somalia", "Mogadishu", 1, 1, "A radio station director is shot in the head by suspected fundamentalists."], ["2009.06.07", "Somalia", "Mogadishu", 3, 5, "Islamists kill three civilians with a roadside bomb."], ["2009.06.07", "Thailand", "Narathiwat", 1, 19, "A storekeeper is blasted to death by Muslim truck bombers."], ["2009.06.07", "Thailand", "Narathiwat", 2, 0, "Islamic militants gun down two village defense volunteers in cold blood."], ["2009.06.08", "Bangladesh", "Boalia", 0, 3, "Three Christians, including a pastor, are pulled from their church and tortured for their faith with burning cigarettes and wooden clubs."], ["2009.06.08", "Iraq", "Baghdad", 7, 21, "Seven passengers aboard a minibus are blown to Allah by a planted bomb."], ["2009.06.08", "Iraq", "Mosul", 2, 0, "Two students are gunned down in separate attacks."], ["2009.06.08", "Pakistan", "Peshawar", 1, 2, "Seminary students are suspected in the bombing of a police van that killed one officer."], ["2009.06.08", "Pakistan", "Swat", 2, 2, "Religious extremists attack a home, kill a guard, then kidnap a man, whom they later murder."], ["2009.06.08", "Pakistan", "Tiasar", 1, 0, "An 11-year-old boy is shot in the head when the Taliban attack his church."], ["2009.06.08", "Thailand", "Narathiwat", 1, 0, "Islamists gun down a rubber tapper."], ["2009.06.09", "Afghanistan", "Asadabad", 1, 54, "A child dies from shrapnel injuries when religious extremists toss a grenade into a crowd."], ["2009.06.09", "Pakistan", "Peshawar", 17, 52, "Shahid car bombers attack a hotel, killing seventeen people in the suicide blast."], ["2009.06.10", "Ingushetia", "Nazran", 1, 5, "Muslim gunman stage a daring ambush outside a kindergarten that leaves a woman dead and a baby among the injured."], ["2009.06.10", "Iraq", "Bathaa", 30, 70, "Thirty Shiites at an outdoor food market are massacred by Sunni car bombers.  Children are among the dead."], ["2009.06.10", "Pal. Auth.", "Deir el-Balah", 1, 0, "A girl is murdered by her father in an 'honor killing.'"], ["2009.06.10", "Thailand", "Pattani", 1, 2, "A 43-year-old Buddhist man is murdered by Muslim gunmen."], ["2009.06.11", "Iraq", "Hamrin", 1, 2, "A child is killed and two others injured by Mujahid bombers."], ["2009.06.11", "Iraq", "Hawija", 3, 9, "Sunni radicals kill three Iraqis with a planted bomb."], ["2009.06.11", "Mali", "Timbuktu", 1, 0, "An anti-terror official is assassinated in his home by al-Qaeda."], ["2009.06.11", "Pakistan", "Peshawar", 1, 14, "A civilian is murdered by a Fedayeen suicide bomber."], ["2009.06.11", "Thailand", "Narathiwat", 1, 0, "Muslim gunmen open fire from a pickup truck, killing a civilian walking to work."], ["2009.06.11", "Thailand", "Narathiwat", 2, 0, "A Buddhist man and his pregnant wife are brutally shot to death by Islamic terrorists."], ["2009.06.11", "Turkey", "Afyon", 1, 0, "A 19-year-old woman is tortured and beaten to death by her suitor and his family for refusing a marriage proposal."], ["2009.06.12", "Iraq", "Baghdad", 6, 12, "A lawmaker is among six people murdered by a teenage Fedayeen."], ["2009.06.12", "Iraq", "Balad Ruz", 1, 1, "A 17-year-old girl is shot to death in her home by Sunni terrorists."], ["2009.06.12", "Pakistan", "Hangu", 4, 6, "Islamists use a homemade bomb to kill four local police."], ["2009.06.12", "Pakistan", "Lahore", 7, 7, "A moderate cleric is targeted by a suicide bomber outside his mosque.  Six others also die."], ["2009.06.12", "Pakistan", "Nowshera", 5, 105, "A Shahid suicide car bomber takes out five people at a mosque."], ["2009.06.12", "Pal. Auth.", "Hajah", 1, 0, "A 15-year-old boy is hung by his family on a (false) suspicion of being an Israeli informant."], ["2009.06.12", "Philippines", "Kidapawan", 1, 2, "Moro Islamists attack a local jail, killing one of the guards."], ["2009.06.12", "Thailand", "Yala", 1, 1, "A Buddhist monk is shot to death by Islamists while begging for alms."], ["2009.06.12", "Thailand", "Yala", 2, 0, "A woman is among two people killed by Muslim militants in separate attacks."], ["2009.06.13", "Afghanistan", "Farah", 2, 0, "Religious extremists murder a woman and her husband as they are traveling to her hospital."], ["2009.06.13", "Afghanistan", "Helmand", 8, 21, "Eight delivery drivers are killed when a Shahid suicide bomber detonates in a convoy."], ["2009.06.13", "Afghanistan", "Paktia", 4, 2, "Three construction workers and one other civilian are murdered in two Taliban attacks."], ["2009.06.13", "India", "Poonch", 2, 2, "Two boys are blown apart by a Mujahid landmine."], ["2009.06.13", "Ingushetia", "Nazran", 1, 0, "Islamic terrorists machine-gun a former government official to death."], ["2009.06.13", "Iraq", "Baiji", 1, 7, "Sunni bombers manage to kill a young girl traveling with her family."], ["2009.06.13", "Pakistan", "Bahawalpur", 0, 10, "Ten Christians are injured by a Muslim package bomb."], ["2009.06.13", "Pakistan", "Kohat", 2, 6, "Two people are killed by Islamic bombers."], ["2009.06.13", "Philippines", "Parang", 6, 10, "Six local troops are killed in an Abu Sayyaf ambush."], ["2009.06.13", "Thailand", "Narathiwat", 1, 1, "A female nursery teacher is shot to death by Islamic radicals."], ["2009.06.13", "Thailand", "Yala", 1, 12, "Dedicated Muslims throw a grenade into a bus packed with Buddhists, killing at least one."], ["2009.06.13", "Thailand", "Yala", 2, 0, "Two Buddhist villagers, a husband and wife, are gunned down by Mujahideen in cold blood."], ["2009.06.14", "Belgium", "Brussels", 1, 0, "A 32-year-old woman is murdered by her brothers for refusing to wear the veil."], ["2009.06.14", "India", "Srinagar", 1, 0, "Hizb-ul-Mujahideen members shoot a man to death inside his home."], ["2009.06.14", "Iraq", "Mandali", 6, 0, "al-Qaeda militants machine-gun six Iraqis to death as they are sitting on a minibus."], ["2009.06.14", "Pakistan", "Dera Ismail Khan", 9, 36, "Nine people are incinerated by a Taliban bomb at a marketplace."], ["2009.06.14", "Pakistan", "South Waziristan", 3, 2, "Three people are blown to bits by Taliban bombers."], ["2009.06.15", "Iran", "Tehran", 7, 12, "Basij Islamic hardliners open fire on demonstrators, killing seven."], ["2009.06.15", "Iraq", "Baghdad", 6, 25, "Six Iraqis are killed in various terror attacks."], ["2009.06.15", "Pakistan", "Mardan", 2, 3, "Taliban militants gun down two local cops."], ["2009.06.15", "Pakistan", "Swat", 2, 0, "The bodies of two men, kidnapped earlier by Sunni fundamentalists, are found."], ["2009.06.15", "Philippines", "Maguindanao", 1, 3, "A civilian is murdered in a Moro Islamist ambush."], ["2009.06.15", "Thailand", "Pattani", 1, 0, "A Buddhist janitor is shot to death on his way to work by Muslim militants"], ["2009.06.15", "Thailand", "Yala", 1, 0, "Islamists behead a Buddhist laborer outside a plantation."], ["2009.06.15", "Yemen", "Sanaa", 9, 0, "Women and children are among nine foreign missionaries kidnapped and executed by Shiite fundamentalists."], ["2009.06.16", "Iraq", "Kirkuk", 2, 5, "A storeowner stabbed inside his shop is among two people killed in separate attacks."], ["2009.06.16", "Pakistan", "Kurram", 3, 0, "Three people are killed in a Religion of Peace sectarian clash."], ["2009.06.16", "Pakistan", "Peshawar", 1, 1, "Islamic terrorists kill a police officer by tossing a grenade at his vehicle."], ["2009.06.16", "Pakistan", "Shahdadkot", 3, 0, "A woman and a 3-year-old child are among three people gunned down in an honor killing over illicit sex.  The killers were led by an imam."], ["2009.06.16", "Somalia", "Galgalato", 6, 0, "Six people are killed in an al-Shabaab attack."], ["2009.06.16", "Somalia", "Mogadishu", 1, 0, "An Islamist sniper nails the chief of police from a rooftop."], ["2009.06.16", "Thailand", "Pattani", 2, 2, "Two policemen are blown up in a Mujahideen bombing."], ["2009.06.16", "Thailand", "Yala", 1, 0, "A 56-year-old female Buddhist teacher is gunned down by Muslim militants as she is riding to work."], ["2009.06.17", "Afghanistan", "Helmand", 3, 0, "Islamic bombers murder three Danish peacekeepers in a roadside attack."], ["2009.06.17", "Afghanistan", "Khost", 2, 2, "Two Afghan soldiers are killed in a Taliban ambush."], ["2009.06.17", "Algeria", "El Mehir", 23, 5, "Holy Warriors stage a brutal ambush on a group of policemen escorting a road construction crew, machine-gunning about two dozen to death."], ["2009.06.17", "India", "Sopore", 1, 0, "Mujahideen shoot a 50-year-old woman to death inside her home."], ["2009.06.17", "Pakistan", "Mohmand", 4, 9, "Three women are among four who die from shrapnel injuries following a mortar attack by hardliners."], ["2009.06.17", "Somalia", "Mogadishu", 1, 1, "Islamists kill an African peacekeeper in an IED attack."], ["2009.06.17", "Somalia", "Mogadishu", 9, 48, "Five children are among nine civilians killed by mortar fire during an offensive by Muslim militants."], ["2009.06.18", "Afghanistan", "Kandahar", 2, 4, "A child is among two civilians blown apart by a bomb planted on a motorcycle."], ["2009.06.18", "Iraq", "Mosul", 1, 0, "A Christian is gunned down by Muslim gunmen in the process of kidnapping another Christian."], ["2009.06.18", "Pakistan", "Lahore", 1, 0, "A 22-year-old woman is strangled by her brother in front of her family on suspicion of unauthorized sex."], ["2009.06.18", "Pakistan", "Mir Ali", 2, 0, "Sunni hardliners abduct and murder two locals."], ["2009.06.18", "Somalia", "Baladwayne", 35, 45, "At least thirty-five people are murdered by a Shahid suicide bomber blast at a hotel."], ["2009.06.18", "Thailand", "Yala", 1, 0, "Muslim separatists shoot a 29-year-old civilian to death by the side of the road."], ["2009.06.18", "Thailand", "Yala", 2, 0, "A teen is among two young men gunned down by Mujahideen while eating at a restaurant."], ["2009.06.19", "Afghanistan", "Kandahar", 1, 1, "Religious extremists enter a school and behead one student."], ["2009.06.19", "India", "Krimcha", 1, 0, "A Muslim man beheads his daughter to keep her from marrying a man of her choosing."], ["2009.06.19", "India", "Srinagar", 1, 3, "Mujahideen toss a grenade at a tourist bus, killing at least one civilian."], ["2009.06.19", "Iraq", "Mosul", 3, 0, "The coach of the national karate team is among three Iraqis gunned down by Islamic terrorists."], ["2009.06.19", "Pakistan", "Ittanwali", 0, 3, "A Christian woman's family is beaten, including two young children, after she refuses to embrace Islam."], ["2009.06.20", "Chechnya", "Grozny", 1, 0, "Authorities arrest a young man for shooting his sister to death over 'immoral behavior'."], ["2009.06.20", "India", "Anantnag", 1, 0, "Mujahideen invade a home and slit a woman's throat."], ["2009.06.20", "Iran", "Tehran", 13, 50, "Islamic militias and police kill another thirteen Iranian demonstrators, including a young girl."], ["2009.06.20", "Iraq", "Fallujah", 4, 0, "A female Fedayeen bomber murders four Iraqis."], ["2009.06.20", "Iraq", "Ramadi", 1, 6, "A child is killed when Sunni militants rocket a home."], ["2009.06.20", "Iraq", "Taza", 80, 211, "Women and children are abundant among the dead and dismembered as dedicated Sunni detonate a truck bomb outside a Shia mosque, killing at least eighty."], ["2009.06.20", "Philippines", "Mindanao", 3, 32, "Muslim militants hurl a grenade into a town festival, killing three celebrants."], ["2009.06.21", "Afghanistan", "Bagram", 2, 6, "Hard-line fundamentalists fire on an air field, killing at least two Americans."], ["2009.06.21", "Afghanistan", "Samangan", 2, 0, "An 18-year-old girl and her lover are stabbed over fifty times apiece by her father in an honor attack."], ["2009.06.21", "Egypt", "El-Fashn", 0, 22, "A Muslim mob assaults a Christian church, smashing and slashing until at least twenty-two worshippers lay injured."], ["2009.06.21", "Iraq", "Baghdad", 2, 0, "The bodies of two British hostages, held two years before being murdered, are recovered."], ["2009.06.21", "Iraq", "Baghdad", 2, 13, "Two civilians are killed when Muslim terrorists bomb a cafe."], ["2009.06.21", "Iraq", "Baghdad", 8, 1, "Jihadi gunmen are able to murder eight local cops in multiple attacks."], ["2009.06.22", "Algeria", "Khenchela", 5, 1, "Armed fundamentalists machine-gun five police officers at point-blank range."], ["2009.06.22", "Ingushetia", "Magas", 2, 3, "Two people are killed during a Fedayeen car bomb assassination attempt on the president of the republic, who is seriously injured."], ["2009.06.22", "Iraq", "Baghdad", 22, 79, "Twenty-two people are blown to bits in four separate Jihad bombings, including an attack on a school bus."], ["2009.06.22", "Iraq", "Husseiniyah", 5, 19, "Holy Warriors bomb a marketplace, killing five patrons."], ["2009.06.22", "Iraq", "Mosul", 3, 0, "A woman shot to death in her home by Mujahideen is among three civilians killed."], ["2009.06.22", "Pakistan", "Bannu", 3, 1, "Two women are among three killed when Islamic radicals fire a rocket into a home."], ["2009.06.22", "Pakistan", "Battagram", 2, 7, "A Shahid suicide bomber take out two local police."], ["2009.06.22", "Pakistan", "Quetta", 3, 0, "Three Shias are gunned down in a sectarian drive-by shooting."], ["2009.06.22", "Philippines", "Maguindanao", 1, 4, "Moro Islamists storm a village and shoot a 15-year-old Christian boy dead."], ["2009.06.22", "Thailand", "Narathiwat", 0, 8, "Eight people are injured when Islamists open fire on a Buddhist temple."], ["2009.06.23", "Afghanistan", "Ghazni", 2, 0, "Two civilians are murdered by a Shahid suicide bomber."], ["2009.06.23", "Afghanistan", "Jowzjan", 3, 0, "Sunni bombers take out three UN aid workers in a roadside attack."], ["2009.06.23", "Afghanistan", "Zabul", 2, 0, "Two Afghan intelligence agents are murdered by Taliban terrorists."], ["2009.06.23", "Chechnya", "Grozny", 2, 0, "Islamic insurgents kill two people with a roadside blast."], ["2009.06.23", "Iraq", "Ludhiana", 1, 0, "A pregnant woman is stabbed to death by her uncle in an honor killing."], ["2009.06.23", "Mauritania", "Nouakchott", 1, 0, "An young American aid worker is murdered by al-Qaeda gunmen."], ["2009.06.23", "Pakistan", "Dera Ismail Khan", 1, 0, "A Taliban leader criticizes a recent attack on civilians and is quickly gunned down."], ["2009.06.23", "Pakistan", "Khyber", 1, 1, "Sunni hardliners open fire on a pair of village guards, killing one."], ["2009.06.23", "Pakistan", "Quetta", 1, 0, "A college principal is gunned down in a sectarian drive-by attack as he is walking home."], ["2009.06.23", "Somalia", "Jowhar", 2, 4, "A mother traveling with her two young children is among those machine-gunned to death on a bus by al-Shabaab militants."], ["2009.06.24", "Afghanistan", "Helmand", 7, 4, "Seven civilians die when Islamists bomb their minibus."], ["2009.06.24", "Algeria", "Setif", 1, 0, "A man stabs his daughter to death across the street from a mosque.  She was disobedient."], ["2009.06.24", "Germany", "Schweinfurt", 1, 0, "A 15-year-old girl is stabbed to death by her father over her Western lifestyle."], ["2009.06.24", "Ingushetia", "Karabulak", 1, 0, "Muslim rebels machine-gun a local soldier to death in a drive-by."], ["2009.06.24", "Iraq", "Baghdad", 1, 10, "A young man is killed in a sectarian bombing in a residential neighborhood."], ["2009.06.24", "Iraq", "Baghdad", 69, 135, "At least sixty people are blown to bits when Islamists bomb a packed outdoor pet market full of women and children."], ["2009.06.24", "Iraq", "Mosul", 2, 9, "Two people are killed in separate Jihad bombings."], ["2009.06.24", "Pakistan", "Bajaur", 1, 4, "Sunni militants fire a missile into a bazaar, killing one patron."], ["2009.06.24", "Pakistan", "Peshawar", 3, 0, "Three local police are blasted to death when radicals shoot a rocket into their post."], ["2009.06.25", "Iraq", "Baghdad", 7, 31, "Islamic bombers kill seven Iraqis at a bus station."], ["2009.06.25", "Iraq", "Mosul", 1, 0, "Terrorists murder a 16-year-old boy."], ["2009.06.25", "Pakistan", "Buner", 1, 0, "Religious radicals kidnap a policeman, then riddle his body with bullets."], ["2009.06.25", "Somalia", "Shabelle", 5, 13, "Five people are killed during an al-Shabaab attack."], ["2009.06.26", "Afghanistan", "Khost", 1, 5, "An English interpreter dies from shrapnel injuries suffered during a roadside blast."], ["2009.06.26", "Iraq", "Baghdad", 19, 50, "Holy Warriors detonate a bomb packed with nails to maximize casualties at a crowded bazaar.  Nineteen are killed."], ["2009.06.26", "Pakistan", "Muzaffarabad", 2, 3, "A Shahid suicide bomber takes down two local soldiers along a highway."], ["2009.06.26", "Pakistan", "North Waziristan", 4, 24, "Four Pakistanis are killed in a remote-controlled Taliban bomb attack."], ["2009.06.27", "Afghanistan", "Helmand", 8, 0, "Religious radicals storm a police post and shoot eight local officers to death."], ["2009.06.27", "Afghanistan", "Khost", 1, 0, "Taliban bombers kill a civilian with a car bomb."], ["2009.06.27", "Afghanistan", "Kunar", 2, 0, "Two locals are blown apart by a well-placed Islamic bomb."], ["2009.06.27", "Bangladesh", "Shariatpur", 1, 0, "Muslims rape and kill a Hindu woman."], ["2009.06.27", "India", "Rajouri", 2, 0, "Muslim terrorists gun down a young couple."], ["2009.06.27", "Iraq", "Baghdad", 1, 4, "A civilian is murdered when Islamists plant a bomb on a motorcycle."], ["2009.06.27", "Philippines", "Tacurong", 0, 9, "Nine people at a bus terminal suffer shrapnel injuries from an Islamic bomb."], ["2009.06.27", "Philippines", "Tipo Tipo", 2, 0, "Two unarmed engineers are murdered by Moro Islamist gunmen."], ["2009.06.27", "Sudan", "Hashaba", 8, 20, "The Islamic Republic stages air strikes on a village, killing eight residents."], ["2009.06.28", "Iraq", "Hamrin Dam", 1, 3, "Islamists bomb a family vehicle, killing one member and injuring three."], ["2009.06.28", "Iraq", "Mosul", 2, 0, "Two civilians are murdered by Sunni gunmen."], ["2009.06.28", "Pakistan", "Charsadda", 5, 0, "'Deeply conservative' Muslims shoot a young couple to death for eloping without permission - along with a few other family members."], ["2009.06.28", "Pakistan", "Waziristan", 22, 35, "Twenty-two local troops are killed in two brutal ambushes by Muslim extremists."], ["2009.06.28", "Philippines", "Sumisip", 7, 2, "Abu Sayyaf militants ambush a police vehicle and shoot seven officers to death."], ["2009.06.28", "Somalia", "Mogadisu", 5, 14, "Five Somalis are killed during an attack on the presidential palace."], ["2009.06.28", "Thailand", "Narathiwat", 1, 0, "A female Buddhist teacher is murdered by two Muslim gunmen on a motorcycle."], ["2009.06.29", "Belgium", "Brussels", 1, 0, "A woman is found dead, the victim of an honor killing by her husband and brother-in-law for seeking a divorce."], ["2009.06.29", "Iran", "Mashhad", 6, 0, "Six political activists are hanged."], ["2009.06.29", "Iraq", "Hamdaniya", 9, 10, "A 5-year-old child is among nine Iraqis killed by Islamic bombers."], ["2009.06.29", "Philippines", "Maguindanao", 1, 14, "A Muslim extremist murders a patron at a coffee shop with a homemade bomb."], ["2009.06.29", "Thailand", "Narathiwat", 2, 0, "Two young men are gunned down by Islamic terrorists by the side of the road."], ["2009.06.30", "Afghanistan", "Torkhum", 8, 8, "Four women and two children are among eight people killed by a male suicide bomber disguised in a burka."], ["2009.06.30", "Canada", "Kingston Mills, ON", 4, 0, "Three teenage girls and a 50-year-old woman are murdered by their family in an 'honor killing.'"], ["2009.06.30", "Iraq", "Kirkuk", 27, 80, "Holy Warriors blow up over two dozen Iraqi civilians at an outdoor market."], ["2009.06.30", "Iraq", "Shurqat", 2, 0, "Jihadis shoot two people riding in a civilian vehicle."], ["2009.06.30", "Pakistan", "Hajika", 4, 11, "Four people are killed in a car bombing outside a hotel."], ["2009.06.30", "Somalia", "Mogadishu", 2, 5, "al-Shabaab militants toss a hand grenade into the street, killing two people."], ["2009.06.30", "Thailand", "Pattani", 1, 0, "Muslim bombers kill a local soldier on patrol."], ["2009.07.01", "Iraq", "Baquba", 1, 3, "An Iraqi is killed in a Jihad bomb attack."], ["2009.07.01", "Pakistan", "Dera Ismail Khan", 1, 1, "A civilian is killed in a Taliban bombing."], ["2009.07.01", "Pakistan", "Faisalabad", 0, 1, "A young Christian is brutally tortured by a Muslim mob on charges of desecrating a Qur'an."], ["2009.07.01", "Pakistan", "Ghaziabad", 1, 0, "A 16-year-old Christian boy is tortured to death in a police station."], ["2009.07.01", "Pakistan", "Hangu", 1, 9, "A local police officer is killed in a Taliban ambush."], ["2009.07.01", "Pakistan", "Jamrud", 2, 0, "Religious extremists ambush two men in a vehicle, shooting both to death."], ["2009.07.01", "Pakistan", "Lahore", 0, 15, "Fifteen Christian women and children are burned when a Muslim mob throws acid on them."], ["2009.07.01", "Pakistan", "Lashkar", 2, 4, "Two villagers are cut down by militant Muslims in an automatic weapons attack."], ["2009.07.01", "Pakistan", "Nowshera", 2, 3, "Two civilians are blown apart in a Sunni rocket attack on a home."], ["2009.07.02", "England", "London", 0, 1, "A 24-year-old man is blinded, suffers the loss of his tongue and 90% burns during an 'honor' attack in which he was forced to drink acid and had it thrown on him by angry Muslims."], ["2009.07.02", "Iraq", "Baghdad", 4, 31, "Four Iraqis are blown apart by a series of Jihad bomb blasts."], ["2009.07.02", "Pakistan", "Chacho Wali", 2, 0, "A young couple is shot to death in for marrying against their family's will."], ["2009.07.02", "Pakistan", "Dera Ismail Khan", 2, 6, "Suspected Islamists toss a grenade into a shop, killing two people."], ["2009.07.02", "Pakistan", "Peshawar", 2, 2, "Two local police are killed in a remote-controlled bomb attack by Talibanis."], ["2009.07.02", "Pal. Auth.", "Gaza", 1, 0, "A Palestinian girl is killed from an errant Hamas mortar shell intended for Israelis."], ["2009.07.02", "Saudi Arabia", "Riyadh", 2, 0, "Two sisters are shot to death outside a women's shelter by their brother after being accused of 'illicit relations.'"], ["2009.07.03", "Ethiopia", "Dessie", 2, 0, "Two Christians are shot to death by Muslim gunmen while working on a church."], ["2009.07.03", "India", "Kishtwar", 2, 1, "Hizb-ul-Mujahideen militants slit the throat of one individual and shot another to death."], ["2009.07.04", "Ingushetia", "Nazran", 9, 9, "A brutal, well-planned ambush by Mujahideen leaves nine police officers dead."], ["2009.07.04", "Iraq", "Mosul", 4, 0, "Two brothers are among four people shot to death in separate terror attacks."], ["2009.07.04", "Iraq", "Yusufiya", 1, 12, "One person is killed when Jihadis bomb a vegetable market."], ["2009.07.04", "Mali", "Tessalit", 24, 3, "al-Qaeda militants ambush a group of local soldiers, killing some on the spot and then executing others taken hostage."], ["2009.07.04", "Pakistan", "Dera Ismail Khan", 1, 0, "A local trader is gunned down by sectarian rivals."], ["2009.07.04", "Pakistan", "Mohmand", 12, 0, "Islamic radicals ambush a group of tribesmen, killing at least a dozen."], ["2009.07.04", "Somalia", "Mogadishu", 1, 0, "Islamists shoot a 22-year-old journalist in the stomach, then shoot at those trying to help so that he eventually bleeds to death."], ["2009.07.04", "Somalia", "Mogadishu", 23, 50, "Twenty-three civilian bystanders are killed during an attack by al-Shabaab militants on government troops."], ["2009.07.05", "Pakistan", "Lahore", 1, 0, "A man is gunned down in the name of honor by his new wife's son."], ["2009.07.05", "Pakistan", "Mohmand", 2, 0, "Two tribesmen are kidnapped by Sunni hardliners, then murdered by having their throats slit."], ["2009.07.05", "Philippines", "Cotabato", 6, 44, "A Religion of Peace nail bomb outside a Christian church leaves at least six innocents dead."], ["2009.07.05", "Saudi Arabia", "Riyadh", 2, 0, "A brother shoots his two young sisters to death for 'mixing with unrelated men.'"], ["2009.07.06", "Iraq", "Baghdad", 5, 0, "Mujahideen gunmen take down five Iraqis at a checkpoint."], ["2009.07.06", "Iraq", "Mosul", 1, 12, "Two policemen are stabbed to death by Muslim terrorists, who also murder a teenager in a separate bombing."], ["2009.07.06", "Pakistan", "Dera Ismail Khan", 5, 2, "Five Shias and Sunnis are killed in three separate sectarian attacks."], ["2009.07.07", "Afghanistan", "Khost", 1, 28, "Religious extremists throw a grenade into the street, killing one civilian and injuring children."], ["2009.07.07", "Afghanistan", "Nuristan", 8, 8, "Armed fundamentalists storm a police post, killing eight local officers."], ["2009.07.07", "Iraq", "Mosul", 4, 0, "A father and son are among four Iraqis gunned down by Mujahideen."], ["2009.07.07", "Pakistan", "Khyber", 1, 0, "A 55-year-old tribal leader is kidnapped and murdered by Sunni extremists."], ["2009.07.07", "Pakistan", "Lahore", 0, 1, "A Christian man is crippled by a Muslim, who shoots him eight times in the legs for refusing to pay Jizya."], ["2009.07.07", "Pakistan", "Peshawar", 2, 3, "Taliban assassins take down two civilians in separate attacks."], ["2009.07.07", "Philippines", "Jolo", 2, 27, "Abu Sayyaf militants detonate a bomb outside a second Christian church, killing two innocents."], ["2009.07.07", "Thailand", "Narathiwat", 2, 0, "Two teenagers riding a motorbike are taken out by Religion of Peace gunmen."], ["2009.07.07", "Thailand", "Pattani", 1, 0, "A 40-year-old Buddhist man is shot to death by Muslim radicals while shopping at a grocery."], ["2009.07.08", "India", "Kulgam", 1, 1, "A shepherd and a 13-year-old boy are shot point-blank by Islamic terrorists.  The boy survives with critical injuries."], ["2009.07.08", "Ingushetia", "Nazran", 1, 0, "Muslim militants open fire on a government vehicle, killing a guard."], ["2009.07.08", "Iraq", "Baghdad", 2, 5, "A man and his teenage son are taken down by sectarian bombers while tending their garden."], ["2009.07.08", "Iraq", "Mosul", 15, 24, "Fifteen people are blown apart by two Jihad bombs, one near a mosque and the other in a commercial district."], ["2009.07.08", "Iraq", "Musayyib", 2, 18, "Mujahideen attempt to blow up a wedding, killing two of the guests."], ["2009.07.08", "Pakistan", "Peshawar", 1, 4, "A female suicide bomber manages to kill one other person."], ["2009.07.08", "Thailand", "Pattani", 1, 0, "A villager is gunned down by Muslim terrorists while driving his pickup truck."], ["2009.07.09", "Afghanistan", "Kabul", 25, 4, "More than a dozen children are among twenty-five innocents annihilated in a suicide blast."], ["2009.07.09", "Afghanistan", "Samangan", 2, 2, "Two local policemen are murdered in a Taliban attack on a remote post."], ["2009.07.09", "France", "Lyon", 1, 0, "A 22-year-old woman is murdered by her 17-year-old \"religious\" brother, angry over a sexual affair."], ["2009.07.09", "Iraq", "Baghdad", 16, 66, "Sixteen  Iraqis are blown to bits in two marketplace bombings."], ["2009.07.09", "Iraq", "Tal Afar", 35, 61, "Thirty-five Iraqis are murdered by Fedayeen suicide bombers along a residential street."], ["2009.07.09", "Jordan", "Amman", 1, 0, "A 27-year-old woman is stabbed to death by her younger brother for bringing dishonor to the family by getting pregnant."], ["2009.07.09", "Jordan", "Amman", 1, 0, "A second woman is stabbed to death by her brother, who finishes the job with a rock.  Her crime was talking to a man."], ["2009.07.09", "Pakistan", "Bajaur", 4, 0, "Islamic terrorists attack a check post and shoot four security personnel to death."], ["2009.07.09", "Pakistan", "Bannu", 2, 5, "The Taliban take out two local soldiers with a roadside bombing."], ["2009.07.09", "Pakistan", "Peshawar", 1, 3, "A power company employee dies from shrapnel injuries suffered from a Mujahideen bombing."], ["2009.07.09", "Thailand", "Pattani", 1, 5, "Islamists kill a local soldier with a roadside bomb."], ["2009.07.10", "China", "Urumqi", 137, 800, "Chinese Muslims rampage through Han neighborhoods, murdering one-hundred and forty, including women and children.  A bus full of passengers is set ablaze, women are raped and decapitated heads are strung up on highways."], ["2009.07.10", "Somalia", "Baidoa", 7, 0, "al-Shabaab Islamists stage the public beheading of seven people for \"being Christian.\""], ["2009.07.10", "Thailand", "Pattani", 1, 0, "An elderly man is shot to death in a Mujahideen drive-by attack."], ["2009.07.11", "Afghanistan", "Ghazni", 8, 1, "Four security guards are killed in a Taliban rocket attack.  Another four are cut down by a roadside bomb in Logar."], ["2009.07.11", "Afghanistan", "Paktia", 18, 20, "Taliban fundamentalists stage a brutal ambush on a road construction crew, leaving eighteen dead."], ["2009.07.11", "Iraq", "Baghdad", 4, 12, "Four people are killed when fundamentalists bomb a billiards hall."], ["2009.07.11", "Iraq", "Mosul", 8, 39, "Eight Iraqis are blown up in a Jihad car bombing."], ["2009.07.11", "Pakistan", "Kohat", 3, 6, "Three security personnel are murdered by a Taliban remote-controlled bomb."], ["2009.07.11", "Somalia", "Mogadishu", 1, 0, "A government official is murdered in an ambush by Jihadis."], ["2009.07.11", "Somalia", "Mogadishu", 3, 1, "Three Ugandan peacekeepers are killed in an al-Shabaab mortar attack."], ["2009.07.12", "Iraq", "Baghdad", 4, 33, "Four people are killed when Islamists place bombs at four Christian churches."], ["2009.07.12", "Iraq", "Jurf al-Sakhar", 1, 0, "al-Qaeda gunmen murder a civilian."], ["2009.07.12", "Iraq", "Kirkuk", 1, 0, "A Christian man is pulled from his car and murdered in front of his daughter."], ["2009.07.12", "Pakistan", "Lahore", 1, 0, "A 23-year old woman is shot to death by her cousin over unapproved sexual relations."], ["2009.07.13", "Afghanistan", "Kabul", 4, 0, "Taliban bombers send four local police to Allah."], ["2009.07.13", "Chechnya", "Grozny", 1, 0, "Mujahideen kill a policeman with a bomb."], ["2009.07.13", "Dagestan", "Rostov-on-Don", 2, 5, "Islamists open up on a convoy of local troops at point blank range, killing at least two."], ["2009.07.13", "Iraq", "Fallujah", 1, 0, "A boy is kidnapped and tortured to death by terrorists."], ["2009.07.13", "Pakistan", "Multan", 12, 61, "Seven children and three women are among twelve killed when a cleric's explosives go off earlier than expected where they are being stored at his Qur'an school."], ["2009.07.14", "Iraq", "Baghdad", 2, 0, "Two traffic cops are gunned down by Mujahideen."], ["2009.07.14", "Iraq", "Mosul", 1, 0, "A woman is murdered in her home by Jihadi gunmen."], ["2009.07.14", "Pakistan", "Khyber", 2, 3, "Islamic militants attack an oil tanker, killing two civilians."], ["2009.07.15", "Afghanistan", "Ghazni", 2, 1, "Two civilians lose their lives to a Taliban bomb hidden on a bicycle."], ["2009.07.15", "Chechnya", "Grozny", 1, 0, "A female human rights activist investigating honor killings is kidnapped and brutally murdered."], ["2009.07.15", "Ingushetia", "Border", 2, 0, "Two innocents are gunned down in their car by Muslim separatists."], ["2009.07.15", "Iraq", "Baghdad", 5, 28, "Jihadi bombers take the lives of five people attending a funeral."], ["2009.07.15", "Iraq", "Ramadi", 6, 25, "Six Iraqis are blown up when a Shahid suicide bomber drives into a checkpoint."], ["2009.07.15", "Pakistan", "Bannu", 2, 6, "Mujahideen kill two cops with a roadside bomb."], ["2009.07.15", "Pakistan", "Jandola", 2, 1, "Two woman are killed and a child injured when Islamic terrorists lob a rocket into a home."], ["2009.07.15", "Thailand", "Pattani", 2, 1, "Two civilians are shot to death by Muslim radicals in separate attacks."], ["2009.07.16", "Dagestan", "Gedzhukh", 1, 0, "A government official is assassinated outside his home by suspected Islamists."], ["2009.07.16", "India", "Doda", 1, 0, "Islamic militants kidnap and murder a civilian."], ["2009.07.16", "Iraq", "Basra", 3, 1, "An Iranian-backed militia kills three off-duty US soldiers in a mortar attack."], ["2009.07.16", "Jordan", "Amman", 1, 0, "A young man stabs his married sister and smashes her head with a rock over 'immoral behavior.'"], ["2009.07.16", "Pakistan", "Bajaur", 1, 0, "A Taliban rocket attack on a home leaves at least one resident dead."], ["2009.07.16", "Pakistan", "Karachi", 3, 0, "Three men are killed in separate sectarian attacks, including one who is brutally tortured before being shot."], ["2009.07.16", "Pakistan", "Miranshah", 3, 4, "Mujahideen bombers take out three people traveling in a car."], ["2009.07.16", "Pakistan", "Peshawar", 2, 0, "A UN staff member and a guard are shot to death by Sunni militants at a refugee camp."], ["2009.07.16", "Thailand", "Narathiwat", 1, 0, "Islamists gun down a food vendor."], ["2009.07.16", "Thailand", "Yala", 1, 0, "A 26-year-old man is murdered inside his home by Muslim radicals."], ["2009.07.17", "Afghanistan", "Spin Boldak", 11, 3, "Five children are among eleven civilians killed when an Islamist bomb rips through their bus."], ["2009.07.17", "India", "Shopian", 1, 0, "A 17-year-old girl is shot to death in her home by Muslim terrorists."], ["2009.07.17", "Indonesia", "Jakarta", 9, 50, "Fedayeen suicide bombers carry out attacks on two luxury hotels that leave at least nine dead."], ["2009.07.17", "Ingushetia", "Sredniye Achaluki", 2, 0, "Islamists open fire on a passing vehicle, killing two people."], ["2009.07.17", "Iraq", "Baghdad", 2, 9, "A married couple is blown apart in a Mujahideen bombing."], ["2009.07.17", "Iraq", "Garma", 2, 11, "Two young girls, ages 6 and 12, are killed in a brutal bombing by Holy Warriors outside their home."], ["2009.07.17", "Iraq", "Kut", 1, 0, "A young woman is shot to death in an apparent honor killing."], ["2009.07.17", "Pakistan", "Khyber", 1, 0, "A shopkeeper dies in a Taliban bombing at a market."], ["2009.07.17", "Thailand", "Yala", 2, 5, "Two security personnel are murdered in a militant bomb attack."], ["2009.07.18", "Afghanistan", "Nangarhar", 2, 0, "Two villagers die defending their homes from a Taliban attack."], ["2009.07.18", "Afghanistan", "Zabul", 3, 3, "Three local soldiers are blown to bits in a Shahid suicide attack."], ["2009.07.18", "Iraq", "Fallujah", 1, 13, "A child dies from shrapnel injuries suffered from a bomb attack on a soccer game the day before."], ["2009.07.18", "Iraq", "Garma", 4, 8, "Four Iraqis are taken out by a Jihadi car bomb."], ["2009.07.18", "Pakistan", "Swat", 1, 0, "The Taliban behead a government employee in his home."], ["2009.07.19", "Afghanistan", "Kunduz", 1, 0, "A politician is murdered by Taliban gunmen."], ["2009.07.19", "Afghanistan", "Torkham", 2, 1, "A suicide bomber takes out two Afghanis at a police post."], ["2009.07.19", "India", "Doda", 1, 0, "Hizb-ul-Mujahideen militants gun down a young civilian."], ["2009.07.19", "Thailand", "Narathiwat", 1, 0, "A shopkeeper is murdered when Islamic radicals fire into his store."], ["2009.07.19", "Thailand", "Yala", 1, 0, "Mujahideen shoot a plantation worker to death by the side of the road."], ["2009.07.19", "Yemen", "Sanaa", 10, 0, "Ten people are killed when Sunnis and Shias clash over control of a local mosque."], ["2009.07.20", "Germany", "Munich", 1, 0, "A Muslim man stabs his ex-wife to death 'in the name of the Qur'an' for being in a relationship."], ["2009.07.20", "Iraq", "Mosul", 2, 1, "A young girl is among two civilians killed by Islamic gunmen."], ["2009.07.20", "Iraq", "Peshawar", 4, 0, "Four local cops are gunned down in a brutal ambush by Lashkar-e-Islam."], ["2009.07.20", "Iraq", "Ramadi", 4, 9, "Jihadis kill four Iraqis with a car bomb."], ["2009.07.20", "Pakistan", "Lahore", 2, 0, "A young couple is murdered by the woman's family for marrying against their will."], ["2009.07.20", "Somalia", "Mahadday Weyne", 1, 0, "A father of two is shot to death by Muslims for leaving Islam and becoming a Christian."], ["2009.07.20", "Somalia", "Mogadishu", 2, 7, "Two civilians are killed during an ambush by Islamists."], ["2009.07.20", "Thailand", "Pattani", 1, 0, "A Buddhist man is shot to death by passing Muslims on a motorcycle."], ["2009.07.20", "Turkey", "Istanbul", 1, 0, "A Christian is stabbed shortly after leaving a church by a Muslim who said he just 'wanted to kill a Christian.'"], ["2009.07.21", "Afghanistan", "Paktia", 3, 4, "Women and children are among the casualties when suicide bombers dressed as women stage an attack."], ["2009.07.21", "Dagestan", "Khasavyurt", 1, 0, "A man is shot to death by Muslim gunmen while sitting in a cafe."], ["2009.07.21", "India", "Shopian", 1, 3, "Lashkar-e-Toiba militants throw a grenade a group of police, killing one."], ["2009.07.21", "Iraq", "Baghdad", 18, 113, "Sunni extremists murder eighteen Iraqis in coordinated bombings around four cities.  The dead include women and children."], ["2009.07.21", "Pal. Auth.", "Gaza", 0, 50, "About fifty Fatah supporters at a wedding are injured when Hamas operatives detonate a bomb during the reception."], ["2009.07.21", "Philippines", "Cotabato", 1, 1, "An elderly woman farmer is shot to death in her field by Moro Islamists."], ["2009.07.21", "Yemen", "Saada", 1, 2, "Shiite rebels shoot a security personnel member to death."], ["2009.07.22", "Afghanistan", "Kunduz", 11, 0, "Four children are among eleven killed in a Taliban rocket attack."], ["2009.07.22", "Iraq", "Diyala", 5, 35, "Five Shia pilgrims are killed when Sunni gunmen open fire on their bus at close range."], ["2009.07.22", "Thailand", "Yala", 1, 0, "Islamists gun down a 41-year-old rubber farmer by the side of the road."], ["2009.07.23", "Eritrea", "Mitire", 1, 0, "A 43-year-old man dies from torture after refusing to renounce his Christian faith."], ["2009.07.23", "India", "Shopian", 2, 0, "Islamic terrorists burst into a home and murder a 3-year-old boy and his father."], ["2009.07.23", "Iraq", "Kirkuk", 2, 5, "Jihadis end the lives of two civilians with separate roadside bombs."], ["2009.07.23", "Pakistan", "Lahore", 1, 0, "A 21-year-old girl is burned to death by her in-laws in an honor killing."], ["2009.07.23", "Pakistan", "Quetta", 1, 0, "A school principal is gunned down in a targeted sectarian attack."], ["2009.07.23", "Pal. Auth.", "Jabalya", 1, 0, "A man tortures and kills his daughter after finding her talking on a cell phone and suspected an illicit relation."], ["2009.07.23", "Philippines", "Basilan", 3, 0, "A 1-year-old child is among three people gunned down in an Abu Sayyaf drive-by shooting."], ["2009.07.23", "Somalia", "Mogadishu", 15, 55, "Fifteen civilians are killed during a late evening attack by al-Shabaab and Hizb al-Islam terrorists."], ["2009.07.23", "Thailand", "Pattani", 1, 0, "A villager is shot to death outside a store by drive-by Muslim radicals."], ["2009.07.23", "Yemen", "Saada", 7, 3, "Shiite extremists ambush and kill seven local soldiers."], ["2009.07.24", "Afghanistan", "Khost", 0, 14, "Seven remarkably inefficient suicide bombers manage to kill no one but themselves."], ["2009.07.24", "Iraq", "Tal Afar", 4, 0, "Four Iraqis are kidnapped and murdered execution-style by suspected al-Qaeda."], ["2009.07.24", "Pakistan", "Quetta", 1, 0, "A university professor is shot to death in a sectarian attack."], ["2009.07.25", "Bangladesh", "Charsindhu", 0, 5, "A Muslim mob attacks Hindu homes and ransacks a temple.  Five people are injured."], ["2009.07.25", "Iraq", "Fallujah", 5, 21, "Five civilians are taken out by a Mujahideen car bombing."], ["2009.07.25", "Pakistan", "North Waziristan", 1, 0, "A civilian is abducted and beheaded by Sunni radicals."], ["2009.07.26", "Afghanistan", "Helmand", 3, 2, "A Taliban roadside bomb leave three security guards dead."], ["2009.07.26", "Afghanistan", "Nangarhar", 2, 0, "Two road workers are murdered by Taliban bombers."], ["2009.07.26", "Chechnya", "Grozny", 6, 10, "A suicide bomber detonates as he is stopped from entering a concert hall.  At least six innocents die in the blast."], ["2009.07.26", "Iraq", "Baghdad", 4, 0, "Four people are gunned down at a checkpoint by Jihadis."], ["2009.07.26", "Iraq", "Khaldiyah", 5, 12, "A suicide bomber kills five people trying to stop him from entering a funeral."], ["2009.07.26", "Iraq", "Ninewa", 1, 0, "A Christian worker is murdered at a Pepsi plant by Islamic gunmen."], ["2009.07.26", "Pakistan", "North Waziristan", 3, 0, "Three civilians are kidnapped and beheaded by religious extremists."], ["2009.07.27", "Nigeria", "Bauchi", 5, 12, "At least three policemen and two civilians are killed during a series of attacks by Boko Haram Islamists."], ["2009.07.27", "Nigeria", "Maiduguri", 1, 0, "A Christian pastor and father of seven is hacked to death by radical Muslims, who then burn down his church."], ["2009.07.27", "Pakistan", "Faisalabad", 0, 1, "A Hindu human rights lawyer is shot twice by Islamic fundamentalists outside his home."], ["2009.07.27", "Pakistan", "Mansehra", 1, 2, "Fundamentalists bomb a shop selling music and DVDs, killing a patron."], ["2009.07.27", "Somalia", "Merca", 4, 0, "Four Christian orphanage workers are beheaded by Islamists after declining the offer to return to Islam."], ["2009.07.27", "Somalia", "Mogadishu", 6, 20, "Six civilians are killed as a result of an attack on government troops by al-Shabaab militants at a market."], ["2009.07.27", "Thailand", "Pattani", 1, 0, "A painter is killed in a Mujahideen drive-by shooting."], ["2009.07.27", "Thailand", "Pattani", 1, 0, "A suspected Islamist guns down a man at a wedding."], ["2009.07.28", "Afghanistan", "Helmand", 8, 4, "Eight security guards are killed when their vehicles are hit by Taliban remote-controlled bombs."], ["2009.07.28", "Afghanistan", "Kabul", 5, 9, "Five Afghan civilians are murdered in four separate Mujahid attacks around the country."], ["2009.07.28", "Iraq", "Baghdad", 8, 15, "Jihadis successfully kill eight Iraqis with a bomb hidden on a motorcycle."], ["2009.07.28", "Nigeria", "Maiduguri", 1, 0, "Islamists pull a Christian man from his home and slit his throat."], ["2009.07.28", "Nigeria", "Maiduguri", 3, 0, "Three Christian pastors are kidnapped by Boko Harem Islamists and then beheaded after they refuse to accept Islam."], ["2009.07.28", "Pakistan", "Mingora", 1, 0, "A police officer is kidnapped and beheaded by Islamic radicals."], ["2009.07.28", "Pakistan", "Miranshah", 2, 5, "A suicide car bomber rams a police checkpoint, killing two local cops."], ["2009.07.28", "Philippines", "Basilan", 1, 0, "Moro Islamists fire on a passing vehicle, killing one occupant."], ["2009.07.28", "Thailand", "Pattani", 2, 0, "A Buddhist couple is brutally shot to death by Muslim radicals."], ["2009.07.29", "Afghanistan", "Kandahar", 4, 0, "Religious extremists kill two civilians and two local cops in three attacks."], ["2009.07.29", "Algeria", "Tipaza", 17, 23, "Armed fundamentalists hit a security convoy with roadside bombs and automatic weapons fire, killing at least seventeen members."], ["2009.07.29", "Pakistan", "Dera Ismail Khan", 1, 4, "A Sunni sectarian attack on Shias leaves at least one dead."], ["2009.07.29", "Pakistan", "Mohmand", 2, 6, "A woman is among two vehicle passengers gunned down by Islamists."], ["2009.07.29", "Thailand", "Yala", 1, 0, "Mujahideen gun down a 43-year-old man riding a motorcycle."], ["2009.07.30", "Iraq", "Baqubah", 7, 10, "Seven Iraqis are killed in twin blasts at Sunni political party building."], ["2009.07.30", "Iraq", "Qaim", 5, 39, "Five civilians are blown to bits by a suicide car bomber."], ["2009.07.30", "Pakistan", "Gojra City", 7, 19, "Seven people, including women and children (the youngest of whom was 4), are burned alive when a Muslim mob rampages through a Christian community over rumors of a Qur'an desecration."], ["2009.07.30", "Pakistan", "Swat", 1, 2, "Islamic terrorists storm the home of a government official and shoot his brother to death."], ["2009.07.30", "Yemen", "Sanaa", 3, 3, "Three local troops are killed in an al-Qaeda ambush."], ["2009.07.31", "Afghanistan", "Farah", 4, 3, "Talibanis ambush a vehicle carrying voting equipment, killing four occupants."], ["2009.07.31", "Iraq", "Baghdad", 33, 136, "Jihadis place bombs in five rival mosques, sending at least thirty worshippers to Allah and leaving over one-hundred more in agony."], ["2009.07.31", "Iraq", "Kirkuk", 2, 15, "Terrorists detonate a car bomb at a marketplace, killing two civilians."], ["2009.07.31", "Iraq", "Mosul", 2, 2, "A married couple die from shrapnel injuries when Mujahideen toss a grenade into their home."], ["2009.07.31", "Pakistan", "Koral", 3, 0, "A man guns down his sister and two teenage nieces after learning that one of them made a road trip with a stranger."], ["2009.08.01", "Afghanistan", "Baghlan", 3, 0, "Three police are killed in a roadside attack."], ["2009.08.01", "Afghanistan", "Ghazni", 1, 2, "A car carrying campaign workers is ambushed by Talibanis."], ["2009.08.01", "India", "Srinagar", 2, 0, "Jaish-e-Mohammed militants shoot two police officers to death in separate attacks."], ["2009.08.01", "Iraq", "Mosul", 1, 0, "Sunni terrorists gun down a local traffic cop."], ["2009.08.01", "Pakistan", "Gojra", 8, 18, "Eight Christians are burned alive by a mob angered over a rumor of Qur'an desecration."], ["2009.08.02", "Chechnya", "Sharoi", 5, 4, "Jihad Warriors ambush two vehicles carrying police, blasting and shooting five officers to death."], ["2009.08.02", "Dagestan", "Makhachkala", 4, 0, "Islamic militants gun down three emergency workers (in Ingushetia ) and a police officer."], ["2009.08.02", "India", "Shopian", 1, 0, "Mujahideen gunmen murder a man while he is visiting an orchard."], ["2009.08.02", "Iraq", "Haditha", 7, 34, "Car bombers successfully take down seven Iraqis at an outdoor market."], ["2009.08.02", "Pakistan", "Mashogagar", 1, 0, "Muslim militants kidnap a man, murder him in captivity, and then plant explosives on his body to kill others."], ["2009.08.02", "Pakistan", "Paharipura", 2, 0, "Two police are gunned down in a terrorist ambush."], ["2009.08.02", "Thailand", "Pattani", 1, 0, "A Buddhist man is gunned down in a Muslim drive-by."], ["2009.08.02", "Thailand", "Pattani", 1, 0, "Islamists shoot a 29-year-old man to death as he is riding home from work."], ["2009.08.03", "Afghanistan", "Ghazni", 1, 4, "A civilian is killed by a Taliban bomb."], ["2009.08.03", "Afghanistan", "Herat", 12, 26, "A woman and a 12-year-old girl are among a dozen Afghanis blown apart by Sunni bombers along a city street."], ["2009.08.03", "Algeria", "Kabylie", 4, 0, "Four civilians are cut to pieces by automatic weapons fire from Islamic fundamentalists."], ["2009.08.03", "Iraq", "Fallujah", 5, 8, "Car bombers take out five Iraqis."], ["2009.08.03", "Iraq", "Hilla", 6, 27, "Islamic terrorists bomb two passenger buses, killing six innocents."], ["2009.08.03", "Iraq", "Iskandariya", 1, 3, "A Shiite pilgrim is murdered by suspected Sunnis."], ["2009.08.03", "Pakistan", "Gorja", 1, 0, "A Christian man succumbs to injuries suffered by a Muslim mob attack."], ["2009.08.03", "Pakistan", "Miranshah", 9, 12, "Nine people are killed in a Jihad rocket attack."], ["2009.08.03", "Somalia", "Medina", 1, 5, "In Islamist tosses a grenade at a group of soldiers in a commercial district, killing one."], ["2009.08.04", "Afghanistan", "Zabul", 2, 17, "A Shahid suicide bomber manages to send two Afghanis to Allah."], ["2009.08.04", "Iraq", "Baghdad", 1, 0, "al-Qaeda brutally beheads a 'police informant' and releases the video."], ["2009.08.04", "Iraq", "Mussayab", 1, 0, "Mujahideen shoot a policeman's brother to death."], ["2009.08.04", "Pakistan", "Chashma", 3, 3, "Three civilians are killed when the Taliban fire a missile into a home."], ["2009.08.04", "Pakistan", "Datakhel", 2, 3, "Two women die from shrapnel injuries following a rocket attack by Islamic hardliners."], ["2009.08.04", "Pakistan", "Lahore", 2, 0, "A factory owner and guard are beaten to death by a mob after an employee accuses one of desecrating the Qur'an."], ["2009.08.04", "Thailand", "Narathiwat", 1, 0, "A woman is murdered by Religion of Peace gunmen."], ["2009.08.04", "Thailand", "Yala", 1, 0, "Islamists gun down a 57-year-old man as he returns home from work."], ["2009.08.05", "Afghanistan", "Nangahar", 6, 0, "Six civilians are taken down by Taliban bombers along a highway."], ["2009.08.05", "Afghanistan", "Nangarhar", 5, 0, "Five civilians are blown to bits by Taliban bombers."], ["2009.08.05", "Iraq", "Baghdad", 5, 8, "Five local police are taken out by a Jihadi roadside bomb."], ["2009.08.05", "Iraq", "Jalawla", 1, 0, "A young shepherd is murdered by Islamic bombers."], ["2009.08.05", "Iraq", "Ramadi", 1, 4, "A woman is killed in a Jihad car bomb blast."], ["2009.08.05", "Thailand", "Narathiwat", 2, 0, "Two young men are shot to death by Mujahideen."], ["2009.08.05", "Thailand", "Pattani", 1, 0, "A middle-aged Buddhist man is murdered by Islamic gunmen as he returns home from market."], ["2009.08.06", "Afghanistan", "Helmand", 10, 5, "Two women and two children are among ten Afghanis murdered by two Fedayeen bombers."], ["2009.08.06", "Iran", "Tabriz", 7, 0, "Seven lawyers representing pro-reformists are murdered by the Revolutionary Guard while in detention."], ["2009.08.06", "Iraq", "Baghdad", 1, 4, "A Shiite pilgrim is killed by Sunni bombers."], ["2009.08.06", "Iraq", "Khanaqin", 2, 0, "A man and woman are shot to death inside a vehicle by suspected hardliners."], ["2009.08.06", "Iraq", "Kirkuk", 5, 32, "Jihadi bombers take out five Iraqis at a market."], ["2009.08.06", "Iraq", "Mosul", 1, 0, "A woman is gunned down by Muslim terrorists."], ["2009.08.06", "Pakistan", "Bajaur", 1, 0, "Taliban assassins take down a local soldier standing guard."], ["2009.08.06", "Pakistan", "Dera Ismail Khan", 2, 0, "Two shopkeepers are murdered in a sectarian shooting."], ["2009.08.06", "Pakistan", "Multan", 1, 0, "A member of the minority Ahmadiyya is assassinated in his own home by Religion of Peace gunmen."], ["2009.08.06", "Pakistan", "Yasrab Colony", 2, 0, "A pregnant woman and her lover are killed by being thrown into a well alive by their family."], ["2009.08.07", "Afghanistan", "Ghazni", 1, 2, "A security guard is murdered by Taliban bombers."], ["2009.08.07", "Afghanistan", "Kandahar", 6, 4, "Terrorists use two roadside bombs to kill six local security personnel."], ["2009.08.07", "Chechnya", "Grozny", 2, 1, "A Mujahideen bombing at a restaurant and another along a highway leave two dead."], ["2009.08.07", "Iraq", "Baghdad", 3, 13, "Sunni bombers take out three more Sunni pilgrims."], ["2009.08.07", "Iraq", "Baghdad", 6, 24, "A half-dozen people are killed in an attack on a marketplace."], ["2009.08.07", "Iraq", "Mosul", 38, 95, "At least thirty-eight people are blown to bits when Sunni bombers blast a Shia mosque."], ["2009.08.07", "Pakistan", "Khyber", 1, 0, "A civilian is killed in a battle between rival Islamists."], ["2009.08.07", "Pakistan", "Lahore", 3, 0, "Three people are gunned down by a relative over a suspected sexual affair."], ["2009.08.07", "Pakistan", "Tank", 19, 18, "Nineteen people are killed when Taliban hardliners attack a peace committee."], ["2009.08.08", "Afghanistan", "Helmand", 5, 0, "Five civilians are incinerated by Taliban bombers."], ["2009.08.08", "Iraq", "Mosul", 1, 0, "Sunni gunmen murder a cop at an intersection."], ["2009.08.08", "Somalia", "Mogadishu", 2, 4, "al-Shabaab militants kill two local police with a roadside bomb."], ["2009.08.08", "Thailand", "Pattani", 1, 0, "A man is gunned down outside his home in a Muslim drive-by attack."], ["2009.08.08", "Yemen", "Baqim", 8, 0, "Eight people are killed when Sunnis and Shias work out their differences in the usual way."], ["2009.08.09", "Iraq", "Baghdad", 2, 0, "Two Kurds are gunned down by Sunni terrorists."], ["2009.08.09", "Pakistan", "Bannu", 3, 0, "Two farmers are among three people taken down in an ambush by Islamic militants."], ["2009.08.09", "Pakistan", "Mohmand", 5, 0, "The Taliban attack a peace committee, killing five people."], ["2009.08.09", "Pakistan", "North Waziristan", 2, 3, "Two local soldiers are blasted to bits by Taliban bombers while traveling in a vehicle."], ["2009.08.09", "Somalia", "Mogadishu", 2, 0, "Two civilians are taken out in a bombing by Muslim militants."], ["2009.08.09", "Thailand", "Yala", 1, 0, "Mujahideen shoot a village chief to death as he is riding a motorcycle with his wife."], ["2009.08.10", "Afghanistan", "Logar", 5, 26, "Five innocents are killed when Islamic fundamentalists in vests assault a government building."], ["2009.08.10", "Dagestan", "Derbent", 1, 1, "Islamic extremists kill a border guard with a bomb."], ["2009.08.10", "Iraq", "Baghdad", 5, 35, "Three innocents are killed in three Jihad bombing attacks."], ["2009.08.10", "Iraq", "Baghdad", 7, 42, "Muslim bombers kill seven day laborers as they are enjoying their morning tea."], ["2009.08.10", "Iraq", "Baghdad", 10, 35, "Ten construction workers are murdered by Sunni bombers."], ["2009.08.10", "Iraq", "Khazna", 42, 190, "al-Qaeda detonate massive truck bombs 500 feet apart in a residential neighborhood of religious minorities, leveling homes and leaving over forty dead."], ["2009.08.10", "Pakistan", "North Waziristan", 1, 3, "Gul Bahadur terrorists kill a soldier as he is fetching water."], ["2009.08.11", "Afghanistan", "Kabul", 5, 4, "The Taliban murder five local police with a roadside bomb."], ["2009.08.11", "Iraq", "Baghdad", 8, 30, "Islamists blast eight Iraqis to death with bombs at a cafe and an apartment complex."], ["2009.08.11", "Jordan", "Nasser", 1, 0, "A 16-year-old girl is shot eight times in various parts of her body by an uncle because she had been raped."], ["2009.08.11", "Pakistan", "Mohmand", 1, 0, "The Taliban kidnap and murder a tribal elder."], ["2009.08.11", "Pakistan", "Peshawar", 2, 3, "Sunni militants fire a rocket into a residential area, killing two people."], ["2009.08.12", "Afghanistan", "Gereshk", 14, 0, "Taliban bombs kill fourteen civilians, including three children."], ["2009.08.12", "Afghanistan", "Kunduz", 3, 0, "Mujahideen storm a police post and shoot three people to death."], ["2009.08.12", "Afghanistan", "Zabul", 2, 6, "Two civilians are killed by Islamic bombers while traveling in a vehicle."], ["2009.08.12", "India", "Baramulla", 1, 9, "A civilian is killed when Islamists hurl a grenade into a crowded area."], ["2009.08.12", "Iraq", "Mosul", 4, 5, "An elderly man and communications worker are among four Iraqis killed in terror attacks."], ["2009.08.12", "Iraq", "Ramadi", 2, 7, "A Fedayeen suicide bomber takes out two Iraqis."], ["2009.08.12", "Jordan", "Madaba", 1, 0, "A pregnant woman is shot four times in the head by her brother for marrying by choice."], ["2009.08.12", "Pakistan", "Orakzai", 1, 0, "A schoolteacher is gunned down by Muslim terrorists."], ["2009.08.12", "Thailand", "Pattani", 1, 4, "Mujahideen gunmen spray a tea shop with bullets from a moving truck, killing one person inside."], ["2009.08.13", "Afghanistan", "Helmand", 3, 2, "Three British soldiers providing security for a meeting of tribal elders are killed in a heinous double bomb ambush."], ["2009.08.13", "Dagestan", "Buinaksk", 4, 5, "Islamic militants attack a police post, killing four officers."], ["2009.08.13", "Dagestan", "Buinaksk", 7, 0, "Seven women are murdered at a sauna by Muslim terrorists."], ["2009.08.13", "Iraq", "Baghdad", 2, 13, "A bicycle bomb kills two civilians."], ["2009.08.13", "Iraq", "Mosul", 21, 35, "Two Fedayeen in bomb vests attack a cafe, leaving over twenty innocents dead and another thirty in agony."], ["2009.08.13", "Pakistan", "Bajour", 2, 0, "Two men are kidnapped by the Taliban and then raked with machine-gun fire."], ["2009.08.13", "Pakistan", "Wana", 4, 2, "al-Qaeda linked militants take out four civilians with a motorcycle bomb."], ["2009.08.13", "Somalia", "Mogadishu", 2, 4, "An elderly man and a 10-year-old girl are among the casualties when Islamists mortar a residential neighborhood."], ["2009.08.13", "Thailand", "Yala", 2, 4, "Two patrons are murdered by Islamic gunmen while sitting in a tea shop."], ["2009.08.14", "Dagestan", "Makhachkala", 2, 0, "Two traffic cops are brutally gunned down by Islamic rebels."], ["2009.08.15", "Afghanistan", "Kabul", 4, 0, "The Taliban manage to kill four civilians with a remote-controlled bomb."], ["2009.08.15", "Afghanistan", "Kabul", 7, 91, "Seven civilians are blown to bits by a Fedayeen suicide car bomber."], ["2009.08.15", "Algeria", "Tizi Ouzou", 1, 2, "Islamic fundamentalists kill a guard at a beach with a bomb and small arms fire."], ["2009.08.15", "Dagestan", "Makhachkala", 2, 0, "Two police are killed in separate sniper attacks by Muslim militants."], ["2009.08.15", "Egypt", "Cairo", 1, 0, "A 22-year-old Christian conscript is murdered in his barracks after suffering horrible abuse over his religion."], ["2009.08.15", "Iraq", "Mosul", 6, 9, "Five local cops and a taxi driver are taken down by Islamic terrorists."], ["2009.08.15", "Pakistan", "Khawaza Kehla", 5, 4, "A suicide car bomber rams into a checkpoint, killing five Pakistani soldiers."], ["2009.08.15", "Somalia", "Mogadushu", 5, 20, "Islamic militia kill five people in their homes with a mortar barrage."], ["2009.08.16", "India", "Doda", 1, 0, "A 26-year-old man is abducted and shot to death by Mujahideen."], ["2009.08.16", "Iraq", "Baghdad", 8, 21, "Eight Iraqis at a market are murdered by Jihad bombers."], ["2009.08.16", "Iraq", "Fallujah", 4, 5, "al-Qaeda gunmen attack a home, killing four residents."], ["2009.08.16", "Pakistan", "Swat", 1, 3, "At least one Pakistani is killed by a Shahid suicide bomber."], ["2009.08.16", "Pakistan", "Swat", 21, 0, "The bodies of twenty-one victims of Taliban executions are discovered in three locations."], ["2009.08.16", "Thailand", "Narathiwat", 2, 0, "Two men are shot to death by Mujahideen."], ["2009.08.16", "Thailand", "Yala", 1, 0, "Muslim extremists slit the throat of a Buddhist rubber plantation worker."], ["2009.08.17", "Afghanistan", "Kabul", 1, 0, "An American civilian is killed during a Taliban attack in the eastern part of the country."], ["2009.08.17", "Ingushetia", "Nazran", 25, 160, "A suicide bomber rams an explosives-laden car into a government building, causing at least twenty other deaths."], ["2009.08.17", "Iraq", "Mussayab", 2, 1, "Suspected al-Qaeda gun down two Iraqis at a checkpoint."], ["2009.08.17", "Pakistan", "Peshawar", 7, 9, "Three children and two women are among seven innocents blown to bits by a Fedayeen car bomber at a gas station."], ["2009.08.17", "Pakistan", "Sindh", 1, 6, "A local leader is killed in a sectarian attack."], ["2009.08.18", "Afghanistan", "Badakshan", 4, 0, "Taliban terrorists murder all four workers transporting election materials."], ["2009.08.18", "Afghanistan", "Kabul", 8, 53, "Holy Warriors murder eight in a brutal suicide car bomb attack along a city street."], ["2009.08.18", "Afghanistan", "Uruzgan", 5, 0, "A Fedayeen suicide bomber takes out five Afghanis."], ["2009.08.18", "Iraq", "Baghdad", 2, 15, "Mujahideen plant a bomb near a school that leaves two people dead."], ["2009.08.18", "Iraq", "Mosul", 2, 0, "Two civilians are killed in separate Jihad bombings."], ["2009.08.18", "Pakistan", "Miranshah", 7, 4, "A suicidal Sunni rams a group of local soldiers with an explosives-laden car, killing four, along with three civilian passersby."], ["2009.08.18", "Pakistan", "Peshawar", 1, 0, "A civilian is kidnapped and beheaded by Religion of Peace militants."], ["2009.08.18", "Somalia", "Bulahawa", 1, 0, "A 41-year-old Christian is hunted down and shot to death for leaving Islam."], ["2009.08.19", "Afghanistan", "Kandahar", 4, 0, "Two government officials are taken down by a Taliban landmine.  Another roadside attack elsewhere leaves two police dead."], ["2009.08.19", "Afghanistan", "Paktika", 4, 0, "Four civilians, including two women, are blown to bits by a Mujahideen roadside bomb."], ["2009.08.19", "Afghanistan", "Spin Boldak", 4, 0, "Religious extremists plant a bomb that leaves four Afghans dead."], ["2009.08.19", "Belgium", "Jette", 0, 1, "A man who says he was sent by Allah to punish women who wear makeup, walks into a beauty salon and attacks an employee while quoting the Qur'an."], ["2009.08.19", "Iraq", "Baghdad", 95, 563, "Islamic bombers stage several coordinated blasts and manage to kill nearly one-hundred Iraqis and injure about six-hundred others."], ["2009.08.19", "Iraq", "Kirkuk", 0, 0, "Islamic militants kidnap and murder a Christian doctor."], ["2009.08.19", "Pakistan", "Bajaur", 3, 0, "Three people are shot to death by suspected Taliban."], ["2009.08.19", "Philippines", "Guindulungan", 1, 1, "Muslim terrorists storm a village and kill a 41-year-old resident."], ["2009.08.19", "Somalia", "Beledweyn", 3, 0, "Two brothers are among three civilians gunned down by suspected Hizbul Islam."], ["2009.08.19", "Thailand", "Yala", 1, 0, "A villager is shot five times by Islamists while walking to a market."], ["2009.08.20", "Afghanistan", "Kandahar", 1, 0, "The Taliban kill a man with a rocket attack."], ["2009.08.20", "Iraq", "Babel", 6, 80, "Six civilians are killed in two Jihad bombings, one at a market."], ["2009.08.20", "Philippines", "Cotabato", 1, 20, "Islamic terrorists toss a grenade at a wedding party, killing at least one member."], ["2009.08.20", "Somalia", "Ahlu Sunna", 33, 22, "Thirty-three people are killed when Ahlu Sunna fundamentalists lay siege to a town."], ["2009.08.20", "Somalia", "Bulahawa", 12, 8, "A dozen people lose their lives to al-Shabaab violence."], ["2009.08.20", "Thailand", "Pattani", 1, 0, "A Buddhist villager is murdered by Muslim gunmen while working on his motorcycle."], ["2009.08.21", "Afghanistan", "Balkh", 1, 0, "An election official is murdered by Sunni radicals."], ["2009.08.21", "Afghanistan", "Ghazni", 2, 0, "Islamic extremists attack a polling station, killing two defenders."], ["2009.08.21", "Afghanistan", "Helmand", 6, 0, "Six civilians are blown to bits by a Taliban landmine."], ["2009.08.21", "Chechnya", "Grozny", 5, 3, "Separate Shahid suicide attacks leave five people dead."], ["2009.08.21", "Iraq", "Baghdad", 2, 20, "Two people are murdered at a market after terrorists plant a bomb in a vegetable cart."], ["2009.08.21", "Iraq", "Mosul", 4, 1, "Sunni insurgents blow up four local soldiers with a car bomb along a city street."], ["2009.08.21", "Pakistan", "Multan", 1, 2, "A girl dies from injuries after three sisters are tortured by the their brothers for leaving the house without permission."], ["2009.08.21", "Pakistan", "Peshawar", 1, 1, "Islamic extremists fire on a police patrol, killing one officer."], ["2009.08.21", "Somalia", "Mogadishu", 22, 40, "Nearly two-dozen civilians lose their lives to an assault by Islamic terrorists."], ["2009.08.22", "Afghanistan", "Baghlan", 6, 0, "Taliban bombers send six Afghan police to Allah."], ["2009.08.22", "Afghanistan", "Kandahar", 0, 2, "Taliban fundamentalists cut the fingers off of two women for voting in the election."], ["2009.08.22", "Iraq", "Mosul", 1, 0, "Jihadis kidnap a civilian, then slit his throat."], ["2009.08.22", "Iraq", "Mosul", 2, 0, "Fundamentalists murder a liquor store owner and one other person."], ["2009.08.22", "Iraq", "Mosul", 2, 0, "Two girls are shot to death by suspected Sunni terrorists."], ["2009.08.22", "Iraq", "Mosul", 3, 0, "Mujahideen bombers kill a local mayor and two young children."], ["2009.08.22", "Pakistan", "Peshawar", 2, 3, "A suicide bomber takes out two innocents near a hospital."], ["2009.08.22", "Thailand", "Narathiwat", 1, 2, "Mujahideen fire into a pickup truck, killing a man and seriously injuring his wife and son."], ["2009.08.22", "Thailand", "Yala", 3, 4, "Muslim militants stop a vehicle with a bomb, then machine-gun three occupants to death."], ["2009.08.22", "Thailand", "Yala", 3, 4, "Three public servants are blasted to death by Muslim terrorists."], ["2009.08.23", "Iraq", "Abu Khamis", 2, 0, "A man and his son are murdered by al-Qaeda bombers."], ["2009.08.23", "Pakistan", "Bajaur", 1, 2, "A guard is killed when sectarian Jihadis fire into a rival mosque."], ["2009.08.23", "Pakistan", "Momin", 3, 15, "A Shahid suicide bomber targets a funeral, killing three people, including two women."], ["2009.08.23", "Pakistan", "Sarjani", 3, 0, "A man guns down his wife and two daughters on suspicion of 'loose character.'"], ["2009.08.23", "Pakistan", "South Waziristan", 4, 0, "Islamic radicals attack a vehicle carrying a tribal elder, leaving him and three family members dead."], ["2009.08.23", "Somalia", "Mogadishu", 6, 12, "Six civilians are killed by gunfire as Hizb Al-Islam vows to step up Ramadan violence."], ["2009.08.23", "Thailand", "Narathiwat", 2, 3, "Two local soldiers are killed in a brutal ambush by Muslim militants."], ["2009.08.24", "Afghanistan", "Helmand", 2, 0, "Two 25-year-old Estonian soldiers are killed by Islamic militants while patrolling the border."], ["2009.08.24", "Algeria", "El Guemaichia", 3, 2, "Two emergency workers are killed when Islamic fundamentalists hide a bomb under the body of a murdered civilian."], ["2009.08.24", "Iraq", "Kut", 10, 19, "Four women and two children are among ten Iraqis blown to bits by bombs placed on buses."], ["2009.08.24", "Pakistan", "Khyber Pass", 1, 1, "Islamic militants murder a journalist riding on a bus."], ["2009.08.25", "Afghanistan", "Kandahar", 41, 66, "Religious extremists detonate several car bombs outside a construction company, incinerating at least forty souls."], ["2009.08.25", "Afghanistan", "Paktika", 4, 0, "Four civilian construction workers are blown to bits by Taliban bombers."], ["2009.08.25", "Chechnya", "Mesker-Yurt", 4, 3, "A suicide bomber attacks a car wash, killing four people."], ["2009.08.25", "Iraq", "Abu Ghraib", 2, 0, "A professor in his home is among two people murdered by Mujahideen."], ["2009.08.25", "Thailand", "Narathiwat", 0, 42, "Islamists injure forty-two people with a powerful car bomb outside a restaurant."], ["2009.08.26", "Afghanistan", "Baghlan", 1, 2, "A Pakistani engineer is shot to death by suspected extremists."], ["2009.08.26", "Afghanistan", "Kunduz", 1, 0, "A government official is taken out in a Taliban roadside bombing."], ["2009.08.26", "Afghanistan", "Paktika", 2, 1, "Religious extremists blow two civilians to bits with a roadside bomb."], ["2009.08.26", "Algeria", "Kabylie", 1, 0, "Islamic fundamentalists murder a 37-year-old civilian."], ["2009.08.26", "Pakistan", "Wana", 2, 0, "Two local soldiers are shot to death by Muslim radicals."], ["2009.08.26", "Thailand", "Yala", 1, 0, "A female plantation worker is blown to bits by Mujahideen bombers."], ["2009.08.26", "Thailand", "Yala", 2, 0, "Two men are gunned down in separate Muslim drive-by attacks."], ["2009.08.27", "Afghanistan", "Khost", 4, 0, "Four local cops are taken out with a Taliban landmine."], ["2009.08.27", "Iraq", "Mosul", 5, 10, "Five Iraqis are murdered in various Mujahideen shooting and bombing attacks."], ["2009.08.27", "Pakistan", "Tokham", 22, 27, "A teenage suicide bomber pretending to beg for food blows up twenty-two Pakistani soldiers gathered to break their Ramadan fast."], ["2009.08.27", "Thailand", "Yala", 1, 0, "A 70-year-old man is gunned down outside of his home by Muslim militants."], ["2009.08.28", "Iraq", "Mosul", 5, 6, "A young girl shot to death is among five Iraqis murdered in at least two Jihad attacks."], ["2009.08.28", "Pakistan", "Quetta", 6, 7, "Six Christians are gunned down after refusing a 'convert or die' offer from Islamists."], ["2009.08.28", "Thailand", "Pattani", 1, 17, "Islamists hurl a grenade at a group of villagers playing an outdoor game, killing a 62-year-old."], ["2009.08.29", "Afghanistan", "Zabul", 2, 21, "A Fedayeen bomber blows himself up in front of a bazaar, killing two civilian bystanders."], ["2009.08.29", "Algeria", "Algiers", 5, 3, "Five people are killed in two terrorist attacks by armed fundamentalists."], ["2009.08.29", "Iraq", "Hamad", 12, 15, "A Fedayeen truck bomber detonates near a police station, killing at least a dozen innocents."], ["2009.08.29", "Iraq", "Mosul", 1, 0, "A young girl is gunned down by Muslim terrorists."], ["2009.08.29", "Iraq", "Mosul", 6, 23, "Six Iraqis at a market are blown to bits by Jihadi bombers."], ["2009.08.29", "Pakistan", "Bannu", 2, 0, "Terrorists ram a police vehicle, then open up with automatic weapons, killing two officers."], ["2009.08.29", "Sudan", "Wernyol", 43, 62, "An Islamic-backed militia targets Christian villagers, hacking or shooting at least 43 to death including a senior church leader."], ["2009.08.29", "Yemen", "Sawad", 9, 16, "Shiite rebels kill nine local tribesmen in a mortar attack."], ["2009.08.30", "Iraq", "Baghdad", 2, 13, "Separate bombings, one a Shahid, leave two civilians dead."], ["2009.08.30", "Iraq", "Mosul", 1, 0, "A woman is shot to death by Mujahideen."], ["2009.08.30", "Pakistan", "Mingora", 16, 11, "Sixteen local cops are murdered by a Shahid suicide bomber."], ["2009.08.30", "Pakistan", "Swat", 3, 0, "Two political activists and a student are murdered by suspected hardliners."], ["2009.08.31", "India", "Srinagar", 2, 12, "Jamiat-Ul-Mujahideen terrorists gun down two guards outside a bank."], ["2009.08.31", "Iraq", "Khanaqin", 1, 12, "Jihadi bombers kill one civilian and leave a dozen more with injuries."], ["2009.09.01", "Afghanistan", "Border", 1, 0, "Video surfaces of the Taliban strapping explosives to a man accused of spying, then detonating him."], ["2009.09.01", "Afghanistan", "Zabul", 1, 3, "An Afghan civilian is taken down by a roadside bomb."], ["2009.09.01", "India", "Poonch", 1, 0, "Lashkar-e-Toiba terrorists shoot an Indian soldier to death during an infiltration attempt from Pakistan."], ["2009.09.01", "Iraq", "Mosul", 3, 1, "The head of a local charity is among three people gunned down by Sunni militants."], ["2009.09.01", "Pakistan", "Mohmand", 1, 0, "A tribal elder is murdered outside his home by Mujahid gunmen."], ["2009.09.01", "Somalia", "Mogadishu", 2, 10, "Two civilians die from gunshot injuries suffered during an attack by Islamic militants."], ["2009.09.02", "Afghanistan", "Jowzjan", 1, 6, "Taliban bombers kill one civilian by planting a remote-controlled bomb on a bicycle."], ["2009.09.02", "Afghanistan", "Kabul", 23, 50, "A Shahid blows himself up outside a mosque, taking twenty-three Afghans with him."], ["2009.09.02", "India", "Rajouri", 2, 0, "Two local cops are killed in a brutal Mujahideen ambush."], ["2009.09.02", "Iraq", "Mosul", 2, 1, "A 19-year-old girl in her home is among two people executed by Jihadis."], ["2009.09.02", "Iraq", "Tal Afar", 2, 0, "A married couple is brutally gunned down by Islamic terrorists."], ["2009.09.02", "Pakistan", "Bannu", 2, 0, "Two small girls, ages 8 and 13, die from shrapnel injuries when Islamists toss a grenade into their home."], ["2009.09.02", "Pakistan", "Hub", 3, 0, "Three people are shot dead in a targeted sectarian attack."], ["2009.09.02", "Thailand", "Narathiwat", 1, 1, "Terrorists gun down a man and injure his wife."], ["2009.09.02", "Thailand", "Narathiwat", 2, 0, "A man in a tea shop is among two people murdered by Muslim militants"], ["2009.09.02", "Thailand", "Pattani", 2, 0, "Muslim gunmen murder a man and his 13-year-old son."], ["2009.09.02", "Thailand", "Pattani", 5, 0, "Four men are shot to death in separate Muslim terror attacks. (A fifth is killed in Yala)"], ["2009.09.03", "Iraq", "Mussayab", 4, 24, "Sunnis bombers take down four Shiites, preparing to break Ramadan fast outside a mosque."], ["2009.09.03", "Thailand", "Pattani", 1, 27, "Twenty-seven people are injured, and an elderly man killed, when Muslims toss a bomb into a restaurant packed with Buddhists."], ["2009.09.04", "Afghanistan", "Nimroz", 3, 0, "Three security guards are murdered by a Shahid suicide bomber."], ["2009.09.04", "Ingushetia", "Dattykh", 3, 2, "Islamic militants murder three local police with a roadside bomb."], ["2009.09.04", "Pakistan", "Peshawar", 2, 0, "Two local police are gunned down point-blank by Islamic gunmen while sitting in their car."], ["2009.09.04", "Thailand", "Pattani", 2, 0, "A man and his 15-year-old son are slaughtered by Mujahid gunmen."], ["2009.09.04", "Thailand", "Yala", 1, 12, "A policeman is burned alive in his car by Jihadis outside a restaurant."], ["2009.09.05", "Afghanistan", "Kunar", 2, 3, "Two women are killed by a Taliban mortar attack on their neighborhood."], ["2009.09.05", "Iraq", "Kirkuk", 1, 0, "A 62-year-old man is abducted, bound and executed by Mujahideen."], ["2009.09.05", "Pakistan", "Swat", 2, 1, "Holy Warriors gun down two brothers outside their home."], ["2009.09.05", "Somalia", "Mogadishu", 6, 18, "Children are among the dead when al-Shabaab Islamists stage an attack in a residential area."], ["2009.09.05", "Thailand", "Yala", 1, 1, "A Buddhist rubber tapper is gunned down by Muslim radicals."], ["2009.09.06", "Chechnya", "Grozny", 1, 0, "Islamic militants shoot a young traffic policeman to death."], ["2009.09.06", "Iraq", "Baghdad", 1, 6, "A civilian is killed in a Jihad bombing."], ["2009.09.06", "Iraq", "Mosul", 2, 0, "A man and his son are murdered by Jihadi roadside bombers."], ["2009.09.06", "Iraq", "Mosul", 2, 0, "An elderly woman and her 3-year-old granddaughter are successfully taken out in their home by Mujahideen gunmen."], ["2009.09.06", "Pakistan", "Mirpurkhas", 1, 0, "A pregnant woman is shot to death by Sunnis for switching to the Shia sect."], ["2009.09.06", "Thailand", "Yala", 3, 0, "A 61-man is mowed down along with his son and daughter in an automatic weapons attack by Islamic separatists."], ["2009.09.07", "Afghanistan", "Kabul", 3, 2, "A family of three, including the parents and child, are wiped out by a Taliban rocket as they are sleeping in their home."], ["2009.09.07", "Afghanistan", "Uruzgan", 1, 20, "A child loses his life to shrapnel injuries from after an attack by Sunni terrorists."], ["2009.09.07", "Iraq", "Baqubah", 6, 9, "Six Shiites are blown to bits by a Sunni Shahid at a mosque."], ["2009.09.07", "Iraq", "Karbala", 4, 8, "Islamists blow up a passenger bus, killing four."], ["2009.09.07", "Iraq", "Kirkuk", 1, 0, "An oil company employee is killed in a drive-by Mujahideen shooting."], ["2009.09.07", "Iraq", "Ramadi", 9, 13, "A Shahid suicide bomber blows nine Iraqis straight to Allah."], ["2009.09.07", "Pakistan", "South Waziristan", 5, 0, "Taliban militants take out five local soldiers in a roadside attack."], ["2009.09.08", "Afghanistan", "Baghlan", 1, 21, "Sunni terrorists murder a local cop with a bomb."], ["2009.09.08", "Afghanistan", "Kabul", 3, 9, "Three Afghan civilians are blown to bits by a Shahid suicide bomber."], ["2009.09.08", "Afghanistan", "Nuristan", 8, 8, "Taliban militants stage a brutal siege on two government buildings, killing eight guards in the process."], ["2009.09.08", "Iraq", "Baghdad", 12, 26, "Five separate roadside attacks around the country leave a dozen Iraqis dead."], ["2009.09.08", "Pakistan", "NWFP", 1, 1, "Taliban militants kidnap a Greek professor after killing his guard."], ["2009.09.08", "Pakistan", "Orakzai", 4, 6, "Four Shiite school children are gunned down in cold blood by Sunni extremists."], ["2009.09.08", "Somalia", "Mogadishu", 8, 31, "Eight civilians are killed when religious hardliners attack government troops."], ["2009.09.08", "Thailand", "Pattani", 1, 0, "A teacher is taken down by Islamic gunmen."], ["2009.09.09", "Afghanistan", "Logar", 25, 0, "Fifteen schoolchildren are among twenty-five innocents blown to bits by Taliban bombers."], ["2009.09.09", "Iraq", "Karbala", 4, 0, "Jihadis murder four Iraqis with a roadside blast."], ["2009.09.09", "Iraq", "Kirkuk", 8, 2, "Women and children are among eight members of a family murdered by an al-Qaeda car bomb."], ["2009.09.09", "Pakistan", "South Waziristan", 1, 2, "Islamic radicals kill an elderly man with a bomb."], ["2009.09.09", "Thailand", "Pattani", 1, 0, "Islamists shoot a Buddhist to death in cold blood, then set fire to the body."], ["2009.09.09", "Thailand", "Pattani", 2, 0, "Two more Buddhist villagers are shot to death by Muslim radicals in separate attacks."], ["2009.09.10", "Afghanistan", "Helmand", 2, 4, "Two civilians are murdered by a Fedayeen suicide bomber."], ["2009.09.10", "Afghanistan", "Kunduz", 7, 2, "Taliban terrorists attack a police post and kill seven officers."], ["2009.09.10", "Dagestan", "Makhachkala", 2, 0, "Two government officials are murdered by Muslim gunmen on consecutive days."], ["2009.09.10", "Iraq", "Mahmudiya", 4, 29, "A double bombing at a market leaves four patrons dead."], ["2009.09.10", "Iraq", "Wardek", 20, 27, "A Shahid suicide bomber drives a truck packed with explosives into a village, killing at least twenty innocent people."], ["2009.09.10", "Jordan", "Aqaba", 1, 0, "A Muslim man guns down his teenage sister for \"knowing many men.\""], ["2009.09.10", "Pakistan", "South Waziristan", 2, 4, "Two public workers are killed in a Mujahideen rocket attack."], ["2009.09.10", "Thailand", "Yala", 2, 0, "Two men are gunned down by Mujahideen in separate attacks."], ["2009.09.11", "Afghanistan", "Farah", 3, 0, "Three civilians are killed when a Taliban rocket strikes their home."], ["2009.09.11", "Afghanistan", "Kandahar", 2, 0, "A child is among two people blown into pieces by a Fedayeen suicide bomber."], ["2009.09.11", "Afghanistan", "Kandahar", 6, 0, "Sunni hardliners kill six civilians with a roadside bomb."], ["2009.09.11", "Afghanistan", "Kunar", 6, 0, "Six security guards are murdered by Mujahideen."], ["2009.09.11", "Afghanistan", "Uruzgan", 14, 0, "Fourteen car passengers are massacred by Taliban bombers."], ["2009.09.11", "Ethiopia", "Senbete", 0, 3, "A Muslim mob ransacks two Christian churches and seriously injures three Christian worshippers."], ["2009.09.11", "Ingushetia", "Nazran", 1, 4, "A local police officer dies from injuries suffered from a suicide bomber."], ["2009.09.11", "Iraq", "Safara", 5, 0, "Five Iraqi police are gunned down at point blank range by Muslim terrorists."], ["2009.09.11", "Somalia", "Mogadishu", 15, 27, "Fifteen people, including nine disabled patients at a hospital, are killed when Islamic militia slam mortars into a neighborhood."], ["2009.09.12", "Bangladesh", "Dhaka", 1, 0, "A group of Muslims brutally torture and murder a young Christian student."], ["2009.09.12", "India", "Srinagar", 3, 10, "A woman and two others are taken out be a car bomb."], ["2009.09.12", "Ingushetia", "Nazran", 1, 0, "A prosecutor is gunned down outside his home by suspected Islamic rebels."], ["2009.09.12", "Iraq", "Baghdad", 4, 24, "A double bombing by sectarian Jihadis at a mosque leaves four dead."], ["2009.09.12", "Iraq", "Baqubah", 4, 0, "Two women are among four people blown to bits by an al-Qaeda bomb."], ["2009.09.12", "Pakistan", "Landikotal", 3, 0, "Two brothers are among three men gunned down by Mujahideen."], ["2009.09.12", "Thailand", "Yala", 0, 0, "Suspected Islamists slit a teenager's throat, then set fire to his body."], ["2009.09.13", "Bangladesh", "Dhaka", 1, 0, "A Christian evangelist dies from injuries suffered from severe torture at the hands of a Muslim gang."], ["2009.09.13", "India", "Kishtwar", 1, 0, "A civilian is shot to death by Hiz-bul-Mujahideen."], ["2009.09.13", "Iraq", "Baghdad", 1, 4, "A cafe is bombed by Mujahid, leaving at least one patron dead."], ["2009.09.13", "Iraq", "Muqdadiya", 2, 12, "Muslim terrorists set off a bomb at a market, killing two patrons."], ["2009.09.13", "Pakistan", "Khyber", 3, 2, "Islamic militants kill three local soldiers in a landmine attack."], ["2009.09.13", "Thailand", "Yala", 5, 0, "Five local security personnel are ambushed and killed by Islamic radicals while on a break."], ["2009.09.14", "Iraq", "Baqubah", 5, 5, "Five people are killed in two Jihad bombings, one of which was in front of a movie theater."], ["2009.09.14", "Iraq", "Buhriz", 1, 1, "Islamic bombers take out an antiques dealer."], ["2009.09.14", "Iraq", "Mosul", 3, 1, "A woman and her daughter are among four casualties of Mujahideen bombers."], ["2009.09.14", "Iraq", "Mukheefa", 1, 0, "A college student is shot to death by Muslim terrorists while walking home."], ["2009.09.14", "Pakistan", "Karachi", 1, 0, "A courageous security guard loses his life defending an oil refinery against Islamic militants."], ["2009.09.14", "Pakistan", "Sialkot", 1, 0, "A young Christian is beaten to death after being arrested for blasphemy."], ["2009.09.15", "Iraq", "Baghdad", 2, 5, "Jihadis fire mortars into a populated area, killing two Iraqis."], ["2009.09.15", "Italy", "Trieste", 1, 1, "An 18-year-old girl dies from being stabbed in the throat by her father for falling in love with a non-Muslim."], ["2009.09.15", "Somalia", "Merca", 1, 0, "A 69-year-old Christian is executed by al-Shabaab militants after they find him carrying Bibles through their checkpoint."], ["2009.09.16", "Afghanistan", "Kandahar", 2, 8, "A Fedayeen suicide bomber sends two civilians to Allah."], ["2009.09.16", "Afghanistan", "Khost", 1, 2, "Islamists detonate a bomb in a shop, killing one civilian."], ["2009.09.16", "Egypt", "Bagur", 1, 2, "A 63-year-old Christian is stabbed to death by a rampaging Muslim."], ["2009.09.16", "Iraq", "Khalis", 3, 6, "Jihadi car bombers take out three Iraqis."], ["2009.09.16", "Philippines", "Tungawan", 3, 0, "Moro Islamists murder three people by throwing a grenade into a village."], ["2009.09.16", "Thailand", "Narathiwat", 1, 0, "A man picking up groceries in his truck is gunned down by Muslim radicals."], ["2009.09.17", "Afghanistan", "Kabul", 16, 40, "Civilians and soldiers are among the dead as a Shahid suicide bomber detonates along a city street."], ["2009.09.17", "Iraq", "Tal Afar", 3, 3, "A suicide truck bomber takes down three civilians."], ["2009.09.17", "Iraq", "Tuz Khurmato", 2, 1, "Two Iraqis are killed in a Mujahideen bombing."], ["2009.09.17", "Pakistan", "Peshawar", 2, 0, "Two members of a family are kidnapped and tortured to death by Sunni hardliners."], ["2009.09.17", "Somalia", "Mogadishu", 21, 30, "Over twenty African peacekeepers and civilians are killed in a devastating suicide truck bomb attack."], ["2009.09.17", "Thailand", "Pattani", 2, 2, "Two Buddhist security personnel, one of whom was with his wife, are killed in separate Muslim shootings."], ["2009.09.17", "Thailand", "Pattani", 3, 2, "A Buddhist laborer is among three civilians shot to death by Islamic terrorists in separate attacks."], ["2009.09.18", "Algeria", "Boumerdes", 1, 0, "Islamic fundamentalists kill a local soldier with a bomb."], ["2009.09.18", "Algeria", "Kabylie", 1, 0, "A civilian is gunned down by fundamentalists."], ["2009.09.18", "India", "Doda", 2, 0, "Islamic terrorists ambush and kill two police officers."], ["2009.09.18", "Iraq", "Mahmoudiya", 7, 21, "Jihadi car bombers hit a market as it is packed with Ramadan shoppers.  Seven Iraqis are killed."], ["2009.09.18", "Pakistan", "Hangu", 1, 0, "The mayor of a town is gunned down in a sectarian attack."], ["2009.09.18", "Pakistan", "Kohat", 3, 0, "Three mourners at a funeral are shot to death by Sunni militants."], ["2009.09.18", "Pakistan", "Ustarzai", 39, 54, "Thirty-nine innocents are slaughtered by a devastating Lashkar-i-Jhangvi Al-Alami bomb attack on a busy Shiite market."], ["2009.09.19", "Afghanistan", "Helmand", 1, 1, "A Danish soldier is killed by a sniper while on patrol."], ["2009.09.19", "Afghanistan", "Herat", 2, 7, "Two children, ages 7 and 10, are blasted to death by a female suicide bomber."], ["2009.09.19", "Afghanistan", "Kandahar", 2, 0, "A Taliban bomb hidden in a bicycle leaves two civilians dead."], ["2009.09.19", "Afghanistan", "Kandahar", 5, 16, "Five Afghans are murdered by a Shahid suicide bomber."], ["2009.09.19", "Iraq", "Mosul", 1, 2, "An 11-year-old boy dies from injuries following a Jihad bombing."], ["2009.09.19", "Iraq", "Zubair", 2, 0, "Two members of a religious minority are murdered by Muslim gunmen."], ["2009.09.19", "Pakistan", "Darra Adam Khel", 2, 0, "A suspected suicide attack kills two innocents."], ["2009.09.19", "Pakistan", "Malakand", 5, 0, "Five people are riddled with bullets when Talibanis open point blank on a passenger vehicle."], ["2009.09.20", "India", "Ganderbal", 1, 1, "Mujahideen barge into a home and shot two sisters, killing one."], ["2009.09.20", "Ingushetia", "Gazi-Yurt", 2, 1, "Two local police are gunned down by Islamic militants."], ["2009.09.20", "Iraq", "Iskandariya", 1, 4, "Suspected al-Qaeda bomb a cemetery, killing at least one mourner."], ["2009.09.20", "Pakistan", "Hangu", 4, 4, "Four people are machine-gunned to death at a market by Muslim terrorists."], ["2009.09.20", "Russia", "Cherkessk", 1, 0, "A moderate cleric is assassinated by Wahabbi extremists."], ["2009.09.20", "Somalia", "Wanlaweyn", 2, 0, "al-Shabaab Islamists gun down two demonstrators who are protesting them."], ["2009.09.20", "Sudan", "Jonglei", 51, 46, "Fifty-one non-Muslim villagers are massacred in an assault by armed forces directed by the Islamic Republic."], ["2009.09.21", "Iraq", "Latifiya", 3, 2, "Three people are incinerated by a Jihad bomb blast at a gas station."], ["2009.09.21", "Philippines", "Sulu", 8, 9, "Abu Sayyaf terrorists kill eight soldiers in an ambush."], ["2009.09.22", "Afghanistan", "Farah", 5, 2, "Five civilians are blown to bits when their car is hit by a Taliban roadside bomb."], ["2009.09.22", "India", "Baramulla", 1, 4, "A local soldier is gunned down in an ambush by Islamic militants."], ["2009.09.22", "Somalia", "Mogadishu", 8, 20, "Eight civilians are killed during an attack by Islamic hardliners."], ["2009.09.23", "Afghanistan", "Herat", 1, 2, "A teenage boy is gunned down in his home by Islamic militants, who also injure his sister and mother."], ["2009.09.23", "Afghanistan", "Kandahar", 7, 0, "Three children and two women are among seven innocents wiped out by a Taliban roadside bomb."], ["2009.09.23", "Iraq", "Mosul", 4, 1, "Four Iraqis are killed in two Jihad bombing attacks."], ["2009.09.23", "Thailand", "Pattani", 2, 0, "Two Buddhists, one a 19-year-old woman, are brutally murdered by Muslim gunmen."], ["2009.09.23", "Thailand", "Yala", 1, 1, "A 16-year-old boy is shot to death by Muslim radicals in a drive-by attack."], ["2009.09.24", "Afghanistan", "Helmand", 4, 2, "Taliban hardliners murder four police with a roadside bomb."], ["2009.09.24", "Iraq", "Mosul", 2, 0, "Sunni gunmen take down two local cops at a checkpoint."], ["2009.09.24", "Pakistan", "Bannu", 9, 0, "Islamic radicals open fire on two cars carrying tribal elders.  Nine victims are cut down."], ["2009.09.24", "Somalia", "Mogadishu", 5, 10, "Five civilians die in an ambush claimed by Hizbul Islam."], ["2009.09.25", "Afghanistan", "Herat", 4, 0, "The Taliban shoot three civilians and hang another."], ["2009.09.26", "Iraq", "Mosul", 1, 0, "An off-duty policeman is shot to death by Sunni terrorists."], ["2009.09.26", "Pakistan", "Bannu", 13, 64, "A truck bomber detonates outside a police station, killing thirteen people on the street, including a young child."], ["2009.09.26", "Pakistan", "Peshawar", 11, 94, "Eleven people outside a bank are murdered by a Jihad car bomb."], ["2009.09.26", "Thailand", "Narathiwat", 2, 0, "A man and his wife are brutally gunned down by Islamic radicals."], ["2009.09.27", "Afghanistan", "Badghis", 1, 0, "An 'enemy of Allah' is hanged by Sunni hardliners."], ["2009.09.27", "Afghanistan", "Farah", 5, 0, "Taliban bombers take out five civilians traveling in a car."], ["2009.09.27", "Afghanistan", "Herat", 4, 17, "Four civilians are blown to bits by a motorcycle suicide bomber."], ["2009.09.27", "Chechnya", "Stary Achkoi", 2, 0, "Muslim gunmen murder a man and his son as they are sitting in their car."], ["2009.09.27", "Iraq", "Ramadi", 4, 8, "A Shahid suicide bomber blasts four Iraqis to death outside a police station."], ["2009.09.27", "Pakistan", "Sargodha", 2, 0, "A man shoots his teen daughter and her lover to death in the name of honor."], ["2009.09.27", "Thailand", "Yala", 1, 1, "A man visiting his brother's grave is murdered by Muslim bombers."], ["2009.09.28", "Afghanistan", "Kunar", 6, 0, "Six civilians traveling in a car are massacred by Taliban bombers."], ["2009.09.28", "India", "Pulwama", 1, 0, "A young woman is cut down by Lashkar-e-Toiba gunmen."], ["2009.09.28", "Iraq", "Baghdad", 5, 28, "Vicious back-to-back bombings leave five Iraqis dead."], ["2009.09.28", "Iraq", "Diwaniyah", 3, 5, "Jihadis bomb a minibus, killing three passengers."], ["2009.09.28", "Iraq", "Ramadi", 7, 16, "Seven people are murdered when a Fedayeen suicide bomber detonates along a city street."], ["2009.09.28", "Iraq", "Tal Afar", 4, 0, "Four Kurds are captured and executed by al-Qaeda."], ["2009.09.28", "Jordan", "Amman", 1, 0, "A 40-year-old divorced mother of five is stabbed fifteen times by her brothers for having a 'bad reputation.'"], ["2009.09.28", "Pakistan", "Bannu", 4, 0, "Four people are incinerated by a suicide bomber."], ["2009.09.28", "Pakistan", "North Waziristan", 2, 5, "Islamic radicals fire rockets into a military base, killing two local soldiers."], ["2009.09.28", "Pakistan", "Orakzai", 1, 0, "A man is abducted and killed by Islamic terrorists."], ["2009.09.28", "Somalia", "Marerey", 1, 0, "A 46-year-old Christian woman is shot to death by Islamists after being found with Bibles."], ["2009.09.28", "Somalia", "Mogadishu", 2, 0, "Two 'enemies of Allah' are executed at a livestock market."], ["2009.09.28", "Thailand", "Narathiwat", 2, 0, "Two villagers are gunned down by Muslim militants."], ["2009.09.28", "Thailand", "Pattani", 1, 0, "Suspected Muslim insurgents stab a man to death."], ["2009.09.28", "Thailand", "Pattani", 2, 0, "Islamic separatists murder two civilians in their home."], ["2009.09.29", "Afghanistan", "Kandahar", 30, 39, "Ten children and seven women are among thirty people killed when religious extremists bomb a passenger bus."], ["2009.09.29", "India", "Baramulla", 3, 2, "Islamic militants cut down three police standing guard at a bus station."], ["2009.09.29", "Iraq", "Baghdad", 18, 55, "At least eighteen Iraqis are killed in multiple terror attacks around the country."], ["2009.09.29", "Somalia", "Kismayo", 1, 0, "A local businessman is assassinated by Islamists."], ["2009.09.29", "Somalia", "Mogadishu", 8, 6, "Eight civilians are killed during an ambush by Islamic militia."], ["2009.09.29", "Thailand", "Pattani", 1, 0, "Islamic radicals gun down a civilian in a drive-by."], ["2009.09.29", "Thailand", "Pattani", 2, 2, "A Buddhist woman is among two people killed when Islamic 'insurgents' spray a home with automatic weapons fire."], ["2009.09.30", "India", "Bandipora", 1, 0, "Islamic militants storm a home and murder a resident."], ["2009.09.30", "Iraq", "Baghdad", 1, 1, "Mujahideen plant a bomb under a car, killing a man and injuring his wife."], ["2009.09.30", "Iraq", "Baghdad", 1, 8, "A university student is murdered by Jihad bus bombers."], ["2009.09.30", "Iraq", "Mahmudiya", 3, 1, "Three Iraqi police are gunned down point-blank by Sunni ambushers at a checkpoint."], ["2009.09.30", "Pakistan", "Swat", 1, 0, "A family man who sheltered a Chinese engineer who escaped from the Taliban is murdered."], ["2009.09.30", "Pal. Auth.", "Hebron", 1, 0, "A 16-year-old is strangled by her family in an honor killing."], ["2009.09.30", "Philippines", "Jolo", 3, 2, "Abu Sayyaf terrorists kill three soldiers riding in a vehicle, including two American seamen."], ["2009.09.30", "Thailand", "Narathiwat", 1, 1, "A local village head is murdered by Muslim gunmen."], ["2009.10.01", "Somalia", "Mogadishu", 5, 6, "Islamists shell a vegetable market, killing five civilians, including women."], ["2009.10.02", "Afghanistan", "Kunar", 1, 3, "Taliban extremists attack a group of trucks, killing one of the drivers."], ["2009.10.02", "India", "Sopore", 1, 0, "A civilian is killed by religious militants."], ["2009.10.02", "Iraq", "Diyala", 2, 0, "A barber is among two people taken down by Religion of Peace gunmen."], ["2009.10.02", "Iraq", "Shurouq", 1, 4, "Terrorists plant a bomb at a mosque, killing an imam who also worked as a policeman."], ["2009.10.02", "Pakistan", "Mardan", 2, 0, "Islamic radicals murder two local police."], ["2009.10.02", "Russia", "Kabardino-Balkaria", 1, 3, "Muslim gunmen kill a police officer in a drive-by."], ["2009.10.02", "Somalia", "Kismayo", 22, 70, "Civilians are among the two dozen people killed when Islamic factions clash."], ["2009.10.02", "Somalia", "Mogadishu", 6, 15, "Six people are killed when Muslim radicals mortar a main market."], ["2009.10.02", "Thailand", "Pattani", 2, 0, "A middle-aged Buddhist man is among two people murdered separately by Muslim gunmen."], ["2009.10.03", "Afghanistan", "Kunduz", 4, 20, "Four civilians at a market are blown to bits by a Taliban planted bomb."], ["2009.10.03", "Afghanistan", "Wardak", 2, 0, "An Islamic militant dressed as a local soldier shoots two American troops to death as they sleep."], ["2009.10.03", "Iraq", "Mosul", 3, 0, "A beheaded woman is among three people killed by terrorists in three incidents."], ["2009.10.03", "Pakistan", "Bajur", 2, 0, "A tribal elder and a civilian are murdered separately by Muslim extremists."], ["2009.10.03", "Pakistan", "Islamabad", 1, 2, "Three Hindu men are abducted, one of whom is murdered in captivity."], ["2009.10.04", "India", "Srinagar", 1, 0, "Muslim cops kill a Hindu boy for marrying a Muslim girl."], ["2009.10.04", "Iraq", "Baghdad", 2, 4, "A truck driver is among two people killed in two Jihad bombings."], ["2009.10.04", "Iraq", "Kirkuk", 1, 0, "A 55-year-old Christian nurse is kidnapped and tortured to death by Religion of Peace militants."], ["2009.10.04", "Iraq", "Kirkuk", 1, 0, "A woman is shot to death in an 'honor killing.'"], ["2009.10.04", "Somalia", "Kismayo", 8, 14, "Eight people are killed when rival Islamic hardliners clash."], ["2009.10.04", "Thailand", "Narathiwat", 1, 0, "A villager is shot in the neck and then set on fire by Religion of Peace separatists."], ["2009.10.05", "Iraq", "Haditha", 6, 15, "A half-dozen funeral mourners are blown to bits by a suicide bomber."], ["2009.10.05", "Iraq", "Kirkuk", 1, 0, "The tortured body of a Christian businessman is discovered three days after being kidnapped by Muslims."], ["2009.10.05", "Iraq", "Mosul", 1, 0, "A 10-year-old boy is taken out by a bomb hidden in a garbage can."], ["2009.10.05", "Pakistan", "Islamabad", 5, 6, "Two women are among five people killed when a suicide bomber detonates at a UN World Food Program office."], ["2009.10.05", "Philippines", "Jolo", 1, 1, "Abu Sayyaf shot a guard for a bridge construction crew to death."], ["2009.10.05", "Thailand", "Narathiwat", 1, 17, "Islamists gun down a laborer and also set off a bomb at a Buddhist festival."], ["2009.10.06", "Afghanistan", "Ghazni", 2, 25, "Taliban militants rocket a passenger bus, killing two men."], ["2009.10.06", "Iraq", "Amiriyeh", 7, 25, "Terrorists set off a bus bomb near a mosque, killing at least seven Iraqis along the crowded street."], ["2009.10.06", "Thailand", "Narathiwat", 4, 42, "Islamic militants kill four civilians in separate bombings, including a Buddhist woman at a restaurant."], ["2009.10.07", "Afghanistan", "Ghazni", 3, 0, "Taliban bombers take out three local cops."], ["2009.10.07", "Iraq", "Abu Ghraib", 2, 9, "Two civilians are killed when Mujahideen toss a grenade at a hospital."], ["2009.10.07", "Iraq", "Shirqat", 3, 0, "The tortured bodies of three kidnapped police officers are found."], ["2009.10.07", "Thailand", "Pattani", 2, 0, "Islamists shoot two men to death, one as he is driving his child to school."], ["2009.10.08", "Afghanistan", "Kabul", 17, 76, "A suicide bomber detonates outside the Indian embassy, ending the lives of seventeen innocents."], ["2009.10.08", "Iraq", "Jalawla", 2, 4, "Two Iraqis are murdered by Jihadi bombers."], ["2009.10.08", "Iraq", "Yusufiya", 3, 10, "Suspected Islamists set off a bomb outside a shop, killing three civilians."], ["2009.10.09", "Afghanistan", "Kabul", 2, 4, "Two Polish soldiers assisting a road construction project are killed by Taliban bombers."], ["2009.10.09", "Afghanistan", "Paktia", 6, 3, "A suicide bomber murders six guards at a road construction project."], ["2009.10.09", "Chechnya", "Grozny", 1, 3, "Islamic insurgents fire an RPG at a police post, killing one officer."], ["2009.10.09", "Iraq", "Saqlawiya", 3, 0, "al-Qaeda bombers murder a cleric and two of his associates on their way home."], ["2009.10.09", "Pakistan", "Peshawar", 52, 100, "Over fifty innocent civilians at a market are incinerated by a dedicated Sunni suicide car bomber."], ["2009.10.09", "Somalia", "Mogadishu", 3, 0, "al-Shabaab militants shoot three rivals to death."], ["2009.10.10", "Afghanistan", "Kunduz", 1, 0, "A young policeman is murdered by Taliban bombers."], ["2009.10.10", "Pakistan", "Khuzdar", 2, 0, "Suspected Islamists machine-gun two truck drivers to death."], ["2009.10.10", "Pakistan", "Rawalpindi", 9, 0, "Islamic militants storm a security headquarters, killing six officers in the siege and three more taken hostage."], ["2009.10.10", "Somalia", "Afgoye", 1, 0, "A Hizbul Islam leader is gunned down by Islamic rivals."], ["2009.10.10", "Somalia", "Kismayo", 25, 41, "Twenty-five people are killed when Hizbul Islam hard-liners attack their rivals."], ["2009.10.10", "Somalia", "Mogadishu", 1, 0, "A Christian pastor is shot to death by al-Shabaab militants as he is returning home."], ["2009.10.10", "Somalia", "Mogadishu", 1, 0, "al-Shabaab militants shoot a man to death at a market."], ["2009.10.11", "Iraq", "Mosul", 2, 0, "A university student is among two civilians murdered by the terror group, Islamic State of Iraq."], ["2009.10.11", "Iraq", "Ramadi", 19, 80, "Three horrific bombings, one at a hospital, leave nineteen innocents dead."], ["2009.10.11", "Thailand", "Narathiwat", 1, 0, "Muslim militants murder a 37-year-old civilian sitting in a tea shop."], ["2009.10.11", "Thailand", "Pattani", 1, 0, "A cattle rancher is shot to death in his field by Religion of Peace gunmen."], ["2009.10.11", "Thailand", "Yala", 1, 0, "A butcher on his way home is gunned down by Islamists."], ["2009.10.12", "Iraq", "Abu Khamis", 2, 2, "Terrorists target the mayor of a town with a bomb, killing two of his sons instead."], ["2009.10.12", "Iraq", "Buhriz", 4, 5, "Jihadi bombers take out four Iraqis in multiple attacks."], ["2009.10.12", "Pakistan", "Alpuri", 41, 45, "A 12-year-old suicide bomber slaughters forty-one people at a crowded market."], ["2009.10.12", "Pakistan", "Quetta", 1, 0, "A Shia man is gunned down in a sectarian attack."], ["2009.10.13", "Iraq", "Baquba", 6, 10, "A Shahid detonates himself in a cafe, killing at least six others."], ["2009.10.13", "Somalia", "Mogadishu", 4, 11, "Four people are killed when Hizbul Islam terrorists ambush government troops."], ["2009.10.14", "Afghanistan", "Zabul", 2, 6, "Religious extremists kill two local soldiers with a roadside bomb."], ["2009.10.14", "Iraq", "Karbala", 6, 45, "Sunni bombers strike three groups of praying Shias in separate attacks, leaving a half-dozen dead."], ["2009.10.14", "Pakistan", "Sherazi Mohalla", 1, 0, "A man is stabbed to death in front of his wife and child by his in-laws for marrying without permission."], ["2009.10.15", "Pakistan", "Kohat", 11, 16, "Eleven people are murdered when a Fedayeen car bomber plows into a crowd."], ["2009.10.15", "Pakistan", "Lahore", 28, 67, "Shahid suicide attackers brutally assault two police academies, killing nearly thirty people."], ["2009.10.15", "Pakistan", "Peshawar", 1, 12, "A 6-year-old child is blown apart by a remote-controlled car bomb along a city street."], ["2009.10.16", "Iraq", "Mosul", 1, 0, "A local soldier standing guard is murdered by a suicide bomber."], ["2009.10.16", "Iraq", "Tal Afar", 15, 70, "A suicide bomber at a rival mosque yell's 'Allah Akbar', then opens up on worshippers with a machine-gun before detonating, leaving at least fifteen dead in the massacre."], ["2009.10.16", "Pakistan", "Peshawar", 15, 24, "Two girls are among fifteen innocents incinerated by Fedayeen suicide bombers."], ["2009.10.16", "Somalia", "Mogadishu", 1, 0, "A young policeman is gunned down in an Islamist drive-by."], ["2009.10.17", "Iraq", "Falluja", 4, 10, "Mujahideen set off a roadside bomb, killing four local security personnel."], ["2009.10.17", "Iraq", "Mosul", 4, 4, "A child is among four people cut down by Islamic militants in separate attacks."], ["2009.10.17", "Pakistan", "FATA", 3, 6, "Three local soldiers are killed in a bomb set by religious extremists."], ["2009.10.18", "Egypt", "Attaleen", 1, 0, "Muslims gun down a 61-year-old Christian whose son was dating a Muslim girl."], ["2009.10.18", "India", "Poonch", 1, 0, "A local soldier is murdered when terrorists plant a landmine in the road."], ["2009.10.18", "Iran", "Pisheen", 42, 25, "A suicidal Sunni from the 'Soldiers of God' group detonates in a gymnasium, slaughtering nearly fifty people."], ["2009.10.18", "Iraq", "Adhamiya", 8, 29, "Mujahideen set off two bombs in commercial areas, sending eight civilians to Allah."], ["2009.10.18", "Iraq", "Baghdad", 5, 16, "Five patrons at a cafe are blown to bits by a bomb planted on a motorcycle."], ["2009.10.18", "Iraq", "Mosul", 1, 5, "Muslim gunmen take down a child in a drive-by."], ["2009.10.19", "Iraq", "Baghdad", 4, 13, "Jihadis bomb a restaurant and a minibus, killing at least four innocents."], ["2009.10.19", "Somalia", "Bardere", 1, 0, "An official is assassinated by al-Shabaab."], ["2009.10.19", "Somalia", "Galkayo", 1, 0, "A Christian woman is murdered by Islamists inside her home for refusing to wear a veil."], ["2009.10.19", "Thailand", "Yala", 0, 28, "Islamic militants set off a bomb at a packed market, injuring over two dozen."], ["2009.10.20", "Iraq", "Mosul", 2, 0, "Two men are kidnapped and murdered by Muslim terrorists."], ["2009.10.20", "Iraq", "Saqlawiya", 4, 12, "Four people are murdered when Mujahideen set off a car bomb at a gas station."], ["2009.10.20", "Pakistan", "Islamabad", 6, 29, "Two suicide bombers attack a women's university about a minute apart, leaving six students and staff dead."], ["2009.10.20", "Pakistan", "Orakzai", 2, 0, "Two young police recruits are abducted and shot to death in captivity by hardliners."], ["2009.10.20", "Thailand", "Narathiwat", 1, 0, "Islamists shoot a 57-year-old man to death inside his construction shop."], ["2009.10.21", "Iraq", "Bousef", 2, 0, "A man and woman are gunned down by Sunni militants."], ["2009.10.21", "Iraq", "Iskandariya", 2, 12, "Jihadis bomb a livestock market, killing at least two attendees."], ["2009.10.21", "Iraq", "Kirkuk", 2, 1, "A shopkeeper and journalist are killed in separate attacks."], ["2009.10.21", "Iraq", "Mosul", 2, 0, "A girl and her father are murdered by Muslim gunmen."], ["2009.10.21", "Philippines", "Patikul", 1, 2, "Abu Sayyaf members plant a bomb near a water pipe which kills an inspector."], ["2009.10.21", "Thailand", "Narathiwat", 2, 0, "Two men are gunned down by Islamic militants in separate attacks."], ["2009.10.21", "Thailand", "Narathiwat", 3, 2, "A woman is among three construction workers murdered by Mujahideen."], ["2009.10.22", "Algeria", "Kabylia", 7, 2, "Seven security personnel are cut down by automatic weapons at close range while they are riding a bus."], ["2009.10.22", "Ingushetia", "Nazran", 1, 2, "Islamists kill the driver of a police vehicle with a roadside bomb."], ["2009.10.22", "Pakistan", "Islamabad", 2, 0, "Talibanis assassinate a brigadier and his driver in broad daylight in the capital."], ["2009.10.22", "Russia", "Plievo", 1, 0, "Fundamentalists murder a shop owner for selling alcohol."], ["2009.10.22", "Somalia", "Mogadishu", 18, 60, "Islamic militia mortar an airport, killing at least eighteen innocents."], ["2009.10.22", "Thailand", "Yala", 1, 0, "Muslim radicals shoot a man to death inside his home."], ["2009.10.23", "Iraq", "Abu Ghraib", 2, 3, "Islamic radicals bomb a family in their vehicle, killing two members."], ["2009.10.23", "Pakistan", "Kamra", 8, 17, "A Fedayeen pedals to paradise, taking eight others with him in the suicide blast outside an aeronautical complex."], ["2009.10.23", "Pakistan", "Peshawar", 0, 15, "Islamists car bomb a restaurant, injuring fifteen people."], ["2009.10.23", "Pakistan", "South Waziristan", 18, 6, "Eighteen people in a wedding party, mostly children, perish in a horrific bombing attack on a minibus."], ["2009.10.23", "Thailand", "Pattani", 1, 0, "A 23-year-old man is murdered by Islamic terrorists."], ["2009.10.23", "Thailand", "Pattani", 1, 0, "A 29-year-old villager is shot in the head by Muslim militants."], ["2009.10.23", "Thailand", "Yala", 2, 1, "Two men are murdered by Mujahideen gunmen, one in his home."], ["2009.10.24", "Iraq", "Tikrit", 2, 7, "A suicide bomber takes out seven at a political headquarters."], ["2009.10.24", "Pakistan", "Punjab", 1, 0, "A police officer is killed by a Fedayeen bomber."], ["2009.10.24", "Thailand", "Pattani", 1, 0, "A Buddhist working as a janitor is shot to death by Muslim militants at a tea shop."], ["2009.10.24", "Thailand", "Pattani", 1, 0, "Islamists gun down a farmer in his field."], ["2009.10.25", "Iraq", "Baghdad", 160, 540, "Two massive car bombs take out one-hundred and sixty Iraqis standing near or in government buildings.  The dead include 30 children at a day care center.  The Islamic State of Iraq takes responsibility."], ["2009.10.25", "Somalia", "Merca", 2, 0, "Two men are shot to death by al-Shabaab militants"], ["2009.10.25", "Yemen", "Dalea", 2, 3, "Two local soldiers are gunned down in a suspected sectarian ambush."], ["2009.10.26", "Iraq", "Karbalah", 4, 12, "A suicide bomber sends four souls to Allah."], ["2009.10.26", "Iraq", "Mosul", 2, 2, "Mujahideen gunmen murder two civilians."], ["2009.10.26", "Thailand", "Pattani", 2, 0, "Dedicated Muslims gun down two Buddhist civilians looking for food."], ["2009.10.27", "Iraq", "Baiji", 1, 0, "Terrorists attack a bomb to a car which kills an 11-year-old boy trying to remove it."], ["2009.10.27", "Iraq", "Tikrit", 2, 0, "Jihadis blow up an oil tanker, killing the two drivers."], ["2009.10.27", "Pakistan", "Bajaur", 1, 0, "Taliban radicals shoot a man to death while he is sitting in his shop."], ["2009.10.27", "Pakistan", "Mohmand", 2, 3, "Religious extremists attack a police post, killing two officers."], ["2009.10.28", "Afghanistan", "Kabul", 9, 9, "Mujahideen force their way into a UN guesthouse, where they murder nine people, including six international workers."], ["2009.10.28", "Iraq", "Baghdad", 3, 4, "Three women sitting on a minibus are blown to bits by Islamic bombers."], ["2009.10.28", "Iraq", "Mosul", 3, 5, "Mujahideen kill three civilians with a roadside bomb."], ["2009.10.28", "Pakistan", "Peshawar", 117, 200, "Over one-hundred people - mostly women and children - are blown to bits by a massive car bomb blast at a busy market."], ["2009.10.28", "Thailand", "Pattani", 1, 0, "A 78-year-old Buddhist man is shot off his motorbike by Muslim terrorists."], ["2009.10.28", "Thailand", "Pattani", 1, 0, "Muslim radicals shoot a Buddhist motorcycle shop owner to death, then set fire to his body."], ["2009.10.28", "Thailand", "Pattani", 2, 0, "Two civilians are gunned down in separate Muslim drive-bys."], ["2009.10.29", "Afghanistan", "Kandahar", 4, 0, "A child is among four Afghan civilians torn to pieces by an Islamist bomb."], ["2009.10.29", "Iraq", "Baquba", 1, 2, "A civilian is taken out by a Fedayeen suicide bomber outside a hospital."], ["2009.10.29", "Iraq", "Mosul", 3, 1, "Sunni gunmen murder three Iraqi policemen at point-blank range."], ["2009.10.30", "Afghanistan", "Nangarhar", 9, 0, "All nine civilians riding in a taxi are slaughtered by Taliban bombers."], ["2009.10.30", "Iraq", "Baghdad", 1, 3, "Mujahideen bombers murder a government official."], ["2009.10.30", "Iraq", "Tikrit", 1, 0, "A young man has his throat slashed by Sunni militants."], ["2009.10.30", "Pakistan", "Pir Sarhandi Goth", 1, 0, "An older homosexual man is pulled from his home and beaten to death by a Muslim mob."], ["2009.10.30", "Thailand", "Yala", 1, 1, "A Buddhist woman is brutally shot to death, and her husband is seriously injured, by Muslim radicals."], ["2009.10.31", "Pakistan", "Bara", 7, 12, "Lashkar-e-Islam members use a roadside bomber to murder seven security personnel."], ["2009.10.31", "Pakistan", "Khyber", 2, 7, "Sunni hardliners blow up a girls' school and mortar a residential neighborhood, killing two civilians."], ["2009.10.31", "Philippines", "Sulu", 1, 4, "Moro Islamists open fire on a passing patrol, killing at least one."], ["2009.10.31", "Thailand", "Yala", 1, 0, "Islamists kidnap a local man, handcuff him, then shoot him in the head."], ["2009.11.01", "Dagestan", "Bavtugai", 1, 0, "A local mosque official is assassinated by extremists."], ["2009.11.01", "India", "Srinagar", 2, 0, "Islamists murder two traffic cops in a hit-and-run surprise attack at an intersection."], ["2009.11.01", "Iraq", "Karbala", 3, 15, "Terrorists plant a bomb on a bus that leaves three people dead."], ["2009.11.01", "Iraq", "Mussayab", 9, 38, "Jihadis rig a bicycle with explosives, then set it off in a market, killing at least nine innocents."], ["2009.11.01", "Iraq", "Ramadi", 3, 5, "A Fedayeen suicide bomber takes down three Iraqis."], ["2009.11.01", "Philippines", "Banisilan", 1, 2, "Moro Islamists ambush a car carrying civilians, shooting at least one to death."], ["2009.11.01", "Somalia", "Lascanood", 5, 4, "Suspected Shabaab radicals blow up a car with five people inside."], ["2009.11.02", "Iraq", "Khanaqin", 2, 0, "A man and his son are gunned down by Muslim terrorists."], ["2009.11.02", "Pakistan", "Lahore", 0, 25, "Twenty-five people are injured when a suicide bomber detonates along a city street."], ["2009.11.02", "Pakistan", "Rawalpindi", 36, 63, "Fundamentalists set off a massive bomb near a line of people outside a bank, putting down at least thirty-five."], ["2009.11.02", "Thailand", "Narathiwat", 1, 0, "Islamists break into a house and murder a villager."], ["2009.11.02", "Thailand", "Pattani", 2, 0, "Two security personnel are gunned down by Muslim rebels in separate attacks."], ["2009.11.02", "Thailand", "Yala", 2, 0, "Two men are killed in a Religion of Peace drive-by."], ["2009.11.02", "Thailand", "Yala", 2, 0, "Two men riding in a pickup truck are shot to death by a terrorist disguised in a burka."], ["2009.11.02", "USA", "Glendale, AZ", 1, 1, "A woman dies from injuries suffered when her father runs her down with a car for being too 'Westernized.'"], ["2009.11.03", "Afghanistan", "Helmand", 5, 8, "A Taliban gunmen disguised as a policeman suddenly opens fire at a police base, killing five British soldiers in cold blood."], ["2009.11.03", "Iraq", "Abu Ghraib", 3, 0, "Mujahid bombers wipe out a family of three, including a girl."], ["2009.11.03", "Saudi Arabia", "Jazan", 1, 11, "Islamic rebels gun down a security officer \"with the support and assistance of Allah.\""], ["2009.11.03", "Thailand", "Pattani", 2, 0, "Two Buddhist truck drivers are brutally slain and then burned by Religion of Peace extremists."], ["2009.11.03", "Yemen", "Hadramut", 8, 0, "al-Qaeda militants open fire on a vehicle, machine-gunning eight people to death."], ["2009.11.04", "Pakistan", "Bajaur", 2, 2, "Two female schoolteachers are brutally shot to death by Taliban extremists."], ["2009.11.05", "Philippines", "Zamboanga", 2, 8, "Two people are killed when suspected Islamists fire into a commuter bus."], ["2009.11.05", "USA", "Ft. Hood, TX", 13, 31, "A Muslim psychiatrist yelling 'Allah Akbar' murders thirteen unarmed U.S. soldiers on their base in Texas, including a pregnant woman."], ["2009.11.06", "Iraq", "Baqubah", 1, 1, "Sunni fundamentalists shoot a barber to death."], ["2009.11.06", "Iraq", "Rashad", 1, 0, "Suspected al-Qaeda gunmen take down an Iraqi."], ["2009.11.06", "Pakistan", "Hangu", 1, 4, "A policeman is gunned down by Islamic terrorists."], ["2009.11.06", "Somalia", "Merca", 1, 0, "A 33-year-old man is brutally stoned to death for adultery.  The execution takes about seven minutes."], ["2009.11.07", "Afghanistan", "Helmand", 3, 0, "Religious extremists blow up a vehicle carrying local soldiers, killing three."], ["2009.11.07", "Iraq", "Abu Ghraib", 1, 3, "An al-Qaeda bombing leaves one dead."], ["2009.11.07", "Pakistan", "Hangu", 3, 2, "Islamic hardliners attack a local military base with rockets, killing three."], ["2009.11.07", "Yemen", "Al Khubah", 4, 36, "Shiite rebels reportedly shell a residential area, killing four women from the same family."], ["2009.11.08", "India", "Rajouri", 2, 1, "A man and his wife are murdered in their home by intruding Islamic gunmen."], ["2009.11.08", "Iraq", "Kirkuk", 1, 0, "Mujahideen gun down an oil company worker."], ["2009.11.08", "Iraq", "Kut", 1, 0, "A young woman is kidnapped, bound and shot to death by Muslim terrorists."], ["2009.11.08", "Pakistan", "Mattani", 12, 36, "A Fedayeen suicide bomber strikes a packed market, blasting at least a dozen innocents to death."], ["2009.11.08", "Somalia", "Hodon", 2, 8, "Two civilians are killed during an attack by Islamic militia."], ["2009.11.08", "Thailand", "Pattani", 2, 3, "A young man eating in a restaurant is among two people killed in separate Mujahid shootings."], ["2009.11.09", "Algeria", "Tarah", 2, 5, "Fundamentalists set off a bomb that kills five local soldiers."], ["2009.11.09", "Iraq", "Kut", 1, 0, "A young woman is the victim of an honor killing by her brother."], ["2009.11.09", "Pakistan", "Bajaur", 3, 1, "Three local soldiers are murdered in two Mujahideen bombing and shooting attacks."], ["2009.11.09", "Pakistan", "Peshawar", 3, 5, "A woman and a rickshaw driver are among three people blown up by a Shahid suicide bomber."], ["2009.11.09", "Philippines", "Jolo", 1, 0, "Abu Sayyaf militants cut the head off of a Christian school principal and leave it in a paper bag at a gas station."], ["2009.11.09", "Thailand", "Narathiwat", 1, 0, "Islamists shoot and kill a 53-year-old riding home on his motorcycle."], ["2009.11.09", "Thailand", "Yala", 1, 1, "A young Buddhist man collecting plants is brutally ambushed and killed by Religion of Peace advocates."], ["2009.11.10", "Afghanistan", "Paktika", 2, 13, "The Taliban fire a rocket into a home, killing two residents."], ["2009.11.10", "Iran", "Tehran", 1, 0, "The Islamic Republic of Iran assassinates a doctor who exposed torture by poisoning his salad."], ["2009.11.10", "Iraq", "Balad", 2, 2, "Two policemen are cut down in an urban ambush by Sunni gunmen."], ["2009.11.10", "Pakistan", "Peshawar", 34, 104, "Thirty-four people are blown to bits by a Shahid car bomber along a crowded city street lined with shops.  Women and children are among the dead."], ["2009.11.10", "Thailand", "Narathiwat", 1, 0, "Islamists murder a man as he is walking outside his home."], ["2009.11.10", "Thailand", "Pattani", 1, 0, "A villager is gunned down by Muslim militants."], ["2009.11.11", "Afghanistan", "Zabul", 2, 3, "Two civilians are blown to bits by a Fedayeen suicide bomber."], ["2009.11.11", "Pakistan", "Mohmand", 10, 14, "Two local soldiers, kidnapped and beheaded, are among ten murdered by Taliban Islamists in two attacks."], ["2009.11.11", "Somalia", "Puntland", 2, 0, "A judge and a lawmaker are assassinated by suspected al-Shabaab militants in separate incidents."], ["2009.11.12", "Afghanistan", "Nangarhar", 2, 2, "Two children are blown to bits by Islamic bombers."], ["2009.11.12", "Iraq", "Baghdad", 1, 0, "A female high school teacher is shot to death by Muslim terrorists."], ["2009.11.12", "Iraq", "Mosul", 3, 0, "Three civilians are killed in separate Mujahid shooting attacks, including a teenager."], ["2009.11.12", "Pakistan", "Hangu", 2, 6, "Taliban extremists detonate explosives outside a home, killing at least two residents."], ["2009.11.12", "Pakistan", "Peshawar", 1, 0, "An Iranian official is gunned down in a sectarian attack blamed on a Sunni group."], ["2009.11.12", "Thailand", "Pattani", 2, 0, "Muslim radicals gun down a older Buddhist couple at a rice mill."], ["2009.11.13", "Afghanistan", "Kabul", 2, 4, "A Taliban blast leaves at least two Afghans dead."], ["2009.11.13", "Afghanistan", "Kabul", 4, 0, "Two civilians and three soldiers are killed in separate roadside bombings by religious fundamentalists."], ["2009.11.13", "Iraq", "Baghdad", 2, 0, "A policeman and his brother are murdered by Islamic gunmen."], ["2009.11.13", "Iraq", "Mosul", 1, 0, "A young man is kidnapped and shot in the head by terrorists."], ["2009.11.13", "Pakistan", "Bannu", 6, 27, "Six people lose their lives to a suicide car bomber."], ["2009.11.13", "Pakistan", "Peshawar", 10, 55, "A Shahid suicide truck bomber takes out ten at a government building."], ["2009.11.13", "Thailand", "Yala", 1, 0, "An 18-year-old is shot to death in a Religion of Peace drive-by attack."], ["2009.11.14", "Iraq", "Mosul", 1, 0, "A 16-year-old Christian boy is gunned down outside his home by suspected radicals."], ["2009.11.14", "Pakistan", "Peshawar", 15, 25, "Four children and a woman are among fifteen innocents blown to bits by a suicide bomber."], ["2009.11.14", "Somalia", "Mogadishu", 1, 0, "A 23-year-old Christian convert is kidnapped by Islamists and executed with two shots to the head."], ["2009.11.14", "Somalia", "Mogadishu", 5, 11, "At least five civilians are killed during a mortar attack by Islamic militia."], ["2009.11.14", "Thailand", "Narathiwat", 2, 0, "Two men are murdered by Muslim gunmen at a wood processing plant."], ["2009.11.15", "Iraq", "Mosul", 1, 5, "Jihadi bombers take out a 12-year-old child."], ["2009.11.15", "Pakistan", "Bajaur", 1, 0, "An anti-Taliban tribal leader is murdered and his home destroyed."], ["2009.11.16", "Afghanistan", "Tagab", 14, 38, "Religious extremists rocket a market, killing at least fourteen people."], ["2009.11.16", "India", "Kupwara", 2, 0, "Pakistani infiltrators attack an Indian security patrol, killing two members."], ["2009.11.16", "India", "Samba", 2, 0, "Mujahideen kill a border policeman and his driver with a landmine."], ["2009.11.16", "Iraq", "Kirkuk", 6, 17, "Six people are blown to bits by Islamic car bombers."], ["2009.11.16", "Iraq", "al-Saadan", 13, 0, "al-Qaeda militants kidnap and execute thirteen Sunni Iraqis."], ["2009.11.16", "Pakistan", "Peshawar", 4, 43, "A Fedayeen suicide bomb blast outside a shop leaves at least four dead."], ["2009.11.17", "Afghanistan", "Helmand", 2, 0, "Two Afghan civilians are killed in a roadside attack by Sunni terrorists."], ["2009.11.17", "Afghanistan", "Kunduz", 4, 0, "Taliban hardliners murder four guards at a security firm."], ["2009.11.17", "Iraq", "Baghdad", 2, 6, "A Jihad bomb kills two Iraqis."], ["2009.11.17", "Somalia", "Eelboon", 1, 0, "A 29-year-old woman is planted in the ground and pelted to death with stones over adulterous sex."], ["2009.11.17", "Thailand", "Pattani", 1, 0, "A Holy Warrior on a motorbike guns down a school bus driver through his side window."], ["2009.11.19", "Afghanistan", "Oruzgan", 10, 13, "A Shahid suicide car bomber takes out ten civilians along a city street."], ["2009.11.19", "Pakistan", "Karachi", 1, 0, "A Shiite cleric is gunned down by sectarian rivals."], ["2009.11.19", "Pakistan", "Orakzai", 2, 0, "A policeman and his elderly father a shot to death by Taliban militants."], ["2009.11.19", "Pakistan", "Peshawar", 19, 50, "Nineteen innocents are incinerated in a suicide bomb attack on a courthouse."], ["2009.11.19", "Russia", "Moscow", 1, 1, "An anti-Islam priest is assassinated in his own church by a suspected Muslim gunman."], ["2009.11.19", "Thailand", "Pattani", 1, 0, "A 35-year-old Buddhist university employee is gunned down by Islamists."], ["2009.11.19", "Thailand", "Pattani", 1, 0, "Muslims shoot a 32-year-old Buddhist construction worker to death as he is traveling to pick up his children."], ["2009.11.20", "Afghanistan", "Farah", 16, 25, "A suicide bomber on a motorcycle detonates in the middle of a packed market, slaughtering about sixteen shoppers."], ["2009.11.20", "Iraq", "Mosul", 3, 5, "Three Iraqis are blown apart by a roadside bomb."], ["2009.11.20", "Pakistan", "Karachi", 1, 1, "A Sunni is shot to death by sectarian rivals."], ["2009.11.20", "Pakistan", "Peshawar", 3, 7, "Jihadis take out three policemen with a shrapnel bomb."], ["2009.11.21", "Iraq", "Mosul", 1, 0, "A school teacher is assassinated by Muslim gunmen."], ["2009.11.21", "Pakistan", "North Waziristan", 4, 0, "Four security officers are killed in a rocket attack by Taliban fundamentalists."], ["2009.11.21", "Philippines", "Surallah", 1, 0, "A 5-year-old girl is killed when Muslim rebels fire on a group of soldiers."], ["2009.11.21", "Saudi Arabia", "Jebel Rumayh", 3, 3, "Shiite radicals infiltrate the border and kill three Saudi soldiers."], ["2009.11.22", "Afghanistan", "Helmand", 3, 2, "Taliban radicals take out three local security personnel in a roadside attack."], ["2009.11.22", "Afghanistan", "Landikotal", 6, 10, "The Taliban mortar a crowded bazaar, killing at least six civilians."], ["2009.11.22", "Afghanistan", "Spin Boldak", 5, 0, "All five passengers in a police vehicle are ripped to shreds by a Sunni bomb."], ["2009.11.22", "Iraq", "Garma", 7, 5, "Sunnis bomb a checkpoint, killing seven Iraqis."], ["2009.11.22", "Iraq", "Mosul", 1, 4, "A child is incinerated in a thermal bomb attack by Muslim terrorists."], ["2009.11.22", "Somalia", "Afmadow", 2, 0, "At least two civilians are killed in the crossfire when rival Islamist groups clash."], ["2009.11.22", "Thailand", "Pattani", 1, 0, "A female Buddhist teacher is gunned down in front of her home by Islamic militants."], ["2009.11.24", "Afghanistan", "Khost", 4, 0, "Two women are among four civilians shot to death at point-blank range by Mujahideen."], ["2009.11.24", "Afghanistan", "Khost", 5, 3, "Four children are blown to bits when Islamic fundamentalists set off a roadside bomb next to a family vehicle."], ["2009.11.24", "Iraq", "Baghdad", 2, 0, "Two Sunni imams are assassinated in separate bomb attacks."], ["2009.11.24", "Pakistan", "Bajaur", 3, 4, "Two children are among three members of a family killed when suspected Mujahid rocket their home."], ["2009.11.24", "Thailand", "Pattani", 2, 0, "Two young men are shot to death by Muslim militants in separate attacks."], ["2009.11.25", "Iraq", "Karbala", 5, 36, "Five people are murdered by a brutal double bombing at a restaurant."], ["2009.11.25", "Iraq", "Mosul", 3, 1, "Islamist bombers take out three Iraqi cops."], ["2009.11.25", "Iraq", "Tarmiya", 6, 0, "A married couple and two daughters are among six innocents slain in a sectarian home invasion."], ["2009.11.25", "Somalia", "Mogadishu", 1, 1, "A civilian is killed when Jihadis throw a grenade into the street."], ["2009.11.25", "Thailand", "Narathiwat", 1, 0, "Islamic gunmen murder a 47-year-old man as he is returning home from a tea shop."], ["2009.11.25", "Yemen", "San'a", 1, 0, "al-Qaeda posts a video of the torture and gruesome execution of a 41-year-old intelligence officer."], ["2009.11.26", "Dagestan", "Makhachkala", 1, 0, "A police officer is gunned down by Muslim militants."], ["2009.11.26", "Iraq", "Iskandariya", 2, 28, "Children are among the casualties when Sunni radicals set off a bomb at a crowded marketplace."], ["2009.11.26", "Iraq", "Yousifiya", 2, 10, "Jihadis explode a car bomb at a bus stop, killing two Iraqis."], ["2009.11.26", "Thailand", "Yala", 1, 0, "Islamists shoot a 62-year-old civilian to death as he is riding a motorbike."], ["2009.11.27", "Afghanistan", "Farah", 3, 0, "Three Afghanis are taken out by a Fedayeen suicide bomber."], ["2009.11.27", "Pakistan", "Bajaur", 1, 3, "A tribal leader is assassinated by Taliban bombers at a mosque."], ["2009.11.27", "Pal. Auth.", "Gaza", 1, 0, "A woman is strangled with a wet towel by her family members to restore their 'honor'."], ["2009.11.27", "Russia", "Bologoye", 26, 96, "Twenty-six passengers are killed when Islamic terrorists derail a train with a bomb."], ["2009.11.28", "India", "Bhopal", 3, 0, "Three people are gunned down in an ambush by a SIMI terrorist."], ["2009.11.28", "Somalia", "Baladweyn", 2, 1, "Two clerics are assassinated by Hizbul-Islam gunmen outside a mosque."], ["2009.11.29", "Afghanistan", "Nimroz", 6, 2, "Six Afghan police officers are murdered in cold blood by a Talibani disguised as one of them."], ["2009.11.29", "Iraq", "Ghalbiyah", 1, 2, "Suspected al-Qaeda bombers take down another Iraqi."], ["2009.11.29", "Pakistan", "Kohat", 33, 65, "At least thirty people celebrating a holiday are blown to bits when a suicide car bomber plows into a crowded market."], ["2009.11.30", "Iraq", "Mosul", 1, 3, "Muslim gunmen ambush a car carrying a family from a religious minority.  The father is killed.  Two women and a child are injured."], ["2009.11.30", "Thailand", "Pattani", 1, 0, "A man is shot to death inside his home by Islamic radicals."], ["2009.12.01", "Pakistan", "Orakzai", 3, 0, "Three tribal leaders are assassinated by Sunni terrorists."], ["2009.12.01", "Pakistan", "Swat", 1, 0, "Islamic fundamentalists murder the head of a local peace committee."], ["2009.12.01", "Pakistan", "Swat", 1, 13, "A teen suicide bomber murders a lawmaker inside his home."], ["2009.12.01", "Somalia", "Bosasso", 2, 25, "Suspected hardliners toss a grenade into a movie theater, leaving two patrons dead from shrapnel injury."], ["2009.12.02", "Iraq", "Baghdad", 1, 0, "A civilian is gunned down in a sectarian attack at a cafe."], ["2009.12.02", "Pakistan", "Islamabad", 2, 11, "A young man straps explosives to his body and detonates at the entrance of a naval complex, killing two security guards."], ["2009.12.03", "Ingushetia", "Malgobek", 1, 0, "A government official is assassinated by Islamic militants."], ["2009.12.03", "Iraq", "Baghdad", 1, 6, "Mujahideen blow up a civilian at a market."], ["2009.12.03", "Iraq", "Tikrit", 11, 15, "A Fedayeen suicide bomber blows himself up at a packed market, taking eleven innocents with him."], ["2009.12.03", "Pakistan", "Karol", 1, 0, "A Christian man is shot to death by Muslims after refusing to 'embrace' Islam."], ["2009.12.03", "Somalia", "Mogadishu", 22, 46, "Doctors and students are among twenty-two people blown to bits at a medical school graduation by a Shahid."], ["2009.12.03", "Thailand", "Pattani", 3, 0, "A 17-year-old boy is among three members of a family brutally gunned down in their home by Islamic separatists."], ["2009.12.04", "Dagestan", "Khasavyurt", 2, 7, "A civilian having lunch at a cafe is among two people murdered by Muslim terrorists in separate attacks."], ["2009.12.04", "India", "Srinagar", 0, 0, "Al-Nasireen gunmen assassinate a political leader outside his home."], ["2009.12.04", "Iraq", "Tuz Khormato", 1, 0, "An ethnic minority member is gunned down in his home by Islamic terrorists."], ["2009.12.04", "Jordan", "Amman", 1, 0, "A 34-year-old woman, nine months pregnant, is stabbed to death by her brother over alleged adultery."], ["2009.12.04", "Pakistan", "Mohmand Agency", 6, 13, "Mujahideen bombers take out six members of a wedding party traveling in a mini-bus."], ["2009.12.04", "Pakistan", "Rawalpindi", 40, 86, "Seventeen children at a mosque are among nearly forty people cut down in a barbaric shooting and bombing attack by Sunni hardliners."], ["2009.12.04", "USA", "Binghamton, NY", 1, 0, "A non-Muslim Islamic studies professor is stabbed to death by a Muslim grad student in revenge for 'persecuted' Muslims."], ["2009.12.05", "Iraq", "Mosul", 5, 1, "Mujahideen shoot five people to death including a mother and an elderly civilian."], ["2009.12.05", "Philippines", "Jolo", 1, 12, "One person is killed when suspected Abu Sayyaf militants set off a bomb."], ["2009.12.06", "Iraq", "Abu Ghraib", 4, 0, "Four local police manning a checkpoint are machine-gunned to death at point-blank range."], ["2009.12.06", "Pakistan", "Bajaur", 2, 2, "The Taliban murder two tribesmen outside a mosque."], ["2009.12.06", "Somalia", "Bosaso", 1, 0, "A cleric is assassinated by suspected Islamic militia."], ["2009.12.07", "India", "Baramulla", 1, 0, "Muslim terrorists gun down a political worker outside his home."], ["2009.12.07", "Iraq", "Baghdad", 8, 40, "Seven children are among eight dead when Sunni radicals bomb a Shia school."], ["2009.12.07", "Iraq", "Tarmiyah", 1, 4, "A woman is blown murdered in her home by Mujahid bombers."], ["2009.12.07", "Iraq", "Tarmiyah", 8, 0, "Six Iraqis are gunned down by al-Qaeda.  Two more bodies are discovered in Kirkuk."], ["2009.12.07", "Pakistan", "Karachi", 1, 0, "A Shia leader is shot to death by Sunni rivals."], ["2009.12.07", "Pakistan", "Lahore", 50, 150, "At least fifty people are incinerated by twin bombings at a crowded marketplace."], ["2009.12.07", "Pakistan", "Peshawar", 11, 45, "Eleven people at a courthouse are blown to bits by a Fedayeen suicide bomber."], ["2009.12.07", "Thailand", "Narathiwat", 2, 11, "A Buddhist man and woman are murdered by Muslim bombers at a busy market."], ["2009.12.07", "Thailand", "Pattani", 1, 4, "A pro-government cleric is gunned down by Islamic separatists."], ["2009.12.08", "Iraq", "Baghdad", 127, 448, "Five car bombs, one outside a fine arts center, leave at least one-hundred and twenty Iraqis dead and nearly five hundred more in agony."], ["2009.12.08", "Pakistan", "Multan", 12, 20, "A dozen Pakistanis are blown to bits by Taliban bombers."], ["2009.12.08", "Pal. Auth.", "Jerash", 1, 0, "A man stabs his 30-year-old sister to death over suspected immoral behavior."], ["2009.12.09", "Iraq", "Baghdad", 4, 11, "Two street sweepers are among four Iraqis murdered by Islamic bombers in attacks on a library and minibus."], ["2009.12.09", "Iraq", "Mosul", 2, 0, "Two Christian brothers are kidnapped and shot to death by Muslim terrorists."], ["2009.12.09", "Thailand", "Pattani", 1, 0, "A civilian is shot to death in his car by Muslim militants."], ["2009.12.09", "Thailand", "Yala", 1, 17, "A series of bombs rocks several neighborhoods.  A bomb disposal technician is killed."], ["2009.12.10", "Thailand", "Narathiwat", 3, 8, "Three Buddhist women are torn to shreds by a remote-controlled bomb planted on a motorcycle outside a restaurant."], ["2009.12.11", "Afghanistan", "Paktika", 5, 15, "Five people are blown to bits by a Shahid suicide bomber."], ["2009.12.11", "Iraq", "Baghdad", 1, 3, "Jihadis plant a bomb under a family car, killing the father and injuring three relatives."], ["2009.12.11", "Iraq", "Yusufiyah", 6, 21, "A car bomb near a shop takes out six Iraqis."], ["2009.12.12", "Iraq", "Khalis", 1, 2, "A farmer is shot to death by Islamic militants."], ["2009.12.12", "Iraq", "Kirkuk", 3, 4, "An IED attack leaves three Iraqis dead."], ["2009.12.13", "Iraq", "Fallujah", 2, 15, "Islamic bombers manage to kill two Iraqis with a roadside blast."], ["2009.12.13", "Iraq", "Mosul", 2, 21, "A Fedayeen suicide bomber murders two young police recruits."], ["2009.12.13", "Somalia", "Afgoye", 1, 0, "A 48-year-old man is pelted to death with stones by Hezb al-Islam for adultery."], ["2009.12.13", "Thailand", "Pattani", 2, 0, "Two civilians are shot to death by Islamic militants in separate attacks."], ["2009.12.14", "Afghanistan", "Lashkar Gah", 16, 0, "Sixteen police officers are killed in two terror attacks by Sunni fundamentalists."], ["2009.12.14", "Iraq", "Baghdad", 13, 33, "Jihadi bombers take down thirteen Iraqis with successive blasts."], ["2009.12.14", "Iraq", "Balad Ruz", 22, 29, "A female suicide bomber ends the lives of nearly two-dozen innocent people in a residential area."], ["2009.12.14", "Iraq", "al-Manari", 4, 0, "A man and his family are murdered in their home by suspected al-Qaeda."], ["2009.12.14", "Thailand", "Narathiwat", 1, 0, "Muslims gun down a 38-year-old Buddhist."], ["2009.12.14", "Thailand", "Pattani", 1, 0, "A 37-year-old woman is slashed to death by Muslim radicals."], ["2009.12.14", "Thailand", "Pattani", 2, 0, "Two men are shot to death by Islamic militants, one in his home, the other at a barber shop."], ["2009.12.15", "Afghanistan", "Gardez", 5, 0, "Five people are blown to bits by Jihadi bombers."], ["2009.12.15", "Afghanistan", "Helmand", 2, 0, "Two British soldiers are killed by a suicide bomber as they are walking down a street."], ["2009.12.15", "Afghanistan", "Kabul", 7, 44, "A suicide car bomber takes out seven people standing outside a hotel."], ["2009.12.15", "India", "Shopian", 1, 0, "A 21-year-old woman is gunned down in front of her family by Islamic militants."], ["2009.12.15", "Iraq", "Mosul", 2, 0, "A woman is among two people incinerated by a thermal bomb."], ["2009.12.15", "Iraq", "Mosul", 4, 40, "Four Christians are killed when Islamic bombers target a church and Christian school."], ["2009.12.15", "Iraq", "Nineveh", 3, 0, "Muslim radicals throw grenades into a police patrol, brutally killing three Iraqis."], ["2009.12.15", "Pakistan", "Dera Ghazi Khan", 33, 60, "Thirty-three shoppers at an outdoor market are blown apart by a Fedayeen suicide car bomber."], ["2009.12.15", "Somalia", "Bossasso", 3, 8, "Suspected Islamists blow up a pick-up full of local soldiers, killing three."], ["2009.12.15", "UAE", "Abu Dhabi", 2, 0, "An Arab man stabs two Nepali 'infidels' to death, claiming that he was entitled to do so, as a Muslim."], ["2009.12.16", "Afghanistan", "Herat", 4, 0, "Four local cops are slaughtered by a Taliban roadside blast."], ["2009.12.16", "Iraq", "Baghdad", 2, 5, "Sunni bombers take down two Iraqis riding on a bus."], ["2009.12.16", "Pakistan", "Khyber", 4, 27, "Fundamentalists throw grenades into a music concert, killing at least four people."], ["2009.12.16", "Thailand", "Yala", 3, 0, "Three men are shot to death in separate shooting attacks by Islamic insurgents."], ["2009.12.17", "Afghanistan", "Kandahar", 7, 3, "Five women are among seven people murdered by Taliban roadside bombers."], ["2009.12.17", "Ingushetia", "Nazran", 2, 24, "Children are among the casualties of a suicide bombing.  A separate shooting leaves two dead."], ["2009.12.17", "Iraq", "Baghdad", 1, 10, "A pedestrian is killed by a roadside bomb."], ["2009.12.17", "Iraq", "Mosul", 1, 0, "A 30-year-old Christian man is shot to death in cold blood by Mujahideen."], ["2009.12.17", "Pakistan", "Bara Tehsil", 3, 5, "Three security force personnel are murdered in Taliban ambushes."], ["2009.12.17", "Thailand", "Yala", 2, 0, "A 2-year-old girl is gunned down along with her father by Holy Warriors."], ["2009.12.18", "India", "Pulwama", 2, 0, "Two people are dragged from their homes and murdered by Mujahideen.  One has his throat slit."], ["2009.12.18", "Iraq", "Sulaimaniyah", 1, 0, "A civilian is gunned down on his doorstep by Muslim terrorists."], ["2009.12.18", "Pakistan", "Haripur", 3, 0, "A man and his wife are among three killed in their home by suspected Islamic hardliners."], ["2009.12.18", "Pakistan", "Lower Dir", 15, 28, "Children are among fifteen people blown to bits a mosque by a Shahid suicide bomber."], ["2009.12.18", "Somalia", "Mogadishu", 2, 4, "Two civilians are killed when a mortar fired by suspected Islamic militia strikes a house."], ["2009.12.19", "Iraq", "Mosul", 3, 1, "Jihadi gunmen take down three Iraqis in separate attacks."], ["2009.12.19", "Pakistan", "Poonch", 1, 2, "An Indian border guard is shot by a Muslim sniper from Pakistan."], ["2009.12.19", "Thailand", "Narathiwat", 3, 2, "Three Buddhists are incinerated when Muslim insurgents blow up a gas tank next to their truck."], ["2009.12.20", "Iraq", "Mosul", 2, 0, "Mujahideen gun down two local cops."], ["2009.12.20", "Somalia", "Mogadishu", 1, 3, "One Somali is killed in a mortar attack by Islamic militia."], ["2009.12.21", "Iraq", "Tal Afar", 4, 5, "A Fedayeen suicide bomber takes out four Iraqis."], ["2009.12.21", "Somalia", "Mogadishu", 5, 0, "Five Somalis near a minibus are murdered by al-Shabaab bombers."], ["2009.12.21", "Yemen", "Abyan", 2, 9, "al-Qaeda militants booby-trap an area with explosives, killing two civilians."], ["2009.12.22", "India", "Pampore", 2, 1, "Hizbul Mujahideen militants shoot two local cops to death."], ["2009.12.22", "Iraq", "Iskandariya", 1, 4, "A civilian dies from shrapnel injures after Jihadis detonate a bomb on a minibus."], ["2009.12.22", "Pakistan", "Peshawar", 3, 16, "A woman is among three people at a press club blown to bits by a Shahid suicide bomber."], ["2009.12.22", "Thailand", "Pattani", 1, 0, "A 37-year-old father is shot full of holes by Muslim militants after dropping his children off at school."], ["2009.12.22", "Thailand", "Pattani", 1, 1, "Islamic gunmen fire into a family home, killing a 3-year-old girl and seriously injuring her sister."], ["2009.12.23", "Afghanistan", "Helmand", 3, 4, "Three civilians are killed when fundamentalists detonate a bomb at a bazaar."], ["2009.12.23", "Afghanistan", "Helmand", 3, 5, "Three innocents are cut down by a Taliban bomb planted on a bicycle."], ["2009.12.23", "Afghanistan", "Spin Boldak", 2, 3, "Talibanis take down two civilians with a roadside bomb."], ["2009.12.23", "Iraq", "Baghdad", 5, 46, "Sunni bombers murder five Shia pilgrims in three separate attacks."], ["2009.12.23", "Iraq", "Mosul", 2, 0, "A bomb placed near an ancient Christian church kills two people."], ["2009.12.24", "Afghanistan", "Kandahar", 8, 3, "A Shahid suicide bomber on a horse car murders eight innocent people."], ["2009.12.24", "Afghanistan", "Paktika", 2, 0, "Two civilians are murdered by Jihadi roadside bombers."], ["2009.12.24", "Iraq", "Baghdad", 12, 53, "Jihadis murder a dozen mourners when they bomb two separate funerals."], ["2009.12.24", "Iraq", "Hilla", 25, 105, "A crowded bus station is the target of Sunni bombers, who leave twenty-five Iraqis dead and nearly one hundred more in agony."], ["2009.12.24", "Iraq", "Kirkuk", 4, 0, "Four Iraqis are gunned down by suspected al-Qaeda militants."], ["2009.12.24", "Iraq", "Mosul", 1, 0, "A Christian is gunned down in front of his home by Islamists."], ["2009.12.24", "Israel", "Einav", 1, 0, "An Israeli father of seven is shot to death in his car by Palestinian terrorists."], ["2009.12.24", "Pakistan", "Peshawar", 4, 24, "A suicide bomber detonates near a Christian school, killing four others."], ["2009.12.24", "Pakistan", "Rawalpindi", 1, 2, "A 6-year-old girl is dismembered by a suicide bomber."], ["2009.12.24", "Somalia", "Mogadishu", 6, 25, "Six civilians are killed during an attack by Hizb al-Islam fundamentalists."], ["2009.12.25", "Algeria", "Tizi Ouzou", 1, 2, "A local soldier is murdered by fundamentalist bombers."], ["2009.12.25", "Iraq", "Baghdad", 10, 51, "Ten Shiite pilgrims are murdered in three separate bombing attacks by sectarian rivals."], ["2009.12.25", "Iraq", "Mosul", 3, 0, "Three unarmed census workers are shot to death in cold blood by Sunni insurgents."], ["2009.12.25", "Pakistan", "Kalar Kahar", 0, 60, "About sixty Christians are injured when a Muslim mob attacks them during Christmas prayers."], ["2009.12.25", "Pakistan", "Peshawar", 2, 0, "Islamists gun down two local cops."], ["2009.12.26", "Iraq", "Baghdad", 6, 22, "Two bombs, one near a tent distributing food to Shia pilgrims, leave six Iraqis dead."], ["2009.12.26", "Pakistan", "Karachi", 0, 26, "Shiite radicals are suspected of detonating a roadside bomb that injures some twenty-six people at a funeral."], ["2009.12.26", "Pakistan", "Punjab", 0, 2, "Two young Christians are shot in the chest after refusing to convert to Islam."], ["2009.12.26", "Thailand", "Pattani", 1, 0, "A man is murdered in front of his home by Muslim separatists."], ["2009.12.27", "Iran", "Tehran", 9, 60, "Basij militia and Islamic state police fire into a crowd of protesters, killing at least nine."], ["2009.12.27", "Iraq", "Touz Khormato", 5, 25, "Five Shia pilgrims are blown to bits by Sunni terrorists."], ["2009.12.27", "Pakistan", "Muzaffarabad", 15, 100, "A Shahid suicide bomber blows himself up at a rival mosque, taking at least fifteen innocents with him."], ["2009.12.27", "Pakistan", "Sadda", 6, 0, "Islamic fundamentalists blow up a family home, killing six occupants, including five young children."], ["2009.12.27", "Thailand", "Yala", 2, 1, "Islamists shoot two men to death as they are riding a motorcycle."], ["2009.12.28", "Afghanistan", "Badghis", 2, 3, "Two local cops are murdered in a Taliban ambush."], ["2009.12.28", "Iraq", "Mosul", 2, 0, "Jihadi gunmen take down two cement workers."], ["2009.12.28", "Nigeria", "Bauchi", 3, 12, "At least three security forces are killed during attacks by a local Islamist sect."], ["2009.12.28", "Pakistan", "Chamarkand", 2, 5, "Two local soldiers are killed in a Taliban rocket attack on their checkpoint."], ["2009.12.28", "Pakistan", "Karachi", 45, 82, "More than forty people in a religious procession are sent straight to Allah by a Fedayeen suicide bomber."], ["2009.12.28", "Pakistan", "Orakzai", 9, 6, "Taliban hardliners assault a village, killing nine defense volunteers."], ["2009.12.28", "Somalia", "Gedo", 1, 0, "Islamic militia are suspected of murdered a humanitarian worker in his home."], ["2009.12.29", "Afghanistan", "Herat", 1, 2, "A terrorist in an Afghan army uniform opens fire on three unsuspecting NATO soldiers, killing one."], ["2009.12.29", "Iraq", "Baghdad", 4, 18, "Two woman are among four Iraqis murdered in two Jihad attacks."], ["2009.12.29", "Iraq", "Tal Massoud", 5, 0, "Four people are shot to death and one beheaded by suspected al-Qaeda elements."], ["2009.12.29", "Pakistan", "Lahore", 2, 0, "A man slits his daughter's throat, and stabs her lover to death, over a suspected illicit affair."], ["2009.12.29", "Thailand", "Pattani", 1, 0, "A 45-year-old man is gunned down in his pickup truck by Islamic radicals."], ["2009.12.29", "Thailand", "Pattani", 1, 0, "A 49-year-old man is shot to death by militant Muslims at a tea shop."], ["2009.12.30", "Afghanistan", "Kandahar", 5, 0, "A female reporter is among five Canadians killed by a Taliban roadside bomb."], ["2009.12.30", "Afghanistan", "Khost", 8, 6, "Eight American civilians are murdered by a Shahid suicide bomber at a gymnasium."], ["2009.12.30", "India", "Baramulla", 4, 0, "Hizb-ul-Mujahideen gunmen open up on four Indian cops at point-blank range, leaving all four dead."], ["2009.12.30", "Iraq", "Khalis", 7, 25, "Dedicated Sunnis bomb a Shia religious festival, leaving seven dead."], ["2009.12.30", "Iraq", "Ramadi", 27, 105, "Twin suicide blasts take down over twenty-five Iraqis and leave over one hundred others with injuries, including lost limbs."], ["2009.12.30", "Pakistan", "Bajaur", 1, 0, "A tribal elder is brutally murdered by the Taliban and dropped by the roadside."], ["2009.12.30", "Thailand", "Narathiwat", 3, 0, "A Buddhist civilian is among three people killed in an Islamist drive-by shooting."], ["2009.12.30", "Thailand", "Pattani", 1, 0, "Muslim gunmen take out a civilian as he is driving home."], ["2009.12.30", "Thailand", "Pattani", 2, 0, "Two volunteers guarding teachers are taken down in a Mujahideen bombing."], ["2009.12.31", "Afghanistan", "Uruzgan", 6, 0, "Six civilians are beheaded by Islamic hardliners."], ["2009.12.31", "Pakistan", "Kalat", 2, 2, "Two oil truck drivers are shot to death by Muslim radicals."], ["2009.12.31", "Thailand", "Yala", 2, 0, "Two civilians riding a motorbike are shot to death by Islamic militants."]], "columns": ["Date", "Country", "City", "Killed", "Injured", "Description"], "year": 2009}