{"rows": [["2006.01.01", "Thailand", "Narathiwat", 2, 3, "Two people are killed in a bomb blast staged by Islamic militants. Three others are injured."], ["2006.01.02", "Chechnya", "Kurchaloi", 2, 0, "Two Russian guards are killed by Jihadi snipers."], ["2006.01.02", "India", "Khog", 1, 0, "An 18-year-old Hindu is kidnapped by militant Muslims and tortured to death."], ["2006.01.02", "Iraq", "Baqubah", 7, 13, "A Fedayeen suicide bomber rams his car into a bus carrying police recruits, killing seven and injuring thirteen."], ["2006.01.02", "Iraq", "Iskandariya", 3, 0, "Three more civilians are killed by Muslim radicals in a drive-by shooting."], ["2006.01.02", "Iraq", "Kirkuk", 2, 2, "Two children, ages 7 and 10, are killed by Jihadi gunmen in an attack that also injures their parents."], ["2006.01.02", "Thailand", "Yala", 1, 3, "Islamic militants attack four Thai soldiers, capturing and beheading one of them."], ["2006.01.03", "Afghanistan", "Helmand", 1, 0, "Two Taliban members shoot a humanitarian aid worker in the back of the head as he is kneeling in prayer."], ["2006.01.03", "India", "Bumloora", 1, 0, "A civilian is abducted from his job site and hanged by the Mujahideen."], ["2006.01.03", "Thailand", "Narathiwat", 1, 0, "A militant Muslim assassinates a village headsman outside his home with an automatic rifle."], ["2006.01.04", "Afghanistan", "Qalat", 1, 0, "The Taliban kill the headmaster of a school by cutting off his head in front of his wife and eight children."], ["2006.01.04", "Iraq", "Baghdad", 3, 13, "Three civilians are killed and thirteen others injured by a terrorist car bombing on a city street."], ["2006.01.04", "Iraq", "Baghdad", 4, 0, "An oil company employee and his son are shot to death in a Jihad attack.  Two other bodies found executed in Mahawil."], ["2006.01.04", "Iraq", "Baghdad", 8, 12, "At least eight civilians are killed and twelve injured when radical Sunnis detonate a bomb near a market."], ["2006.01.04", "Iraq", "Kirkuk", 2, 2, "Two civilians are killed by a roadside terror bombing."], ["2006.01.04", "Iraq", "Muqdadiyah", 36, 40, "Nearly forty people are blown to bits by a Fedayeen suicide bomber at a Shiite funeral for a child.  At least forty more suffer various injury and lost limbs."], ["2006.01.04", "Russia", "Gimry", 1, 8, "One Russian is killed by Chechen Mujahideen who infiltrated the border."], ["2006.01.04", "Thailand", "Sungai Padi", 1, 0, "A 51-year-old man is gunned down by Islamic radicals as he is eating breakfast in a tea shop."], ["2006.01.05", "Afghanistan", "Tarin Kot", 10, 50, "Two children are among ten people murdered by an Islamic suicide bomber in a crowded area of the capital.  Fifty others are injured."], ["2006.01.05", "Iraq", "Baghdad", 15, 14, "Four bombs, two of them suicide attacks in Baghdad, leave four people dead in the capital and Najaf.  Four policemen are also killed by Jihad gunmen in Baqubah and seven U.S. soldiers are killed in two terror attacks."], ["2006.01.05", "Iraq", "Karbala", 53, 148, "A Sunni suicide bomber targets a Shia shrine, killing more than sixty innocent souls and injuring seventy more.  Women and children are amply represented among the victims."], ["2006.01.05", "Iraq", "Ramadi", 82, 70, "Eighty people waiting in line to apply for jobs at a recruiting station are blown to bits by a religious fanatic.  Another seventy are injured."], ["2006.01.05", "Yemen", "Al Salem", 2, 0, "Two Yemeni troops are killed in an ambush by radical Islamists."], ["2006.01.06", "Yemen", "Saada", 4, 2, "Four civilians are killed, and two injured, in a mortar attack by armed fundamentalists."], ["2006.01.07", "Afghanistan", "Jalalabad", 1, 1, "A terrorist bombing by the Taliban leaves one civilian dead and another person injured."], ["2006.01.07", "Algeria", "Tissemsilt", 4, 0, "Four civilian employees of a state water company are killed by the Salafist Group for Preaching and Combat."], ["2006.01.07", "Iraq", "Baghdad", 1, 1, "An American journalist is taken hostage, and her Iraqi translator murdered."], ["2006.01.07", "Iraq", "Fallujah", 1, 9, "A doctor is gunned down by Jihadis.  Elsewhere, a suicide bomber injures nine people."], ["2006.01.07", "Pakistan", "Kai Kot", 5, 0, "A family is massacred by the Taliban.  The dead include a young girl."], ["2006.01.07", "Pakistan", "Miranshah", 8, 6, "Eight soldiers are massacred by religious militants at a border checkpoint."], ["2006.01.07", "Pakistan", "Wana", 1, 1, "A 6-year-old boy is killed by a bomb that also injures an 8-year-old."], ["2006.01.07", "Thailand", "Pattani", 1, 3, "Islamic militants kill a pig farmer and also fire on a family of foreigners, injuring three, including a baby."], ["2006.01.07", "Thailand", "Yala", 2, 3, "Two policemen are murdered by Islamic fundamentalists.  Separately, a bomb at a tea shop injures three people."], ["2006.01.07", "Thailand", "Yala", 2, 4, "A grocery store is shot up by Muslim radicals.  Two people in their 20's are killed and four others injured."], ["2006.01.08", "Iraq", "Baghdad", 2, 5, "A Fedayeen suicide bomber kills two Iraqis and injures five others outside a mosque."], ["2006.01.09", "India", "Awantipora", 1, 0, "The Mujahideen abduct a man from his home and shoot him to death."], ["2006.01.09", "Iraq", "Baghdad", 29, 21, "Two Fedayeen suicide bomber maximize their killing power and send themselves and dozens of others to Allah at a government building."], ["2006.01.09", "Iraq", "Kirkuk", 1, 0, "Ansar al-Sunna terrorists gun down a judge."], ["2006.01.09", "Thailand", "Pattani", 1, 0, "The burnt body of a 74-year-old Buddhist is found after he is murdered by Islamic radicals, who beat the elderly man severely before slashing his throat."], ["2006.01.09", "Thailand", "Yala", 1, 0, "Muslim radicals shoot a 60-year-old Buddhist three times in the neck after vowing to 'keep killing innocents'."], ["2006.01.10", "Pakistan", "Sarbandki", 7, 2, "al-Qaeda backed militants kill seven Pakistani soldiers in a rocket attack."], ["2006.01.11", "India", "Udhampur", 1, 2, "A teenage girl is killed when militants hurl a grenade into her home on Eid day.  Two other relatives are injured."], ["2006.01.11", "Philippines", "Maguindanao", 1, 1, "The Moro Islamic Front is suspected in the assassination of a local sultan."], ["2006.01.13", "Iraq", "Baqubah", 3, 5, "Two policemen are killed by a car bomb.  Another dead officer is found in Iskandariya, blindfolded and with hands tied behind his back."], ["2006.01.14", "Afghanistan", "Kandahar", 1, 0, "The Taliban assassinate a political figure outside his home."], ["2006.01.14", "Afghanistan", "Khost", 0, 22, "Religious fundamentalists bomb a sporting event and a music shop, injuring twenty-two."], ["2006.01.14", "Iraq", "Baghdad", 3, 4, "Sunni gunmen assassinate a Shiite cleric.  Elsewhere, a bomb kills two policemen."], ["2006.01.14", "Pakistan", "Sarband", 1, 2, "al-Qaeda backed militants fire a rocket into a home, killing a man and injuring his two children."], ["2006.01.14", "Pakistan", "Sarbandki", 1, 3, "A rocket attack leaves one man dead and three children injured."], ["2006.01.15", "Afghanistan", "Kandahar", 3, 14, "At least three people are killed, including two civilians, when a suicide bomber rams a Canadian convoy."], ["2006.01.15", "India", "Kashmir Valley", 1, 0, "A contractor is abducted and killed by the Mujahideen."], ["2006.01.15", "Iraq", "Ulwiya", 6, 8, "Five separate Jihad attacks and kidnappings leave at least six dead around the country."], ["2006.01.15", "Pakistan", "Jangzai", 2, 0, "Two men are killed in a landmine blast."], ["2006.01.15", "Thailand", "Narathiwat", 2, 0, "Islamists butcher two 20-year-old men in a gruesome attack."], ["2006.01.16", "Afghanistan", "Kandahar", 5, 10, "Five people are killed and ten others injured by a \"Holy Warrior\" suicide bomber."], ["2006.01.16", "Afghanistan", "Spin Boldak", 22, 20, "A Fedayeen bomber plows an explosives-laden motorbike into a crowd of people in a downtown area, killing at least twenty-two."], ["2006.01.16", "Chechnya", "Grozny", 1, 3, "A policeman is killed by Jihadis."], ["2006.01.16", "India", "Kulgam", 2, 1, "Islamic radicals gun down two political activists in separate attacks."], ["2006.01.16", "Iraq", "Miqdadia", 6, 18, "A Jihad car bombing kills six, including a child, and injures eighteen."], ["2006.01.16", "Iraq", "Ramadi", 1, 0, "A physics professor is gunned down in a brutal attack."], ["2006.01.17", "Chechnya", "Grozny", 5, 0, "Four Russians and one Chechen are blown apart in a landmine attack by Muslim rebels."], ["2006.01.17", "Iraq", "Kirkuk", 2, 1, "Radical Sunni gunmen kill two Kurdish election officials in separate attacks."], ["2006.01.18", "India", "Pampore", 1, 0, "The body of a civilian is recovered ten days after being abducted by the Mujahideen."], ["2006.01.18", "Iraq", "Baghdad", 3, 0, "Sunni radicals infiltrate an office building and murder three men."], ["2006.01.18", "Iraq", "Baghdad", 12, 2, "Jihadis ambush a private convoy, blasting and shooting twelve guards and bystanders to death and kidnapping two African engineers."], ["2006.01.18", "Iraq", "Basra", 2, 1, "Two American civilians are killed in a roadside terrorist bombing."], ["2006.01.18", "Iraq", "al-Sa'diya", 5, 9, "Four people are killed in a terror bombing attack on a police vehicle."], ["2006.01.19", "Egypt", "Udaysaat", 2, 14, "Muslims go on a rampage against Christians, angered by the construction of a church.  Two, including a 13-year-old boy, are killed."], ["2006.01.19", "India", "Khrew Pampore", 1, 0, "A civilian is shot to death by the Mujahideen at his village."], ["2006.01.19", "Iraq", "Baghdad", 23, 26, "Two religious extremists hit a coffee shop in a downtown area with suicide bombs, dismembering themselves and twenty-three innocents while causing egregious injury to two dozen others."], ["2006.01.19", "Iraq", "Dujail", 12, 0, "Twelve civilians are machine-gunned to death by radical Sunnis after their cars were stopped at a fake roadblock."], ["2006.01.19", "Israel", "Tel Aviv", 0, 20, "A Palestinian suicide bomber injures two dozen Israelis in an attack on a fast-food stall at a bus station."], ["2006.01.20", "Indonesia", "Waghete", 4, 1, "Indonesian soldiers kill four unarmed Papua teenagers (ages 13 to 15) in an unprovoked attack as they are walking to school.  A fifth boy is severely beaten."], ["2006.01.20", "Ingushetia", "Nazran", 2, 2, "Two civilians are killed by Islamic terrorists in a small village."], ["2006.01.20", "Ingushetia", "Ordzhonikidzevskaya", 1, 2, "Suspected Islamists invade the home of a civilian, killing him and injuring his wife and son."], ["2006.01.20", "Iraq", "Baghdad", 1, 0, "A homosexual is shot to death by Islamic extremists."], ["2006.01.20", "Iraq", "Baghdad", 6, 3, "Four civilians are killed in a roadside bomb and two other people are gunned down by Muslim radicals in separate Karbala attacks."], ["2006.01.20", "Iraq", "Dujail", 9, 0, "The bodies of seven civilians are found bound and executed where two others were found days earlier."], ["2006.01.20", "Thailand", "Narathiwat", 1, 0, "A 63-year-old farmer is killed when a bomb planted at the base of a cell tower explodes."], ["2006.01.21", "Afghanistan", "Ghazni", 1, 1, "A policeman is killed in a Taliban ambush."], ["2006.01.21", "India", "Budshah Chowk", 0, 7, "Seven people are injured in a Mujahideen grenade attack."], ["2006.01.21", "Iraq", "Baghdad", 3, 0, "Three butchers standing on a corner are mowed down in a drive-by shooting by radical Muslims."], ["2006.01.21", "Iraq", "Tikrit", 6, 9, "Six people, including a child, are killed in four separate Jihad attacks across the country."], ["2006.01.21", "Pakistan", "Angoor Adda", 4, 2, "Four civilians die when militants hit a food store with a rocket."], ["2006.01.22", "Iraq", "Balad Ruz", 5, 1, "Four children (ages 6 to 11) and a man are killed when Islamic insurgents deliberately fire a rocket into a home."], ["2006.01.22", "Iraq", "Baqubah", 12, 16, "A suicide car bombing, two brutal kidnappings (including a man and his son) and a roadside terror attack leave twelve people dead across the country."], ["2006.01.22", "Iraq", "Mashahidah", 23, 0, "The bodies of twenty-three police recruits are found bound and executed, days after they were forced off a bus at gunpoint by Sunni terrorists."], ["2006.01.23", "Iraq", "Baghdad", 3, 20, "A Fedayeen suicide car bomber kills two civilians.  Another civilian is killed, and over a dozen wounded in two other car bombings."], ["2006.01.24", "Iran", "Ahvaz", 8, 46, "At least eight people are killed by two bombs in an Iranian city.  Some forty-six are injured in the sectarian attack."], ["2006.01.24", "Iraq", "Dujail", 11, 3, "The bodies of eight police recruits are found.  Two separate Jihad attacks claim three more lives elsewhere."], ["2006.01.25", "Afghanistan", "Gomal", 2, 2, "Taliban militants attack a remote police post with rockets, killing two and injuring two."], ["2006.01.25", "Bangladesh", "Meherpur", 2, 9, "Jama'atul Mujahideen terrorists kill a Hindu woman and her daughter at a memorial service for her dead father by throwing two bombs at them.  Nine others were injured."], ["2006.01.25", "Tajikistan", "Ghayroghum", 1, 0, "Uzbeki Islamic Movement terrorists kill a prison warden to free a comrade."], ["2006.01.26", "Iraq", "Baghdad", 12, 7, "Jihadis kill at least ten people in five separate attacks, along with two bodies found bound and blindfolded a day earlier."], ["2006.01.26", "Iraq", "Balad", 3, 1, "Terrorists attempt an assassination, killing three bodyguards instead."], ["2006.01.27", "Afghanistan", "Helmand", 2, 2, "Religious extremists kill two policemen with a roadside bomb."], ["2006.01.27", "India", "Tral", 1, 0, "A policeman is killed in a Mujahideen mine attack."], ["2006.01.28", "India", "Poonch", 2, 2, "Two army personnel are killed by Lashkar-e-Toiba and Jaish-e-Mohammed terrorists, who infiltrated the border."], ["2006.01.28", "Iraq", "Fallujah", 7, 9, "Five separate Jihad attacks leave seven people dead and nine others injured."], ["2006.01.28", "Iraq", "Karbala", 6, 0, "Six bodies are found bound, blindfolded and executed in a garbage dump."], ["2006.01.29", "India", "Kanjikullah", 1, 0, "A policeman is abducted and murdered by the Mujahideen."], ["2006.01.29", "Iraq", "Iskandariya", 11, 5, "Radical Sunnis plant a bomb outside a shop in a Shia town, blowing at least ten people into disparate parts."], ["2006.01.29", "Iraq", "Kirkuk", 3, 11, "Muslims target Christian churches with six car bombs, killing at least three people and injuring eleven."], ["2006.01.29", "Iraq", "Ojah", 4, 6, "A Fedayeen suicide bomber blows himself to Allah, taking several innocents along with him."], ["2006.01.29", "Philippines", "Pulunoling", 2, 0, "Muslims shoot a Christian couple to death as they are riding a motorcycle on their way home."], ["2006.01.29", "Thailand", "Narathiwat", 2, 0, "Islamic militants open fire on a railway station, killing two guards."], ["2006.01.29", "Thailand", "Pattani", 1, 0, "A 38-year-old schoolteacher is killed by Muslim radicals while walking home from work."], ["2006.01.29", "Thailand", "Pattani", 1, 0, "Muslim terrorists shoot a 41-year-old government official to death in his home."], ["2006.01.30", "Pakistan", "Miranshah", 2, 11, "Two Pakistani soldiers are killed by an al-Qaeda landmine."], ["2006.01.31", "Iraq", "Baghdad", 1, 0, "A baker is killed by Islamic radicals in his shop."], ["2006.01.31", "Iraq", "Baghdad", 14, 0, "The bodies of fourteen young people are found blindfolded, bound and executed at two separate sites."], ["2006.01.31", "Iraq", "Muqdadiyah", 4, 0, "Jihadis kill the wife and two sons of a religious cleric in their home."], ["2006.02.01", "Iraq", "Baghdad", 8, 0, "Sunni insurgents kill at least eight people in four separate terror attacks around the country."], ["2006.02.01", "Iraq", "Baghdad", 8, 50, "A Fedayeen bomber kills eight men waiting for work next to a crowded intersection.  At least fifty others are in various states of physical agony from the blast."], ["2006.02.01", "Philippines", "Jolo", 2, 0, "A man and his son are gunned down on their way home by Islamists."], ["2006.02.01", "Thailand", "Pattani", 1, 0, "Muslims stab a 63-year-old Buddhist man to death as he is working his rubber plantation."], ["2006.02.02", "Afghanistan", "Khost", 5, 3, "The Taliban send a Fedayeen suicide bomber to kill three Afghan soldiers and two civilians at a checkpoint."], ["2006.02.02", "Iraq", "Baghdad", 16, 90, "Sixteen people are killed in two Islamic terror bombings.  One shrapnel bomb detonated at a gas station and the other at a market."], ["2006.02.02", "Iraq", "Baghdad", 19, 11, "The bodies of fourteen men, blindfolded and tortured, are discovered.  Sectarian violence also claims five other lives in five additional attacks around the country."], ["2006.02.02", "Russia", "Vladikavkaz", 2, 16, "Muslim separatists are suspected to be behind three bombings at gambling establishments that kill a young man and woman."], ["2006.02.02", "Thailand", "Janae", 1, 5, "A Buddhist policeman is killed when Islamic radicals attempt to kill a group of teachers under escort in a motorcade with a bomb hidden in a fire extinguisher."], ["2006.02.02", "Thailand", "Narathiwat", 2, 1, "Islamists kill a village chief's driver and deputy with a shrapnel bomb hidden under their vehicle."], ["2006.02.02", "Thailand", "Pattani", 1, 0, "A 42-year-old wood trader is gunned down by Muslim terrorists."], ["2006.02.03", "Afghanistan", "Helmand", 3, 13, "Three policemen are killed and thirteen injured in a series of Taliban ambushes."], ["2006.02.03", "Bangladesh", "Rajshahi", 1, 0, "A university professor is murdered after receiving death threats from Islamic fundamentalists."], ["2006.02.03", "Iraq", "Hawija", 1, 0, "In a heinous attack, Sunni extremists kill an Iraqi translator."], ["2006.02.03", "Philippines", "Patikul", 6, 5, "Islamists massacre a family of Christians after confirming their religious identity.  The victims included an infant and other young children."], ["2006.02.03", "Thailand", "Songkhla", 1, 4, "A Buddhist teacher is gunned down by Muslim militants and four others are wounded in a separate attack on teachers."], ["2006.02.04", "Afghanistan", "Helmand", 5, 0, "Two overnight attacks by religious extremists leave at least five people dead, including a district chief."], ["2006.02.04", "Afghanistan", "Kandahar", 2, 3, "A woman and her child are killed in a Taliban remote-control bomb attack on a city street."], ["2006.02.04", "Afghanistan", "Nish", 6, 5, "Six policemen are killed when Islamic fundamentalists set off a landmine under their vehicle."], ["2006.02.04", "India", "Sarhuti", 1, 0, "Hizb-ul-Mujahideen  behead a young man."], ["2006.02.04", "Iraq", "Nasiriyah", 3, 0, "A Sunni radical fires into a crowd of Shiites marching in a procession, killing three."], ["2006.02.04", "Pakistan", "Bahawalpur", 2, 27, "Two people are killed in a train crash resulting from an act of sabotage by suspected Islamists."], ["2006.02.04", "Pakistan", "Zarmilan", 3, 1, "al-Qaeda militants detonate a bomb under a truck, killing three Pakistanis."], ["2006.02.04", "Thailand", "Yala", 1, 32, "Thirty-three people are injured by a mobile-phone bombing at a cafe, including a teenager who succumbs to injuries two days later."], ["2006.02.05", "India", "Baramulla", 1, 0, "A civilian is murdered by the Mujahideen."], ["2006.02.05", "Iraq", "Baghdad", 6, 12, "Six people are killed in four separate attacks by Jihadis, including two men who were tortured to death."], ["2006.02.05", "Iraq", "Salman Pak", 2, 7, "Two people are killed, and seven wounded by a car bomb along a city street."], ["2006.02.05", "Israel", "Petach Tikva", 1, 4, "A Palestinian stabs an Israeli woman to death as she is riding a bus.  Four others were stabbed as well."], ["2006.02.05", "Pakistan", "Quetta", 12, 13, "A dozen people are blown to bits when Taliban terrorists bomb a passenger bus."], ["2006.02.05", "Turkey", "Trabzon", 1, 0, "A Catholic priest is murdered by an assailant who shouts 'Allah Akbar!' after he fires the gun."], ["2006.02.06", "India", "Amirabad Tral", 1, 0, "Muslim terrorists gun down a policeman."], ["2006.02.06", "India", "Gursai", 1, 0, "Muslim terrorists abduct a civilian from his home and murder him in captivity."], ["2006.02.06", "Iraq", "Dujail", 4, 0, "The body of an Iraqi contractor is found, and three other people are killed in two separate Jihad attacks."], ["2006.02.06", "Thailand", "Banangstar", 3, 0, "Three villagers are shot to death by Muslim militants in a heinous attack on a market."], ["2006.02.06", "Thailand", "Narathiwat", 1, 0, "Muslims kill a 71-year-old Buddhist as he is on his way home with his 16-year-old granddaughter."], ["2006.02.07", "Afghanistan", "Bala Buluk", 4, 3, "Two engineers working on road construction are killed by religious extremists in a bomb attack, along with two Afghans."], ["2006.02.07", "Afghanistan", "Kandahar", 13, 11, "A Fedayeen suicide bomber drives an explosives-laden motorbike into a crowd near a police post, killing at least thirteen."], ["2006.02.07", "Iraq", "Baghdad", 8, 23, "Seven civilians are among eight people blown to bits by two terrorist bombings along a crowded roadside."], ["2006.02.07", "Iraq", "Yusufiyah", 7, 4, "Seven people are killed in at least three separate attacks around the country by Jihad terrorists."], ["2006.02.07", "Thailand", "Narathiwat", 1, 0, "A Buddhist is shot in the head at close range by Muslims while on his way home."], ["2006.02.08", "Iraq", "Ramadi", 5, 3, "Three civilians are among five people killed when a Fedayeen suicide bomber rams a checkpoint with a car."], ["2006.02.08", "Pakistan", "Dabkot", 1, 0, "Local Islamists abduct and behead a man, leaving the body with a note attached."], ["2006.02.09", "Afghanistan", "Herat", 5, 27, "At least five people die in religious violence after Sunnis accuse Shias of destroying a sacred flag."], ["2006.02.09", "India", "Kither", 2, 0, "A woman is among two people killed in an ambush by Muslim terrorists."], ["2006.02.09", "Iraq", "Baghdad", 4, 2, "Jihadi gunmen kill four people in three separate attacks, including two who were murdered in captivity."], ["2006.02.09", "Pakistan", "Hangu", 31, 50, "Some 31 Shiites are blown to bits while celebrating a religious holiday by a suicidal Sunni extremist.  The dead include women and children."], ["2006.02.10", "Afghanistan", "Kunar", 8, 6, "Eight Afghan soldiers are killed by two Taliban landmines, the second designed to kill those trying to help the first."], ["2006.02.10", "India", "Gursai", 1, 0, "A civilian is abducted and hanged to death by the Mujahideen."], ["2006.02.10", "Iraq", "Baghdad", 1, 2, "A brutal shooting attack in which a Fedayeen holds a gun to a woman's head before killing her."], ["2006.02.10", "Iraq", "Baghdad", 9, 38, "A grisly scene as nine people are killed at a Shiite mosque by a car bomb detonated by radical Sunnis.  Nearly forty others were injured."], ["2006.02.10", "Iraq", "Baqubah", 4, 2, "Four people are killed in three separate Jihad attacks, including a woman inside her home."], ["2006.02.10", "Pakistan", "Sangsilla", 3, 4, "Three members of a family, including two women, are blown apart in a roadside bomb blast."], ["2006.02.10", "Pakistan", "Sydan Banda", 4, 2, "A woman is among four people killed when radicals open fire on a train in a sectarian attack."], ["2006.02.10", "Philippines", "Jolo", 2, 0, "Militant Muslims shoot a policeman in the head in front of a bakery.  The same group beheaded another man in a separate attack in the same area."], ["2006.02.10", "Philippines", "Sulu", 1, 0, "Abu Sayyaf terrorists kill a police chief in front of his family."], ["2006.02.11", "India", "Shedgam", 1, 0, "Muslim radicals kill a civilian outside his home."], ["2006.02.11", "Ingushetia", "Troitskaya", 1, 4, "Islamic militants ambush a troop carrier with automatic weapons, killing one Russian soldier."], ["2006.02.11", "Iraq", "Baqubah", 2, 0, "Radical Sunnis sneak up and shoot two policemen in the head as they are sitting in their car."], ["2006.02.11", "Pakistan", "Hangu", 3, 2, "Three more people, including a 9-year-old boy, are killed in sectarian violence."], ["2006.02.12", "Afghanistan", "Helmand", 8, 0, "Two Afghan soldiers are killed in a Taliban ambush.  Another six are captured and executed in captivity."], ["2006.02.12", "Iraq", "Baghdad", 2, 3, "A child is among two killed by a roadside terror bombing."], ["2006.02.12", "Iraq", "Baghdad", 4, 4, "A Fedayeen suicide bomber kills four people at a checkpoint."], ["2006.02.12", "Iraq", "Kirkuk", 7, 17, "A doctor and a sports director are among seven people gunned down by Jihadis in four separate attacks around the country."], ["2006.02.12", "Iraq", "Mahawil", 6, 0, "The bodies of six people, who were bound and tortured, are found at three separate sites."], ["2006.02.13", "Afghanistan", "Grishk", 7, 0, "Seven policemen are gunned down at a road construction guard post by the Afghan Taliban."], ["2006.02.13", "France", "Saint Genevieve des Bois", 1, 0, "A young Jewish man is kidnapped by a Muslim gang and tortured for three weeks before expiring of his wounds."], ["2006.02.13", "Iraq", "Baghdad", 7, 47, "A Fedayeen suicide bomber standing outside a bank blows himself to Allah, taking at least seven innocent bystanders with him.  Children are among the victims."], ["2006.02.13", "Iraq", "Baqubah", 4, 0, "Sunnis slaughter a family of four Shias sitting in their car, in an automatic weapons attack."], ["2006.02.13", "Pakistan", "Manawan", 1, 0, "A doctor is gunned down outside his clinic."], ["2006.02.14", "India", "Sopore", 1, 5, "Six civilians are injured when a Muslim militant tosses a grenade into the street.  One succumbs to injuries two days later."], ["2006.02.14", "Iraq", "Balad", 11, 1, "A horrible Valentine's day massacre as Sunnis round up a family of Shiites and then machine-gun them to death, including a 5-year-old boy.  Only one other child escaped death."], ["2006.02.14", "Iraq", "Tikrit", 3, 0, "Gunmen kill an Iraqi contractor and, in a separate attack in Baghdad, a man and his son."], ["2006.02.14", "Pakistan", "Peshawar", 1, 0, "An 8-year-old boy is shot in the face by an Islamic activist protesting cartoons."], ["2006.02.15", "Afghanistan", "Nimroz", 1, 4, "An attack by religious fundamentalists kills one policeman and leaves four others injured."], ["2006.02.15", "India", "Bugam Kulgam", 1, 1, "The Mujahideen force their way into a home, then shoot a man to death and injure his brother."], ["2006.02.15", "Iraq", "Baghdad", 4, 0, "Four children, ages 10 to 14, are blown up by Islamic fundamentalists targeting a liquor store as they are walking to school.  Two brothers and their sister were among the four."], ["2006.02.15", "Iraq", "Baghdad", 6, 12, "Two deadly bombing attacks, including one at a university leave six Iraqis dead, as five more bodies are found dumped elsewhere."], ["2006.02.15", "Pakistan", "Hub", 4, 0, "Three Chinese engineers and their Pakistani driver are shot to death in their car by Muslim terrorists."], ["2006.02.15", "UAE", "Fujairah", 1, 0, "A Hindu sailor is beaten to death by Iranian crewmates, angered over Muhammad cartoons."], ["2006.02.16", "Afghanistan", "Farah", 2, 0, "Two Afghani intelligence agents are kidnapped and beheaded by religious extremists."], ["2006.02.16", "Iraq", "Baghdad", 9, 19, "Two car bombs, one near a crowded market, kill seven civilians and injure over a dozen more.  Elsewhere, four bodies are found bound and blindfolded."], ["2006.02.16", "Thailand", "Narathiwat", 1, 0, "Muslim militants murder a policeman assigned to guard teachers from terror attacks."], ["2006.02.17", "India", "Panglar", 1, 1, "The Mujahideen gun down a policeman in a brutal attack that also injures a young girl."], ["2006.02.17", "Iraq", "Baghdad", 12, 4, "Jihadis kill a dozen people in four separate attacks, which included an 18-month-old girl and the kidnapping of a bank manager and his son after slaughtering five bodyguards."], ["2006.02.17", "Thailand", "Narathiwat", 1, 13, "Islamists shoot a Buddhist villager, then detonate a bomb that injures thirteen people investigating the scene."], ["2006.02.17", "Thailand", "Yala", 1, 0, "A security guard at an irrigation plant is murdered by Islamic militants."], ["2006.02.18", "Afghanistan", "Helmand", 3, 0, "A late night attack by the Taliban on a police post leaves three officers dead."], ["2006.02.18", "Iraq", "Baghdad", 7, 4, "Five people are killed in three separate roadside terror attacks as two more kidnap victims are discovered."], ["2006.02.18", "Iraq", "Baqubah", 2, 5, "Two Jihad bombings kill two people and injure five."], ["2006.02.18", "Nigeria", "Maiduguri", 21, 112, "Angry Muslim mobs burn churches and beat Christians to death.  At least sixteen people are killed in the violence."], ["2006.02.18", "Philippines", "Jolo", 2, 22, "Abu Sayyaf bombs a karaoke bar, killing a janitor and injuring about two dozen others.  Another civilian later dies of injuries."], ["2006.02.19", "India", "Srinagar", 1, 0, "A civilian is gunned down in broad daylight by the Mujahideen."], ["2006.02.19", "Iraq", "Baghdad", 2, 4, "Car bombing on a city street followed by a suicide bomber kills two people."], ["2006.02.19", "Iraq", "Kirkuk", 3, 0, "Three policemen are killed by radical Sunnis in a roadside bombing."], ["2006.02.19", "Nigeria", "Borno", 7, 24, "Muslim mobs target Nigerian Christians in a protest against Danish cartoons.  More churches are burned and seven more are killed."], ["2006.02.19", "Thailand", "Narathiwat", 1, 0, "Islamists murder a civilian."], ["2006.02.19", "Thailand", "Yala", 2, 0, "Two people, at least one of whom was Buddhist, are shot to death by Muslim radicals in separate attacks."], ["2006.02.20", "India", "Pattan", 1, 0, "Militant Muslims shoot a civilian to death on a highway."], ["2006.02.20", "Iraq", "Baghdad", 10, 53, "Muslim radicals kill ten people in five deadly attacks around the country."], ["2006.02.20", "Iraq", "Kadhimiya", 12, 9, "A Fedayeen suicide bomber massacres a dozen innocent Shias on a passenger bus.  Survivors suffered horrible burns."], ["2006.02.20", "Iraq", "Mosul", 5, 21, "A Jihadi eats his breakfast at a packed diner, then places a bomb under the counter before walking out.  Five people killed.  Two dozen injured."], ["2006.02.20", "Nigeria", "Maiduguri", 30, 95, "An additional thirty bodies are counted from the Muslim rioting against Christians over the weekend."], ["2006.02.20", "Pakistan", "Eisokhel", 1, 0, "Uzbeki Islamists kill a local tribesman in a terror attack."], ["2006.02.21", "Ingushetia", "Troitskaya", 1, 0, "Suspected Islamists kill a Russian woman with a grenade."], ["2006.02.21", "Iraq", "Baghdad", 22, 28, "Jihadis set off a car bomb at a crowded market, killing at least twenty-two innocents and injuring dozens more."], ["2006.02.21", "Iraq", "Iskandariya", 5, 8, "A roadside bomb destroys a pick-up truck carrying workers to a job site.  Two similar attacks elsewhere take four more lives."], ["2006.02.21", "Nigeria", "Bauchi", 25, 100, "Muslims mobs take out their rage on Christians in yet a third Nigerian state, killing at least twenty-five and injuring over one-hundred in a two-day spree."], ["2006.02.21", "Pakistan", "Angoor Adda", 2, 0, "Islamists shoot two brothers execution-style."], ["2006.02.21", "Thailand", "Yala", 1, 0, "Thai Islamists gun down a border patrolman as he is riding a motorcycle."], ["2006.02.22", "Afghanistan", "Kunduz", 1, 12, "Religious extremists set off a bicycle bomb, killing one civilian and injuring twelve."], ["2006.02.22", "India", "Sopore", 1, 0, "The Mujahideen murder a woman outside her village."], ["2006.02.22", "Iraq", "Baghdad", 6, 12, "Three Sunni clerics are assassinated as Shias go on a mosque-burning  rampage.  Three guards are also killed."], ["2006.02.22", "Iraq", "Baqubah", 6, 0, "Two brothers are among six people gunned down in two separate attacks by radical Sunnis."], ["2006.02.22", "Iraq", "al-Mashrugiya", 3, 4, "Two children and a woman are killed when terrorists set off a bomb near a primary school."], ["2006.02.22", "Pakistan", "Wana", 1, 3, "al-Qaeda supported militants kill a village chief and injure three of his family members."], ["2006.02.22", "Uzbekistan", "Tashkent", 1, 0, "A local Jewish leader and father of four is beaten to death."], ["2006.02.23", "India", "Srinagar", 1, 0, "Islamic terrorists murder a university student."], ["2006.02.23", "Iraq", "Baghdad", 54, 0, "Reprisal from the destruction of a Shiite mosque leaves at least fifty Sunnis dead in random attacks around the capital."], ["2006.02.23", "Iraq", "Baqubah", 21, 31, "A suicide bomber slaughters sixteen people at a market and injures two dozen others.  Five people are killed in a second bombing"], ["2006.02.23", "Iraq", "Basra", 25, 16, "Radical Shias raid a prison and haul away thirteen Sunni prisoners.  At least eleven are executed.  Separate attacks leaves more casualties."], ["2006.02.23", "Iraq", "Nahrawan", 47, 0, "In a horrific crime, 47 demonstrators for peace, ages 20 to 50, are forced from their cars at gunpoint and then machine-gunned to death by Sunni Jihadis."], ["2006.02.23", "Iraq", "Samarrah", 3, 1, "A reporter for the al-Arabiya network is kidnapped, stripped naked, tortured and then brutally murdered by men shouting 'Allah Akbar'."], ["2006.02.23", "Pakistan", "Vehari", 2, 0, "A man shoots his two sisters to death on suspicion that they were having love affairs."], ["2006.02.24", "Afghanistan", "Girishk", 4, 0, "Taliban fundamentalists ambush and kill four Afghan soldiers."], ["2006.02.24", "Iraq", "Latifiya", 3, 2, "Sunni gunmen raid a house in the middle of the night and kill two women and a man.  Two young children are injured in the attack."], ["2006.02.24", "Nigeria", "Kontagora", 9, 27, "Machete-wielding Muslims hack nine Christians apart and set fire to four churches."], ["2006.02.24", "Nigeria", "Potiskum", 4, 12, "At least four Christians are clubbed to death by a Muslim mob, and five churches burned."], ["2006.02.24", "Saudi Arabia", "Abqaiq", 2, 10, "Two oil refinery guards are killed defending the plant against suicide bombers."], ["2006.02.25", "India", "Sarhuti", 1, 0, "Only weeks after the Hizb-ul-Mujahideen beheaded her fiancé, the same group breaks into a young woman's house and shoots her to death."], ["2006.02.25", "Ingushetia", "Ordzhonikidzevskaya", 1, 1, "A woman is killed when a militant throws a hand grenade trough the window of her house."], ["2006.02.25", "Iraq", "Baghdad", 3, 8, "Radicals attack a funeral procession for a journalist, killing at least three people."], ["2006.02.25", "Iraq", "Baghdad", 26, 0, "Twenty-six bodies are found in six locations in the city.  Some showed signs of torture."], ["2006.02.25", "Iraq", "Baqubah", 13, 0, "In a horrible attack, thirteen members of a Shia family (representing three generations) are slaughtered by Sunni gunmen as they are fleeing the violence."], ["2006.02.25", "Iraq", "Karbala", 8, 31, "Eight people are blown apart by a Sunni car bomb at a crowded market.  At least thirty others are injured."], ["2006.02.25", "Thailand", "Pattani", 1, 0, "A Thai soldier is killed after being ambushed by Islamic radicals."], ["2006.02.26", "Afghanistan", "Kabul", 6, 38, "Taliban-led prison uprising leaves six inmates dead and about forty injured."], ["2006.02.26", "Iraq", "Baghdad", 21, 55, "Muslim radicals shoot mortars into residential neighborhoods, killing fifteen Sunnis and three Shias.  Three other bodies are found elsewhere."], ["2006.02.26", "Iraq", "Baqubah", 2, 5, "Jihadis open fire on a group of teenagers playing soccer, killing two boys and injuring five."], ["2006.02.26", "Iraq", "Hilla", 5, 3, "A Muslim terrorist detonates a bomb in a passenger bus at a station, killing at least five people."], ["2006.02.26", "Iraq", "Mosul", 1, 0, "Angry Muslims pull a pediatrician from his office and execute him."], ["2006.02.26", "Pakistan", "Tank", 2, 2, "Two policemen are killed by al-Qaeda militants."], ["2006.02.26", "Thailand", "Pattani", 1, 0, "A local doctor is killed by Islamists while walking home from work."], ["2006.02.27", "India", "Sopore", 1, 0, "The Mujahideen gun down a civilian on the street."], ["2006.02.27", "Iraq", "Baghdad", 11, 17, "Four people are killed in a mortar attack and three more die in a roadside bombing near Kirkuk.  Four bound bodies are found elsewhere."], ["2006.02.27", "Iraq", "Baqubah", 2, 5, "Gunmen kill the owner of a glaze shop and an employee."], ["2006.02.27", "Saudi Arabia", "Riyadh", 2, 3, "Two Filipino oil workers are killed when al-Qaeda militants open fire on Saudi security forces."], ["2006.02.27", "Thailand", "Narathiwat", 2, 0, "Two villagers are gunned down by Islamic terrorists in separate attacks."], ["2006.02.28", "India", "Bijbehara", 1, 0, "Islamic terrorists kill an animal worker."], ["2006.02.28", "Iraq", "Baghdad", 18, 42, "Four separate Jihad bombings leave at least eighteen dead and over forty injured."], ["2006.02.28", "Iraq", "Baghdad", 23, 51, "A Fedayeen suicide bomber joins a line of people waiting for kerosene, then detonates his explosives, killing two dozen innocents and injuring many more."], ["2006.02.28", "Iraq", "Hurriyah", 23, 55, "Religious extremists bomb a Shiite mosque, slaughtering twenty-three innocents and leaving dozens more in various states of agony."], ["2006.02.28", "Iraq", "Tarfaya", 9, 0, "Sunnis roundup and execute nine Shias, leaving their bodies at a dump site."], ["2006.02.28", "Thailand", "Narathiwat", 0, 8, "A bomb hidden in a food market injures eight."], ["2006.03.01", "India", "Baramulla", 2, 0, "Two policemen are murdered by Islamic militants while on street patrol."], ["2006.03.01", "India", "Baramulla", 2, 0, "Two security personnel are gunned down by the Mujahideen."], ["2006.03.01", "India", "Titwan", 1, 0, "The Mujahideen abduct a teenage boy and then behead him in captivity."], ["2006.03.01", "Iraq", "Baghdad", 2, 5, "Radicals kill two family members attending a Shiite funeral."], ["2006.03.01", "Iraq", "Baghdad", 27, 68, "Radical Muslims set off two car bombs in civilian areas.  At least twenty-five people are burned to death or torn apart by shrapnel."], ["2006.03.01", "Iraq", "Kirkuk", 4, 8, "Jihadis ambush a police patrol, killing four officers."], ["2006.03.01", "Iraq", "Mahmudiya", 3, 2, "Terrorists use mortar rounds to kill three members of the same family."], ["2006.03.01", "Israel", "Samaria", 1, 1, "Two Muslims gun down a Jew outside a gas station.  The victim was a father of two."], ["2006.03.01", "Pakistan", "Sergardan Chowk", 1, 0, "The local Taliban kill a civilian and leave his body in the open."], ["2006.03.01", "Thailand", "Narathiwat", 1, 0, "Islamic militants murder a rubber wood trader."], ["2006.03.01", "Thailand", "Yala", 1, 0, "A postman is shot to death by Islamists."], ["2006.03.02", "India", "Tarzoo", 1, 0, "A civilian is murdered by the Mujahideen."], ["2006.03.02", "Iraq", "Baghdad", 8, 14, "Islamic militants bomb a market, slaughtering eight innocents including a child."], ["2006.03.02", "Iraq", "Baghdad", 10, 8, "Five people are killed when Muslim radicals bomb a passenger bus.  Five additional bodies are found elsewhere."], ["2006.03.02", "Iraq", "Basra", 3, 0, "A Sunni cleric is assassinated, and a man and woman are found dead from a separate Shiite attack."], ["2006.03.02", "Iraq", "Mosul", 4, 0, "In a senseless act of violence, gunmen spray a car with machine-gun fire after it left a police academy."], ["2006.03.02", "Iraq", "Tikrit", 6, 3, "Jihadis attack a police checkpoint, killing six officers."], ["2006.03.02", "Pakistan", "Karachi", 4, 51, "A suicide bomber kills four people, including two Americans, outside a hotel."], ["2006.03.03", "India", "Lucknow", 2, 12, "Muslim rioters kill two Hindus and injure a dozen more."], ["2006.03.03", "Iraq", "Nahrawan", 25, 0, "Sunnis attack Shiite laborers at two brick factories, executing twenty-five people with a shot to the forehead.  Among the dead was at least one woman and three children, including a 6-year-old girl."], ["2006.03.03", "Philippines", "Basilan", 1, 4, "Abu Sayyaf suspected in the shooting assassination of a city mayor."], ["2006.03.03", "USA", "Chapel Hill, NC", 0, 9, "Calling it the will of Allah, an Iranian immigrant plows his SUV into a crowd of students as 'retribution' for foreign policy overseas."], ["2006.03.04", "Afghanistan", "Bala Buluk", 1, 0, "Six Taliban terrorists drag a UN engineer from his car and shoot him to death."], ["2006.03.04", "Afghanistan", "Helmand", 1, 0, "Taliban terrorists assassinate a government official with machine-gun fire into his car from motorcycles."], ["2006.03.04", "Afghanistan", "Lashkargah", 5, 0, "Religious extremists kill four Afghan security agents and an electrician with a remote-controlled bomb."], ["2006.03.04", "Afghanistan", "Nakhonak", 1, 2, "One person is killed by a Taliban landmine."], ["2006.03.04", "Iraq", "Baqubah", 1, 8, "Fundamentalists kill a young girl with a bombing of a store that sold musical paraphernalia."], ["2006.03.04", "Iraq", "Gisr Diyala", 7, 20, "Seven people are killed when Jihadis lob a mortar round into a crowded market."], ["2006.03.04", "Iraq", "Kirkuk", 2, 0, "Two Shias are killed inside their mosque by Sunni gunmen."], ["2006.03.04", "Iraq", "Salman Pak", 2, 3, "Two civilians die from injuries received in a car bombing on a city street."], ["2006.03.04", "Pakistan", "Mir Ali", 2, 7, "al-Qaeda backed militants attack a security patrol, killing two Pakistani troops."], ["2006.03.04", "Pakistan", "Quetta", 2, 3, "A Muslim militant throws a grenade at children playing in the street, killing two young girls."], ["2006.03.04", "Thailand", "Sungai Padi", 1, 1, "A 21-year-old man is gunned down in an Islamist attack against him and his teenage sister."], ["2006.03.05", "India", "Baramulla", 1, 0, "A man is gunned down by the Mujahideen at a bus stop."], ["2006.03.05", "India", "Kishtwar", 1, 0, "A civilian is shot to death by the Mujahideen outside his home."], ["2006.03.05", "India", "Pulwama", 0, 26, "Twenty-four civilians and two police are injured when a Jaish-e-Mohammad militant tosses a grenade into the road."], ["2006.03.05", "India", "Srinagar", 2, 3, "Two policemen die when a Jaish-e-Mohammad radical lobs a grenade at their picket."], ["2006.03.05", "Iraq", "Baghdad", 3, 7, "Shia gunmen storm a Sunni mosque, killing three people."], ["2006.03.05", "Iraq", "Baiji", 2, 0, "Religious fundamentalists murder two barbers who were on their way to work."], ["2006.03.06", "Iraq", "Baghdad", 5, 16, "Three Jihad car bombs kill five and injure sixteen."], ["2006.03.06", "Iraq", "Baqubah", 9, 23, "Two girls under the age of 4 are among the six deaths when Sunni radicals detonate a car bomb at a busy market.  Three other people are killed is separate shooting attacks."], ["2006.03.06", "Pakistan", "Barwan", 1, 0, "Islamic militants kidnap and behead a school teacher."], ["2006.03.06", "Pakistan", "Miranshah", 1, 2, "Militants fire a rocket into a house, killing a young woman and injuring two children."], ["2006.03.06", "Thailand", "Pattani", 2, 0, "Two civilians are gunned down by Islamic separatists."], ["2006.03.06", "Thailand", "Pattani", 3, 2, "Radical Muslims storm a Buddhist village and shoot an elderly couple and their neighbor to death, then set fire to their homes."], ["2006.03.07", "Chechnya", "Kurchaloi", 2, 2, "A woman and her 12-year-old son are killed by the Mujahideen in a bomb explosion."], ["2006.03.07", "India", "Handwara", 1, 0, "A woman who suffered injuries when Muslims attacked her on 11/21 finally succumbs.  Elsewhere, the Mujahideen kidnaps a 17-year-old and chops off his fingers."], ["2006.03.07", "India", "Varanasi", 23, 62, "Muslim terrorists (Lashkar-e-Toiba) use a trio of bombs against Hindu civilians at a religious prayer offering.  At least twenty-three innocents are massacred and several dozen injured."], ["2006.03.07", "Iraq", "Baiji", 3, 4, "Three security force members are killed outside an oil refinery in an ambush by Sunni insurgents."], ["2006.03.07", "Iraq", "Baqubah", 4, 5, "Sunni gunmen kill three Shias at a political office.  A separate car bombing kills one civilian."], ["2006.03.07", "Pakistan", "Mirali", 1, 1, "Fundamentalists attack a vehicle, killing one of the occupants."], ["2006.03.07", "Thailand", "Yala", 1, 0, "Islamists behead a 41-year-old plantation worker."], ["2006.03.08", "India", "Awantipora", 1, 0, "An SPO is kidnapped by Islamic militants and killed in captivity."], ["2006.03.08", "India", "Chajru", 1, 0, "A villager is brutally gunned down by the Mujahideen."], ["2006.03.08", "Iraq", "Baghdad", 4, 5, "Two young boys selling gas are among four people killed in two bombings by Jihadis."], ["2006.03.08", "Iraq", "Baghdad", 23, 0, "The bodies of eighteen men are found bound and strangled on a minibus.  Five other bodies are found elsewhere."], ["2006.03.08", "Iraq", "Fallujah", 4, 2, "Islamic terrorists kill four civilians with a remote-controlled bomb."], ["2006.03.08", "Pakistan", "Tabba Takka", 1, 0, "al-Qaeda militants shoot a civilian to death and pin a warning note to his body."], ["2006.03.09", "Algeria", "El Oued", 1, 0, "Armed fundamentalists kill a freed prisoner by spraying his home with automatic weapons fire."], ["2006.03.09", "Iraq", "Baghdad", 8, 15, "Terrorists set off a bomb in front of a hospital and another in a street to kill eight civilians and injure fifteen."], ["2006.03.09", "Iraq", "Mosul", 2, 2, "Religious fundamentalists kill the host of an educational and cultural TV show while on his way to interview poets."], ["2006.03.09", "Pakistan", "Miran Ali", 2, 1, "al-Qaeda backed militants attack a Pakistani checkpoint, killing two soldiers."], ["2006.03.09", "Pakistan", "Ouspas", 1, 0, "The son of a pro-government leader is murdered by the local Taliban."], ["2006.03.09", "Pakistan", "Quetta", 2, 0, "A policemen and his daughter are killed when sectarian radicals toss a bomb into their home."], ["2006.03.09", "Thailand", "Pattani", 1, 0, "A Buddhist man is found murdered with a note on his body from Islamists acknowledging that they are killing the innocent."], ["2006.03.09", "Thailand", "Yala", 1, 0, "Islamists gun down a Buddhist outside his home."], ["2006.03.10", "Dagestan", "Makhachkala", 1, 1, "Radicals plant a bomb under the car of a government official, killing him and badly injuring his driver."], ["2006.03.10", "England", "Birmingham", 1, 0, "A 6-year-old is burned to death when two Muslims burn down her family's house in an attempted honor killing."], ["2006.03.10", "Iraq", "Baghdad", 6, 0, "Six bodies are found bound and executed."], ["2006.03.10", "Iraq", "Fallujah", 11, 0, "Eleven people are killed by a suicide truck bomber at an intersection."], ["2006.03.10", "Iraq", "Kirkuk", 1, 14, "A civilian is killed by gunmen, and another ten injured.  Jihadis also kidnap four women."], ["2006.03.10", "Iraq", "Samarra", 3, 5, "Two car bombings leave three civilians dead."], ["2006.03.10", "Nigeria", "Kaduna", 1, 1, "Angry Muslims shoot into the house of an Anglican bishop, killing one person and injuring another."], ["2006.03.10", "Pakistan", "Jandola", 1, 0, "Islamic fundamentalists murder a man, then circulate pamphlets as a warning to others."], ["2006.03.10", "Pakistan", "Quetta", 28, 5, "Twenty-eight people traveling to a wedding party are blown to bits by a landmine suspected to have been planted by the Taliban."], ["2006.03.10", "Sudan", "Graida", 27, 23, "The Islamic government targets six villages, killing at least twenty-seven people and injuring dozens more including women and children."], ["2006.03.10", "Turkey", "Van", 2, 19, "An apparent Fedayeen suicide bombing leaves two other people dead."], ["2006.03.11", "Afghanistan", "Helmand", 1, 0, "A police officer is killed by a Taliban landmine."], ["2006.03.11", "Afghanistan", "Helmand", 2, 0, "The decapitated bodies of two men abducted two days earlier by religious extremists are found in the desert."], ["2006.03.11", "India", "Ladi Pahalgam", 1, 1, "The Mujahideen abducts two civilians from their home and shoots one to death in captivity."], ["2006.03.11", "India", "Reasi", 1, 1, "Mujahideen terrorists force their way into a civilian's house and shoot him to death."], ["2006.03.11", "India", "Thathri", 0, 1, "Muslim terrorists force their way into a home and deliberately cripple a young girl by shooting her in both legs."], ["2006.03.11", "Iraq", "Baghdad", 1, 0, "A 'Christian Peacemaker' pacifist is kidnapped by Islamic radicals, held for three months, tortured and then shot to death."], ["2006.03.11", "Iraq", "Baghdad", 1, 1, "A television station director is killed by Islamic terrorists outside his home."], ["2006.03.12", "Afghanistan", "Kabul", 2, 5, "A Fedayeen suicide bomber attempts a political assassination.  Two people are killed in the blast."], ["2006.03.12", "Afghanistan", "Kabul", 2, 5, "Suicide bombers kill a young girl on her way to school and a man on a motorbike."], ["2006.03.12", "Afghanistan", "Kunar", 4, 0, "Four Americans are killed by a remote-controlled blast while providing security to a group of Afghan civilians."], ["2006.03.12", "India", "Kader", 1, 0, "A boy is abducted and beheaded by the Mujahideen."], ["2006.03.12", "Iraq", "Baghdad", 8, 14, "Jihadis kill six civilians with a remote-controlled bomb and shoot two policemen to death in a separate attack."], ["2006.03.12", "Iraq", "Baghdad", 10, 4, "A paint shop is the target of a terror blast as eight bodies are found bound and executed elsewhere in the city."], ["2006.03.12", "Iraq", "Baghdad", 52, 204, "al-Qaeda suicide bombers tear apart forty-four poor Shias living in a slum in two separate market attacks.  About two-hundred others are injured.  Eight are hanged or beaten to death in revenge"], ["2006.03.12", "Pakistan", "Anghar", 1, 0, "Islamists kill a man and pin a note to his body."], ["2006.03.12", "Pakistan", "Madakhel", 1, 0, "A civilian is abducted, tortured and killed by Muslim radicals."], ["2006.03.12", "Thailand", "Pattani", 1, 2, "Islamic militants kill a 44-year-old Buddhist as he is riding his motorcycle.  They also bomb a Buddhist temple, injuring a young girl and her mother."], ["2006.03.13", "Afghanistan", "Kandahar", 4, 0, "The Taliban execute four Albanian cleaning-company contractors that were abducted a day earlier."], ["2006.03.13", "Afghanistan", "Miansheen", 5, 6, "Religious extremists attack a police post, killing five officers."], ["2006.03.13", "Bangladesh", "Comilla", 3, 0, "An Islamic militant sets off a suicide blast to avoid arrest.  A mother and two children are blown apart as well."], ["2006.03.13", "India", "Ganderbal", 1, 0, "After keeping him in captivity for two days under harsh conditions, the Hizb-ul-Mujahideen hang an abducted civilian."], ["2006.03.13", "Iraq", "Baghdad", 1, 0, "Radicals gun down a journalist outside his home."], ["2006.03.13", "Iraq", "Baghdad", 3, 7, "Three civilians, including a child, are killed by two terrorist bombings."], ["2006.03.13", "Iraq", "Tikrit", 5, 18, "At least five people are killed when Islamic radicals set off a bomb along a city street."], ["2006.03.14", "Indonesia", "Ambon", 1, 0, "In a suspected Muslim attack, a 33-year-old Catholic nun is stabbed to death by an intruder."], ["2006.03.14", "Iraq", "Baghdad", 87, 0, "Eighty-seven victims of sectarian violence are found in at least four separate locations around the city in a 24-hour period."], ["2006.03.15", "India", "Bhajja", 2, 0, "An older husband and wife are shot to death by Hizb-ul-Mujahideen terrorists after forcing their way into the couple's home."], ["2006.03.15", "Iraq", "Baghdad", 3, 2, "Jihadis murder two Shia pilgrims walking by the road and kill two other innocents in separate bomb attacks."], ["2006.03.15", "Iraq", "Baghdad", 22, 0, "Twenty-two bodies, victims of sectarian violence, are reported found."], ["2006.03.15", "Iraq", "Baqubah", 2, 6, "A woman and two children are among the causalities as a suicide bomber on a bicycle pedals his way to paradise."], ["2006.03.15", "Iraq", "Baqubah", 2, 11, "Two people are killed when religious fundamentalists bomb a photography studio."], ["2006.03.15", "Thailand", "Muang", 2, 0, "A man and his son are attacked by Muslim radicals while riding home on a motorbike.  Both are killed."], ["2006.03.15", "Thailand", "Pattani", 1, 1, "Islamists attack a husband and wife on a road, killing the man and leaving the woman severely injured."], ["2006.03.16", "Iraq", "Baijii", 2, 4, "Radical Sunnis invade a home and kill a translator and his son inside."], ["2006.03.16", "Iraq", "Baqubah", 3, 0, "Islamic terrorists kill three schoolgirls with a roadside bomb."], ["2006.03.16", "Iraq", "Mosul", 5, 2, "Jihad gunmen murder four college students.  Another civilian is killed in a bombing."], ["2006.03.16", "Iraq", "Ramadi", 3, 6, "Sunni radicals attack a checkpoint at an intersection, killing three civilians."], ["2006.03.16", "Thailand", "Pattani", 6, 2, "In a shocking attack, a group of Muslims walk into a government office and gun down six officials meeting in a conference room."], ["2006.03.16", "Thailand", "Yala", 1, 1, "An ice cream vendor is murdered and his 8-year-old son injured by militant Islamists."], ["2006.03.17", "Afghanistan", "Maiwand", 9, 0, "The Taliban kill nine policemen with a bomb as they are transporting the bodies of four Albanians kidnapped and murdered earlier."], ["2006.03.17", "Afghanistan", "Zabul", 1, 2, "The Taliban attack a construction site, killing a guard and taking two people hostage."], ["2006.03.17", "Iran", "Sistan-Baluchistan", 21, 7, "Sunni rebels (Jundollah, 'God's Soldiers') in Iran pose as police officers to stop cars carrying Shias, then machine-gun the occupants, killing twenty-one."], ["2006.03.17", "Iraq", "Adil", 3, 2, "Sunni gunmen shoot Shia pilgrims from a passing car, killing three."], ["2006.03.17", "Iraq", "Baghdad", 8, 4, "A Fedayeen suicide bomber blows up a minibus, and seven bodies are found over the last two days, some showing signs of torture."], ["2006.03.18", "Afghanistan", "Ghazni", 5, 0, "Religious extremists assassinate a former governor, two relatives and two employees in a residential neighborhood."], ["2006.03.18", "India", "Rawalpora", 0, 10, "A woman and nine others are injured in a powerful Hizb-ul-Mujahideen car blast."], ["2006.03.18", "India", "Sumbal", 1, 0, "Muslim gunmen murder a young civilian."], ["2006.03.18", "Iraq", "Baghdad", 2, 8, "Sunni extremists kill two more Shia pilgrims with a roadside bomb."], ["2006.03.18", "Iraq", "Baghdad", 22, 0, "The bodies of twenty-two men showing signs of torture are found by police."], ["2006.03.18", "Thailand", "Yala", 1, 0, "A 39-year-old man is murdered by Islamic separatists."], ["2006.03.18", "Thailand", "Yala", 1, 0, "Islamists gun down a 53-year-old man who was riding out to his rubber plantation."], ["2006.03.19", "Afghanistan", "Kandahar", 2, 4, "Two policemen are killed by the Taliban.  The fundamentalists take four other people hostage in the attack."], ["2006.03.19", "India", "Sopore", 2, 5, "Al Mansooran terrorists kill two security guards by tossing a grenade into their complex."], ["2006.03.19", "Iraq", "Baghdad", 14, 10, "Twelve bodies are found in the capital and Jihadis also gun down two civilians in Ramadi."], ["2006.03.19", "Iraq", "Hawija", 2, 0, "Religious extremists abduct and behead two soldiers."], ["2006.03.19", "Iraq", "Mosul", 4, 1, "Jihadi gunmen murder four people."], ["2006.03.19", "Pakistan", "Dera Ismail Khan", 7, 4, "al-Qaeda militants detonate a bomb on a road, killing seven people and injuring four."], ["2006.03.19", "Pakistan", "Pir Ghaib", 2, 1, "After ascertaining that the victims were Punjabis, Muslim radicals shoot three men at a picnic area, killing two."], ["2006.03.19", "Pakistan", "Zafar Colony", 7, 7, "Islamic militants are suspected in a bombing attack on a security convoy that leaves seven dead."], ["2006.03.20", "Afghanistan", "Musa Qala", 4, 0, "Religious extremists stage a vicious attack on a police vehicle in a remote area, killing all four occupants."], ["2006.03.20", "India", "Rajouri", 1, 0, "A civilian is murdered by the Mujahideen."], ["2006.03.20", "Iraq", "Baghdad", 3, 4, "Passengers on a minibus are the targets of Islamic terrorists who kill at least three with a bomb."], ["2006.03.20", "Iraq", "Baghdad", 3, 23, "Muslims kill three people in a coffee shop by skillfully hiding a bomb in a bag.  Twenty-three people are injured, many seriously."], ["2006.03.20", "Iraq", "Baghdad", 9, 3, "Four separate attacks by Muslim radicals leave nine dead, including a woman and a university lecturer"], ["2006.03.20", "Iraq", "Fallujah", 1, 1, "Militants invade a home and kill a man while injuring his wife."], ["2006.03.21", "Iraq", "Miqdadiya", 17, 4, "Islamic insurgents attack a police station with rockets and arms fire, killing seventeen people, including two civilians."], ["2006.03.21", "Somalia", "Salagle", 1, 0, "A humanitarian worker is killed by an Islamic militia as he is delivering food supplies."], ["2006.03.22", "Ethiopia", "Arisi Negellie", 1, 0, "Muslims gun down a father of seven in front of a Lutheran church.  The victim was a convert from Islam."], ["2006.03.22", "Iraq", "Baghdad", 8, 22, "A Shia pilgrim is killed when Sunni radicals attack a bus full of passenger.  Seven bodies are found in two locations elsewhere."], ["2006.03.22", "Iraq", "Baghdad", 21, 24, "In a cold-blooded attack, Sunni radicals gun down sixteen Shia pilgrims in two separate attacks.  Five other bodies are also discovered."], ["2006.03.22", "Iraq", "Madaen", 4, 6, "Jihadis attack a police station with RPGs and mortars, killing four officers."], ["2006.03.22", "Pakistan", "South Waziristan", 1, 3, "Islamists kill a pro-government cleric and abduct three other people."], ["2006.03.23", "Afghanistan", "Andar", 1, 0, "The Taliban assassinate a policeman in front of his home."], ["2006.03.23", "Afghanistan", "Maidan Wardak", 1, 1, "At least one civilian is killed when Jihadis fire a rocket into the center of a town."], ["2006.03.23", "Dagestan", "Makhachkala", 1, 9, "Gunmen open fire on a car carrying a senior government official, killing him and injuring nine others."], ["2006.03.23", "Iraq", "Baghdad", 7, 22, "A suicide bomber at a market murders at least seven innocents."], ["2006.03.23", "Iraq", "Baghdad", 23, 35, "Twenty-three people are blown apart by a Fedayeen suicide bomber on a city street."], ["2006.03.23", "Iraq", "Baqubah", 4, 0, "Four policemen are killed by terrorists using a remote-controlled roadside bomb."], ["2006.03.23", "Iraq", "Fallujah", 14, 0, "Eight victims of religious militants are found, along with six others in the capital."], ["2006.03.23", "Pakistan", "Kohlu", 1, 9, "A man is killed and nine people, including two children, are injured when extremists bomb a telephone booth."], ["2006.03.24", "Algeria", "Boumerdes", 1, 0, "Islamic fundamentalists shoot a town's mayor to death outside his home."], ["2006.03.24", "Iraq", "Baghdad", 5, 1, "Fundamentalists bomb a bake shop killing five people including four bakery employees."], ["2006.03.24", "Iraq", "Baghdad", 15, 1, "Three policemen are killed in an ambush by radical Sunnis and eighteen bodies are found at three locations in the city."], ["2006.03.24", "Iraq", "Khalis", 5, 17, "Five worshippers are killed, and seventeen wounded, when radical Shias bomb a Sunni mosque."], ["2006.03.24", "Iraq", "Mahmoudiya", 4, 1, "Muslim radicals shoot four members of a family to death in their home, including a child.  The mother is critically injured."], ["2006.03.24", "Pakistan", "Datta Kheil", 1, 2, "One person is killed when al-Qaeda backed militants fire a rocket at a security post."], ["2006.03.25", "Algeria", "Blida", 4, 0, "Four farmers are machine-gunned to death in their fields by Islamic fundamentalists."], ["2006.03.25", "India", "Sangiot", 1, 0, "A boy is abducted and murdered by the Mujahideen."], ["2006.03.25", "Iraq", "Baghdad", 15, 4, "Four civilians are among five killed in a bombing, and ten victims of sectarian violence are found elsewhere, some showing signs of torture."], ["2006.03.25", "Iraq", "Mahmudiya", 4, 13, "Sunni insurgents kill four residents in their homes with mortars."], ["2006.03.25", "Thailand", "Narathiwat", 1, 4, "Islamic gunmen attack voters as they are leaving the polls, killing at least one person."], ["2006.03.26", "India", "Pampore", 1, 7, "Lashker-e-Toiba militants attack an Indian army convoy on a highway, killing at least one."], ["2006.03.26", "Iraq", "Baghdad", 14, 3, "A woman is blown apart in front of her house by radical Sunnis.  Thirteen bodies are also discovered at three separate locations elsewhere."], ["2006.03.26", "Iraq", "Basra", 1, 2, "Terrorists kill a 14-year-old boy in front of his school."], ["2006.03.26", "Iraq", "Mullah Eid", 30, 0, "Thirty victims of Jihadis are discovered by a road, some were beheaded."], ["2006.03.26", "Pakistan", "South Waziristan", 1, 0, "The local Taliban capture and execute a man under Sharia law."], ["2006.03.26", "Somalia", "Mogadishu", 144, 354, "Islamic militias of rival clerics set off four days of violence, leaving more than one-hundred dead."], ["2006.03.27", "Afghanistan", "Helmand", 3, 2, "Religious extremists kill a woman and two other villagers with a roadside bomb."], ["2006.03.27", "India", "Rohama", 1, 0, "A civilian is shot dead by the Mujahideen."], ["2006.03.27", "India", "Sanjote", 1, 0, "A youth is kidnapped and tortured by the Mujahideen, who finish him off by slitting his throat."], ["2006.03.27", "Iraq", "Baghdad", 8, 35, "Islamic radicals fire two rockets into a commercial district, killing eight people and injuring dozens."], ["2006.03.27", "Iraq", "Baghdad", 21, 0, "Twenty-one bodies are discovered, some with nooses around their necks, as sectarian violence continues."], ["2006.03.27", "Iraq", "Mosul", 40, 30, "A Saudi suicide bomber attacks Iraqis at a recruiting center, killing at least forty and injuring dozens."], ["2006.03.27", "Pakistan", "Shakai", 0, 6, "Six children on their way to school are injured when Islamists bomb their bus."], ["2006.03.27", "Philippines", "Jolo", 9, 20, "Suspected Abu Sayyaf terrorists bomb a department store, killing nine and injuring over twenty."], ["2006.03.27", "Thailand", "Narathiwat", 1, 0, "Radical Muslims shoot a man to death in front of his 4-year-old daughter."], ["2006.03.27", "Thailand", "Narathiwat", 1, 1, "A 19-year-old Chinese trader is shot twice in the head by Muslim radicals as he is going door-to-door with his father."], ["2006.03.27", "Thailand", "Pattani", 1, 0, "A 32-year-old man is murdered by Muslim gunmen on his way home."], ["2006.03.27", "Thailand", "Pattani", 1, 0, "A 75-year-old man is gunned down by Islamists."], ["2006.03.27", "Thailand", "Yala", 1, 0, "A government worker is murdered by Muslim gunmen."], ["2006.03.27", "Thailand", "Yala", 1, 0, "Muslim radicals kill a medical doctor as he is shopping at an electronics store."], ["2006.03.28", "Afghanistan", "Farah", 4, 0, "Four employees of a mining company are killed by two Fedayeen suicide bombers in a car."], ["2006.03.28", "Afghanistan", "Helmand", 6, 0, "The Taliban kill six Afghan soldiers with a roadside bomb."], ["2006.03.28", "Afghanistan", "Kandahar", 2, 0, "Two policemen are murdered by the Taliban."], ["2006.03.28", "Iraq", "Baghdad", 14, 0, "The bodies of fourteen people are found bound and executed."], ["2006.03.28", "Israel", "Negev", 2, 0, "A shepherd and his 16-year-old son are killed by an Islamic Jihad rocket."], ["2006.03.28", "Pakistan", "Fort Salop", 26, 25, "At least twenty-six people are killed when a radical Muslim cleric incites his followers to attack resettled Afghan families."], ["2006.03.28", "Pakistan", "Peshawar", 1, 16, "A policeman is killed, and sixteen civilians injured, by a motorcycle bomb detonated at a crowded market."], ["2006.03.29", "Iraq", "Baghdad", 8, 6, "Muslim terrorists line up fourteen employees of a trading company and shoot them one-by-one.  Three women are among the dead."], ["2006.03.29", "Iraq", "Baghdad", 17, 0, "The bodies of seventeen young men are found bound and executed with signs of torture."], ["2006.03.29", "Pakistan", "Mir Ali", 2, 9, "Local Taliban kill a woman and a young girl with a rocket."], ["2006.03.29", "Thailand", "Narathiwat", 1, 0, "A 28-year-old man is shot to death by Muslim radicals outside his home."], ["2006.03.30", "Afghanistan", "Helmand", 2, 0, "Taliban terrorists open fire on a car carrying a police director and his brother, killing both."], ["2006.03.30", "Afghanistan", "Kandahar", 1, 6, "A woman, two children and four men are injured by a Fedayeen suicide bomber.  A 4-year-old boy dies a day later."], ["2006.03.30", "Afghanistan", "Laghman", 4, 0, "Four men are killed in a rocket attack on their vehicle by religious extremists."], ["2006.03.30", "India", "Gandipora", 1, 0, "The Mujahideen abduct and murder a local folk singer."], ["2006.03.30", "Iraq", "Baiji", 8, 1, "Islamic terrorists ambush a minivan carrying oil workers, killing at least eight."], ["2006.03.30", "Israel", "Kedumim", 4, 0, "A young Muslim dresses as a Jewish hitchhiker, then murders the elderly Jewish couple who stop to offer assistance, along with a teenager and one other."], ["2006.03.31", "Afghanistan", "Tahhar", 1, 0, "A lawmaker is killed in his home by the Taliban."], ["2006.03.31", "India", "Soura", 1, 5, "The Hizbul Mujahideen terrorist group uses an IED against a military vehicle, killing one and injuring five."], ["2006.03.31", "Iraq", "Baghdad", 5, 0, "Five victims of sectarian violence are found bound, tortured and executed."], ["2006.03.31", "Iraq", "Balad Ruz", 6, 1, "Radical Sunnis kill six Shia pilgrims as they are riding in a minibus."], ["2006.03.31", "Iraq", "Baqubah", 5, 0, "Sunni gunmen shoot five civilians to death as they are riding in a car."], ["2006.03.31", "Thailand", "Pattani", 1, 0, "A 52-year-old policeman is killed by Islamic radicals as he is waiting for his wife outside a school."], ["2006.03.31", "Thailand", "Pattani", 1, 0, "Islamists murder a 24-year-old civilian in a drive-by shooting."], ["2006.04.01", "Afghanistan", "Girishk", 4, 0, "A religious extremist poses as a hitchhiker, then kills the four policemen who stop to help."], ["2006.04.01", "India", "Gharat", 1, 0, "The Mujahideen abduct and kill a civilian."], ["2006.04.01", "Iraq", "Baghdad", 15, 1, "Islamic terrorists kill fifteen innocents in five attacks, including three ice cream vendors and a butcher and his son."], ["2006.04.01", "Iraq", "Tikrit", 1, 0, "Fundamentalists bomb a music shop, killing at least one person."], ["2006.04.01", "Iraq", "Youssifiyah", 2, 0, "Muslims shoot down a U.S. helicopter, then drag the pilots' bodies through the street shouting \"Allah Akbar.\""], ["2006.04.01", "Pakistan", "Dattakhel", 1, 3, "Local Taliban militants fire a rocket into a military camp, killing one Pakistani soldier."], ["2006.04.02", "Afghanistan", "Kandahar", 5, 3, "Religious extremists ambush a police checkpoint, killing five officers."], ["2006.04.02", "Afghanistan", "Nimroz", 1, 0, "The Taliban stop a vehicle and force a Turkish engineer out.  They then shoot him to death and burn his body."], ["2006.04.02", "India", "Chadoora", 1, 0, "The Mujahideen abduct and murder a university grad student."], ["2006.04.02", "India", "Lama Dhar", 1, 0, "A teenager is killed in a grenade attack by the Mujahideen."], ["2006.04.02", "India", "Sopore", 1, 0, "Islamic militants assassinate a city councilman."], ["2006.04.02", "Iraq", "Balad Ruz", 2, 3, "Islamists kill two members of a family, including a 12-year-old girl, in a shooting ambush."], ["2006.04.02", "Pakistan", "Sararogha", 1, 0, "Islamists murder a pro-government cleric."], ["2006.04.02", "Philippines", "Lamitan", 1, 1, "Suspected Abu Sayyaf terrorists gun down a policeman and seriously injure his son."], ["2006.04.02", "Thailand", "Pattani", 1, 0, "Muslim extremists stalk and kill a 45-year-old man on the way to pick up his wife."], ["2006.04.03", "Iraq", "Baghdad", 4, 0, "Sunni gunmen invade a Shia family's home, line up two sisters, a brother and an uncle, then machine-gun them to death."], ["2006.04.03", "Iraq", "Baghdad", 11, 6, "Terrorists use a car bomb to kill two civilians.  Nine bodies are also found bound and tortured over the next 24 hours."], ["2006.04.03", "Iraq", "Basra", 6, 0, "A young child is among six victims of a drive-by shooting by Muslim terrorists at a market."], ["2006.04.03", "Pakistan", "Dattakhel", 5, 1, "Pro-Talibanis plant a landmine and detonate it under a civilian vehicle, killing at least five, including a mother and her son."], ["2006.04.03", "Pakistan", "Jandola", 4, 0, "A man, his wife and two children are slaughtered by Islamic fundamentalists in a bomb blast."], ["2006.04.03", "Thailand", "Yala", 1, 0, "Islamists murder a 52-year old man."], ["2006.04.04", "India", "Baramulla", 1, 2, "Militant Muslims kill a party activist and injure two women with automatic weapons."], ["2006.04.04", "India", "Tral", 1, 0, "A policeman is abducted and killed by Islamic radicals."], ["2006.04.04", "Iraq", "Baghdad", 2, 3, "Two children are killed when Islamic terrorists bomb their home.  Their mother and brother are injured."], ["2006.04.04", "Iraq", "Baghdad", 10, 28, "Ten people are blown apart by a Sunni car bomb in a Shiite neighborhood.  Nearly thirty others are injured."], ["2006.04.05", "Afghanistan", "Ghanzi", 1, 0, "The Taliban gun down a man as he is driving to work."], ["2006.04.05", "Afghanistan", "Nimroz", 1, 0, "Religious extremists kill a government official."], ["2006.04.05", "Algeria", "Djebel Sbaa", 2, 0, "Two security personnel are murdered by Islamic fundamentalists in separate attacks."], ["2006.04.05", "Iraq", "Baghdad", 9, 18, "Two car bombs by Muslim terrorists kill three civilians and injure eighteen as six bodies are found elsewhere."], ["2006.04.05", "Iraq", "Diwaniya", 1, 1, "Terrorists kill a Polish translator and injure his nephew."], ["2006.04.05", "Pakistan", "Miranshah", 3, 3, "Three Pakistanis are killed in an Islamist rocket attack on their post."], ["2006.04.06", "Afghanistan", "Bagram", 1, 3, "A rocket fired by Taliban extremists kills a civilian."], ["2006.04.06", "India", "Harhama", 1, 0, "A 70-year-old man is shot to death by Muslim terrorists."], ["2006.04.06", "Iraq", "Baghdad", 6, 0, "Six bodies are found bound and executed by police."], ["2006.04.06", "Iraq", "Najaf", 13, 39, "'Iraqi Freedom Fighters' bomb a Shia cemetery near a mosque, killing at least thirteen and injuring dozens more.  The victims were mostly women and children."], ["2006.04.07", "Algeria", "Ouardhia", 13, 8, "Thirteen Algerians are massacred by Islamic fundamentalists in an ambush on their vehicles."], ["2006.04.07", "India", "Baradari", 1, 4, "A Mujahideen bombing on a bus kills at least one civilian."], ["2006.04.07", "India", "Kashiyar", 1, 0, "The Mujahideen abduct and behead a civilian."], ["2006.04.07", "India", "Parne", 2, 0, "An elderly couple are murdered inside their home by Islamic radicals in a heinous attack."], ["2006.04.07", "Iraq", "Baghdad", 85, 164, "At least eighty Shia worshippers are slaughtered when Sunni terrorists stage a triple suicide attack against a mosque."], ["2006.04.07", "Iraq", "Kirkuk", 1, 0, "Sunni terrorists murder a Shia tailor in his shop."], ["2006.04.07", "Philippines", "Asturias", 1, 9, "Abu Sayyaf terrorists are suspected in a drive-by that leaves a woman dead and children injured."], ["2006.04.08", "Afghanistan", "Herat", 2, 7, "A suicide car bomber murders two Afghans and leaves seven injured."], ["2006.04.08", "Iraq", "Baghdad", 2, 0, "Islamic terrorists place a bomb in the doorway of a home, killing two family members."], ["2006.04.08", "Iraq", "Kirkuk", 4, 0, "Four Iraqi soldiers are kidnapped, tortured and executed by Islamic militants."], ["2006.04.08", "Iraq", "Musayib", 6, 16, "Suspected al-Qaeda car bombing kills six innocents near a Shia mosque."], ["2006.04.09", "Chechnya", "Sernovodsk", 3, 0, "A policemen and two family members are massacred in a Jihad ambush on their vehicle."], ["2006.04.09", "India", "Challad", 3, 0, "Three members of a family, including two brothers and a woman, are murdered by the Hizb-ul-Mujahideen."], ["2006.04.10", "Afghanistan", "Badghis", 5, 0, "Five Afghan humanitarian workers working for a Christian aid agency are slaughtered by Muslim extremists at their clinic."], ["2006.04.10", "India", "Bijbehara", 1, 0, "A forest worker is abducted and murdered by the Mujahideen."], ["2006.04.10", "Iraq", "Baghdad", 3, 0, "Islamic radicals murder three members of the same family."], ["2006.04.10", "Iraq", "Baqubah", 1, 0, "An Iranian woman is found shot through the head in a Sunni area."], ["2006.04.10", "Pakistan", "Dherdoni", 2, 0, "Islamic terrorists murder a water tanker driver and his assistant."], ["2006.04.10", "Somalia", "Baidoa", 6, 3, "Armed Muslims open fire on a food convoy, killing six humanitarian aid workers."], ["2006.04.11", "Afghanistan", "Asadabad", 7, 34, "The Taliban fire two rockets into a school, killing seven children between the ages of 7 and 10."], ["2006.04.11", "India", "Kangan", 1, 0, "A civilian is abducted and murdered by the Mujahideen."], ["2006.04.11", "Iraq", "Baghdad", 3, 4, "Islamic terrorists bomb a passenger bus, killing three civilians."], ["2006.04.11", "Iraq", "Jurf al-Sahkar", 4, 0, "Four Iraqi soldiers are abducted and beheaded by 'Holy Warriors'."], ["2006.04.11", "Iraq", "Kirkuk", 1, 0, "A man is kidnapped, tortured and beheaded by Jihad extremists."], ["2006.04.11", "Pakistan", "Karachi", 55, 77, "Fifty-five people attending a religious gathering in a city park are blown apart by two suicide bombers.  Some seventy others are injured."], ["2006.04.12", "India", "Tral", 1, 1, "A Mujahideen ambush against a vehicle leaves one dead."], ["2006.04.12", "Iraq", "Baghdad", 15, 9, "Six separate Jihad attacks leave fifteen dead around the country, including truck drivers and oil workers."], ["2006.04.12", "Iraq", "Howaydir", 23, 50, "Radical Sunnis detonate a car bomb outside a Shiite mosque, blowing nearly two dozen people into bits.  Another fifty are injured."], ["2006.04.12", "Iraq", "Khalis", 4, 27, "Two car bombs targeting vegetable markets leave four dead in Khalis and Tal Afar."], ["2006.04.12", "Iraq", "Kirkuk", 1, 1, "Terrorists attack a gas company executive and his wife, killing the woman."], ["2006.04.12", "Kabardino-Balk.", "Nalchik", 1, 0, "Terrorists fire a grenade into an anti-Terrorism headquarters, killing a guard."], ["2006.04.12", "Pal. Auth.", "Jericho", 1, 0, "An Arab man is tortured and killed by the al-Aqsa Brigade for selling property to a Jew."], ["2006.04.13", "Chad", "Djawara", 118, 0, "Janjaweed Arab terrorists rampage through four African villages over a 2-day period, hacking, stabbing and shooting more than a hundred people to death."], ["2006.04.13", "Iraq", "Baghdad", 13, 8, "Thirteen people are killed when Muslim terrorists car bomb a crowded market."], ["2006.04.13", "Iraq", "Fallujah", 7, 0, "Terrorists kill five people in Fallujah and two truck drivers are gunned down near the capital."], ["2006.04.13", "Sudan", "Akobo", 15, 11, "Four attacks by government-armed militias leave fifteen dead, including four children."], ["2006.04.14", "Afghanistan", "Khost", 3, 2, "Three Afghan policemen are killed in a Taliban roadside bombing attack."], ["2006.04.14", "Egypt", "Alexandria", 1, 3, "Knife-wielding Islamists attack Christians gathered outside a church, stabbing four of them.  A 78-year-old man dies."], ["2006.04.14", "India", "Srinagar", 5, 31, "A series of deadly grenade attacks on civilians leave three women and two men dead."], ["2006.04.14", "Iraq", "Baqubah", 4, 5, "Four people are killed by two mosque bombings."], ["2006.04.14", "Iraq", "Basra", 2, 4, "A suicide bomber kills two Iraqi civilians."], ["2006.04.14", "Iraq", "Basra", 7, 3, "Ten employees of a construction company are handcuffed, blindfolded, then lined up against a wall and shot by Muslim extremists.  Seven die."], ["2006.04.14", "Thailand", "Narathiwat", 1, 4, "Militant Muslims hide in the bushes to surprise a civilian party with automatic weapons."], ["2006.04.15", "Chechnya", "Dargo", 2, 5, "Jihadis use a landmine and small arms fire to ambush a security patrol."], ["2006.04.15", "Iraq", "Baghdad", 7, 26, "Seven people are murdered in two bomb attacks by Islamic militants, including one in a restaurant."], ["2006.04.15", "Pakistan", "Ghulam Khan", 1, 1, "Islamists plant a bomb at a bazaar, killing at least one shopper."], ["2006.04.15", "Pakistan", "North Waziristan", 1, 0, "al-Qaeda kidnap and behead a civilian - attaching a note to the body warning more of the same."], ["2006.04.15", "Yemen", "Sanaa", 1, 5, "A guard is killed when radical Shiites attack a rival mosque."], ["2006.04.16", "Ethiopia", "Jijiga", 3, 23, "Islamists bomb a two bars and a church, killing three people and injuring two dozen."], ["2006.04.16", "Iraq", "Baghdad", 4, 6, "Four ordinary Iraqis are blown apart by a terrorist car bombing near a mosque."], ["2006.04.16", "Philippines", "North Cotabato", 1, 0, "The Moro Islamic Front guns down a man in front of his wife inside a game hall."], ["2006.04.16", "Thailand", "Narathiwat", 1, 0, "A 32-year-old civilian is gunned down by Muslim terrorists while riding a motorcycle."], ["2006.04.17", "Ethiopia", "Gedo", 3, 30, "Three people are killed when a Muslim radical hurls a grenade into a market."], ["2006.04.17", "India", "Tral", 1, 4, "Muslim militants attempt a political assassination, killing one and injuring four."], ["2006.04.17", "Iraq", "Baghdad", 4, 4, "Four terror attacks leave four innocents dead, including a mosque guard and a shepherd"], ["2006.04.17", "Israel", "Tel Aviv", 9, 66, "With the blessing of Hamas, Islamic Jihad sends a teenage suicide bomber into a restaurant and massacres at least nine innocents.  More than sixty others are injured."], ["2006.04.17", "Pakistan", "Datakhel", 1, 0, "al-Qaeda kills a local tribesman for supplying food to Americans."], ["2006.04.17", "Pakistan", "Madakhel", 1, 0, "Islamic fundamentalists kidnap and behead a civilian."], ["2006.04.17", "Thailand", "Narathiwat", 1, 0, "A 50-year-old man is gunned down by Muslim fanatics."], ["2006.04.18", "India", "Sildhar", 2, 0, "The Hizb-ul-Mujahideen abduct two civilians from their homes and murder them in captivity."], ["2006.04.18", "Iraq", "Baghdad", 4, 22, "Four civilians are killed when Muslim terrorists detonate a roadside bomb."], ["2006.04.18", "Iraq", "Baghdad", 7, 20, "Seven people are blown apart in a cafe when Islamic radicals place a bomb under a chair.  At least twenty others are injured."], ["2006.04.18", "Iraq", "Baghdad", 19, 0, "Fourteen victims of execution are found in the same neighborhood, and five elsewhere, over the last two days."], ["2006.04.18", "Iraq", "Yusufiya", 4, 0, "Islamic radicals kidnap, torture and kill four young men."], ["2006.04.18", "Pakistan", "Faisalabad", 2, 0, "A Shia cleric and his driver are shot to death by radical Sunnis."], ["2006.04.18", "Pakistan", "Mirali", 1, 0, "Islamists kidnap and behead a civilian."], ["2006.04.18", "Thailand", "Yala", 1, 0, "Islamists kill a 24-year-old man on his way to work by shooting him multiple times in the chest."], ["2006.04.19", "India", "Handwara", 2, 0, "Two soldiers on leave are killed inside their home by the Mujahideen."], ["2006.04.19", "Iraq", "Baiji", 5, 4, "Jihadis use a roadside car bomb to kill five civilians."], ["2006.04.19", "Iraq", "Baqubah", 3, 1, "Three university professors are gunned down by religious extremists."], ["2006.04.19", "Iraq", "Rashad", 5, 3, "Sunni gunmen take out five civilians and injure three."], ["2006.04.19", "Thailand", "Narathiwat", 3, 17, "Three people, including a female election volunteer are murdered in separate attacks by Thai Islamists attempting to disrupt elections."], ["2006.04.20", "India", "Bhaderwah", 1, 3, "A Mujahideen grenade attack on a police station leaves one dead and three injured."], ["2006.04.20", "Iraq", "Kirkuk", 9, 1, "Nine people, including four security guards, are killed by Muslim terrorists in four separate attacks around the country."], ["2006.04.20", "Iraq", "Tal Afar", 3, 4, "Three people, including a doctor in his clinic, are murdered by Islamists in two attacks."], ["2006.04.20", "Pakistan", "Sarobi", 7, 22, "al-Qaeda militants ambush a military convoy, killing seven Pakistani soldiers and injuring twenty-two."], ["2006.04.21", "Afghanistan", "Maiwand", 6, 0, "Six policemen are killed at their post by Taliban extremists."], ["2006.04.21", "India", "Cherwan", 1, 0, "The Mujahideen murders a civilian outside his village."], ["2006.04.21", "India", "Gool", 2, 0, "Two transportation employees are shot to death on the job by Muslim radicals."], ["2006.04.21", "India", "Kishtwar", 1, 0, "A civilian is gunned down by the Mujahideen."], ["2006.04.21", "Iraq", "Baghdad", 3, 0, "A baker and two bakery workers are murdered in two separate attacks by Islamic fundamentalists."], ["2006.04.21", "Iraq", "Baghdad", 8, 0, "The bodies of eight men, bound and executed, with signs of torture are found in two locations in the country."], ["2006.04.21", "Iraq", "Baiji", 6, 0, "In a heinous act, Islamic terrorists kidnap six off-duty policemen from and murder them."], ["2006.04.22", "Afghanistan", "Gumbad", 4, 0, "Four Canadian troops are killed by religious extremists, who detonated a bomb under their vehicle."], ["2006.04.22", "Afghanistan", "Laghman", 6, 4, "Six Afghans are killed in a Taliban bomb attack."], ["2006.04.22", "Iraq", "Hawija", 2, 0, "Two civilians are gunned down by Sunni extremists."], ["2006.04.22", "Iraq", "Muqdadiya", 13, 15, "Two people are killed in a market bombing, as eleven bodies are found in the capital."], ["2006.04.23", "Afghanistan", "Kandahar", 1, 2, "Taliban militants attack a road construction crew, killing a guard."], ["2006.04.23", "Algeria", "Skikda", 10, 8, "Islamic fundamentalists slaughter ten people at a roadblock in a remote area."], ["2006.04.23", "India", "Pulwama", 1, 0, "A civilian is abducted and murdered by the Mujahideen."], ["2006.04.23", "Iraq", "Baghdad", 15, 0, "Jihadis use a rocket to take out seven civilians riding in a car.  Eight bound bodies are found elsewhere."], ["2006.04.23", "Iraq", "Mahmudiya", 2, 7, "A child is among two fatalities from an Islamist mortar attack.  Seven other children are injured."], ["2006.04.23", "Pakistan", "Dungan", 1, 2, "Militant Islamists ambush a group of villagers, killing one."], ["2006.04.23", "Pakistan", "Razmak", 1, 0, "Islamists murder a security officer's younger brother."], ["2006.04.23", "Thailand", "Narathiwat", 1, 1, "Islamic militants gun down a civilian and seriously injure his wife in a drive-by attack."], ["2006.04.23", "Thailand", "Yala", 1, 0, "A 27-year-old shopkeeper loses his life to Allah's holy warriors while tending his business."], ["2006.04.23", "Yemen", "Sana'a", 7, 13, "A Muslim throws a grenade into a market, killing seven."], ["2006.04.24", "Egypt", "Dahab", 19, 62, "Three bombings at an Egyptian resort area leave at least nineteen victims dead and another sixty injured."], ["2006.04.24", "India", "Srinagar", 1, 25, "One civilian was killed, and two dozen others wounded, when Muslim militants stage three grenade attacks on polling stations."], ["2006.04.24", "Iraq", "Baghdad", 10, 80, "A string of Jihadi car bombings kill ten innocents and injure eighty."], ["2006.04.24", "Iraq", "Mosul", 28, 0, "The bodies of twenty-eight young men are found bound and tortured in Mosul and in the capital."], ["2006.04.24", "Pakistan", "Karwan Manza", 1, 0, "The body of a government employee is found beheaded several days after being abducted by local Islamists."], ["2006.04.25", "Afghanistan", "Kabul", 2, 3, "Religious extremists fire rockets into a city street, killing two civilians."], ["2006.04.25", "India", "Arnora", 2, 0, "Two bodyguards are killed by Muslim terrorists attempting to wipe out the family of a legislator."], ["2006.04.25", "India", "Shopian", 1, 0, "A bookseller succumbs to injuries suffered from an Islamic terror attack."], ["2006.04.25", "India", "Tral", 0, 24, "Twelve schoolchildren are among twenty-four people injured when an Islamic radical hurls a grenade into a crowded market."], ["2006.04.25", "Iraq", "Baghdad", 2, 5, "Radical Sunnis plant a bomb on a minibus, killing at least two."], ["2006.04.25", "Iraq", "Baqubah", 4, 0, "Holy warriors gun down four civilians, including an 8-year-old girl."], ["2006.04.25", "Pakistan", "Dattakhel", 4, 9, "al-Qaeda militants attack a security patrol, killing four people, including a journalist."], ["2006.04.25", "Pakistan", "Quetta", 4, 2, "An Afghan bomb maker connects the wrong wires, killing four members of his own family and injuring his 2nd wife and 13-year-old son."], ["2006.04.25", "Pakistan", "Shavai Kainari", 1, 0, "Islamic militants kidnap and behead a taxi driver."], ["2006.04.25", "Thailand", "Narathiwat", 1, 0, "A 45-year-old civilian is killed by Muslim terrorists while walking home."], ["2006.04.25", "Thailand", "Pattani", 1, 0, "Islamists gun down a Buddhist pig farmer."], ["2006.04.26", "Iraq", "Baghdad", 24, 22, "Five bombs kill twelve civilians in various parts of the country.  Jihadis also shoot a truck driver to death and murder eleven kidnapped men."], ["2006.04.26", "Jordan", "Irbid", 1, 0, "A man kills his sister to restore 'honor' after seeing her picture on a friend's mobile phone."], ["2006.04.27", "India", "Awantipore", 1, 0, "The Mujahideen gun down a policeman."], ["2006.04.27", "India", "Pahalgam", 0, 20, "Twenty people, including eight tourists, are injured when a Muslim radical tosses a grenade into a crowded bus stop."], ["2006.04.27", "Iraq", "Baghdad", 15, 0, "The sister of the country's vice president is gunned down along with her bodyguard by Muslim terrorists as thirteen headless bodies are discovered elsewhere."], ["2006.04.27", "Iraq", "Nassiriya", 4, 1, "Three Italian soldiers and one Romanian are killed when terrorists bomb their convoy."], ["2006.04.28", "India", "Kulgam", 1, 0, "The Mujahideen kill a Communist Party activist inside his home."], ["2006.04.28", "Iraq", "Diyala", 9, 18, "Terrorists launch a series of assaults against police stations and checkpoints, killing at least nine."], ["2006.04.29", "Afghanistan", "Baghran", 3, 1, "Religious extremists fire a rocket at a police patrol, killing three and injuring another."], ["2006.04.29", "Iraq", "Baghdad", 9, 14, "Nine Iraqis are killed in various terror attacks around the country."], ["2006.04.29", "Iraq", "Basra", 2, 3, "Two British contractors are killed by a Muslim terrorist bombing."], ["2006.04.29", "Iraq", "Jurf al-Sakhar", 2, 0, "Islamic radicals abduct a policeman and his brother, then dump their bodies by their house two hours later."], ["2006.04.29", "Iraq", "Qaim", 3, 7, "Three civilians are killed by a Fedayeen suicide car bomber."], ["2006.04.30", "Afghanistan", "Kandahar", 1, 0, "An Indian engineer is kidnapped and brutally decapitated by the Taliban."], ["2006.04.30", "Afghanistan", "Lashkargah", 1, 2, "Religious extremists open fire on a civilian car, killing one occupant."], ["2006.04.30", "India", "Udhampur", 13, 0, "Thirteen Hindus are kidnapped by Muslim extremists and brutally executed.  Families are among the dead."], ["2006.04.30", "Iraq", "Baghdad", 1, 0, "News surfaces of the murder of a 14-year-old boy, Ahmed Khalil, dragged from his home and executed for being gay."], ["2006.04.30", "Iraq", "Baghdad", 3, 2, "Islamic terrorists kill three civilian contractors from Fiji."], ["2006.04.30", "Iraq", "Baghdad", 9, 6, "Sunni radicals plant a bomb inside a minibus, killing two civilians.  Seven bodies are discovered elsewhere."], ["2006.04.30", "Iraq", "Ramadi", 2, 0, "Two children are killed in an RPG attack by Muslim insurgents."], ["2006.04.30", "Philippines", "Surallah", 1, 7, "A 13-year-old girl is killed by Moro Islamic Front terrorists, who attack a cargo truck carrying her family."], ["2006.05.01", "India", "Doda", 22, 9, "Islamic militants rouse Hindu villagers in the middle of the night and have them line up outside their homes, where they are massacred.  Twenty-two are killed.  Only nine survive with injury.  The victims include women and children."], ["2006.05.01", "India", "Handwara", 1, 3, "The Mujahideen kill a construction worker and injure three others with an IED on their job site."], ["2006.05.01", "India", "Kulangam", 1, 0, "A civilian is killed when the Mujahideen detonate a roadside bomb."], ["2006.05.01", "Pakistan", "Mir Ali", 1, 0, "Islamists kidnap and kill an 80-year-old man."], ["2006.05.02", "Afghanistan", "Farah", 1, 0, "A judge is assassinated by religious extremists."], ["2006.05.02", "Afghanistan", "Kabul", 1, 2, "A Fedayeen suicide bomber kills at least one civilian on a city street."], ["2006.05.02", "India", "Doda", 1, 0, "A civilian is abducted from a forested area and executed by the Mujahideen."], ["2006.05.02", "Iraq", "Baghdad", 2, 5, "Terrorists plant a bomb on a passenger bus, killing at least two civilians."], ["2006.05.02", "Iraq", "Yusufiya", 20, 0, "The bodies of twenty men, bound and tortured, are found in three locations, including the capital."], ["2006.05.02", "Pakistan", "Chichawatni", 1, 0, "A man slits his sister's throat in an honor killing."], ["2006.05.02", "Pakistan", "Jatree", 6, 3, "Six members of a family, including two children, were gunned down in an honor killing over a love affair."], ["2006.05.02", "Thailand", "Yala", 1, 0, "Islamists gun down a civilian as he is walking home."], ["2006.05.03", "Iraq", "Baghdad", 4, 0, "Islamic terrorists pull four college students off a bus and shoot them in the head."], ["2006.05.03", "Iraq", "Baghdad", 16, 15, "Fourteen bodies, victims of sectarian violence are discovered, some with signs of torture, as a bomb kills two civilians at a market."], ["2006.05.03", "Iraq", "Fallujah", 16, 25, "Fedayeen suicide bomber blows himself to Allah, taking at least sixteen young police recruits with him."], ["2006.05.03", "Iraq", "Tikrit", 1, 0, "A tailor is murdered by Islamic radicals."], ["2006.05.03", "Pakistan", "Bajaur", 3, 0, "al-Qaeda backed militants storm a police station and murder three officers."], ["2006.05.03", "Pakistan", "Khanpur", 1, 0, "A Muslim man hacks his wife to death with an axe over suspicion that she may have been stepping out on him."], ["2006.05.03", "Thailand", "Pattani", 2, 0, "Islamic militants gun down two neighbors in separate attacks."], ["2006.05.03", "Thailand", "Yala", 1, 0, "A civilian is killed in his home by Islamists."], ["2006.05.03", "Thailand", "Yala", 1, 0, "A villager is killed by Muslim radicals in a roadside shooting attack."], ["2006.05.04", "India", "Chadoora", 2, 9, "Two civilians are killed when Islamic militants hurl a grenade into a market."], ["2006.05.04", "Iraq", "Baghdad", 10, 52, "A Fedayeen suicide bomber attacks a crowd of civilians waiting outside a courthouse, slaughtering at least ten."], ["2006.05.04", "Israel", "Beit Shemesh", 1, 0, "An 8-year-old is raped and murdered by a Palestinian."], ["2006.05.05", "Afghanistan", "Necha", 3, 0, "Three civilians traveling in a car are killed by a bomb set by religious extremists."], ["2006.05.05", "India", "Bijnour", 1, 0, "A civilian is kidnapped from his home by the Mujahideen and killed in captivity."], ["2006.05.05", "Iran", "al-Dura", 1, 0, "A 14-year-old boy is gunned down on his doorstop by Iranian police who suspected him of being a homosexual."], ["2006.05.05", "Iraq", "Baghdad", 6, 0, "Islamic fundamentalists kill six people for buying alcohol."], ["2006.05.05", "Pakistan", "Leghari", 1, 1, "al-Qaeda militants fire a rocket at a checkpoint, killing a Pakistani soldier."], ["2006.05.06", "Afghanistan", "Kabul", 2, 4, "Taliban extremists kill two Italian peacekeepers in a bomb attack."], ["2006.05.06", "India", "Kupwara", 1, 0, "A civilian is killed inside his home by the Mujahideen."], ["2006.05.06", "Iraq", "Baghdad", 8, 3, "Two children, ages 5 and 6, are killed when Muslim insurgents lob a mortar shell at their family.  Six other bodies are found tortured and executed elsewhere."], ["2006.05.06", "Iraq", "Kirkuk", 1, 2, "Sunni radicals open fire on a group of civilians, killing at least one."], ["2006.05.06", "Iraq", "Tikrit", 3, 1, "A Fedayeen suicide bomber detonates himself inside a military base, killing three Iraqis."], ["2006.05.06", "Somalia", "Coast", 1, 2, "Muslim pirates kill an Indian crewmember of a commercial ship."], ["2006.05.07", "Afghanistan", "Zabul", 2, 0, "Taliban terrorists ambush a police patrol, killing two officers."], ["2006.05.07", "India", "Pulwama", 2, 0, "Two Mujahideen, who are considering quitting, are gunned down by their peers."], ["2006.05.07", "Iraq", "Baghdad", 10, 15, "Ten people in a residential neighborhood are blown to bits by a suicidal religious fanatic."], ["2006.05.07", "Iraq", "Baghdad", 42, 0, "The bodies of forty-two victims of Muslim sectarian violence are discovered in several locations."], ["2006.05.07", "Iraq", "Karbala", 21, 52, "A suicide car bomber kills twenty-one innocents on a city street near a bus station."], ["2006.05.07", "Thailand", "Pattani", 1, 0, "Muslim terrorists kill a 38-year-old man as he is riding a motorcycle with his wife."], ["2006.05.08", "Iraq", "Baghdad", 16, 35, "Three terrorist bombings leave at least fifteen civilians dead.  Another six bodies are found elsewhere."], ["2006.05.08", "Iraq", "Balad Ruz", 2, 3, "Two civilians are killed by a Jihadi bombing."], ["2006.05.08", "Iraq", "Khalisa", 2, 0, "Two Iraqi journalists are kidnapped by religious fanatics and murdered."], ["2006.05.08", "Pakistan", "Inayat Kili", 1, 0, "Pro-Taliban terrorists kill a policeman with a landmine."], ["2006.05.08", "Somalia", "Mogadishu", 11, 40, "An Islamic militia sparks a gun battle that leaves eleven dead over a two day period."], ["2006.05.08", "Thailand", "Narathiwat", 1, 0, "A part-time teacher is shot seven times by Muslim assassins on motorcycles."], ["2006.05.08", "Thailand", "Pattani", 2, 5, "Muslim radicals open fire on Buddhist sanitation workers, killing two."], ["2006.05.09", "India", "Kilimanoor", 1, 0, "A father of three is brutally stabbed to death by Muslim militants."], ["2006.05.09", "Iraq", "Baghdad", 2, 5, "Islamic terrorists target an electrical plant, killing two civilians."], ["2006.05.09", "Iraq", "Ramadi", 4, 0, "Four policemen are brutally murdered by Jihadis, who ambush their car."], ["2006.05.09", "Iraq", "Suwayra", 26, 0, "The headless body of a 10-year-old boy is among twenty-six victims of sectarian violence that are found in three locations."], ["2006.05.09", "Iraq", "Tal Afar", 37, 134, "Fedayeen suicide bombers leave a horrific scene of death and suffering after targeting a crowded Shiite market.  Nearly forty people lose their lives."], ["2006.05.09", "Thailand", "Narathiwat", 1, 0, "Islamic radicals use shotguns to take down a 44-year-old man walking by the side of the road."], ["2006.05.09", "Thailand", "Pattani", 1, 0, "The owner of a motorcycle repair shop is murdered by Muslims posing as customers."], ["2006.05.09", "Thailand", "Songkhla", 1, 0, "A 65-year-old female schoolteacher is shot four times in the back by radical Muslims."], ["2006.05.09", "Thailand", "Yala", 1, 0, "Radical Muslims kill a man attending a memorial service for one of their previous victims."], ["2006.05.10", "India", "Doda", 1, 2, "A Mujahideen attack on a house leaves one civilian dead."], ["2006.05.10", "India", "Gandoh", 1, 0, "A guard is killed in a Mujahideen attack on a civilian's home."], ["2006.05.10", "Iraq", "Baqubah", 11, 6, "Sunni gunmen kill eleven workers at an electrical plant in brutal fashion."], ["2006.05.10", "Somalia", "Siisii", 47, 103, "Islamic militias clash, leaving about fifty dead."], ["2006.05.10", "Thailand", "Pattani", 3, 13, "Three Buddhists, including two women, are killed when Muslim radicals hide a bomb on a motorcycle along a city street."], ["2006.05.11", "India", "Bi-Tara", 1, 1, "The Mujahideen murder a civilian and injure another in a shooting attack."], ["2006.05.11", "India", "Dhandli", 1, 0, "A woman is murdered inside her home by a group of militant Muslims."], ["2006.05.11", "India", "Srinagar", 2, 0, "Al Mansoorian terrorists gun down two police officers in cold blood."], ["2006.05.11", "Iraq", "Baghdad", 4, 1, "Jihadis kill four street sweepers with a planted bomb."], ["2006.05.11", "Iraq", "Baqubah", 1, 2, "A female school teacher is murdered by Islamists, and her 14-year-old nephew and 12-year-old daughter are badly injured."], ["2006.05.11", "Kosovo", "Kosovska Mitrovica", 0, 2, "Two Christian youth are seriously injured when Muslims open up on them with automatic weapons."], ["2006.05.11", "Pakistan", "Khar", 1, 0, "al-Qaeda backed militants behead a man and pin a note to his body."], ["2006.05.11", "Somalia", "Siisii", 27, 0, "Islamic militias claim another twenty-seven lives, mostly civilians.  The dead include a pregnant woman and at least three children."], ["2006.05.11", "Thailand", "Narathiwat", 1, 1, "A man is brutally slain while riding a motorcycle with his 2-year-old daughter on his lap."], ["2006.05.12", "Afghanistan", "Herat", 2, 1, "The Taliban targets a UN vehicle with a rocket, killing two employees."], ["2006.05.12", "Iraq", "Balad Ruz", 2, 2, "A funeral is attacked by Islamic radicals, who kill two more civilians."], ["2006.05.12", "Iraq", "Basra", 2, 0, "Radical Shiites murder a Sunni cleric and his son as they are leaving a mosque."], ["2006.05.12", "Kenya", "Nairobi", 1, 2, "A Christian radio station airing the testimony of Muslim apostates is targeted in a bombing attack.  One guard is shot to death by the radicals."], ["2006.05.12", "Kyrgyzstan", "Batken", 6, 3, "In a rolling gun battle that begins in Tajikistan, a group of Islamic extremists kill several border guards and civilian drivers."], ["2006.05.12", "Somalia", "Yaqshid", 12, 0, "At least a dozen more civilians are killed in a gun battle sparked by Islamic militias."], ["2006.05.13", "India", "Doda", 2, 41, "Militant Muslims attack Hindus civilians at a rally with grenades.  At least two are killed."], ["2006.05.13", "Iran", "Kerman", 12, 0, "Sunnis execute eleven Iranians after stopping their cars.  They also string an injured 12-year-old boy up on pole before fleeing."], ["2006.05.13", "Iraq", "Baghdad", 3, 0, "Sunni extremists kill the 22-year-old son of a judge and two bodyguards."], ["2006.05.13", "Iraq", "Mosul", 2, 4, "Two policemen are ambushed and killed by Sunni radicals."], ["2006.05.13", "Somalia", "Mogadishu", 11, 0, "Another eleven civilians die in violence sparked by Islamic militias."], ["2006.05.14", "Afghanistan", "Helmand", 1, 7, "An intelligence officer is gunned down by the Taliban as a bomb injures seven other people, including two girls."], ["2006.05.14", "Algeria", "Jijel", 21, 0, "The bodies of eighteen children and three women are found massacred in a cave used by armed Islamic fundamentalists."], ["2006.05.14", "India", "Kunan Poshpora", 1, 0, "The Mujahideen ambush and kill a civilian."], ["2006.05.14", "Iraq", "Baghdad", 2, 0, "Two Shia bakery workers are murdered by Sunni fundamentalists."], ["2006.05.14", "Iraq", "Baghdad", 26, 66, "Two suicide car bombings at an airport, and several other bombings elsewhere leave at least twenty-six Iraqis dead, including children and other civilians."], ["2006.05.14", "Iraq", "Karbala", 9, 0, "Four brothers working on a humanitarian project are kidnapped by Islamic radicals and beheaded.  Five other bodies are found elsewhere."], ["2006.05.14", "Pakistan", "Jandola", 1, 0, "A government official is assassinated in his home by pro-Taliban militants."], ["2006.05.15", "India", "Batpora", 2, 0, "Two civilians are kidnapped by Muslim radicals, then killed by having their throats slit.  One was a shopkeeper."], ["2006.05.15", "India", "Chatibandi Bandipore", 2, 0, "The Mujahideen behead two civilians."], ["2006.05.15", "Iraq", "Baghdad", 5, 0, "In a brutal attack, Islamic terrorists kidnap five members of the same family and shoot them to death."], ["2006.05.15", "Iraq", "Balad Ruz", 4, 0, "Sunni gunmen shoot four primary school teachers to death as they are making their way in to work."], ["2006.05.15", "Iraq", "Mosul", 6, 0, "Six member of a single family are brutally slaughtered by Islamic militants."], ["2006.05.15", "Iraq", "Wajihiya", 1, 7, "Jihadis kill a 7-year-old girl with a mortar round.  Seven members of her family are injured in the explosion."], ["2006.05.15", "Pakistan", "Amma Khel", 1, 0, "Pro-Taliban gunmen murder a civil employee on his way to restore power to a remote village."], ["2006.05.16", "Afghanistan", "Zangali", 2, 0, "Two government employees are kidnapped and beheaded by radical Islamists."], ["2006.05.16", "India", "Handwara", 1, 0, "A civilian is lynched from a tree by the Mujahideen."], ["2006.05.16", "Iraq", "Baghdad", 3, 0, "Three people are kidnapped, tortured and executed by Islamic radicals."], ["2006.05.16", "Iraq", "Baghdad", 4, 0, "Radical Sunnis murder four Iraqis on their way home from working at a U.S. base."], ["2006.05.16", "Iraq", "Baghdad", 23, 37, "Sunni gunmen attack Shiites at a bus stop with automatic weapons and a bomb, killing at least twenty innocents and leaving dozens more in agony."], ["2006.05.16", "Iraq", "Karbala", 1, 0, "An Egyptian working at a bakery is gunned down by Muslim extremists."], ["2006.05.16", "Pakistan", "Miranshah", 2, 0, "Two guards are gunned down by Islamic terrorists while on duty at a bazaar."], ["2006.05.16", "Somalia", "Mogadishu", 2, 0, "Islamic militias kill two of a rival's bodyguards."], ["2006.05.16", "Thailand", "Narathiwat", 1, 1, "A policeman is killed in a bomb attack by Islamic militants."], ["2006.05.17", "Afghanistan", "Mosa Qala", 13, 6, "The Taliban attack a small town, killing at least thirteen defenders."], ["2006.05.17", "Chechnya", "Kurchaloi", 5, 6, "Five Russian servicemen are slaughtered in a Mujahideen ambush on their vehicle."], ["2006.05.17", "India", "Doda", 0, 18, "Eighteen people are injured when a Muslim hurls a grenade at a crowd."], ["2006.05.17", "Ingushetia", "Nazran", 7, 0, "Seven innocent people are killed when terrorists bomb a car carrying a deputy minister."], ["2006.05.17", "Iraq", "Baghdad", 4, 0, "The lives of four civilians are destroyed by a terrorist bombing."], ["2006.05.17", "Iraq", "Baqubah", 4, 11, "Jihadis shoot a baker to death, then murder others who arrive on the scene to help."], ["2006.05.17", "Pakistan", "Miser", 1, 4, "Pro-Taliban militants attack a security patrol, killing one."], ["2006.05.17", "Somalia", "Mogadishu", 5, 0, "Islamic militia attacks a compound, killing five people."], ["2006.05.17", "Turkey", "Ankara", 1, 4, "Shouting 'Allah Akbar,' a gunmen murders a judge and injures four others in a courtroom shooting sparked by a limited ban of hijabs."], ["2006.05.18", "Afghanistan", "Ghazni", 1, 0, "A suicide bomber kills a civilian along a city street."], ["2006.05.18", "Afghanistan", "Herat", 1, 0, "An American civilian is killed by a suicidal religious extremist."], ["2006.05.18", "India", "Srinagar", 1, 23, "A Muslim woman tosses a grenade out a car window, killing a civilian.  A second blast in Pulwama injures twenty-three."], ["2006.05.18", "Iraq", "Baghdad", 8, 0, "Radical Islamic gunmen stop a minibus carrying auto mechanics and their driver.  All eight are machine-gunned to death."], ["2006.05.18", "Iraq", "Baghdad", 8, 9, "Eight innocents are blown to bits, and another nine suffer injury when Jihadis detonate a bomb along a city street."], ["2006.05.18", "Iraq", "Karbala", 1, 0, "A math teacher is gunned down by a radical Shiite."], ["2006.05.18", "Iraq", "Kirkuk", 3, 0, "Jihadis kill two people in a drive-by shooting.  They also kidnap a woman and remove her head."], ["2006.05.18", "Thailand", "Pattani", 1, 0, "Islamic militants murder a house painter."], ["2006.05.19", "Pakistan", "Khaddi", 1, 0, "A tribal leader is dragged from his car by militant Islamists and shot to death."], ["2006.05.19", "Somalia", "Mogadishu", 6, 0, "Islamic militias break a truce, killing at least a half-dozen more."], ["2006.05.19", "Sudan", "Baja Baju", 6, 0, "Six civilians are killed by the Janjaweed Arab militia."], ["2006.05.19", "Sudan", "Natiqa", 29, 5, "The Janjaweed raid an African village, killing nearly thirty people."], ["2006.05.20", "Iraq", "Al-Udhaim", 2, 3, "A man and his wife are killed in their home by Islamic radicals.  Three of their children are injured in the invasion."], ["2006.05.20", "Iraq", "Baghdad", 19, 58, "al-Qaeda thought to be behind a brutal bombing that kills nineteen Shiite laborers gathering for work along a city street."], ["2006.05.20", "Iraq", "Mussayab", 19, 0, "Nineteen victims of sectarian violence are discovered."], ["2006.05.20", "Iraq", "Qaim", 5, 10, "A Fedayeen suicide car bomber murders at least five others on his way to paradise."], ["2006.05.20", "Pakistan", "Hurmuz", 2, 1, "Two Pakistani soldiers were killed when a Muslim radical tossed a grenade at their post in a Fedayeen attack."], ["2006.05.20", "Pal. Auth.", "Gaza", 1, 6, "Hamas suspected in elevator blast that kills a bodyguard."], ["2006.05.21", "Afghanistan", "Kabul", 2, 8, "A Fedayeen car bomber kills himself and two innocent civilians."], ["2006.05.21", "England", "Leeds", 1, 0, "A 19-year-old woman is beaten to death by her family, who claim that she had an 'evil spirit.'"], ["2006.05.21", "India", "Srinagar", 6, 22, "Two Islamic groups vie for responsibility for a bloody attack on a youth rally that leaves six innocents dead."], ["2006.05.21", "Iraq", "Baghdad", 3, 23, "Islamists hide two bombs at a fish market, killing at least three people."], ["2006.05.21", "Iraq", "Baghdad", 13, 17, "An al-Qaeda suicide bomber detonates himself at a restaurant, slaughtering over a dozen patrons."], ["2006.05.21", "Pakistan", "Karachi", 1, 0, "A 14-year-old girl dies after her family shoots her in an honor killing for rejecting an arranged marriage."], ["2006.05.21", "Thailand", "Narathiwat", 1, 1, "A 69-year-old man is killed and his wife seriously injured in the brutal assault by Islamic militants."], ["2006.05.21", "Thailand", "Pattani", 1, 0, "A 22-year-old laborer is murdered by Islamic radicals on his job site."], ["2006.05.21", "Thailand", "Yala", 1, 0, "Muslims gun down a plantation worker."], ["2006.05.22", "Iraq", "Baghdad", 9, 15, "Separate Jihad bombings at a market and clinic end the lives of at least nine innocents."], ["2006.05.22", "Iraq", "Jbela", 3, 6, "Three civilians are killed by a terrorist bombing."], ["2006.05.22", "Iraq", "Jurf al-Sakhar", 4, 0, "Four policemen are blown to bits by radical Islamics."], ["2006.05.22", "Iraq", "Muqdadiya", 2, 0, "An Islamic radical walks into a shop and murders two occupants."], ["2006.05.22", "Pal. Auth.", "Gaza", 1, 1, "Hamas suspected in the assassination of a Fatah militant."], ["2006.05.22", "Thailand", "Pattani", 1, 0, "A Buddhist is shot off his motorcycle by Islamists, who then burn his body."], ["2006.05.23", "Afghanistan", "Helmand", 3, 6, "The Taliban ambush a vehicle carrying police, killing at least three."], ["2006.05.23", "Afghanistan", "Wardak", 4, 0, "Three health workers and their driver are killed when the Taliban bomb their car."], ["2006.05.23", "Chechnya", "Eshilkhatoy", 4, 3, "A Mujahideen attack on a security patrol leaves four dead and three injured."], ["2006.05.23", "India", "Srinagar", 2, 20, "Two people are killed when a Fedayeen detonates an explosives-laden vehicle along a city street."], ["2006.05.23", "India", "Srinagar", 2, 38, "Jaish-e-Mohammad terrorists rampage against unarmed civilians in the capital city."], ["2006.05.23", "India", "Thanala", 1, 0, "A civilian is beheaded by Islamic extremists."], ["2006.05.23", "Iraq", "Ain al- Tamur", 4, 0, "The bodies of four victims of sectarian violence are found blindfolded and shot."], ["2006.05.23", "Iraq", "Aswad", 3, 7, "Sunnis spray bullets into a crowd of Shia laborers, killing at least three."], ["2006.05.23", "Iraq", "Baghdad", 3, 12, "Radical Muslims bomb a bakery, killing three people inside."], ["2006.05.23", "Iraq", "Baghdad", 5, 5, "Terrorists detonate a car bomb, killing five innocents."], ["2006.05.23", "Iraq", "Baghdad", 11, 9, "Eleven people are killed when Sunnis detonate a bomb in the courtyard of a Shia mosque."], ["2006.05.23", "Iraq", "Baqubah", 3, 0, "Three elderly men sitting outside their home are gunned down by Islamic extremists."], ["2006.05.23", "Pal. Auth.", "Ramle", 1, 0, "A 24-year old woman is stabbed 29 times in broad daylight by her brother for 'unIslamic' behavior."], ["2006.05.23", "Philippines", "Jolo", 4, 0, "Muslim terrorists kill four government soldiers in three separate attacks over the weekend."], ["2006.05.23", "Thailand", "Narathiwat", 1, 1, "Muslim gunmen murder a civilian and seriously injure another."], ["2006.05.23", "Thailand", "Yala", 2, 0, "Two policemen are shot to death in the head and chest by Muslim militants."], ["2006.05.24", "Afghanistan", "Wazi Khwa", 3, 1, "Three truck drivers are murdered by the Taliban.  The victims included a 15-year-old boy."], ["2006.05.24", "Iraq", "Latifiya", 7, 0, "Seven people are brutally slain by Islamic terrorists."], ["2006.05.24", "Pal. Auth.", "Gaza", 1, 2, "Hamas assassination claims one life."], ["2006.05.24", "Philippines", "Jolo", 1, 0, "Abu Sayyaf kill a 22-year-old coffee shop worker."], ["2006.05.25", "Afghanistan", "Kabul", 2, 2, "A Taliban rocket attack on a residential area kills two civilians."], ["2006.05.25", "India", "Chewa", 1, 0, "A civilian is murdered by the Mujahideen."], ["2006.05.25", "India", "Srinagar", 4, 7, "An 8-year-old boy is among four killed when militant Muslims hurl a grenade at a tourist bus."], ["2006.05.25", "Iraq", "Muqdadiya", 5, 0, "Sunni Holy Warriors abduct five men from a wedding, including the groom and his father, then behead them in captivity."], ["2006.05.25", "Iraq", "Tikrit", 9, 0, "A Sufi mosque is bombed, killing two, and sectarian violence claims seven more lives elsewhere."], ["2006.05.25", "Philippines", "Jolo", 1, 0, "A 32-year-old cigarette vendor is gunned down by Abu Sayyaf near a Catholic church."], ["2006.05.25", "Somalia", "Mogadishu", 48, 50, "Nearly fifty more people are killed in violence sparked by Islamic militias."], ["2006.05.26", "India", "Kishtwar", 2, 0, "Harkat-ul-Jehad-e-Islami shoot two farmers to death in their field."], ["2006.05.26", "Iraq", "Baghdad", 3, 0, "Religious fundamentalists shoot three tennis players to death for wearing shorts."], ["2006.05.26", "Iraq", "Baghdad", 9, 51, "Islamic terrorists detonate two bombs at outdoor markets, killing at least nine and injuring over fifty."], ["2006.05.26", "Pakistan", "Miranshah", 1, 0, "A local man is executed by radical fundamentalists."], ["2006.05.27", "India", "Bandipura", 2, 1, "A woman is among two people shot to death by Islamic terrorists."], ["2006.05.27", "Iraq", "Baghdad", 4, 15, "Terrorists lob a mortar into a marketplace, killing at least four shoppers."], ["2006.05.27", "Iraq", "Baiji", 2, 1, "Jihadis murder two oil truck drivers."], ["2006.05.27", "Iraq", "Baqubah", 7, 5, "Islamic gunmen kill two brothers at an ironsmith shop, then three brothers at a nearby tire shop.  Two other people are killed elsewhere."], ["2006.05.27", "Thailand", "Pattani", 1, 3, "A 3-year-old baby is shot to death by Islamists, who also injure the mother, father and a brother in the attack."], ["2006.05.28", "India", "Srinagar", 3, 0, "Three civilians are murdered by Islamic terrorists in separate attacks - one as he lay injured in a hospital bed."], ["2006.05.28", "Iraq", "Baghdad", 2, 17, "Two civilians are killed in a double bombing by Islamic radicals."], ["2006.05.28", "Iraq", "Baqubah", 3, 0, "Three severed heads are thrown out of a car as it passes through the area where Islamic terrorists kidnapped three civilians."], ["2006.05.28", "Pakistan", "Datta Khel", 2, 3, "Two people are killed and three injured when a car bomb goes off at a checkpoint."], ["2006.05.28", "Pakistan", "Mir Ali", 1, 0, "Pro-Talibanis assassinate a tribal leader at a bazaar."], ["2006.05.28", "Pakistan", "Sindh", 2, 7, "Muslim gunmen open fire on a group of Hindus returning from a religious ceremony, killing two and injuring seven."], ["2006.05.28", "Thailand", "Narathiwat", 2, 1, "Two men riding in a pickup up truck are killed, and a woman seriously injured in an Islamic shooting attack."], ["2006.05.29", "Iraq", "Baghdad", 4, 7, "Four people are killed, including two members of a news crew, when radical Muslims bomb a U.S. convoy."], ["2006.05.29", "Iraq", "Baghdad", 29, 46, "Three separate Jihad bombings targeting a university, mosque, and a residential area leave at least twenty-seven innocents dead and nearly fifty injured."], ["2006.05.29", "Iraq", "Khalis", 14, 17, "Fourteen laborers traveling to work are blown to bits, and another sixteen left in agony by a bomb planted on a passenger bus."], ["2006.05.29", "Iraq", "Samarra", 2, 0, "Two brothers are gunned down by Muslim radicals as the are walking by the side of the road."], ["2006.05.29", "Pakistan", "Akori", 3, 0, "Local Taliban suspected in a landmine attack that leaves three small girls dead."], ["2006.05.29", "Pakistan", "Chakmalai", 1, 0, "A tribal leader is assassinated by pro-Taliban elements."], ["2006.05.29", "Pakistan", "Jacobabad", 5, 0, "A man kills his wife and four other relatives in an honor killing."], ["2006.05.29", "Philippines", "Jolo", 1, 0, "Abu Sayyaf gunmen murder a police officer."], ["2006.05.30", "Afghanistan", "Badakhshan", 2, 2, "Two Afghan employees of a U.S. firm are murdered by Taliban terrorists in a landmine attack."], ["2006.05.30", "Afghanistan", "Qalat", 1, 4, "A rocket attack by Taliban fundamentalists leaves at least one Afghan dead."], ["2006.05.30", "Afghanistan", "Shiberghan", 4, 0, "Three Afghan women working for a humanitarian aid agency are gunned down in cold blood along with their driver by religious fundamentalists."], ["2006.05.30", "India", "Srinagar", 1, 9, "A Jaish-e-Mohammad militant tosses a grenade into a crowd of people, killing one."], ["2006.05.30", "Iraq", "Baghdad", 9, 10, "Nine people in a bakery are cut down by a terrorist bombing."], ["2006.05.30", "Iraq", "Hilla", 12, 36, "A Fedayeen suicide car bomber massacres at least a dozen people near a car dealership."], ["2006.05.30", "Iraq", "Husaniya", 25, 65, "Jihadis bomb a market, slaughtering at least twenty-five innocents."], ["2006.05.30", "Pakistan", "Ferozewala", 4, 20, "Four people, including a woman and child, are killed when terrorists spray their vehicle with automatic weapons fire."], ["2006.05.30", "Pal. Auth.", "Balata", 1, 0, "A man is executed on a city street on suspicion of helping Jews."], ["2006.05.30", "Pal. Auth.", "Raffidiyeh", 1, 0, "A mother of four is shot to death in a hospital courtyard by relatives and al-Aqsa Martyrs Brigade."], ["2006.05.30", "Thailand", "Yala", 1, 0, "Muslims shoot a 50-year-old man to death."], ["2006.05.31", "India", "Dalgate", 1, 36, "Thirty-six tourists are injured in two Mujahideen attacks on their buses.  One succumbs to injuries on June 2."], ["2006.05.31", "India", "Thal", 1, 0, "Islamic terrorists slit the throat of a villager."], ["2006.05.31", "Iraq", "Baghdad", 1, 0, "A TV sports anchorman is killed by religious fundamentalists as he stepped out of his house."], ["2006.05.31", "Iraq", "Baghdad", 46, 0, "Forty-six victims of sectarian violence are found with signs of torture in various locales around the capital."], ["2006.05.31", "Iraq", "Muqdadiya", 2, 0, "The mayor and his cousin are killed when Islamic radical put a bomb under his car."], ["2006.06.01", "India", "Budhal", 1, 0, "A civilian is abducted and murdered by the Mujahideen."], ["2006.06.01", "Iraq", "Baghdad", 6, 21, "Islamic terrorist kill six people, including two laborers in a roadside bombing."], ["2006.06.01", "Iraq", "Samarra", 1, 4, "A woman is blown apart by Islamic terrorists."], ["2006.06.01", "Kosovo", "Zitkovac", 1, 0, "A 22-year-old man is shot to death in an automatic weapons ambush by suspected Albanians."], ["2006.06.02", "Afghanistan", "Azmarai", 3, 0, "A Fedayeen suicide bomber kills three civilians returning from a picnic."], ["2006.06.02", "India", "Bhata", 1, 0, "A civilian is abducted and murdered by the Mujahideen."], ["2006.06.02", "Iraq", "Baghdad", 7, 61, "Three terrorist bombings, two at the same market, kill at least seven innocents."], ["2006.06.02", "Iraq", "Khaldiya", 3, 0, "Three victims of sectarian violence are found tortured and executed."], ["2006.06.02", "Pakistan", "Miran Shah", 4, 7, "Two Fedayeen suicide bombers blow themselves to Allah, taking four Pakistani soldiers with them."], ["2006.06.02", "Pakistan", "Noor Gul", 2, 1, "Two people are killed when militants fire a rocket at a house."], ["2006.06.02", "Syria", "Damascus", 1, 0, "Armed Islamists attempt to storm a radio station.  A security guard is killed."], ["2006.06.02", "Thailand", "Yala", 1, 0, "A local official is gunned down by Islamists."], ["2006.06.03", "Iraq", "Baghdad", 23, 4, "Twenty-two bodies are found showing signs of torture and Islamists also kill a Russian diplomat."], ["2006.06.03", "Iraq", "Baquba", 8, 0, "Eight severed Sunni heads are found."], ["2006.06.03", "Iraq", "Baquba", 9, 2, "Islamic radicals storm an auto parts shop killing three workers.  Six police are killed in a separate attack on a checkpoint."], ["2006.06.03", "Iraq", "Basra", 28, 62, "'Insurgents' bomb a packed market, blowing twenty-eight innocent souls to Allah and injuring dozens more."], ["2006.06.04", "Afghanistan", "Kandahar", 4, 13, "A suicidal religious extremist blows up four civilians with an explosives-laden vehicle."], ["2006.06.04", "Afghanistan", "Paktika", 1, 0, "A health official is shot dead by the Taliban as he is leaving his home."], ["2006.06.04", "India", "Rajouri", 1, 0, "Islamic radicals kill a man inside his home."], ["2006.06.04", "Ingushetia", "Nazran", 1, 2, "Muslim militants kill a soldier in a terror attack."], ["2006.06.04", "Iraq", "Baghdad", 19, 2, "Radical Islamic gunmen kill four employees at a local company and fifteen others in various parts of the capital."], ["2006.06.04", "Iraq", "Diyala", 21, 1, "Sunnis drag twenty-one people, mostly Shia high school students, from a bus and execute them in cold blood."], ["2006.06.04", "Pakistan", "Shena Khowar", 2, 3, "al-Qaeda back militants use an IED to kill two Pakistani soldiers in a roadside blast."], ["2006.06.04", "Pal. Auth.", "Gaza", 3, 0, "Three civilian bystanders are shot to death by Hamas gunmen."], ["2006.06.04", "Pal. Auth.", "Khan Younis", 1, 2, "Militants kill a pregnant woman."], ["2006.06.05", "Iraq", "Suwayra", 4, 0, "Four men are stabbed to death by Muslim militants."], ["2006.06.06", "Afghanistan", "Khogyani", 2, 2, "A Taliban roadside attack leaves two soldiers dead."], ["2006.06.06", "Afghanistan", "Oal a-I Oadzi", 3, 8, "Three children are among the casualties when religious extremists blow up a mosque and school."], ["2006.06.06", "Iraq", "Baghdad", 5, 7, "At least two women are among five civilians killed by Muslim terrorists in three attacks, which include a husband and wife gunned down on a city street."], ["2006.06.06", "Iraq", "Baqubah", 9, 0, "Nine more severed heads are found, courtesy of the Religion of Peace.."], ["2006.06.07", "India", "Patnazi", 1, 0, "Islamic terrorists murder an 18-year-old girl in her home."], ["2006.06.07", "Iraq", "Baghdad", 11, 5, "Separate attacks and the discovery of five bodies add up to eleven dead in sectarian violence."], ["2006.06.07", "Iraq", "Baqubah", 2, 0, "Two ship-owners are gunned down by Islamic radicals."], ["2006.06.07", "Iraq", "Mosul", 6, 0, "Six people, including three university students are shot to death by Muslim terrorists."], ["2006.06.08", "Afghanistan", "Bala Buluk", 1, 0, "Two Talibanis kill a government official on a city street."], ["2006.06.08", "Afghanistan", "Balkh", 2, 1, "Two humanitarian workers are murdered in a shooting attack by religious fundamentalists."], ["2006.06.08", "Afghanistan", "Ghazni", 3, 1, "Three Afghans are murdered by a Taliban roadside bomb."], ["2006.06.08", "Afghanistan", "Kandahar", 2, 0, "The Taliban kill two policemen, then mutilated their bodies."], ["2006.06.08", "Iraq", "Baghdad", 15, 23, "Jihadis target an outdoor market with separate car bombs, killing at least fifteen innocents."], ["2006.06.08", "Iraq", "Baghdad", 19, 50, "Nineteen people are killed and more than fifty injured by two terror bombings near a market."], ["2006.06.08", "Iraq", "Kazimiyah", 6, 15, "Six day laborers are blown apart by a Muslim car bomb."], ["2006.06.08", "Philippines", "Patikul", 1, 2, "Islamists attack Christians at a carnival, killing one and injuring two more."], ["2006.06.08", "Thailand", "Narathiwat", 5, 3, "Five policemen are blown to bits by militant Muslims in a landmine attack."], ["2006.06.08", "Turkey", "Istanbul", 1, 0, "Islamists suspected in the assassination of a lawyer."], ["2006.06.09", "Ingushetia", "Karabulak", 1, 0, "A woman is gunned down by Muslim radicals."], ["2006.06.09", "Ingushetia", "Ordzhonikidzevskaya", 6, 0, "Three young children are among six killed in a targeted Jihad ambush on a vehicle."], ["2006.06.09", "Pakistan", "Wana", 1, 4, "An 18-year-old farm worker is killed in a landmine attack."], ["2006.06.10", "Iraq", "Baghdad", 9, 41, "Islamic radicals set off bombs near two crowded shopping areas, killing at least nine and injuring over forty others."], ["2006.06.10", "Iraq", "Khan Bani Saad", 2, 0, "Shiites kidnap two Sunni brothers from their workplace and then chop off their heads."], ["2006.06.11", "Afghanistan", "Kandahar", 4, 0, "Four road workers are murdered by the Taliban."], ["2006.06.11", "Algeria", "Skikda", 1, 3, "Fundamentalists capture a civilian and cut his throat on video."], ["2006.06.11", "Chechnya", "Niki-Khita", 1, 1, "A Jihad ambush kills one Russian and injures another."], ["2006.06.11", "Iraq", "Baghdad", 6, 42, "Muslim terrorists detonate a car bomb in a commercial district, killing at least six innocents."], ["2006.06.11", "Iraq", "Fallujah", 2, 0, "A man and a woman are brutally gunned down by Muslim terrorists."], ["2006.06.11", "Iraq", "Tikrit", 1, 0, "An Iraqi soldier is captured and beheaded by the Mujahideen."], ["2006.06.11", "Israel", "Jerusalem", 1, 4, "Palestinian gunmen fire on a car carrying Israelis, killing a 35-year-old father."], ["2006.06.11", "Thailand", "Narathiwat", 1, 0, "A young man is murdered by Islamic extremists outside a mosque."], ["2006.06.12", "Afghanistan", "Ghazni", 1, 1, "Religious extremists attack a private truck convoy, killing one of the drivers."], ["2006.06.12", "Afghanistan", "Paktia", 2, 5, "Two passengers in a car are killed and five injured when the Taliban place a bomb under a bridge."], ["2006.06.12", "India", "Budora", 1, 0, "A newly recruited soldier, home on leave, is abducted, tortured and beheaded by the Mujahideen."], ["2006.06.12", "India", "Jammu", 1, 22, "Hindu pilgrims at a bus stop are the targets of a grenade attack by Islamic militants."], ["2006.06.12", "India", "Kulgam", 8, 5, "Hizbul Mujahideen massacre eight migrant laborers."], ["2006.06.12", "India", "Sopore", 3, 0, "Three people are killed in two separate Islamic grenade attacks."], ["2006.06.12", "Iraq", "Baghdad", 5, 19, "A suicidal Sunni blows up five Shiites at a market."], ["2006.06.12", "Iraq", "Baghdad", 6, 12, "Sunni radicals bomb a minibus carrying oil workers, killing six."], ["2006.06.12", "Iraq", "Balad", 2, 26, "A market is once again the target of Islamic militants, who blast at least two shoppers to Allah."], ["2006.06.12", "Iraq", "Suwayra", 9, 0, "A 10-year-old boy is among nine people killed by radical Shiites and dumped into a river."], ["2006.06.12", "Iraq", "Tal Afar", 4, 43, "A Fedayeen suicide bomber plows into a gas station, sending at least four civilians to Allah."], ["2006.06.13", "Algeria", "Skikda", 1, 3, "A bomb attack by Islamic fundamentalists kills an Algerian soldier."], ["2006.06.13", "India", "Anantnag", 1, 0, "The Mujahideen abduct a civilian, murder him and then toss his body in a stream."], ["2006.06.13", "Iraq", "Baghdad", 7, 0, "Islamists shoot a university professor to death as six bodies showing signs of torture are found elsewhere."], ["2006.06.13", "Iraq", "Kirkuk", 22, 43, "A series of Jihad car bombings leave at least twenty people dead, mostly civilians."], ["2006.06.14", "India", "Bandipore", 2, 0, "Two civilians are gunned down by the Mujahideen."], ["2006.06.14", "India", "Sopore", 1, 0, "A man is murdered by Islamic terrorists."], ["2006.06.14", "Iraq", "Baghdad", 2, 7, "Jihadis detonate a car bomb near a market, killing two civilians."], ["2006.06.14", "Pakistan", "Thabi", 1, 0, "A man is kidnapped and beheaded by local Taliban."], ["2006.06.15", "Afghanistan", "Kandahar", 10, 16, "Religious extremists bomb a minibus carrying laborers, killing at least ten people."], ["2006.06.15", "Algeria", "Gouraya", 10, 0, "Two people are beheaded by Islamic fundamentalists, who also kill seven other persons in separate attacks."], ["2006.06.15", "India", "Dunga", 1, 13, "Two brothers are brutally tortured by Islamists, who cut off their tongues, noses and ears.  Their 60-year-old father is also shot to death."], ["2006.06.15", "India", "Srundoo", 1, 0, "The Mujahideen gun down a civilian."], ["2006.06.15", "Iraq", "Baqubah", 10, 2, "Muslim gunmen slaughter ten laborers as they are headed to work.  All are shot to death."], ["2006.06.15", "Iraq", "Tikrit", 4, 15, "Radicals storm a mosque and shoot a cleric and three others to death."], ["2006.06.15", "Pakistan", "Hasilpur", 1, 1, "An elderly man is killed by a Muslim mob as he tries to protect another man from torture over suspicion of blasphemy."], ["2006.06.15", "Pakistan", "Karachi", 5, 6, "Militants ambush a car carrying policemen on a city street, killing five people."], ["2006.06.15", "Pakistan", "Mir Ali", 1, 0, "A journalist who was abducted six months earlier is executed by Islamists while in handcuffs."], ["2006.06.15", "Thailand", "Pattani", 1, 6, "A man is killed by Muslim bombers targeting a city hall."], ["2006.06.15", "Thailand", "Pattani", 1, 10, "Islamists bomb a tea shop, killing a Buddhist patron.  Just one of 41 bombs set that morning."], ["2006.06.16", "India", "Bandipore", 2, 3, "The Mujahideen stages a grenade attack along a city street, killing two civilians."], ["2006.06.16", "India", "Kashmir", 2, 0, "Two civilians are murdered by militant Muslims in separate attacks."], ["2006.06.16", "Iraq", "Baghdad", 3, 16, "Muslim terrorists fire mortar rounds into a residential neighborhood, killing at least three Iraqis."], ["2006.06.16", "Iraq", "Baghdad", 11, 25, "A Sunni suicide bomber hits a Shiite mosque, blasting eleven worshippers to Allah and leaving dozens more in agony."], ["2006.06.16", "Iraq", "Fallujah", 5, 0, "Jihad gunmen massacre five truck drivers trying to make a living."], ["2006.06.16", "Iraq", "Yusifiyah", 3, 0, "Islamic terrorists attack a checkpoint and kidnap two U.S. soldiers, who are later tortured to death."], ["2006.06.16", "Pakistan", "Muzzafargarh", 1, 0, "A man accused of blasphemy is knifed to death by two religious men outside a courtroom."], ["2006.06.16", "Pakistan", "Orakzai", 4, 0, "Two girls under the age of 5 are slaughtered along with two women working for an NGO by Muslim gunmen who broke into their home in the middle of the night."], ["2006.06.16", "USA", "Baltimore, MD", 1, 0, "A 62-year-old Jewish movie-goer is shot to death by a Muslim gunman in an unprovoked terror attack."], ["2006.06.17", "Iraq", "Baghdad", 3, 14, "Muslim extremists bomb a minibus, killing at least four passengers."], ["2006.06.17", "Iraq", "Baghdad", 8, 37, "Jihadis target two markets with explosives, killing at least eight shoppers and leaving another 25 in various stages of injury."], ["2006.06.17", "Iraq", "Baghdad", 23, 52, "Two suicidal Sunnis slaughter dozens in separate attacks at traffic checkpoints."], ["2006.06.17", "Thailand", "Yala", 1, 2, "Islamists bomb a karaoke bar, killing one patron."], ["2006.06.18", "Afghanistan", "Helmand", 32, 14, "Some thirty members of the same family are massacred by the Taliban."], ["2006.06.18", "Iraq", "Baqubah", 13, 0, "Radical Muslims gun down three people in cold blood, as ten other bodies are found elsewhere."], ["2006.06.18", "Iraq", "Mosul", 1, 19, "Jihadis murder a high-school girl and injure nineteen others with a car bomb."], ["2006.06.18", "Thailand", "Narathiwat", 1, 0, "A 48-year-old man out for a Sunday drive is shot to death by Islamists."], ["2006.06.18", "Thailand", "Pattani", 1, 2, "An 88-year-old woman is murdered when Islamists open up on a crowd with automatic weapons."], ["2006.06.19", "Afghanistan", "Kandahar", 4, 0, "Four members of a construction company are killed when religious extremists attack their vehicle."], ["2006.06.19", "India", "Tangmarg", 1, 0, "A civilian is abducted and murdered by the Mujahideen."], ["2006.06.19", "Iraq", "Baghdad", 7, 13, "Seven civilians are murdered by Islamic terrorists in two car bombings."], ["2006.06.19", "Pakistan", "Wana", 1, 0, "Militant Muslims assassinate a tribal chief."], ["2006.06.20", "Algeria", "Blida", 5, 0, "Five farmers are murdered by Islamic fundamentalists in a gruesome knife attack."], ["2006.06.20", "India", "Aaora Missipora", 1, 0, "A political activist is shot to death by the Mujahideen."], ["2006.06.20", "Iraq", "Baghdad", 2, 18, "Islamic terrorists kill two civilians in a bomb attack on a commercial area."], ["2006.06.20", "Iraq", "Basra", 2, 3, "Elderly patients at an old age home are targeted by a Sunni suicide bomber.  Two are killed."], ["2006.06.20", "Iraq", "Suwayra", 7, 0, "The bodies of seven victims of Islamic radicals are found handcuffed and tortured."], ["2006.06.21", "Afghanistan", "Kandahar", 1, 7, "A Fedayeen suicide bomber kills a civilian and injures seven others."], ["2006.06.21", "Algeria", "Bouira", 6, 3, "Islamic fundamentalists ambush a security patrol, killing six individuals."], ["2006.06.21", "Dagestan", "Khasavyurt", 2, 0, "Two policemen sitting in a car are slaughtered in a brutal shooting attack at a traffic stop."], ["2006.06.21", "Iraq", "Baghdad", 4, 6, "Jihadis murder two people with a car bomb at a crowded market.  Elsewhere, a Sunni imam and a high school teacher are gunned down."], ["2006.06.21", "Pakistan", "Bannu", 3, 1, "Three Pakistan policemen on patrol are murdered by al-Qaeda backed terrorists."], ["2006.06.22", "India", "Rajpura", 1, 0, "A civilian is killed in his home by the Mujahideen."], ["2006.06.22", "India", "Sopore", 2, 20, "Muslim militants hurl a grenade at the house of a religious rival, killing a woman and a child, and injuring twenty others."], ["2006.06.22", "Iraq", "Hawija", 1, 0, "A carpenter is murdered by Islamic terrorists."], ["2006.06.23", "Afghanistan", "Zabul", 4, 0, "The Taliban kidnap four civilians and then cut off their heads."], ["2006.06.23", "India", "Lal Chowk", 1, 0, "Islamists murder a police officer on a city street in the capital."], ["2006.06.23", "Iraq", "Baghdad", 5, 0, "The bodies of five factory workers, kidnapped the day before, are found in a river."], ["2006.06.23", "Iraq", "Basra", 5, 15, "At least five people are killed when Islamic militants bomb a gas station."], ["2006.06.23", "Iraq", "Hibhib", 10, 15, "Shia terrorists bomb a Sunni mosque, killing at least ten."], ["2006.06.23", "Philippines", "Shariff Aguak", 6, 9, "Six shoppers are blown to bits when Filipino Muslims set off a bomb at a crowded market."], ["2006.06.23", "Somalia", "Mogadishu", 1, 0, "A Swedish journalist attending an Islamic rally is shot fatally in the chest."], ["2006.06.24", "Afghanistan", "Khost", 1, 0, "Religious extremists kill a policeman as he is driving to work."], ["2006.06.24", "India", "Palhalan", 1, 1, "A 12-year-old boy is killed in a Mujahideen ambush."], ["2006.06.24", "India", "Srinigar", 1, 9, "An Islamic militant tosses a grenade into a crowded street crossing."], ["2006.06.24", "Iraq", "Baqubah", 14, 5, "Three civilians at a car dealership are among fourteen who loose their lives to Islam in four terror attacks."], ["2006.06.24", "Iraq", "Suwayra", 1, 0, "A young woman is tortured and beheaded by angry Muslims."], ["2006.06.25", "India", "Tral", 1, 0, "The Mujahideen kidnap a policeman and then torture and execute him."], ["2006.06.25", "Iraq", "Baghdad", 3, 0, "Islamists read from the Qur'an as they execute three Russian hostages in cold blood.  The last two are forced to stand over the blood and decapitated body of the first."], ["2006.06.25", "Iraq", "Baghdad", 5, 22, "Two Jihad bombings, one in a shopping center and the other on a minibus, leave at least five Iraqi civilians dead."], ["2006.06.25", "Iraq", "Hawija", 3, 0, "Three Shiites are killed in a drive-by shooting."], ["2006.06.25", "Israel", "Kerem Shalom", 2, 3, "Hamas takes credit for an attack on Israel that leaves two IDF soldiers dead and a third kidnapped."], ["2006.06.25", "Israel", "Ramallah", 1, 0, "An 18-year-old Israeli hitchhiker is picked up by Palestinian terrorists and murdered."], ["2006.06.25", "Pakistan", "Karachi", 2, 0, "Muslims gun down two civilians in a suspected sectarian attack."], ["2006.06.25", "USA", "Denver, CO", 1, 5, "Saying that it was 'Allah's choice', a Muslim shoots four of his co-workers and a police officer."], ["2006.06.26", "India", "Bandipore", 3, 0, "Islamic radicals gun down three civilians."], ["2006.06.26", "India", "Baramulla", 2, 0, "Two civilians are murdered by the Mujahideen in separate attacks."], ["2006.06.26", "Iraq", "Baqubah", 18, 25, "Islamic terrorists bomb a crowded market, slaughtering at least eighteen innocents."], ["2006.06.26", "Iraq", "Hilla", 6, 56, "Six shoppers at a market are murdered in a Jihad bombing."], ["2006.06.26", "Pakistan", "Guldar", 5, 0, "Local Talibanis attack a civilian and kill him along with four family members."], ["2006.06.26", "Pakistan", "Karachi", 1, 0, "A Muslim man slits his pregnant wife's throat in an honor killing."], ["2006.06.26", "Pakistan", "North Waziristan", 6, 5, "A Fedayeen suicide bomber plows into a checkpoint, taking the lives of six Pakistanis."], ["2006.06.27", "Afghanistan", "Kunduz", 2, 8, "Fedayeen bombers target German peacekeepers, but kill two civilians."], ["2006.06.27", "India", "Rajpora", 2, 0, "Two people are kidnapped by Islamic militants, and then executed with their bodies thrown into a stream."], ["2006.06.27", "Iraq", "Baghdad", 3, 3, "Three policemen are killed in a roadside terror bombing."], ["2006.06.27", "Iraq", "Baghdad", 3, 10, "A nail-packed bomb at a market kills three."], ["2006.06.27", "Iraq", "Kirkuk", 3, 21, "Jihadis blow up a gas station, killing three patrons."], ["2006.06.27", "Somalia", "Lafole", 6, 0, "Islamic militias break a truce and attack two checkpoints."], ["2006.06.27", "Thailand", "Narathiwat", 2, 0, "Two villagers are murdered by Islamic radicals."], ["2006.06.27", "Thailand", "Yala", 1, 0, "A man is killed in his home by Islamists."], ["2006.06.27", "Thailand", "Yala", 5, 1, "Islamists target a convoy of teachers with a bomb.  Five security guards are killed in the explosion."], ["2006.06.28", "Iraq", "Baqubah", 3, 12, "Jihadis use a car bomb in a crowd of laborers looking for work.  Children are among the casualties."], ["2006.06.28", "Nigeria", "Izom", 1, 0, "A 20-year-old woman is stoned to death by a Muslim mob after she criticized Islam."], ["2006.06.28", "Philippines", "Maguindanao", 1, 2, "A government official is gunned down and two 9-year-old girls are wounded by suspected Muslims ."], ["2006.06.28", "Thailand", "Narathiwat", 1, 5, "Islamic gunmen storm into a karaoke bar, killing one and injuring five others."], ["2006.06.29", "Algeria", "Albalouta", 2, 11, "Islamic fundamentalists attack a communal guard post with rockets, killing two people, whose bodies they later burned."], ["2006.06.29", "India", "Kashmir", 2, 0, "Two civilians are shot to death by radical Muslims in separate attacks (Kangan and Bandipore)."], ["2006.06.29", "Iraq", "Baghdad", 8, 4, "In separate attacks, Jihadis kill eight civilians including a baker, and electrical worker, a garbage collector and a university professor."], ["2006.06.29", "Iraq", "Hilla", 14, 0, "Fourteen bodies are found in Hilla, Kut and Karbala.  The victims included women and children who were killed in brutal fashion."], ["2006.06.29", "Iraq", "Kirkuk", 2, 0, "A 15-year-old girl is among two people kidnapped and murdered by radical Muslims."], ["2006.06.29", "Iraq", "Kirkuk", 4, 27, "A suicide bomber kills four Iraqis at a funeral."], ["2006.06.30", "Iraq", "Baghdad", 7, 0, "Six bodies are found dumped in a house and Jihadi terrorists elsewhere gun down an Imam."], ["2006.06.30", "Pakistan", "Gadi Wind", 1, 0, "A group of Muslim bulldoze a Christian family's house, killing an infant."], ["2006.06.30", "Pakistan", "Ipi", 1, 0, "Shouting \"Allah Akbar,\" executioners shoot a man to death in a public square."], ["2006.06.30", "Pakistan", "Spinkai Raghzai", 1, 3, "Local Taliban shoot a rival religious leader to death."], ["2006.07.01", "Afghanistan", "Sangin", 3, 4, "Two Brits and an Afghan interpreter are killed in an attack on their compound by the Taliban."], ["2006.07.01", "Iraq", "Baghdad", 62, 114, "Sixty-two Shiite shoppers are blown to bits in a horrific marketplace bombing by Sunni terrorists that leaves over a hundred others in various stages of suffering."], ["2006.07.01", "Iraq", "Haditha", 5, 12, "Jihadis mortar a residential neighborhood, killing five residents."], ["2006.07.01", "Iraq", "Mosul", 2, 6, "Two people are killed by a suicide bomber."], ["2006.07.01", "Thailand", "Narathiwat", 1, 0, "Radical Muslims shoot a 22-year-old man to death as he is sleeping in the back of his pick-up truck."], ["2006.07.01", "Thailand", "Yala", 1, 0, "Muslim terrorists shoot a civilian off of his motorcycle."], ["2006.07.02", "India", "Mumbai", 1, 0, "An 18-year-old girl is strangled by her family for loving a Hindu boy.  Her father then chops up the body."], ["2006.07.02", "Iraq", "Baghdad", 3, 29, "Three separate bombings kill three people and injure over two dozen others."], ["2006.07.02", "Iraq", "Baqubah", 2, 3, "Two members of a family are killed when Islamic terrorists set off a bomb outside their home."], ["2006.07.02", "Pakistan", "Lower Dir", 6, 7, "Six members of a security patrol are killed by a Taliban landmine at an Afghan refugee camp."], ["2006.07.02", "Pakistan", "Ningolai", 2, 0, "A 15-year-old boy is among two people murdered by Muslim terrorists."], ["2006.07.03", "Afghanistan", "Herat", 1, 6, "A female university student is murdered by religious extremists."], ["2006.07.03", "Afghanistan", "Kandahar", 1, 6, "Fedayeen suicide bomber kills one other person."], ["2006.07.03", "Afghanistan", "Kunar", 5, 1, "Five laborers are shot to death by Taliban extremists."], ["2006.07.03", "India", "Poonch", 1, 0, "Hizb-ul-Mujahideen kidnap a police officer then cut out his eyes, ears and penis before slitting his throat."], ["2006.07.03", "Iraq", "Diwaniya", 3, 0, "Religious fundamentalists kill two alcohol traders.  A third person is beheaded elsewhere."], ["2006.07.03", "Iraq", "Hawija", 1, 0, "Islamic terrorists kidnap and behead a civilian."], ["2006.07.03", "Iraq", "Mosul", 5, 28, "Jihadis bomb a crowded market, killing five innocents."], ["2006.07.04", "Chechnya", "Avtury", 6, 14, "The Mujahideen fire rockets at a truck convoy, killing at least six Russians."], ["2006.07.04", "India", "Sarharda", 1, 0, "Lashkar-e-Toiba kidnap a man, take him to a field and then slit his throat."], ["2006.07.04", "Iraq", "Karbala", 6, 0, "Six civilians are killed execution style by Muslim terrorists."], ["2006.07.04", "Philippines", "Patikul", 2, 0, "Abu Sayyaf terrorists ambush and kill two government soldiers."], ["2006.07.04", "Somalia", "Mogadishu", 2, 0, "Hard-line Islamists open fire on a group of teenagers watching a World Cup match, killing two, including a girl."], ["2006.07.04", "Turkey", "Gaziantep", 1, 0, "A pregnant 16-year-old girl is brutally slain in her bed by her brother in an 'honor killing.'"], ["2006.07.05", "Afghanistan", "Kabul", 1, 47, "Three Taliban bombs against commuter buses leave at least one person dead."], ["2006.07.05", "Iraq", "Baghdad", 2, 10, "Jihadis bomb a restaurant, killing two people."], ["2006.07.05", "Nigeria", "Kumutu", 3, 30, "Nigerian 'Taliban' attacks Christian villagers, killing at least three."], ["2006.07.05", "Thailand", "Yala", 1, 0, "A man is shot to death by Islamic gunmen while riding a motorcycle."], ["2006.07.06", "Iraq", "Kufa", 13, 41, "Sunni 'freedom fighters' blast two buses full of Shiite pilgrims with a car bomb, killing at least thirteen."], ["2006.07.07", "Iraq", "Baghdad", 3, 30, "Sunnis mortar a Shia mosque, killing at least three innocents."], ["2006.07.07", "Iraq", "Baghdad", 5, 9, "Shia terrorists bomb two Sunni mosques, killing five people."], ["2006.07.07", "Iraq", "Khadimiyah", 4, 38, "Islamic terrorists massacre four children in a mortar attack on a field where they are playing."], ["2006.07.07", "Iraq", "Tal Banat", 6, 46, "Six Shia worshippers at a mosque are blown apart by Sunni radicals in a bombing."], ["2006.07.08", "Chechnya", "Shelkovskaya", 4, 2, "Four civilians are murdered by the Mujahideen in an ambush on their vehicle."], ["2006.07.08", "India", "Kulgam", 5, 32, "Five people are killed when Islamic militants lob grenades at a female political figure."], ["2006.07.08", "Ingushetia", "Sunzhensky", 2, 1, "Militants ambush a car with automatic weapons, killing two occupants."], ["2006.07.08", "Iraq", "Baghdad", 13, 14, "Five horrible attacks on civilians by Muslim terrorists leave thirteen dead, including six people who were merely collecting rags."], ["2006.07.09", "Iraq", "Baghdad", 19, 59, "Radical Sunnis bomb a Shiite mosque, killing nineteen innocents."], ["2006.07.09", "Iraq", "Baghdad", 41, 0, "Radical Shiites set up a phony roadblock and shoot 41 Sunni civilians to death in retaliation for a mosque bombing."], ["2006.07.09", "Kyrgyzstan", "Jalal-Abad", 1, 3, "Islamic militants gun down a policeman."], ["2006.07.09", "Somalia", "Mogadishu", 19, 20, "At least nineteen people are killed when Islamic militias attack a compound."], ["2006.07.09", "Thailand", "Narathiwat", 1, 0, "Muslim radicals gun down a young man at a rubber plantation."], ["2006.07.10", "Algeria", "Tipaza", 6, 4, "Algerian fundamentalists kill six people in an attack on a community."], ["2006.07.10", "Iraq", "Baghdad", 6, 28, "Jihadis kill six with a car bomb located outside a restaurant."], ["2006.07.10", "Iraq", "Kirkuk", 3, 8, "A Fedayeen suicide bomber murders three others."], ["2006.07.10", "Iraq", "Suwayra", 5, 0, "Five civilians are kidnapped and executed by the Mujahideen."], ["2006.07.10", "Pakistan", "Babara", 2, 0, "Local Islamists kill a tribal leader and a community guard in a pre-dawn attack."], ["2006.07.10", "Pakistan", "Malir", 1, 0, "A prominent Sunni is gunned down in a sectarian attack."], ["2006.07.11", "India", "Mumbai", 209, 714, "Lashkar-e-Toiba and local Students Islamic Movement of India set off coordinated bombs that kill nearly two hundred train commuters during the busy rush hour."], ["2006.07.11", "India", "Srinagar", 9, 43, "The Mujahideen hurl grenades at tourists, killing nine, including four women."], ["2006.07.11", "Iraq", "Baghdad", 15, 13, "A double suicide bombing by determined Muslims ends the lives of fifteen innocent people."], ["2006.07.11", "Iraq", "Baghdad", 23, 15, "In three horrible attacks, Islamic radicals kill twenty-three innocent people, including ten Shias on their way to a funeral."], ["2006.07.11", "Iraq", "Baqubah", 19, 0, "Nineteen people are gunned down by Muslim terrorists."], ["2006.07.11", "Somalia", "Mogadishu", 140, 150, "Islamic militias stage a Jihad attack a compound.  At least one-hundred and forty are killed in the following two days."], ["2006.07.12", "Afghanistan", "Khost", 1, 5, "A child is killed by a suicide bomber."], ["2006.07.12", "Afghanistan", "Spin Boldak", 2, 8, "The Taliban place a bomb in a fruit cart, killing two innocents."], ["2006.07.12", "Afghanistan", "Zabul", 3, 0, "Three Afghan border guards are killed by Islamic extremists."], ["2006.07.12", "Iraq", "Baghdad", 7, 20, "A Fedayeen suicide bomber walks into a restaurant and sends seven patrons to Allah."], ["2006.07.12", "Iraq", "Muqdadiya", 20, 0, "Twenty bus drivers are kidnapped and brutally executed by Sunni radicals."], ["2006.07.12", "Iraq", "Tikrit", 2, 0, "Two carpenters are murdered by Muslim militants."], ["2006.07.12", "Israel", "Lebanese Border", 7, 2, "Hezbollah stages a cross-border raid into Israel, killing seven Israelis and capturing two."], ["2006.07.12", "Somalia", "Jowhar", 1, 0, "Islamists shoot a man to death for complaining about new religious taxes."], ["2006.07.12", "Thailand", "Narathiwat", 1, 0, "A school principal is killed by Islamic terrorists."], ["2006.07.13", "India", "Magnar", 4, 2, "Two children are among four people killed by Lashkar-e-Toiba radicals, who gun down villagers in a heinous attack."], ["2006.07.13", "Iraq", "Kirkuk", 3, 5, "Jihadis use a car bomb to kill three people."], ["2006.07.13", "Iraq", "Mosul", 5, 5, "A suicide car bomber sends five others to Allah."], ["2006.07.13", "Israel", "Nahariya", 1, 29, "A woman is killed in her home by Hezbollah rockets."], ["2006.07.13", "Israel", "Safed", 1, 21, "A 70-year-old Israeli woman is killed by a Hezbollah rocket."], ["2006.07.13", "Thailand", "Narathiwat", 1, 6, "Islamists set off a bomb in a market, killing one person."], ["2006.07.14", "Iraq", "Baghdad", 7, 5, "Muslim radicals bomb a rival mosque, killing seven."], ["2006.07.14", "Israel", "Meron", 2, 3, "Hezbollah rockets kill an elderly woman and her 5-year-old grandson.  The boy's mother and father are seriously injured."], ["2006.07.14", "Pakistan", "Karachi", 3, 1, "A suicide bomber kills a Shiite cleric, his nephew and a guard."], ["2006.07.14", "Philippines", "Zamboanga", 2, 1, "An Abu Sayyaf member carrying a Qur'an guns down two policemen."], ["2006.07.14", "Thailand", "Yala", 1, 0, "A 52-year-old man is gunned down by Islamic radicals."], ["2006.07.15", "India", "Ganderbal", 2, 3, "The Mujahideen kill a civilian with a grenade.  An injured man succumbs to injuries a day later."], ["2006.07.15", "India", "Hilltak", 2, 0, "Two adults are killed inside their home by the Mujahideen."], ["2006.07.15", "Iraq", "Baghdad", 5, 4, "A suicide bomber kills two policemen.  Elsewhere, Jihadis gun down three brothers."], ["2006.07.15", "Iraq", "Kirkuk", 1, 2, "A bomb placed inside a computer explodes at an Internet cafe, killing one."], ["2006.07.16", "India", "Darhal", 2, 0, "Two civilians are abducted and murdered by the Mujahideen."], ["2006.07.16", "Iraq", "Baghdad", 6, 40, "Separate terror attacks leave ten civilians dead about forty injured."], ["2006.07.16", "Iraq", "Baghdad", 26, 22, "A suicidal Sunni bomber slaughters twenty-six Shiite patrons in a cafe."], ["2006.07.16", "Iraq", "Kirkuk", 2, 0, "Two barbers are murdered by Islamic fundamentalists."], ["2006.07.16", "Iraq", "Mosul", 6, 0, "Three woman are among six people executed by Muslim radicals and dumped."], ["2006.07.16", "Iraq", "Muqdadiyah", 3, 0, "Three people, including a boy and woman are gunned down by Shia radicals."], ["2006.07.16", "Israel", "Haifa", 8, 17, "Hezbollah fires Iranian missiles at an Israeli city, killing eight residents."], ["2006.07.16", "Thailand", "Pattani", 1, 0, "A 40-year-old retired policeman is killed by Islamic militants as he entered his home."], ["2006.07.16", "Thailand", "Pattani", 1, 0, "A man is stabbed to death by Muslim militants and dumped into a river."], ["2006.07.16", "Thailand", "Pattani", 1, 0, "Islamists on a motorcycle pump four rounds into a civilian."], ["2006.07.16", "Thailand", "Pattani", 1, 0, "Thai Jihadis murder a 71-year-old man standing in front of his house."], ["2006.07.17", "Afghanistan", "Gardez", 5, 22, "A suicide bomber kills five people, including four civilians."], ["2006.07.17", "Chechnya", "Grozny", 2, 0, "A cleric and his brother are assassinated by gunmen at point-blank range."], ["2006.07.17", "Chechnya", "Grozny", 2, 1, "Jihadis spray two policemen with machine-gun fire in broad daylight."], ["2006.07.17", "India", "Poonch", 1, 0, "Fedayeen attack a police station, killing a constable."], ["2006.07.17", "Iraq", "Mahmoudiya", 12, 0, "The bodies of a dozen victims of sectarian violence are found around the city."], ["2006.07.17", "Iraq", "Mahmoudiya", 41, 90, "Sunni gunmen attack unarmed civilians in a market.  Dozens of innocents are massacred."], ["2006.07.17", "Israel", "Nablus", 1, 6, "Palestinians throw a bomb at a group of Israeli soldiers in the West Bank, killing one."], ["2006.07.17", "Pakistan", "Torghundai", 1, 0, "Islamists attack a police post and kill one officer."], ["2006.07.18", "Algeria", "Ain Defla", 4, 0, "Four municipal guards are shot to death in an ambush by Islamic fundamentalists."], ["2006.07.18", "India", "Kulgam", 1, 0, "A boy is kidnapped from a cricket match by Islamic terrorists, tied up and killed in front of a crowd."], ["2006.07.18", "India", "Mahore", 1, 0, "A 6-year-old child dies from gunshot wounds after Muslim radicals fire into a family home."], ["2006.07.18", "Iraq", "Haditha", 3, 0, "Three translators are brutally murdered by Islamic terrorists."], ["2006.07.18", "Iraq", "Kufa", 59, 132, "A suicidal Sunni drives an explosives-packed minivan into a crowd of Shia laborers looking for work.  Over fifty lay dead in the ensuing horror."], ["2006.07.18", "Iraq", "Mahmudiya", 14, 0, "Police find fourteen more victims of sectarian violence, blindfolded and shot at close range."], ["2006.07.18", "Iraq", "Mosul", 4, 2, "A suicide bomber punches his ticket to Allah, taking four other souls with him."], ["2006.07.18", "Iraq", "Tikrit", 2, 0, "Radical Muslims cut off a girl's head, then place it on a bomb, which kills another civilian when it detonates."], ["2006.07.18", "Israel", "Nahariya", 1, 60, "An Israeli civilian is killed by a Hezbollah missile as the terror group fires multiple rockets into civilian areas."], ["2006.07.18", "Philippines", "Maimbung", 1, 2, "At least one policeman is killed in an attack by Muslim terrorists."], ["2006.07.19", "India", "Palhalan Pattan", 1, 0, "A civilian is murdered by the Mujahideen."], ["2006.07.19", "Iraq", "Baghdad", 12, 29, "A marketplace shooting and two bombings by Sunni radicals leaves at least a dozen innocents dead."], ["2006.07.19", "Iraq", "Kirkuk", 4, 16, "Four people at a cafe are killed by a bomb."], ["2006.07.19", "Iraq", "Mahmudiya", 24, 0, "Eighteen people are kidnapped, tortured and shot to death.  Another six in Suwayra."], ["2006.07.19", "Iraq", "Rasheed", 3, 11, "Muslim gunmen storm a market, shooting three people to death and injuring eleven."], ["2006.07.19", "Israel", "Nazareth", 2, 9, "Two brothers, ages 9 and 3, are blown apart by Hezbollah rockets in their front yard."], ["2006.07.20", "India", "Vehil Nowgam", 1, 0, "A youth is executed in public view by the Mujahideen."], ["2006.07.20", "Iraq", "Baghdad", 8, 31, "Three separate terror bombings leave at least eight people dead."], ["2006.07.20", "Iraq", "Baiju", 3, 0, "Islamic gunmen murder three oil refinery engineers."], ["2006.07.20", "Iraq", "Basra", 4, 5, "The throats of a mother and her three children are slit by Muslim terrorists in their home."], ["2006.07.20", "Iraq", "Beiji", 12, 0, "A dozen people examining a corpse in a car are killed when Jihadis detonate the vehicle remotely."], ["2006.07.20", "Iraq", "Fallujah", 9, 13, "A Fedayeen suicide bomber ends the lives of six other people.  Three others are kidnapped an tortured to death."], ["2006.07.20", "Iraq", "Kirkuk", 4, 20, "Four people are killed in a Jihad bombing."], ["2006.07.20", "Iraq", "Muqdadiya", 7, 0, "Seven people are killed in two separate Muslim terror attacks."], ["2006.07.20", "Thailand", "Pattani", 3, 1, "Militant Muslims spray a police booth with automatic weapons, killing three officers."], ["2006.07.20", "Thailand", "Yala", 1, 0, "A 60-year-old fruit grower is gunned down by Islamic militants."], ["2006.07.21", "Iraq", "Baghdad", 38, 0, "Police find 38 corpses of those killed in sectarian violence."], ["2006.07.22", "Afghanistan", "Kandahar", 2, 8, "Two Canadian troops are killed when a Fedayeen suicide bomber rams his car into their vehicle."], ["2006.07.22", "Afghanistan", "Kandahar", 6, 20, "A religious extremist approaches a crowd of civilians and then detonates himself, killing at least six innocents."], ["2006.07.22", "Iraq", "Baghdad", 7, 1, "Jihadis open fire on workers in a house, killing seven."], ["2006.07.22", "Iraq", "Baqubah", 7, 0, "A suicidal Sunni bomber sends seven innocents to Allah."], ["2006.07.23", "Afghanistan", "Charsada", 2, 0, "Two 'World Vision' humanitarian workers are murdered as they are returning from a charity mission."], ["2006.07.23", "Afghanistan", "Khost", 1, 3, "A suicide bomber kills one other person."], ["2006.07.23", "Afghanistan", "Yaqubi", 3, 2, "Three little girls are murdered by the Taliban in a grenade attack on their home."], ["2006.07.23", "India", "Chatroo", 1, 1, "Islamic militants murder a civilian and abduct another."], ["2006.07.23", "India", "Larkipora", 1, 0, "A political activist is shot to death by the Mujahideen."], ["2006.07.23", "India", "Mawar Handwara", 2, 1, "Two civilians are killed in a bombing by Islamic militants."], ["2006.07.23", "Iraq", "Baghdad", 42, 94, "Thirty-three of Baghdad's poorest people are blown apart by a Sunni car bomb place just outside an open-air market.  A second bombing nets another nine."], ["2006.07.23", "Iraq", "Kirkuk", 22, 159, "At least twenty-two souls are lost to a suicide bomber bent on achieving Islamic paradise."], ["2006.07.23", "Israel", "Haifa", 2, 14, "Two Israelis are killed by Hezbollah rockets."], ["2006.07.23", "Thailand", "Pattani", 1, 3, "Islamic radicals murder a 60-year-old janitor as he is buying vegetables for his wife."], ["2006.07.24", "Iraq", "Mosul", 10, 4, "Five Iraqis are killed by a Fedayeen suicide bomber and two separate shootings leave five others dead."], ["2006.07.24", "Thailand", "Narathiwat", 1, 0, "A Buddhist teacher is gunned down by Muslim militants in the classroom in front of his 10-year-old students."], ["2006.07.25", "Afghanistan", "Kabul", 2, 4, "The Taliban kill two civilians with a roadside bomb.  Four others are injured."], ["2006.07.25", "Iraq", "Baghdad", 25, 0, "The bodies of twenty-five abductees are found in four separate locations across the country."], ["2006.07.25", "Iraq", "Baqubah", 5, 0, "Five farmers are kidnapped, tortured and executed by Religion of Peace radicals."], ["2006.07.25", "Iraq", "Karbala", 3, 0, "Three members of a wedding party are gunned down in a drive-by shooting."], ["2006.07.25", "Israel", "Kfar Mrar", 1, 48, "A 15-year-old girl is killed by a Hezbollah rocket."], ["2006.07.25", "Thailand", "Narathiwat", 1, 0, "The employee of a wood-processing plant is killed by Islamic gunmen."], ["2006.07.25", "Thailand", "Pattani", 1, 0, "Militant Muslims shoot a man off of his motorcycle as he is riding to work."], ["2006.07.26", "Afghanistan", "Kandahar", 4, 0, "Four security guards are killed by the Taliban while in route to help another victim."], ["2006.07.26", "Afghanistan", "Zabul", 1, 8, "Religious extremists fire on a truck carrying road workers, killing one of them."], ["2006.07.26", "India", "Renipora", 3, 0, "Three Indian troops are killed in a Mujahideen ambush."], ["2006.07.26", "India", "Sajan", 1, 0, "Muslim terrorists slit a young girl's throat."], ["2006.07.27", "India", "Doda", 1, 6, "A 14-year-old girl is killed when a militant Muslim tosses a grenade at her family."], ["2006.07.27", "Iraq", "Baghdad", 19, 0, "The bodies of nineteen abductees showing signs of torture are found in various parts of the capital."], ["2006.07.27", "Iraq", "Baghdad", 32, 101, "A car bombing and mortar attacks by Jihadis on a shopping district rack up more than thirty dead bodies."], ["2006.07.27", "Israel", "Abus", 1, 0, "al-Fatah terrorists kidnap a 60-year-old Israeli man and then murder him, leaving his body in the truck of a burning car."], ["2006.07.28", "Afghanistan", "Tagab", 1, 11, "Religious extremists attack a police post, killing at least one officer."], ["2006.07.28", "Ingushetia", "Nazran", 2, 0, "Two Russians are killed when Muslim sniper target their car."], ["2006.07.28", "Iraq", "Baghdad", 4, 6, "A bomb planted between a mosque and a youth center kills four people."], ["2006.07.28", "Jordan", "Amman", 1, 0, "A woman is hacked to death by relatives after delivering a baby out-of-wedlock."], ["2006.07.28", "Somalia", "Mogadishu", 1, 0, "Suspected Islamic terrorist assassinates a government minister."], ["2006.07.28", "USA", "Seattle, WA", 1, 5, "An 'angry' Muslim-American uses a young girl as hostage to enter a local Jewish center, where he shoots six women, one of whom dies."], ["2006.07.29", "Iraq", "Kirkuk", 3, 15, "Jihadis kill three people with a car bomb."], ["2006.07.29", "Iraq", "Suwayra", 2, 0, "Two Iraqi soldiers are kidnapped and beheaded."], ["2006.07.30", "Iraq", "Baghdad", 15, 0, "Fifteen victims of Religion of Peace sectarian violence are found in various parts of the city bearing signs of torture."], ["2006.07.30", "Iraq", "Iskandariya", 4, 11, "Jihadis bomb a group of civilians traveling along a road, killing four."], ["2006.07.30", "Iraq", "al-Rasheed", 23, 0, "In a horrible massacre, a dozen armed Sunnis force three minibuses of Shia pilgrims off the road, forcibly disembark the passengers, then machine-gun them to death."], ["2006.07.30", "Thailand", "Narathiwat", 1, 0, "A man is abducted and shot in the head by Islamic radicals."], ["2006.07.30", "Thailand", "Yala", 1, 1, "A Muslim terrorist poses as a fruit seller in order to gain the confidence of two other fruit sellers, who he then guns down."], ["2006.07.31", "Afghanistan", "Farmay Adha", 8, 16, "The Taliban bomb a memorial service at a mosque, killing eight."], ["2006.07.31", "India", "Kangan", 1, 0, "A man is abducted and murdered by the Mujahideen."], ["2006.08.01", "Afghanistan", "Helmand", 3, 1, "A Taliban ambush on a NATO patrol leaves three British soldiers dead."], ["2006.08.01", "India", "Srinagar", 4, 2, "Four Indian soldiers are shot to death by Islamic militants in two separate attacks.  One was outside a hospital, and the other a shopping area."], ["2006.08.01", "Iraq", "Baghdad", 56, 91, "At least fifty-six people are killed in five Jihad attacks by sectarian militants.  Most are burned or blasted to death in bombings."], ["2006.08.02", "Iraq", "Baghdad", 3, 9, "Three day laborers looking for work are blown to bits by Islamic bombers."], ["2006.08.02", "Iraq", "Baghdad", 12, 14, "Children as young as 11 are blown apart when Sunnis deliberately target a soccer match with a bomb hidden in a gym bag."], ["2006.08.02", "Iraq", "Baghdad", 14, 37, "Islamic terrorists target a bank with bombs, killing more than a dozen innocents."], ["2006.08.02", "Iraq", "Beiji", 24, 0, "Two-dozen people aboard a bus are slaughtered by a remote-controlled bomb operated by radical Sunnis."], ["2006.08.02", "Iraq", "Diwaniya", 1, 0, "Radical Muslims murder an employee of a human rights group outside his home."], ["2006.08.02", "Iraq", "Suwayra", 11, 0, "Eleven bound and tortured bodies, victims of sectarian violence, are pulled from a river."], ["2006.08.02", "Israel", "Nahariya", 1, 0, "An Israeli man is killed by a Hezbollah rocket while riding his bike."], ["2006.08.02", "Thailand", "Pattani", 1, 0, "Islamists kill a guard at a construction site with a bomb."], ["2006.08.02", "Thailand", "Songkhla", 3, 1, "Thai Islamists kill three policeman with a bomb planted along a railroad track."], ["2006.08.03", "Afghanistan", "Kandahar", 21, 13, "A Shaheed martyr murders twenty-one innocents at a market by detonating explosives strapped to his body."], ["2006.08.03", "Iraq", "Bahgdad", 10, 32, "Allah's butchers detonate a bomb in a rubbish pile, killing at least ten bystanders."], ["2006.08.03", "Iraq", "Mussayab", 3, 22, "Jihad gunmen attack a wedding party, killing three members."], ["2006.08.03", "Iraq", "Wajihiya", 4, 0, "Muslim radicals invade a home, killing three women and a man."], ["2006.08.03", "Israel", "Acre", 5, 92, "Five Israeli civilians, including a father and daughter, are killed during a 90-minute rocket barrage on their town from Hezbollah."], ["2006.08.03", "Israel", "Ma'a lot", 3, 0, "Three Arab Israelis are killed by a Hezbollah rocket attack."], ["2006.08.03", "Tajikistan", "Dushanbe", 1, 0, "An Islamist kills himself and a police officer with a grenade."], ["2006.08.03", "Thailand", "Narathiwat", 1, 1, "Islamic militants shoot a mechanic to death and seriously injure a 5-year-old girl."], ["2006.08.04", "Afghanistan", "Kandahar", 2, 2, "Two children are killed when religious extremists lob an explosive into a house."], ["2006.08.04", "Iraq", "Dujail", 4, 8, "Muslim terrorists barge into a home and kill four family members."], ["2006.08.04", "Iraq", "Hadhar", 10, 12, "A Fedayeen suicide bomber plows his car into a crowd of spectators at a soccer game, killing at least ten."], ["2006.08.04", "Iraq", "Kut", 7, 0, "Seven people are kidnapped and beheaded by Islamic radicals."], ["2006.08.04", "Iraq", "Ubaydi", 3, 9, "Three civilians are killed when Jihadis lob mortars into their neighborhood."], ["2006.08.04", "Israel", "Karmiel", 2, 82, "Two people are killed and dozens injured by more 'Party of Allah' rockets."], ["2006.08.04", "Israel", "Mughar", 1, 2, "The mother of two young children is killed in her living room by a Hezbollah rocket."], ["2006.08.05", "India", "Poonch", 1, 0, "The Mujahideen capture a village head, beat him up and then shoot him in the head."], ["2006.08.05", "Iraq", "Baghdad", 9, 0, "Radicals kidnap and torture to death nine members of a rival Muslim sect."], ["2006.08.05", "Israel", "al-Aramshe", 3, 4, "A 60-year-old Arab-Israeli woman and her two daughters are killed when a Hezbollah rocket lands in their home."], ["2006.08.06", "India", "Sopore", 1, 17, "A woman is killed when Islamic terrorists lob a grenade into the street."], ["2006.08.06", "Iraq", "Baghdad", 16, 0, "Police discover sixteen victims of sectarian violence in two location in the country.  Women were among the dead."], ["2006.08.06", "Iraq", "Tikrit", 15, 22, "Fifteen mourners at a funeral are slaughtered by a suicide bomber."], ["2006.08.06", "Israel", "Haifa", 3, 189, "A crowded residential area is the target of Hezbollah rockets.  An Israeli woman is among three dead."], ["2006.08.06", "Israel", "Kfar Giladi", 12, 14, "Hezbollah successfully hits a gathering of people in a community, killing twelve Israelis."], ["2006.08.06", "Thailand", "Pattani", 1, 0, "A 52-year-old Buddhist civilian is gunned down by Muslims."], ["2006.08.06", "Thailand", "Tala", 1, 0, "A rubber plantation worker is machine-gunned to death by Islamic radicals."], ["2006.08.07", "Afghanistan", "Daigh", 2, 0, "A 70-year-old woman and her 13-year-old grandson are pulled from their home and hanged by the Taliban."], ["2006.08.07", "India", "Donipawa", 1, 0, "A civilian is abducted and murdered by the Mujahideen."], ["2006.08.07", "Iraq", "Baqubah", 6, 15, "A senseless attack on a checkpoint by Sunni terrorists leaves at least six Iraqi soldiers dead."], ["2006.08.07", "Iraq", "Fallujah", 6, 2, "Six civilians are killed when Sunni terrorists set off a bomb by the side of a road."], ["2006.08.07", "Iraq", "Khalis", 4, 7, "Terrorists blow up a minibus, killing four civilians.."], ["2006.08.07", "Pakistan", "Garhiyoum", 1, 0, "A tribal leader is abducted and beheaded by Muslim extremists."], ["2006.08.07", "Russia", "Karachaevsk", 1, 0, "A local Imam is gunned down by Islamists for performing healing."], ["2006.08.08", "Dagestan", "Makhachkala", 3, 0, "Islamic separatists bomb a government official's convoy, killing three people."], ["2006.08.08", "Iraq", "Baghdad", 10, 69, "Muslim terrorists set off two bombs at a bustling market, killing at least ten people."], ["2006.08.08", "Iraq", "Baghdad", 15, 0, "Fifteen bodies are found by police from sectarian violence."], ["2006.08.08", "Iraq", "Baqubah", 5, 20, "At least five people were killed when Muslim radicals blow up an apartment building in the middle of the night."], ["2006.08.08", "Iraq", "Muqdadiya", 3, 0, "Three people are shot to death by Jihad militants, including a teacher."], ["2006.08.08", "Thailand", "Yala", 1, 0, "A rubber tapper is murdered by Islamic terrorists."], ["2006.08.09", "Ingushetia", "Nazran", 1, 13, "Radicals bomb a prosecutor's house, killing his brother."], ["2006.08.09", "Iraq", "Baghdad", 18, 2, "Terrorists open fire on a street vendor grilling fish, killing five civilians.  Thirteen other bodies are found elsewhere."], ["2006.08.09", "Pakistan", "Angoor Adda", 1, 0, "An elderly man is shot to death by Islamic militants."], ["2006.08.09", "Thailand", "Yala", 1, 0, "An elderly gas station owner is shot to death in a Muslim terror attack."], ["2006.08.10", "India", "Pattan", 1, 2, "The Mujahideen gun down a civilian and injure his wife and neighbor."], ["2006.08.10", "Iraq", "Najaf", 35, 122, "At least 35 innocent people at a market are blown to bits by an Islamic fanatic wrapped in explosives."], ["2006.08.10", "Israel", "Dir el-Asad", 2, 11, "A young mother and her 4-year-old son are blown apart in their home by a Katyusha rocket."], ["2006.08.10", "Israel", "Jerusalem", 1, 0, "An Italian tourist is stabbed to death by a Palestinian youth."], ["2006.08.10", "Israel", "Karmiel", 1, 0, "A baby girl is killed by Hezbollah rockets fired on her family's home."], ["2006.08.10", "Philippines", "North Cotabato", 1, 5, "A bombing attack by Islamic militants leaves one dead and five injured."], ["2006.08.11", "Afghanistan", "Ghazni", 1, 0, "Religious extremists kill a man outside his home."], ["2006.08.11", "Afghanistan", "Ghazni", 2, 1, "Two civilians are killed by a roadside bombing."], ["2006.08.11", "Afghanistan", "Spin Boldak", 1, 0, "A suicide bomber kills a Canadian soldier in a transport convoy."], ["2006.08.11", "India", "Arra", 3, 0, "A Hindu mother and her two young children are brutally slain in their home by Muslim fanatics."], ["2006.08.11", "Iraq", "Baghdad", 6, 0, "Religious radicals kidnap, torture and murder six members of a rival sect."], ["2006.08.11", "Philippines", "Pikit", 2, 0, "Two policemen are ambushed and executed by the Moro Islamic Liberation Front."], ["2006.08.12", "India", "Drogian", 2, 0, "Two elderly people are shot to death in their homes by Islamic terrorists."], ["2006.08.12", "Iraq", "Baghdad", 3, 9, "Three civilians are killed when Jihadis place a shrapnel bomb in a residential neighborhood."], ["2006.08.12", "Iraq", "Mosul", 12, 4, "Jihadis murder a dozen Iraqi civilians in a series of bombing and shooting attacks."], ["2006.08.12", "Italy", "Brescia", 1, 0, "A 20-year-old girl is killed by her family for having a relationship with a non-Muslim."], ["2006.08.12", "Thailand", "Narathiwat", 1, 0, "Islamists shoot a policeman in the back as he is leaving his house."], ["2006.08.12", "Thailand", "Pattani", 1, 0, "A policeman is gunned down by Muslim militants while on patrol."], ["2006.08.12", "Thailand", "Yala", 1, 0, "A circus owner is killed by two Muslim terrorists posing as customers."], ["2006.08.13", "Afghanistan", "Bermel", 5, 6, "Five Afghan soldiers are killed when the Taliban stage a terror attack on their post."], ["2006.08.13", "India", "Shopian", 1, 1, "Harkat-ul-Mujahideen kill a 20-year-old woman and leave her sister-in-law critically injured."], ["2006.08.13", "Iraq", "Baghdad", 62, 148, "Sunni bombers massacre Shiites in a series of neighborhood bombings, racking up over sixty dead and one-hundred and fifty injured."], ["2006.08.13", "Israel", "Shlomi", 1, 21, "Hezbollah fires rockets into an Israeli neighborhood, killing a 70-year-old man in his home."], ["2006.08.13", "Pakistan", "Baltistan", 1, 1, "A bomb hidden in a toy kills a 14-year-old girl."], ["2006.08.13", "Pal. Auth.", "Jenin", 1, 0, "Islamic Jihad executes a man in front of a crowd of people."], ["2006.08.13", "Philippines", "Jolo", 3, 0, "Abu Sayyaf kidnappers stab a businesswoman to death and behead her son after taking them captive.  A policeman trying to rescue them is killed as well."], ["2006.08.13", "Thailand", "Narathiwat", 1, 2, "A man is killed by Muslim gunmen in a drive-by shooting while he is having tea.  Two elderly patrons are wounded."], ["2006.08.13", "Thailand", "Narathiwat", 4, 12, "Islamic radicals kill a ship-owner to draw police, then detonate a bomb, killing three additional civilians and injuring twelve."], ["2006.08.14", "India", "Sopore", 1, 0, "A grenade attack on a bus stop fatally injures a civilian."], ["2006.08.14", "Iraq", "Mosul", 6, 1, "Muslim gunmen kill six civilians in three separate attacks, including three blacksmiths."], ["2006.08.14", "Thailand", "Pattani", 1, 0, "A rubber plantation worker is murdered by Islamic terrorists."], ["2006.08.14", "Thailand", "Yala", 1, 0, "A 56-year-old man is shot seven times in the head by Islamic separatists."], ["2006.08.14", "Thailand", "Yala", 1, 0, "Islamic fundamentalists murder a pork seller."], ["2006.08.15", "Iraq", "Mosul", 9, 36, "A Fedayeen suicide bomber slaughters nine other people outside a political office."], ["2006.08.15", "Iraq", "Muqdadiya", 3, 0, "Islamic radicals gun down three bakers."], ["2006.08.15", "Philippines", "Basilan", 1, 0, "Abu Sayyaf is suspected in the assassination of a high school principal."], ["2006.08.16", "Afghanistan", "Ghazni", 1, 1, "The Taliban murder a police officer."], ["2006.08.16", "Ingushetia", "Nazran", 1, 1, "A Russian is killed when Islamic separatists attack his vehicle with automatic weapons."], ["2006.08.16", "Iraq", "Baghdad", 8, 28, "Religious radicals set off a bomb at a flea market, killing eight shoppers."], ["2006.08.16", "Iraq", "Baghdad", 13, 43, "Jihadis massacre thirteen innocents with a twin bomb attack in a commercial district."], ["2006.08.16", "Iraq", "Muqdadiya", 7, 20, "A female suicide bomber kills seven innocents at a bus station."], ["2006.08.17", "India", "Budgam", 1, 0, "In a gruesome attack, militant Muslims kidnap a craftsman and then cut off his head."], ["2006.08.17", "India", "Srinagar", 3, 2, "Three policemen are killed in separate attacks."], ["2006.08.17", "India", "Wutligam", 1, 0, "A civilian is shot to death by the Mujahideen."], ["2006.08.17", "Iraq", "Baghdad", 3, 28, "Sunnis use a car bomb to kill three Shia civilians."], ["2006.08.17", "Iraq", "Baqubah", 9, 0, "Three brothers are among nine people assassinated by Islamic radicals."], ["2006.08.17", "Iraq", "Daquq", 2, 1, "A bomb blast ends the lives of two civilians."], ["2006.08.17", "Iraq", "Suwayra", 6, 0, "Six victims of sectarian violence are fished out of a river, blindfolded and showing signs of torture.."], ["2006.08.17", "Thailand", "Pattani", 2, 0, "Two men are shot off their motorbikes by Muslim terrorists in separate attacks."], ["2006.08.18", "Iraq", "Baghdad", 7, 0, "Seven Shiite pilgrims are gunned down by Sunni terrorists while en route to a religious ceremony."], ["2006.08.18", "Thailand", "Narathiwat", 1, 0, "A 58-year-old man is murdered in front of his house by militant Muslims."], ["2006.08.19", "Afghanistan", "Paktika", 1, 0, "A man is murdered by the Taliban."], ["2006.08.19", "Algeria", "Telagh", 2, 1, "Fundamentalists slit the throats of two victims, then place a bomb under the bodies to kill civil workers."], ["2006.08.19", "Egypt", "Cairo", 1, 0, "A Christian cobbler is stabbed to death by an angry Muslim."], ["2006.08.19", "Iraq", "Baqubah", 12, 0, "A dozen farmers, university professors and students are gunned down by sectarian radicals."], ["2006.08.19", "Israel", "Bekaot", 1, 0, "An Israeli is killed by a Fatah gunman in the West Bank."], ["2006.08.19", "Thailand", "Narathiwat", 1, 0, "Radical Islamists shoot a plantation worker as he is riding a motorcycle to his job."], ["2006.08.19", "Thailand", "Yala", 1, 0, "Islamic terrorists shoot a man to death on a city street."], ["2006.08.20", "Afghanistan", "Helmand", 3, 0, "Three policemen are killed by a Taliban remote-controlled bomb."], ["2006.08.20", "Afghanistan", "Panjwai", 5, 11, "The Taliban attack a police post, killing at least five Afghans."], ["2006.08.20", "Ingushetia", "Alkhasty", 2, 0, "Islamic militants are suspected in two nighttime attacks on police officers in their homes.  One was set on fire in front of his family."], ["2006.08.20", "Iraq", "Baghdad", 20, 302, "Sunni snipers take down sixteen Shia pilgrims taking part in a religious festival."], ["2006.08.20", "Iraq", "Baqubah", 6, 0, "Six Iraqis, including two brothers, are gunned down by Islamic militants."], ["2006.08.20", "Iraq", "Jurf al-Sakhar", 2, 0, "Two civilians are brutally killed by Islamic terrorists."], ["2006.08.20", "Thailand", "Pattani", 1, 1, "Muslim gunmen fire into a truck loaded with laborers, killing one."], ["2006.08.21", "India", "Baramulla", 1, 0, "The Mujahideen gun down a man near his house."], ["2006.08.21", "Thailand", "Narathiwat", 1, 0, "A man is murdered by Muslim terrorists in his living room."], ["2006.08.21", "Thailand", "Yala", 3, 0, "Three Buddhist civilians are gunned down in an orchard by Islamic radicals."], ["2006.08.22", "Afghanistan", "Gayan", 5, 0, "Religious extremists ambush a police vehicle, killing all five officers inside."], ["2006.08.22", "Afghanistan", "Kandahar", 2, 3, "A young girl and a Canadian soldier are murdered by a Fedayeen suicide bomber."], ["2006.08.22", "Iraq", "Baghdad", 7, 1, "Seven civilians in a house are mowed down by Muslim gunmen."], ["2006.08.22", "Iraq", "Baqubah", 7, 0, "Islamic militants bomb a market, killing seven people."], ["2006.08.23", "Iraq", "Baqubah", 14, 0, "Fourteen victims of sectarian violence are found here and in Latifiya."], ["2006.08.23", "Iraq", "Mosul", 1, 11, "A suicidal Sunni kills a woman with explosives."], ["2006.08.23", "Pakistan", "Sindh", 5, 11, "Five members of a family, including a 3-year-old girl, are murdered in their home in an honor killing."], ["2006.08.23", "Thailand", "Narathiwat", 1, 0, "A schoolteacher is gunned down by Muslim militants as he is on his way to teach."], ["2006.08.23", "Thailand", "Narathiwat", 1, 0, "Militant Muslims murder a community guard."], ["2006.08.24", "Iraq", "Baghdad", 2, 9, "A suicide car bomber kill two civilians."], ["2006.08.24", "Iraq", "Balad", 3, 0, "Jihadis kill three policemen."], ["2006.08.24", "Iraq", "Mosul", 7, 0, "Seven civilians, including five members of the same family, are murdered by sectarian rivals."], ["2006.08.25", "Afghanistan", "Ghazni", 2, 2, "The Taliban kill two local officials in an attack on a community."], ["2006.08.25", "India", "Doda", 1, 0, "A woman is shot to death by the Mujahideen."], ["2006.08.25", "Iraq", "Balad Ruz", 3, 3, "Three teenage boys playing soccer are blown apart in a Jihadi bombing."], ["2006.08.25", "Iraq", "Baqubah", 9, 0, "Nine people are killed by Jihadis in various attacks."], ["2006.08.25", "Iraq", "Mosul", 1, 0, "A university professor is murdered by suspected fundamentalists."], ["2006.08.25", "Thailand", "Yala", 1, 0, "A 25-year-old man is murdered by terrorists as he sat in his truck."], ["2006.08.26", "Ingushetia", "Ossetian Border", 3, 1, "Terrorists attack a vehicle, killing three Russians inside."], ["2006.08.26", "Iraq", "Baqubah", 4, 11, "Sunnis attack a Shia family, killing two women and two children."], ["2006.08.26", "Iraq", "Basra", 4, 0, "Four civilians are killed in two separate attacks, including a woman."], ["2006.08.26", "Iraq", "Iskandaria", 3, 17, "Three people are blown apart in a Jihad car bombing."], ["2006.08.26", "Iraq", "Tikrit", 3, 2, "Sunni extremists storm a bakery and murder three Shia workers."], ["2006.08.26", "Kosovo", "Kosovska Mitrovica", 0, 9, "Nine people are injured when a Muslim hurls a bomb into a bar."], ["2006.08.26", "Thailand", "Yala", 1, 0, "Muslim militants ambush two pick-up trucks carrying soldiers, killing at least one."], ["2006.08.26", "Thailand", "Yala", 2, 5, "Two Thai soldiers are killed by a remote-controlled roadside bomb."], ["2006.08.27", "Iraq", "Abara", 3, 0, "Two brothers and their cousin are brutally slain by Religion of Peace rivals."], ["2006.08.27", "Iraq", "Baghdad", 12, 45, "Two bombs, one hidden on a minibus and the other outside a newspaper office, leave a dozen Iraqis dead and forty others in agony."], ["2006.08.27", "Iraq", "Basra", 7, 0, "Seven people are killed by a bomb hidden on a motorcycle."], ["2006.08.27", "Iraq", "Khalis", 9, 15, "Jihadis bomb a food market, killing at least nine patrons."], ["2006.08.27", "Iraq", "Khalis", 16, 25, "Terrorists storm a house and a cafe, killing sixteen people, including those rushing in to help the victims."], ["2006.08.28", "Afghanistan", "Herat", 1, 0, "A Turkish engineer is murdered by religious extremists while traveling on a highway."], ["2006.08.28", "Afghanistan", "Kabul", 1, 0, "A second Turkish engineer is murdered in a garage by the Taliban."], ["2006.08.28", "Afghanistan", "Leskergah", 19, 41, "Nineteen innocents at a marketplace are blown to bits by a Taliban suicide bomber.  The casualties included fifteen children."], ["2006.08.28", "Iraq", "Baghdad", 20, 62, "A Fedayeen suicide bomber ends the lives of sixteen others near the entrance to a government building.  Four others are shot to death."], ["2006.08.28", "Pakistan", "Naushki", 1, 0, "A mob enters the home of a barber and shoots him to death."], ["2006.08.28", "Pakistan", "North Waziristan", 1, 0, "Islamists kidnap a man, pump him full of bullets, then attach a note to his body."], ["2006.08.28", "Thailand", "Narathiwat", 1, 0, "Muslim militants attack a man delivering donuts, killing him and then cutting off his ears."], ["2006.08.28", "Thailand", "Yala", 1, 0, "A man is murdered by Islamic terrorists at a petrol station."], ["2006.08.29", "Afghanistan", "Kandahar", 2, 1, "A suicide bomber kills two civilians."], ["2006.08.29", "India", "Budgam", 1, 0, "Terrorists slit the throat of a 17-year-old boy."], ["2006.08.29", "Ingushetia", "Nazran", 1, 0, "A police officer is gunned down by Muslim militants."], ["2006.08.29", "Iraq", "Baghdad", 20, 14, "Twenty civilians are kidnapped and killed in at least two separate attacks."], ["2006.08.29", "Iraq", "Baiji", 1, 1, "Religious fundamentalists gun down a bakery worker."], ["2006.08.29", "Iraq", "Baqubah", 21, 5, "Twenty-one victims of sectarian violence are found in and around the city."], ["2006.08.30", "India", "Devar Lolab", 1, 1, "Islamic terrorists kill a policeman and injure a civilian."], ["2006.08.30", "Iraq", "Baghdad", 24, 35, "Sunnis bomb a crowded market, slaughtering two dozen and leaving many more in physical agony."], ["2006.08.30", "Iraq", "Buhriz", 5, 2, "A child and three women are among five members of a family murdered in the car by militant Muslims."], ["2006.08.30", "Iraq", "Diwaniya", 13, 0, "Thirteen Iraqi soldiers are captured and brutally executed by Islamic militants."], ["2006.08.30", "Iraq", "Hilla", 14, 38, "Fourteen people outside a recruiting center are blown to bits by Islamic terrorists."], ["2006.08.30", "Iraq", "Kirkuk", 4, 10, "A suicidal Sunni on a bus kills four other humans."], ["2006.08.30", "Iraq", "Numaniya", 3, 0, "Three Shia brothers are shot to death by radical Sunnis."], ["2006.08.30", "Pakistan", "North Waziristan", 2, 0, "Two men are beheaded in separate attacks by the local Taliban."], ["2006.08.30", "Pakistan", "Wana", 1, 0, "A 14-year-old boy is abducted and murdered by the Mujahideen."], ["2006.08.31", "India", "Dangiwacha", 1, 0, "Islamic terrorists invade a home and kill the daughter of a policeman."], ["2006.08.31", "India", "Dawoocha", 1, 0, "The Mujahideen murder a woman in her home."], ["2006.08.31", "India", "Saroti", 2, 0, "Islamic terrorists brutally murder two police officers."], ["2006.08.31", "Iraq", "Baghdad", 4, 11, "Jihadis target a police patrol, killing four officers."], ["2006.08.31", "Iraq", "Baghdad", 63, 282, "Sunni radicals send rockets into a Shia neighborhood, slaughtering over sixty people, including twenty-four women and nineteen young children."], ["2006.08.31", "Iraq", "Baqubah", 2, 0, "Two brothers working in a cotton shop are brutally slain by Sunni radicals."], ["2006.08.31", "Iraq", "Jbela", 1, 8, "A wedding party is the target of a terrorist bombing."], ["2006.08.31", "Pakistan", "Karachi", 1, 0, "A Muslim guns down a cleric over allegations that he is insulting Islamic teachings and the prophet."], ["2006.08.31", "Sudan", "Buram", 38, 23, "Arab militias wipe out several villages killing dozens.  The true figures may run into the hundreds."], ["2006.08.31", "Thailand", "Yala", 1, 27, "Islamists set off two dozen bombs in garbage cans, killing at least one person."], ["2006.09.01", "India", "Darwashbagh", 1, 0, "Islamic militants abduct and murder a civilian."], ["2006.09.01", "India", "Pulwama", 1, 2, "A man is murdered by the Mujahideen in an attack that also injures two family members."], ["2006.09.01", "Iraq", "Mahmudiya", 1, 3, "A child is killed inside a home that Jihadis try to level with a rocket."], ["2006.09.01", "Pakistan", "Neelum Valley", 2, 3, "Two Christian children of missionaries are brutally murdered.  The girl had her breast cut off and was raped."], ["2006.09.02", "Afghanistan", "Helmand", 3, 1, "The Taliban murder three police at a checkpoint."], ["2006.09.02", "Afghanistan", "Nimroz", 4, 10, "The Taliban kill four Afghan police officers and abduct ten others."], ["2006.09.02", "Algeria", "Adekar", 4, 5, "Islamic fundamentalists ambush a security patrol and kill four members."], ["2006.09.02", "Algeria", "Ouled Hamza", 2, 0, "Two community guards are murdered by Islamic fundamentalists."], ["2006.09.02", "India", "Gani Hamam", 1, 0, "A vegetable vendor is murdered by the Mujahideen."], ["2006.09.02", "Iraq", "Baghdad", 9, 36, "A series of bombings and sectarian shootings leave at least nine civilians dead."], ["2006.09.02", "Iraq", "Karbala", 17, 0, "Fourteen South Asian pilgrims are massacred by Sunni terrorists, along with three other locals."], ["2006.09.03", "Iraq", "Baghdad", 6, 15, "Jihadis mortar a residential neighborhood, killing six people, including two children."], ["2006.09.03", "Iraq", "Baqubah", 5, 0, "A father and four young children are blown up by Islamic radicals as they are traveling in their car."], ["2006.09.03", "Iraq", "Khalis", 4, 19, "Muslim terrorists bomb a market, killing at least four patrons."], ["2006.09.03", "Turkey", "Istanbul", 1, 0, "An Imam is stabbed to death by a religious fanatic."], ["2006.09.04", "Afghanistan", "Kabul", 6, 7, "Six civilians are killed by a Fedayeen suicide bomber.  The casualties included children."], ["2006.09.04", "Afghanistan", "Parwan", 3, 1, "Religious extremists attack a police vehicle, killing three occupants."], ["2006.09.04", "India", "Kashmir", 7, 11, "Seven Indian troops are killed in three separate attacks by Islamic militants."], ["2006.09.04", "India", "Tangmarg", 2, 0, "An off-duty soldier and his kid brother are brutally murdered by Islamic extremists."], ["2006.09.04", "Iraq", "Baghdad", 33, 0, "Thirty-three victims are found tortured and executed by sectarian rivals."], ["2006.09.04", "Iraq", "Basra", 2, 2, "Islamic terrorists attack a British patrol, killing two members."], ["2006.09.04", "Jordan", "Amman", 1, 5, "A terrorist yells, 'Allah Akbar' while gunning down a British tourist and injuring five others."], ["2006.09.04", "Philippines", "Jolo", 5, 20, "Abu Sayyaf militants kill five troops trying to apprehend two Bali bombers."], ["2006.09.05", "India", "Sopore", 1, 0, "The Hizb-ul-Mujahideen murder a student returning home from classes."], ["2006.09.05", "Iraq", "Baghdad", 4, 3, "Four Shia pilgrims are gunned down in two attacks by Sunni extremists (the other in Latifiya)."], ["2006.09.05", "Iraq", "Baghdad", 18, 6, "Eighteen innocents are murdered in at least four separate terror attacks around the country."], ["2006.09.05", "Lebanon", "Rmeileh", 4, 4, "Four members of a detail investigating a Christian's death are themselves killed in a bombing by Muslim radicals."], ["2006.09.05", "Pakistan", "Phuldayun", 1, 0, "A Muslim man guns down his wife, a young mother, in an 'honor' killing."], ["2006.09.05", "Sudan", "Khartoum", 1, 0, "A newspaper editor is kidnapped and beheaded by Islamic hard-liners after publishing an article questioning Muhammad's parentage."], ["2006.09.05", "Thailand", "Narathiwat", 1, 0, "Muslim militants set fire to a house, killing a 61-year-old man."], ["2006.09.05", "Thailand", "Narathiwat", 1, 0, "Muslims gun down a man sitting in a tea shop."], ["2006.09.05", "Thailand", "Yala", 1, 2, "An older woman is killed in her home by Islamists."], ["2006.09.06", "Afghanistan", "Yaqubi", 2, 1, "A suicide bomber kills a teacher and one other person."], ["2006.09.06", "Indonesia", "Tangkuran", 1, 0, "A Christian is killed in a bombing attack by militant Muslims."], ["2006.09.06", "Iraq", "Baghdad", 27, 38, "A horrible car bombing kills eight Iraqis and injures dozens more.  The bodies of nineteen victims of sectarian violence are found elsewhere."], ["2006.09.06", "Pakistan", "Kaga", 1, 0, "A 12-year-old girl is killed in her home by al-Qaeda backed militants."], ["2006.09.07", "Afghanistan", "Kabul", 3, 11, "Three British soldiers die in a single day from attacks by religious extremists."], ["2006.09.07", "India", "Budbug", 1, 0, "The Mujahideen invade a home and kill a resident."], ["2006.09.07", "India", "Srinagar", 1, 0, "A high school student succumbs to injuries suffered from a terror attack the week before."], ["2006.09.07", "Iraq", "Baghdad", 36, 64, "Islamic terrorists mow down nearly forty people in various attacks around the country."], ["2006.09.07", "Iraq", "Suwayra", 3, 0, "A woman is among three people tortured and beheaded by Islamic radicals."], ["2006.09.07", "Pal. Auth.", "Nablus", 1, 0, "A 28-year-old man is gunned down by Palestinian terrorists."], ["2006.09.07", "Somalia", "Mogadishu", 1, 0, "A young college student is murdered after converting from Islam to Christianity."], ["2006.09.08", "Afghanistan", "Kabul", 18, 30, "The lives of eighteen people are snuffed out by a Fedayeen suicide bomber in a downtown blast."], ["2006.09.08", "India", "Doda", 1, 0, "A man is kidnapped by the Mujahideen.  He dies two days later from injuries suffered."], ["2006.09.08", "India", "Malegaon", 31, 297, "Pakistani-backed militants are thought to be responsible for multiple bomb blasts that leave thirty-one dead and three-hundred injured."], ["2006.09.08", "Iraq", "Baghdad", 3, 6, "A woman and child are among three people killed by an incendiary bomb planted by Islamic terrorists."], ["2006.09.08", "Iraq", "Baghdad", 7, 0, "Seven victims of sectarian violence are found bound, tortured and executed."], ["2006.09.08", "Pakistan", "Barkhan", 5, 21, "Five people are killed in the bombing of a bus station."], ["2006.09.09", "India", "Ahlan", 1, 0, "A civilian is killed by Islamic militants."], ["2006.09.09", "India", "Bandipore", 1, 1, "Islamic terrorists open fire on a fruit vendor."], ["2006.09.09", "India", "Doda", 1, 1, "The Mujahideen gun down a man and seriously injure his wife."], ["2006.09.09", "India", "Doda", 2, 0, "The Mujahideen raid a police station, killing two officers and stealing weapons."], ["2006.09.09", "India", "Sonwar", 1, 1, "A taxi driver is killed, and a young girl severely injured in a Mujahideen attack."], ["2006.09.09", "Indonesia", "Poso", 1, 0, "A young Christian woman is killed when Islamic radicals throw a bomb at her house."], ["2006.09.09", "Iraq", "Baghdad", 21, 51, "Jihadis murder twenty-one innocents in a series of bombing and shooting attacks across the city."], ["2006.09.09", "Iraq", "Baiji", 3, 3, "Three civilians are killed in separate bombings."], ["2006.09.09", "Iraq", "Mosul", 1, 1, "A 10-year-old boy is killed and his mother injured inside their home by Muslim terrorists."], ["2006.09.09", "Pakistan", "Garjakh", 2, 0, "A man murders his nephew and nephew's girlfriend for an 'illicit relationship.'"], ["2006.09.09", "Pakistan", "Miramshah", 1, 0, "The local Taliban pump a 70-year-old man full of bullets and leave him with a note attached to his body."], ["2006.09.10", "Afghanistan", "Gardez", 3, 3, "A suicide bomber kills a regional official and two others."], ["2006.09.10", "Iraq", "Baghdad", 6, 29, "Two car bombs set by Islamic militants kill at least six people."], ["2006.09.10", "Iraq", "Mosul", 1, 0, "A barber is murdered by religious fundamentalists."], ["2006.09.10", "Iraq", "Tuz Khurmato", 4, 1, "Jihadi gunmen murder four oil workers."], ["2006.09.10", "Pakistan", "Wana", 1, 0, "A tribal leader is gunned down by Islamists as he is walking home."], ["2006.09.11", "Afghanistan", "Khost", 6, 36, "A 12-year-old boy is among six people murdered by a suicide bomber at a funeral for a previous victim of a suicide bombing."], ["2006.09.11", "India", "Kulgam", 1, 0, "A security official succumbs to injuries from a terrorist ambush."], ["2006.09.11", "Iraq", "Baghdad", 4, 3, "Four civilians are killed in a Jihadi shrapnel bombing."], ["2006.09.11", "Iraq", "Baghdad", 16, 7, "Sixteen people are blown to bits by a suicidal Sunni on a bus."], ["2006.09.11", "Thailand", "Yala", 1, 4, "A Buddhist woman is gunned down by militant Muslims in her grocery store."], ["2006.09.12", "India", "Thandi Dhok", 2, 0, "A husband and wife are murdered in their home by the Mujahideen."], ["2006.09.12", "Iraq", "Baghdad", 6, 15, "Six civilians are shredded by a Jihadi car bomb in a commercial district."], ["2006.09.12", "Iraq", "Bani Saad", 7, 3, "Seven Shia worshippers are murdered in their own mosque by Sunni bombers."], ["2006.09.12", "Syria", "Damascus", 1, 14, "Terrorists shouting 'Allah Akbar' detonate a car bomb and attempt to storm the U.S. embassy.  A Syrian guard is killed."], ["2006.09.12", "Turkey", "Amed", 10, 13, "An ultra-nationalist group with Islamist ties bombs a bus stop, killing ten Kurds, including seven children."], ["2006.09.13", "Afghanistan", "Farah", 1, 0, "A UN humanitarian worker is murdered by Muslim militants on a road."], ["2006.09.13", "Iraq", "Baghdad", 14, 57, "Jihadis kill fourteen people on a city street with a car bomb packed with shrapnel."], ["2006.09.13", "Iraq", "Baghdad", 69, 0, "Sixty-nine victims of sectarian violence are found bound, tortured and murdered over a 24-hour period."], ["2006.09.14", "Afghanistan", "Bakwa", 2, 2, "Religious extremists attack a police station, killing two officers."], ["2006.09.14", "India", "Hathiwara", 1, 0, "A photographer is kidnapped and beheaded by the Religion of Peace."], ["2006.09.14", "Iraq", "Baghdad", 2, 25, "A religious extremist targets a U.S. patrol in a suicide attack, killing two soldiers."], ["2006.09.14", "Iraq", "Baghdad", 10, 39, "Islamic terrorists set off two bombs, one at a photography shop and the other in a city street, killing ten innocents."], ["2006.09.14", "Iraq", "Baghdad", 32, 0, "The tortured bodies of thirty-two victims of sectarian hatred are found."], ["2006.09.14", "Sudan", "Otash", 4, 9, "Arab militia attacks a group of refugees, killing at least four."], ["2006.09.15", "India", "Surankote", 1, 5, "A young boy is killed when Hizb-ul-Mujahideen terrorists lob a grenade into his family's home."], ["2006.09.15", "India", "Watergam", 1, 7, "al-Mansoorian terrorists attack an Indian security patrol, killing one member."], ["2006.09.15", "Iraq", "Baghdad", 1, 0, "A Christian is killed when radical Muslims attack a Catholic church."], ["2006.09.15", "Iraq", "Baghdad", 22, 0, "The bodies of two-dozen more victims of sectarian hatred are found across the city."], ["2006.09.15", "Iraq", "Mussayab", 1, 0, "Islamic radicals kidnap a man, cut off his legs and head, then dump his body in the river."], ["2006.09.15", "Thailand", "Narathiwat", 1, 0, "A man is killed in his home by militant Muslims."], ["2006.09.15", "Thailand", "Narathiwat", 2, 1, "Two civilians are brutally shot to death by Islamic militants while traveling on a road."], ["2006.09.15", "Yemen", "Haradmut", 1, 0, "One of two suicide attacks on oil facilities in Yemen nets the death of a guard."], ["2006.09.16", "Afghanistan", "Kabul", 3, 1, "Three humanitarian workers are blown apart by the Taliban."], ["2006.09.16", "Iraq", "Baghdad", 1, 0, "Muslims stab a Christian to death in a marketplace in retaliation for the pope's remarks."], ["2006.09.16", "Iraq", "Baghdad", 3, 22, "Two bombs, including one strapped to a corpse, kill three people."], ["2006.09.16", "Iraq", "Baghdad", 47, 0, "Forty-seven more tortured and executed victims of sectarian hatred within the Religion of Peace are found."], ["2006.09.16", "Iraq", "Ramadi", 4, 8, "Jihadis send four civilians to Allah with a roadside incendiary bomb."], ["2006.09.16", "Iraq", "Samarra", 4, 0, "An al-Qaeda ambush leaves four tribesman dead."], ["2006.09.16", "Thailand", "Hat Yai", 5, 79, "At least five patrons of a shopping district are killed when Muslim militants set off six separate bombs."], ["2006.09.17", "Afghanistan", "Helmand", 2, 0, "Two policemen are murdered by Taliban extremists in a roadside attack."], ["2006.09.17", "Afghanistan", "Kandahar", 1, 11, "A suicide bomber kills an innocent civilian in a blast along a city street."], ["2006.09.17", "Iraq", "Baghdad", 24, 0, "Twenty-four more tortured and executed victims of sectarian hatred within the Religion of Peace are found."], ["2006.09.17", "Iraq", "Baqubah", 2, 3, "Jihadis attack an electrical plant, killing two guards."], ["2006.09.17", "Iraq", "Kirkuk", 21, 63, "Two suicide bomb attacks by 'Holy Warriors' take the lives of at least twenty-one innocents."], ["2006.09.17", "Somalia", "Mogadishu", 2, 0, "A 70-year-old nun working at a children's' hospital is shot to death by radical Muslims, along with a guard."], ["2006.09.18", "Afghanistan", "Herat", 12, 17, "A dozen innocents are blown apart by a Fedayeen suicide bomber on a motorbike."], ["2006.09.18", "Afghanistan", "Kabul", 4, 11, "At least four people are killed in a suicide car bombing."], ["2006.09.18", "Afghanistan", "Kafir Band", 4, 39, "Four Canadian soldiers, and an unknown number of civilians are killed when a suicide bomber on a bicycle targets a patrol handing out candy to children."], ["2006.09.18", "Iraq", "Baghdad", 27, 13, "Twenty-seven people are murdered by Jihadis in various attacks around the country."], ["2006.09.18", "Iraq", "Baquba", 4, 5, "Sunnis gun down four members of a Shia family."], ["2006.09.18", "Iraq", "Mosul", 4, 0, "Islamic radicals kidnap and torture four women to death."], ["2006.09.18", "Iraq", "Ramadi", 13, 10, "A suicide bomber blows himself to Allah, taking more than a dozen unwilling souls with him."], ["2006.09.18", "Iraq", "Tal Afar", 21, 27, "Muslim radicals bomb a marketplace, massacring twenty-one innocent shoppers."], ["2006.09.18", "Pakistan", "Laddha", 1, 0, "A tribesman is lynched by the local Taliban."], ["2006.09.18", "Somalia", "Baidoa", 5, 18, "At least five people are killed in a car bomb attack on the Somali president."], ["2006.09.19", "Afghanistan", "Helmand", 1, 0, "The Taliban execute a Turkish engineer taken prisoner three weeks earlier."], ["2006.09.19", "Canada", "Ottawa, ON", 2, 0, "A Muslim man guns down his sister and her fiancé because they were living together before marriage."], ["2006.09.19", "Iraq", "Baghdad", 12, 44, "Muslim radicals bomb a gas station, killing two civilians.  They also mortar a residential neighborhood killing an additional ten."], ["2006.09.19", "Iraq", "Baqubah", 11, 0, "Islamic gunmen kill at least eleven people across the city in a spasm of religious violence."], ["2006.09.19", "Iraq", "Mahmudiya", 13, 7, "Thirteen people are murdered by Islamic radicals in at least two separate attacks."], ["2006.09.19", "Iraq", "Sherqat", 18, 11, "Jihadis exterminate eighteen Iraqis with a car bomb followed by a suicide blast."], ["2006.09.19", "Kosovo", "Klina", 0, 4, "Four elderly Serbs are injured when Muslims throw a bomb through their apartment window."], ["2006.09.19", "Pakistan", "Bajaur", 0, 5, "Five women are injured when Taliban terrorists bomb their car as punishment for working at a humanitarian agency."], ["2006.09.20", "Afghanistan", "Wardak", 1, 2, "Religious extremists attack three policemen, killing one and severing the leg of another."], ["2006.09.20", "India", "Doda", 1, 0, "A 36-year-old woman is killed in her home by the Mujahideen."], ["2006.09.20", "India", "Gul Zada", 3, 2, "Local Islamists riddle a car full of bullets at a traffic stop, killing three occupants."], ["2006.09.20", "Iraq", "Baghdad", 43, 15, "Forty-two people are killed in a suicide bombing and various acts of sectarian violence around the city."], ["2006.09.20", "Iraq", "Mosul", 1, 0, "A young female teacher is kidnapped by Islamic militants, who gouge out her eyes and mutilate her."], ["2006.09.20", "Iraq", "Samarra", 1, 26, "A Fedayeen suicide bomber runs his car into a house, killing a young boy and injuring twenty-six others."], ["2006.09.21", "Chechnya", "Grozny", 5, 0, "Five Russians are brutally slaughtered by Muslim gunmen at point-blank range as they are sitting in a vehicle."], ["2006.09.21", "India", "Damhal Hanjipora", 1, 0, "A 20-year-old man is kidnapped from his home and murdered by the Mujahideen."], ["2006.09.21", "India", "Tangmarg", 1, 4, "A 13-year-old boy is killed when Muslim terrorists throw a grenade into the street."], ["2006.09.21", "Iraq", "Baghdad", 28, 22, "Six Jihad attacks leave two-dozen Iraqis dead and several more with burns and bullet wounds."], ["2006.09.21", "Iraq", "Baghdad", 38, 0, "Thirty-eight victims of sectarian hatred within the Religion of Peace are found tortured and executed around the city."], ["2006.09.21", "Iraq", "Karbala", 3, 0, "Three civilians are shot to death by Islamic terrorists."], ["2006.09.21", "Iraq", "Mosul", 2, 0, "Two sisters are brutally murdered by the Mujahideen."], ["2006.09.21", "Pakistan", "Haripur", 8, 3, "A schoolchild is among eight killed when gunmen open up on a family van."], ["2006.09.22", "Afghanistan", "Jalalabad", 1, 0, "The Taliban kill a Pakistani truck driver during an attack on oil tankers."], ["2006.09.22", "Afghanistan", "Kandahar", 19, 3, "Nineteen innocent laborers are massacred by religious extremists who bomb their bus then shoot the survivors."], ["2006.09.22", "Iraq", "Baghdad", 13, 0, "Three women are among thirteen people tortured and executed by Muslim terrorists.  At least one was beheaded."], ["2006.09.22", "Lebanon", "Ein Al Hulwa", 1, 0, "al-Ansar terrorists open fire, killing a Palestinian man."], ["2006.09.22", "Pakistan", "North Waziristan", 1, 0, "A man is kidnapped and executed by the local Taliban."], ["2006.09.22", "Pakistan", "Sargodha", 1, 0, "An 85-year-old Shia cleric is gunned down by radical Sunnis."], ["2006.09.23", "Bangladesh", "Dhaka", 1, 0, "A university professor is gunned down in his home."], ["2006.09.23", "India", "Kangan", 1, 0, "Islamic terrorists murder a civilian."], ["2006.09.23", "Iraq", "Baghdad", 17, 0, "Radical Shias rampage through Sunni neighborhoods, leaving a trail of over a dozen bodies."], ["2006.09.23", "Iraq", "Baghdad", 37, 40, "'Soldiers of the Prophet's Companions' stage a massive car bomb in a Shia neighborhood that kills over three-dozen innocents - mostly women and children."], ["2006.09.23", "Pakistan", "Dera Ghazi Khan", 2, 14, "A 14-year-old boy is one of two people killed when radicals explode a bomb at a cattle market."], ["2006.09.24", "India", "Sopore", 1, 2, "Muslim militants toss a grenade at a security patrol, killing one of the members."], ["2006.09.24", "India", "Surenda", 1, 0, "An 18-year-old woman is murdered by the Hizb-ul-Mujahideen after she refuses to marry a member."], ["2006.09.24", "Iraq", "Baghdad", 2, 17, "Radical Muslims place bombs outside a Christian cathedral, intending to kill worshippers.  Two people, including a child, are killed."], ["2006.09.24", "Iraq", "Baghdad", 6, 18, "Two Jihadi bombings kill six and injure at least eighteen."], ["2006.09.24", "Iraq", "Fallujah", 12, 0, "Jihadis kidnap and torture to death ten people.  A father and son are killed in their home."], ["2006.09.24", "Iraq", "Kirkuk", 4, 0, "Four young men are murdered by militant Muslims"], ["2006.09.24", "Iraq", "Tal Afar", 2, 3, "A suicide bomber rams a police checkpoint, killing two and wound three, including bystanders."], ["2006.09.25", "Afghanistan", "Kandahar", 1, 0, "A woman's rights campaigner is shot to death by the Taliban."], ["2006.09.25", "India", "Gundana", 1, 0, "Islamic radicals kill a medical assistant inside his home."], ["2006.09.25", "India", "Jwari", 2, 0, "A woman is among two people brutally slain by the Mujahideen in their village."], ["2006.09.25", "India", "Marmat", 1, 0, "A village leader is kidnapped by Muslim radicals and killed in captivity."], ["2006.09.25", "India", "Sanglan", 1, 0, "A 23-year-old civilian is kidnapped and murdered by the Mujahideen."], ["2006.09.25", "India", "Srinagar", 1, 6, "A policewoman is killed when Muslim militants throw a grenade at her.  A 9-year-old girl is among the injured."], ["2006.09.25", "Iraq", "Baiji", 10, 0, "The body of one of nine severed heads found two days earlier surfaces.  An intact body is found elsewhere."], ["2006.09.25", "Iraq", "Jurf al-Sakhar", 5, 10, "Muslim radicals target a police station with mortar fire, killing five officers."], ["2006.09.25", "Russia", "Kislovodsk", 1, 0, "The Jamaat terrorist group claims responsibility for the Ramadan shooting of an imam."], ["2006.09.25", "Somalia", "Kismayo", 1, 2, "A 13-year-old boy is gunned down by Islamists for taking part in a protest against their seizure of his city."], ["2006.09.25", "Thailand", "Narathiwat", 1, 0, "A 45-year-old civilian is lured out of his home by Muslim radicals, then cut down with an assault-weapon."], ["2006.09.25", "Thailand", "Yala", 2, 1, "A heavily-armed band of Muslim militants assault a small town, killing two civilians, including a woman."], ["2006.09.26", "Afghanistan", "Kabul", 2, 9, "Religious extremists kill an Afghan child and an Italian solider in a remote-controlled bomb attack."], ["2006.09.26", "Afghanistan", "Lashkar Gah", 18, 17, "A Fedayeen suicide bomber blows himself to Allah, taking eighteen innocent souls with him, including Muslim pilgrims."], ["2006.09.26", "India", "Kashmir", 2, 15, "Two police personnel are killed in separate Mujahideen attacks."], ["2006.09.26", "Iraq", "Baghdad", 10, 11, "A shooting attack on a mosque by Islamic terrorists leaves ten people dead."], ["2006.09.26", "Iraq", "Baghdad", 40, 34, "A series of bomb blasts and other Jihad attacks leave at least forty dead and dozens more in agony."], ["2006.09.26", "Iraq", "Baghdad", 44, 0, "Thirty-five victims of sectarian violence are found within the city and nine more in a river downstream."], ["2006.09.26", "Iraq", "Mahmudiya", 12, 0, "Twelve victims of sectarian violence within the Religion of Peace are found bound, tortured and executed."], ["2006.09.27", "India", "Maisuma", 1, 14, "A Muslim terrorist lobs a grenade into a city street, killing a police officer."], ["2006.09.27", "India", "Srinagar", 2, 0, "Two cops are gunned down by the Mujahideen in separate attacks."], ["2006.09.27", "Iraq", "Baghdad", 7, 11, "A woman gunned down on her way to work is among those killed in three attacks by radical Sunnis."], ["2006.09.27", "Iraq", "Baghdad", 8, 42, "Two separate Jihad attacks leave at least eight dead and over forty injured."], ["2006.09.27", "Iraq", "Baghdad", 16, 25, "A Fedayeen suicide bomber kills at least two other people.  Fourteen other bodies are found elsewhere."], ["2006.09.27", "Thailand", "Narathiwat", 1, 2, "Muslim terrorists open fire on a grocery, killing one civilian."], ["2006.09.27", "Thailand", "Pattani", 1, 0, "A Buddhist is murdered by Muslim extremists as he is riding a bus."], ["2006.09.27", "Thailand", "Yala", 1, 1, "Islamists shoot a civilian in an ambush that also injures his 6-year-old son."], ["2006.09.27", "Thailand", "Yala", 3, 0, "Muslim teens shoot three Buddhists to death as they are shopping at a grocery."], ["2006.09.28", "India", "Diwar", 1, 0, "A woman is killed inside her home by the Mujahideen two years after her husband was murdered in similar fashion."], ["2006.09.28", "India", "Kulgam", 1, 0, "A civilian succumbs to injuries suffered from an earlier terror attack."], ["2006.09.28", "Pakistan", "Khadi", 1, 0, "An Afghan refugee is murdered by the Taliban."], ["2006.09.28", "Thailand", "Pattani", 1, 0, "A man is shot in the head by Islamists after dropping his kids off at school."], ["2006.09.28", "Thailand", "Sai Buri", 1, 0, "A 35-year-old man is gunned down by Muslim militants in his pick-up truck."], ["2006.09.29", "Algeria", "Ouled Boudekhane", 2, 0, "Islamists murder two men outside a mosque."], ["2006.09.29", "India", "Dessa", 1, 0, "A civilian is abducted and killed in captivity by the Mujahideen."], ["2006.09.29", "Iraq", "Kirkuk", 3, 0, "Two brothers are among three people murdered in their car by Islamic radicals."], ["2006.09.30", "Afghanistan", "Kabul", 12, 40, "At least a dozen people are blown to bits by a Fedayeen suicide bomber."], ["2006.09.30", "Iraq", "Baqubah", 8, 0, "A father and two sons are among eight brutally murdered by Islamic terrorists."], ["2006.09.30", "Iraq", "Tal Afar", 2, 30, "A suicide bomber murders two people."], ["2006.09.30", "Pakistan", "Bahawlnagar", 1, 0, "A Christian is killed by authorities who arrest and imprison him for 'blaspheming' Islam."], ["2006.10.01", "Afghanistan", "Gereshk", 2, 2, "The Taliban kill two policemen from the back of a motorcycle."], ["2006.10.01", "Afghanistan", "Musa Qala", 5, 0, "Five civilians are killed in a Taliban landmine attack on their vehicle."], ["2006.10.01", "Ethiopia", "Jimma", 10, 12, "Ten people are killed, more than a dozen injured, and at least two churches burned down as Muslims attempt to ban a Christian ceremony."], ["2006.10.01", "India", "Gool", 1, 0, "The body of a 60-year-old man, abducted and murdered by the Mujahideen, is found."], ["2006.10.01", "Indonesia", "Poso", 0, 1, "A Christian man is pulled off a bus and stabbed by a Muslim mob."], ["2006.10.01", "Iraq", "Baghdad", 50, 0, "Fifty victims of sectarian hatred within the Religion of Peace are found by police over a 24-hour period."], ["2006.10.01", "Iraq", "Fallujah", 4, 6, "Four civilians are killed when Muslim terrorists detonate a bomb at a vegetable market."], ["2006.10.01", "Iraq", "Suwayra", 9, 0, "A schoolgirl is among nine people kidnapped and shot in the head and chest in two locations (Mahmudiya)."], ["2006.10.01", "Pakistan", "Sibi", 1, 0, "A 12-year-old boy is killed in a landmine blast."], ["2006.10.01", "Thailand", "Yala", 1, 1, "Muslim militants gun down a police officer and injure his 4-year-old daughter."], ["2006.10.02", "Afghanistan", "Kabul", 3, 3, "A religious extremist blows himself up, killing three people."], ["2006.10.02", "Iraq", "Baghdad", 5, 10, "Two Jihad bombings net five dead bodies."], ["2006.10.02", "Iraq", "Ishaqi", 3, 0, "Three men are gunned down by suspected Islamic fundamentalists."], ["2006.10.02", "Iraq", "Suwayra", 11, 0, "Seven people are kidnapped and beheaded by Muslim extremists.  Four others are killed in a separate attack."], ["2006.10.02", "Pakistan", "Latrey", 2, 7, "Two people are killed in sectarian violence involving a religious shrine."], ["2006.10.02", "Pal. Auth.", "Rafah", 2, 15, "A sectarian clash leaves two people dead."], ["2006.10.02", "Thailand", "Narathiwat", 1, 0, "A woman is shot to death by Islamic radicals while on a shopping trip."], ["2006.10.02", "Thailand", "Pattani", 2, 0, "Two people are murdered by Islamic radicals in separate attacks."], ["2006.10.02", "Thailand", "Songkhla", 1, 0, "A village headsman is ambushed and killed while driving his truck."], ["2006.10.03", "Afghanistan", "Kandahar", 2, 5, "Two Canadians on a road construction project are murdered by Taliban extremists."], ["2006.10.03", "Iraq", "Baqubah", 16, 0, "Seven members of the same family, including a father and three sons, are among sixteen murdered by Islamic terrorists."], ["2006.10.03", "Iraq", "Gatoun", 4, 0, "Four members of a family are murdered by sectarian rivals."], ["2006.10.03", "Iraq", "Kut", 2, 0, "Islamists behead one woman and burn another to death."], ["2006.10.03", "Iraq", "Rashad", 2, 0, "Two civilians are abducted and horribly tortured by Islamic terrorists, then killed."], ["2006.10.03", "Iraq", "Sadiyah", 2, 19, "A Fedayeen suicide bomber targets a fish market, sending two people to Allah."], ["2006.10.03", "Pakistan", "Ali Khan Brohi", 1, 0, "A woman is tortured to death by her husband and in-laws for opposing his plans to take a second wife."], ["2006.10.04", "Dagestan", "Maka-Kazmalyar", 1, 3, "Muslim terrorists kill a policeman and wound three others on a highway."], ["2006.10.04", "India", "Lal Chowk", 1, 6, "Muslim militants storm a building housing Hindu relics, killing at least one security guard."], ["2006.10.04", "India", "Srinagar", 8, 30, "Eight people are killed when Al Mansoorian militants stage a Fedayeen attack on a government building."], ["2006.10.04", "Iraq", "Baghdad", 16, 87, "Jihadis bomb a Christian district, killing sixteen innocents and injuring many dozens more."], ["2006.10.04", "Iraq", "Mosul", 2, 0, "Two Turkish truck drivers are brutally murdered by Sunni extremists."], ["2006.10.04", "Philippines", "Cotabato", 1, 0, "A local official is gunned down by Muslim radicals while sitting in his car."], ["2006.10.04", "Sudan", "Kalama", 2, 1, "Arab militias attack a DP camp, killing two civilians."], ["2006.10.05", "Algeria", "Bouira", 8, 0, "Eight members of a security patrol are killed by Islamic fundamentalists."], ["2006.10.05", "Iraq", "Al-Samawa", 4, 0, "'Holy Warriors' burst into a house and slaughter three woman and a 3-year-old girl, who has her throat slit."], ["2006.10.05", "Iraq", "Baghdad", 32, 28, "A car bombing adds two additional bodies to thirty more racked up the Religion of Peace in sectarian violence."], ["2006.10.05", "Iraq", "Ukashat", 5, 0, "Five people are kidnapped and tortured to death by Muslim terrorists."], ["2006.10.05", "Iraq", "Zaafaraniya", 5, 6, "Islamic radicals open fire on a cafe, killing five innocents."], ["2006.10.05", "Pakistan", "Kalaya", 8, 3, "Eight more people are killed as Sunnis and Shias clash over ownership of a shrine."], ["2006.10.06", "Afghanistan", "Khost", 1, 3, "A suicide bomber kills a policeman."], ["2006.10.06", "India", "Srinagar", 1, 6, "A civilian is killed when a militant Muslim throws a grenade into a bus stop."], ["2006.10.06", "Iraq", "Baghdad", 7, 0, "Seven people are kidnapped and brutally murdered by sectarian death squads."], ["2006.10.06", "Iraq", "Mosul", 1, 0, "Radical Sunnis gun down a mother walking with her 5-year-old son."], ["2006.10.06", "Pakistan", "Kalay", 5, 0, "Five Sunni family members are killed in a retaliatory mortar strike by Shias for the earlier event."], ["2006.10.06", "Pakistan", "Kalay", 14, 8, "Sunnis mortar a Shia gathering, killing fourteen people."], ["2006.10.07", "Afghanistan", "Baghlan", 2, 0, "Two German journalists, one of whom was a woman, are murdered in the countryside."], ["2006.10.07", "India", "Ramban", 1, 2, "A Muslim tosses a grenade at a police patrol on a city street, killing one officer."], ["2006.10.07", "India", "Shalapora", 1, 0, "An off-duty soldier is kidnapped by the Mujahideen, who behead him and scatter the body parts."], ["2006.10.07", "India", "Vesu Achhabal", 1, 0, "A civilian is kidnapped and killed by the Mujahideen."], ["2006.10.07", "Iraq", "Baaj", 3, 0, "Three innocent workers are gunned down by Sunni terrorists."], ["2006.10.07", "Iraq", "Baghdad", 7, 0, "Two innocent workers at a bakery are among seven people killed by religious extremists."], ["2006.10.07", "Iraq", "Baghdad", 51, 0, "Fifty-one people are killed in sectarian violence within the Religion of Peace across the city."], ["2006.10.07", "Iraq", "Iskandariya", 2, 4, "Two members of a family are killed in their sleep by a Jihad mortar attack on their home."], ["2006.10.07", "Iraq", "Samarra", 2, 0, "The 8-year-old son of a policeman is gunned down along with his father by terrorists."], ["2006.10.07", "Iraq", "Sinjar", 2, 2, "Two religious minorities are gunned down by Islamists."], ["2006.10.07", "Iraq", "Tal Afar", 14, 13, "A suicide truck bomber at a checkpoint blows fourteen other people to Allah."], ["2006.10.07", "Pakistan", "Tank", 1, 0, "A Shia tribal leader is murdered by terrorists."], ["2006.10.07", "Thailand", "Pattani", 1, 0, "Muslims murder a policeman as he travels to work."], ["2006.10.07", "Thailand", "Songkhla", 2, 0, "A Buddhist man and his son are shot to death by Islamists."], ["2006.10.08", "India", "Sopore", 1, 0, "A dental surgeon is abducted and tortured for two hours before Islamic militants slit his throat."], ["2006.10.08", "Iraq", "Baghdad", 1, 0, "A 14-year-old boy is crucified by Islamic radicals in a heinous attack."], ["2006.10.08", "Iraq", "Baqubah", 10, 0, "Four civilians are murdered by Islamic radicals.  Six bodies are found elsewhere."], ["2006.10.08", "Iraq", "Haditha", 5, 0, "Five civilians are gunned down by Jihadi gunmen."], ["2006.10.08", "Thailand", "Narathiwat", 1, 0, "A 65-year-old Buddhist is murdered by Muslims while walking home."], ["2006.10.08", "Thailand", "Pattani", 1, 0, "A rubber tapper is shot to death by Islamists."], ["2006.10.08", "Thailand", "Yala", 1, 0, "Radical Muslims shoot a man four times in front of his house."], ["2006.10.09", "Afghanistan", "Khogyani", 3, 2, "Three men are murdered by Islamic extremists as they are traveling to investigate a school burning."], ["2006.10.09", "India", "Bandipora", 1, 0, "A man is kidnapped and brutally murdered by the Mujahideen."], ["2006.10.09", "Iraq", "Baghdad", 13, 46, "Islamic terrorists kill thirteen civilians rushing home for Ramadan in a heinous bomb attack."], ["2006.10.09", "Iraq", "Baghdad", 53, 0, "Police report finding fifty-three victims of sectarian violence within the Religion of Peace over the last 24 hours."], ["2006.10.09", "Iraq", "Tal Afar", 1, 11, "A suicide bomber kills one other person."], ["2006.10.09", "Thailand", "Narathiwat", 2, 1, "A married couple are murdered by Muslim extremists."], ["2006.10.10", "Afghanistan", "Kabul", 0, 11, "Eleven people are injured when religious extremists place a bicycle bomb next to a bus stop."], ["2006.10.10", "Afghanistan", "Khushmand", 3, 0, "The Taliban execute three civilians."], ["2006.10.10", "Iraq", "Baghdad", 10, 4, "Islamic fundamentalists bomb a bakery, killing ten innocents."], ["2006.10.10", "Iraq", "Baghdad", 60, 22, "Sixty victims of sectarian hatred within the Religion of Peace are found over a 24 hour period.  Twenty-two others are injured."], ["2006.10.10", "Iraq", "Baqubah", 12, 0, "A dozen people are gunned down by Muslim terrorists."], ["2006.10.10", "Iraq", "Fallujah", 4, 0, "Radical Sunnis kidnap and torture four civilians to death."], ["2006.10.10", "Iraq", "Mosul", 7, 0, "Seven bodies are found here, and four others in Tal Afar, showing signs of torture at the hands of religious militants."], ["2006.10.10", "Philippines", "Makilala", 6, 29, "A bomb blast at a festival by Islamic militants leaves six dead and twenty-nine wounded."], ["2006.10.10", "Philippines", "Tacurong City", 2, 8, "Islamists set off a bomb in a crowded market at noon, killing two shoppers."], ["2006.10.11", "Iraq", "Baghdad", 1, 0, "A Christian priest is abducted and decapitated by Muslim extremists.  The head is not found with the body."], ["2006.10.11", "Iraq", "Baghdad", 4, 2, "Islamic gunmen murder four members of a family in their home."], ["2006.10.11", "Iraq", "Baghdad", 7, 13, "Two civilians are killed when Islamic terrorists trigger a car bomb along a city street.  Five laborers are killed in a separate bombing."], ["2006.10.11", "Iraq", "Kut", 6, 0, "A peasant woman is among six people killed by Jihadis in separate attacks."], ["2006.10.11", "Pakistan", "Mir Ali", 1, 0, "An Afghan refugee is murdered by Islamic fundamentalists."], ["2006.10.11", "Pakistan", "Saobi", 1, 0, "A doctor is killed by religious extremists."], ["2006.10.11", "Philippines", "Patikul", 2, 8, "Abu Sayyaf terrorists kill two government soldiers."], ["2006.10.11", "Thailand", "Pattani", 1, 0, "A man is gunned down in a drive-by shooting by Islamists."], ["2006.10.12", "Afghanistan", "Kabul", 1, 19, "Two suicide attacks and an ambush at Uruzgan by the Taliban leave at least one person dead."], ["2006.10.12", "India", "Srinagar", 3, 8, "Three policemen are killed in a brutal assault by Islamic terrorists in the heart of the city."], ["2006.10.12", "Iraq", "Baghdad", 19, 25, "Eleven employees of a television station are brutally slaughtered, some in their sleep.  Two other bombings kill another eight."], ["2006.10.12", "Iraq", "Baqubah", 12, 0, "Twelve people are gunned down by Jihadis."], ["2006.10.12", "Thailand", "Narathiwat", 1, 0, "Muslim radicals kill a 26-year-old Buddhist in his home."], ["2006.10.12", "Thailand", "Yala", 1, 0, "A Buddhist factory worker is shot to death by Muslims."], ["2006.10.13", "Afghanistan", "Kandahar", 9, 5, "Eight civilians are among nine killed by a Fedayeen suicide bomber."], ["2006.10.13", "Algeria", "Kabylie", 1, 0, "The Salafist Group for Preaching and Combat guns down a man in a cafe."], ["2006.10.13", "Iraq", "Duluiya", 17, 0, "Seventeen Shiite laborers are decapitated in an orchard by their Sunni brothers."], ["2006.10.13", "Iraq", "Hilla", 8, 10, "Eight people lose their lives to a Muslim bomber."], ["2006.10.13", "Iraq", "Suwayra", 8, 2, "Six women and two children are slaughtered by Muslim gunmen in a field."], ["2006.10.13", "Thailand", "Narathiwat", 1, 0, "A middle-aged Buddhist man is shot and killed by Muslim militants as he is walking home."], ["2006.10.13", "Thailand", "Narathiwat", 1, 0, "Two Muslims walk into a noodle shop and murder a patron."], ["2006.10.13", "Thailand", "Pattani", 1, 0, "A man is kidnapped and beheaded in front of his 13-year-old daughter by Islamic radicals."], ["2006.10.14", "Afghanistan", "Kandahar", 2, 2, "Two Canadians are killed in a Taliban rocket attack on a road construction project."], ["2006.10.14", "Ethiopia", "Beshasha", 6, 15, "A mob of 300 Muslims attack a group of unarmed Christians worshipping at a church, murdering at least six of them - including two priests."], ["2006.10.14", "Iraq", "Baghdad", 25, 0, "Twenty-five victims of sectarian violence within the Religion of Peace are found tortured and executed."], ["2006.10.14", "Iraq", "Balad", 15, 0, "Fifteen Sunnis are killed in revenge for an earlier massacre."], ["2006.10.14", "Iraq", "Saifiya", 10, 0, "Ten Shia family members are slaughtered in their home by Sunni radicals."], ["2006.10.14", "Thailand", "Narathiwat", 1, 0, "A rubber tapper is murdered by Islamic radicals, who chop his face beyond recognition."], ["2006.10.15", "Afghanistan", "Herat", 2, 1, "Two people are killed when the Taliban explode a bomb along a city street."], ["2006.10.15", "Afghanistan", "Kandahar", 1, 2, "A local official is assassinated by religious extremists."], ["2006.10.15", "Afghanistan", "Khost", 3, 1, "Hundreds of Taliban extremists attack a police post, killing at least three officers."], ["2006.10.15", "Algeria", "Ain Defla", 8, 0, "Islamists from the Salafist Group for Preaching and Combat shoot eight security guards to death."], ["2006.10.15", "India", "Srinagar", 2, 0, "Jaish-e-Mohammed terrorists attack two policemen, killing one.  The second officer succumbs to injury a week later."], ["2006.10.15", "Iraq", "Baghdad", 4, 6, "Four civilians are killed in a Jihad car bombing."], ["2006.10.15", "Iraq", "Balad", 31, 0, "Thirty-one Sunnis are killed in retaliation for an earlier massacre against Shias."], ["2006.10.15", "Iraq", "Fallujah", 4, 0, "Four people are kidnapped and tortured to death by Islamic terrorists."], ["2006.10.15", "Iraq", "Kirkuk", 10, 64, "Three suicide bombings, including one by a man at a girl's high school, leave at least ten innocents dead."], ["2006.10.15", "Iraq", "Latifiya", 8, 0, "Three women and two children are among eight Shias of a family killed when radical Sunnis invade their home."], ["2006.10.15", "Iraq", "Mosul", 5, 0, "Five members of a family, including three women, are killed in their home by Muslim militants."], ["2006.10.15", "Thailand", "Chanae", 1, 1, "A 30-year-old man is shot and killed by Islamists as he is riding a motorcycle."], ["2006.10.15", "Thailand", "Joh I Rong", 1, 1, "A 21-year-old man is killed by Islamic militants."], ["2006.10.16", "Afghanistan", "Kandahar", 4, 2, "A Fedayeen suicide bomber kills four civilians."], ["2006.10.16", "Indonesia", "Sulawesi", 1, 0, "A Christian priest is murdered by Muslim gunmen in front of his wife."], ["2006.10.16", "Iraq", "Baghdad", 20, 17, "Twenty people at a Shiite funeral are killed by two car bombs.  The second was set to kill those rushing to help."], ["2006.10.16", "Iraq", "Baghdad", 46, 0, "Forty-six victims of sectarian violence within the Religion of Peace are found tortured and executed over a 24-hour period."], ["2006.10.16", "Iraq", "Balad", 28, 0, "Twenty-eight more Sunnis are killed by Shias over a 48-hour period in revenge for an earlier massacre."], ["2006.10.16", "Iraq", "Khalis", 12, 4, "Four people standing at a bus stop are gunned down by Islamic terrorists.  Eight others are killed in two separate attacks."], ["2006.10.16", "Iraq", "Suwayra", 8, 48, "Eight civilians standing near a bank are cut down by a Jihad car bomb."], ["2006.10.16", "Thailand", "Narathiwat", 2, 0, "A husband and wife are murdered by Muslim gunmen as they are traveling home from work."], ["2006.10.16", "Thailand", "Pattani", 1, 0, "A 55-year-old man is machine-gunned to death by Islamic radicals."], ["2006.10.16", "Thailand", "Raman", 2, 0, "A village leader and colleague are shot to death by Muslim terrorists as they are returning from a shopping trip."], ["2006.10.16", "Thailand", "Yala", 2, 0, "A husband and wife rubber-tapping team are brutally gunned down by Islamic militants."], ["2006.10.16", "Thailand", "Yala", 2, 0, "Two men are murdered in separate attacks."], ["2006.10.17", "Afghanistan", "Spin Boldak", 1, 0, "Taliban extremists destroy an oil tanker and kill the Pakistani driver."], ["2006.10.17", "Eritrea", "Adi-Quala", 2, 0, "Two Christians are arrested and tortured to death for hosting a church meeting."], ["2006.10.17", "India", "Batmaloo", 1, 0, "A man is gunned down by Islamic militants."], ["2006.10.17", "India", "Lal Chowk", 2, 0, "Two policemen are killed in a Mujahideen attack on a market."], ["2006.10.17", "Iraq", "Baghdad", 19, 0, "Nineteen additional victims of sectarian hatred within the Religion of Peace are found."], ["2006.10.17", "Iraq", "Balad Ruz", 5, 1, "Sunnis storm a house and murder a mother and her four sons."], ["2006.10.17", "Iraq", "Basra", 5, 0, "Islamic radicals murder four university students and a female doctor."], ["2006.10.17", "Iraq", "Haditha", 4, 0, "Four people are kidnapped, tortured and killed by Muslim terrorists."], ["2006.10.17", "Philippines", "Basilan", 1, 1, "Abu Sayyaf militants ambush two off-duty soldiers on their way to a market."], ["2006.10.17", "Thailand", "Yala", 1, 1, "Militant Muslims gun down a guard at a bank."], ["2006.10.18", "Thailand", "Narathiwat", 1, 0, "A civilian is shot in the head by Muslim extremists."], ["2006.10.18", "Thailand", "Yala", 1, 4, "Muslim militants open fire on a checkpoint, killing a Thai soldier."], ["2006.10.19", "Afghanistan", "Khost", 1, 7, "A suicide bomber kills one other person."], ["2006.10.19", "Afghanistan", "Kunar", 8, 0, "Eight Afghan employees at a NATO base are stopped in traffic and shot execution-style on their way home."], ["2006.10.19", "Afghanistan", "Lashkar Gah", 3, 9, "Two children and a British soldier are blown apart by a Fedayeen suicide bomber."], ["2006.10.19", "India", "Budhal", 1, 0, "Terrorists plant a bomb in a field, killing a 12-year-old boy."], ["2006.10.19", "Iraq", "Baghdad", 4, 8, "Four Palestinians are killed when their Muslim 'brothers' fire rockets into their neighborhood."], ["2006.10.19", "Iraq", "Baghdad", 12, 32, "Various attacks by the Religion of Peace claim the lives of a dozen people."], ["2006.10.19", "Iraq", "Khalis", 4, 4, "In a heinous attack, gunmen murder four laborers."], ["2006.10.19", "Iraq", "Khalis", 10, 20, "Sectarian rivals kill ten innocents with a Ramadan bombing of a busy market."], ["2006.10.19", "Iraq", "Kirkuk", 11, 74, "Separate Fedayeen suicide bombers send eleven innocents to Allah."], ["2006.10.19", "Iraq", "Mahmudiya", 7, 3, "Jihadis murder seven people in two attacks."], ["2006.10.19", "Iraq", "Mosul", 21, 26, "A suicide bomber kills eleven innocents at a fueling station.  Ten other people are killed elsewhere."], ["2006.10.19", "Pakistan", "Shakai", 2, 3, "Islamic militants ambush five Pakistani soldiers, killing two."], ["2006.10.20", "Algeria", "Timezrit", 1, 0, "A man is stabbed to death by Islamic fundamentalists at a phony roadblock."], ["2006.10.20", "India", "Lolab", 1, 0, "A 7-year-old child is murdered by militant Muslims in a grenade attack."], ["2006.10.20", "Iraq", "Balad", 9, 0, "Nine people are killed in Sunni-Shia violence."], ["2006.10.20", "Pakistan", "Jandola", 1, 0, "A civilian is murdered by Islamic militants."], ["2006.10.20", "Pakistan", "Peshawar", 7, 41, "Terrorists bomb a crowded shopping area, killing at least a half-dozen innocents."], ["2006.10.20", "Philippines", "Kabacan", 1, 2, "Two Moro Islamic Liberation Front terrorists gun down a man in his bed."], ["2006.10.20", "Thailand", "Narathiwat", 1, 0, "A young woman is murdered by Islamic militants."], ["2006.10.20", "Thailand", "Narathiwat", 1, 0, "Muslim radicals kill a 37-year-old man in his home."], ["2006.10.20", "Thailand", "Narathiwat", 2, 0, "Two men are gunned down in separate drive-by attacks by Muslim terrorists."], ["2006.10.20", "Thailand", "Pattani", 1, 0, "Muslims shoot a 46-year-old man off of his motorcycle."], ["2006.10.20", "Thailand", "Songkhla", 4, 13, "Islamists detonate a bomb at a village teashop, killing four civilians.  Two civilians lost both their legs."], ["2006.10.21", "Afghanistan", "Ismailkhel", 1, 0, "An Afghan official is killed in a remote-controlled Taliban bomb."], ["2006.10.21", "India", "Kishtwar", 1, 1, "A young boy is killed by the Mujahideen in a mine attack."], ["2006.10.21", "Iraq", "Baghdad", 7, 15, "A religious extremist blows himself up in a minivan, killing at least seven others."], ["2006.10.21", "Iraq", "Baqubah", 1, 0, "A 14-year-old Christian boy is abducted and beheaded by Muslim extremists."], ["2006.10.21", "Iraq", "Mahmoudiyah", 19, 52, "Jihadis massacre nineteen people at a crowded market with mortars and a bomb."], ["2006.10.21", "Philippines", "Barangay Banawag", 1, 0, "Islamic militants are suspected in the murder of a farmer."], ["2006.10.21", "Thailand", "Narathiwat", 1, 0, "A Buddhist man is slaughtered by Muslim extremists."], ["2006.10.21", "Thailand", "Pattani", 1, 1, "A couple riding a motorcycle are shot by Muslim radicals.  The man dies on the scene."], ["2006.10.22", "India", "Muzaffarnagar", 1, 12, "A young Hindu is killed, and more than a dozen others injured, when Muslims object to a Diwali celebration."], ["2006.10.22", "Iraq", "Amil", 1, 0, "Religious fundamentalists murder a barber."], ["2006.10.22", "Iraq", "Baghdad", 5, 6, "Muslim terrorists bomb a street market, killing five innocents."], ["2006.10.22", "Iraq", "Baghdad", 50, 0, "Fifty victims of sectarian hatred within the Religion of Peace are found over a 24-hour period."], ["2006.10.22", "Iraq", "Baqubah", 13, 25, "Thirteen police recruits are murdered by a Jihadi bombing and shooting attack on their bus."], ["2006.10.22", "Iraq", "Madaen", 9, 3, "Nine people are killed in a Religion of Peace sectarian clash."], ["2006.10.22", "Iraq", "Yarmuk", 2, 0, "Two street cleaners are murdered by Islamic terrorists."], ["2006.10.22", "Pakistan", "Bahawalpur", 1, 0, "Radical Sunnis gun down a Shia cleric."], ["2006.10.22", "Thailand", "Narathiwat", 1, 12, "A column of Buddhist monks, on their way to receive alms for the poor, is bombed by Muslim militants."], ["2006.10.22", "Thailand", "Pattani", 1, 0, "A man is murdered by Muslim militants while walking home."], ["2006.10.23", "India", "Tarzoo", 1, 1, "A civilian is killed when the Mujahideen bomb a bus stop."], ["2006.10.23", "Iraq", "Baghdad", 21, 35, "Five separate Jihad attacks leave nearly two dozen people dead and another three dozen injured."], ["2006.10.23", "Iraq", "Haqlaniyah", 1, 1, "Terrorists kill a child and injure a woman."], ["2006.10.23", "Mali", "Arouan", 9, 3, "Islamic fundamentalists kill nine former Tuareg rebels."], ["2006.10.23", "Philippines", "Zamboanga", 2, 0, "Islamic militants suspected in a shooting attack that leaves a cop and a civilian dead."], ["2006.10.23", "Thailand", "Pattani", 1, 0, "Muslim radicals kill a civilian who is walking home."], ["2006.10.24", "India", "Baramulla", 1, 0, "A policeman is murdered by the Religion of Peace."], ["2006.10.24", "India", "Changoo Dooru", 1, 0, "Terrorists assassinate a government official."], ["2006.10.24", "Iraq", "Baghdad", 1, 7, "Jihadis bomb an ice cream shop, killing an innocent person."], ["2006.10.24", "Thailand", "Yala", 1, 0, "Muslims shoot a laborer four times, killing him."], ["2006.10.25", "India", "Anantnag", 1, 0, "A man is dragged out of his house and executed by the Mujahideen."], ["2006.10.25", "India", "Kupwara", 2, 0, "Two brothers succumb to injuries after being shot by militant Muslims."], ["2006.10.25", "Iraq", "Husayba", 2, 2, "Two people are killed when Muslim militants bomb a marketplace."], ["2006.10.25", "Iraq", "Mahmudiya", 4, 0, "Terrorists kidnap, bound and execute four people."], ["2006.10.26", "India", "Tral", 1, 0, "A civilian is abducted and executed by the Mujahideen."], ["2006.10.26", "Iraq", "Baqubah", 34, 35, "Two separate attacks by Jihadis leave thirty-four Iraqi policemen dead."], ["2006.10.26", "Iraq", "Mosul", 8, 0, "At least eight people are found shot to death by Islamic terrorists over a two day period."], ["2006.10.26", "Philippines", "Zamboanga", 1, 0, "Muslims gun down a Chinese trader."], ["2006.10.26", "Thailand", "Narathiwat", 1, 5, "A cleric is gunned down by terrorists, and four others are injured in a separate attack."], ["2006.10.27", "Afghanistan", "Uruzgan", 14, 3, "Children and the elderly make up the bulk of civilians casualties, as religious extremists blow up a passenger bus."], ["2006.10.27", "Iraq", "Baghdad", 11, 0, "Eleven victims of sectarian hatred within the Religion of Peace are found murdered."], ["2006.10.27", "Iraq", "Muradiya", 4, 5, "Four people are machine-gunned to death when terrorists open up on a minibus."], ["2006.10.27", "Thailand", "Pattani", 1, 0, "Militant Muslims murder a military guard patrolling a market."], ["2006.10.27", "Thailand", "Yala", 3, 0, "A 4-year-old girl is gunned down by radical Muslims, along with her parents."], ["2006.10.28", "India", "Guwahati", 1, 12, "Pakistani-backed militants kill a 14-year-old boy at a Hindu festival."], ["2006.10.28", "India", "Jamslan", 1, 1, "A woman is blown apart by a terrorist grenade."], ["2006.10.28", "India", "Sopore", 1, 32, "Militant Muslims toss a grenade into a market, killing one person."], ["2006.10.28", "Iraq", "Baghdad", 2, 43, "Two people are killed in separate bombing attacks."], ["2006.10.28", "Iraq", "Iskandariya", 5, 20, "Jihadis detonate a car bomb in a residential area, killing five people."], ["2006.10.28", "Iraq", "Kut", 4, 0, "Islamic gunmen kill four members of a family in their home."], ["2006.10.28", "Iraq", "Suwayra", 5, 0, "Five people are kidnapped, executed and dumped in a river by sectarian rivals."], ["2006.10.28", "Pakistan", "Quetta", 1, 12, "Taliban-backed militants detonate a bicycle bomb on a city street, killing a young boy."], ["2006.10.28", "Thailand", "Narathiwat", 1, 0, "A 74-year-old Buddhist man is murdered by Islamists."], ["2006.10.28", "Thailand", "Pattani", 1, 0, "A rubber plantation owner is murdered by Islamists."], ["2006.10.28", "Thailand", "Pattani", 1, 0, "An off-duty officer is killed by militant Muslims."], ["2006.10.29", "Afghanistan", "Oruzgan", 1, 8, "A Taliban bombing kills a NATO soldier and injures eight other people, including civilians."], ["2006.10.29", "India", "Mahore", 1, 1, "A woman is killed in a Mujahideen IED attack."], ["2006.10.29", "India", "Pulwama", 1, 0, "A 24-year-old civilian is kidnapped and brutally murdered by the Mujahideen."], ["2006.10.29", "Iraq", "Baghdad", 2, 0, "Fundamentalists gun down a sports broadcaster, along with her driver."], ["2006.10.29", "Iraq", "Baghdad", 31, 0, "Thirty-one victims of sectarian hatred within the Religion of Peace are found murdered over a 24-hour period."], ["2006.10.29", "Iraq", "Basra", 19, 0, "In a brutal ambush of a bus carrying cleaning workers and police recruits, Sunnis slaughter nineteen innocents."], ["2006.10.29", "Iraq", "Fallujah", 5, 0, "Terrorists kidnap, torture and kill five people."], ["2006.10.29", "Philippines", "Zamboanga", 1, 0, "A policeman is killed by Abu Sayyaf terrorists."], ["2006.10.29", "Sudan", "Jabel Moun", 92, 0, "Nearly one-hundred innocent people are massacred by an Arab militia backed by the Islamic government.  At least thirty-three are children."], ["2006.10.29", "Sudan", "Khabesh", 22, 0, "Twenty-two African villagers are massacred by Arab militias."], ["2006.10.30", "Algeria", "Dergana", 2, 9, "Islamic rebels kill two people in a second bombing coinciding with an earlier one."], ["2006.10.30", "Algeria", "Raghaja", 1, 14, "Islamic rebels kill one person in a bombing."], ["2006.10.30", "India", "Chadol", 1, 1, "Two students are abducted by the Mujahideen.  One is murdered in captivity."], ["2006.10.30", "Iraq", "Baghdad", 9, 30, "Two Jihad car bombings leave at least nine people dead, and thirty others in agony."], ["2006.10.30", "Iraq", "Baghdad", 31, 60, "Sunnis bomb a market, killing over thirty innocents, including Shia laborers looking for work."], ["2006.10.30", "Iraq", "Khalis", 2, 3, "Two laborers are blown apart by a roadside bomb."], ["2006.10.30", "Iraq", "Kirkuk", 3, 19, "A Fedayeen suicide bomber blows himself up in a Kurdish police station, killing three people, including a 3-year-old girl."], ["2006.10.30", "Iraq", "Mahmudiya", 12, 0, "Six victims of sectarian violence are found here, and another six in Suwayra."], ["2006.10.30", "Thailand", "Yala", 1, 0, "Islamists shoot a man in the head."], ["2006.10.31", "Afghanistan", "Ghazni", 1, 2, "A policeman is killed by a suicide bomber."], ["2006.10.31", "Afghanistan", "Nuristan", 3, 1, "Three NATO soldiers on patrol are killed in a roadside attack by religious extremists."], ["2006.10.31", "Chad", "Amtiman", 128, 0, "One-hundred and twenty-eight black Africans are massacred by Arab extremists in a racial attack.  Homes, warehouses and shops are set ablaze in the village."], ["2006.10.31", "Iraq", "Baghdad", 4, 13, "Two Jihadi car bombings leave four dead."], ["2006.10.31", "Iraq", "Baghdad", 23, 19, "A suicidal Sunni bomber takes out two-dozen innocents at a Shia wedding.  The dead included nine children."], ["2006.10.31", "Iraq", "Baqubah", 10, 3, "Shiite fundamentalists kill ten people, including two shop owners."], ["2006.10.31", "Iraq", "Suwayra", 8, 0, "Eight victims of sectarian hatred within the Religion of Peace are found in two locations."], ["2006.10.31", "Pakistan", "Azad Kashmir", 1, 0, "A Christian missionary is shot to death by Islamic radicals."], ["2006.11.01", "England", "Blackburn", 5, 0, "A conservative Muslim man burns his family to death in a fire over concerns that they were becoming too Westernized."], ["2006.11.01", "India", "Lancha", 1, 0, "The Mujahideen kill a former member who renounced violence."], ["2006.11.01", "Iraq", "Baghdad", 12, 24, "Four Jihad bombings leave at least a dozen people dead."], ["2006.11.01", "Iraq", "Baghdad", 35, 0, "Thirty-five victims of sectarian hatred within the Religion of Peace are found in several locations, tortured and executed."], ["2006.11.01", "Iraq", "Mosul", 9, 0, "Islamic terrorists kill nine people, one of whom was burned."], ["2006.11.01", "Pakistan", "Bajaur", 1, 0, "The Taliban abduct and murder a tribesman."], ["2006.11.01", "Thailand", "Pattani", 1, 0, "Muslim militants murder a postman."], ["2006.11.02", "Afghanistan", "Adraskan", 6, 3, "Religious extremists murder six Afghan policemen in a highway attack."], ["2006.11.02", "Algeria", "Tachebenk", 8, 0, "Eight Algerian soldiers are massacred in an ambush by Islamic fundamentalists."], ["2006.11.02", "India", "Baramulla", 1, 0, "A civilian is murdered by Islamists at a hospital."], ["2006.11.02", "India", "Drug Teng", 1, 0, "The Mujahideen abduct a man from his home and hang him."], ["2006.11.02", "India", "Srinagar", 1, 2, "A cop is gunned down by Jihadis."], ["2006.11.02", "Iraq", "Baghdad", 3, 0, "Sunni gunmen murder a university professor, his wife and son in a shooting attack."], ["2006.11.02", "Iraq", "Baghdad", 7, 45, "Sunnis car-bomb a Shia marketplace, killing at least seven people and leaving dozens more in agony."], ["2006.11.02", "Iraq", "Mahmudiya", 5, 4, "A car-bomb kills one man, and four others are found blindfolded and executed in a separate attack by Jihadis."], ["2006.11.02", "Iraq", "Udhaim", 7, 0, "Two separate Jihad attacks on fuel trucks leave seven innocents dead."], ["2006.11.03", "Afghanistan", "Khost", 2, 1, "Two Pakistani truck drivers are shot to death by the Taliban."], ["2006.11.03", "Chechnya", "Grozny", 1, 3, "The Mujahideen bomb a bridge, killing one person and injuring three others."], ["2006.11.03", "India", "Anantnag", 1, 0, "The Mujahideen kill a man at a wedding."], ["2006.11.03", "Iraq", "Baghdad", 6, 6, "Three family members are among six people killed in two attacks by Muslim terrorists."], ["2006.11.03", "Iraq", "Baghdad", 58, 0, "Fifty-seven bodies and a severed head are found in the capital, all victims of sectarian hatred within the Religion of Peace."], ["2006.11.03", "Iraq", "Madaen", 4, 0, "Jihadis blow up four civilians traveling in a car."], ["2006.11.03", "Pakistan", "Makeen", 1, 0, "Islamic extremists behead a cleric and pin a note to the body."], ["2006.11.03", "Pakistan", "Quetta", 2, 5, "A suicide bomber drives his truck into a police headquarters, killing two officers."], ["2006.11.03", "Philippines", "Mindanao", 3, 5, "MILF terrorists open fire on a group of civilians, killing three."], ["2006.11.03", "Thailand", "Yala", 1, 0, "A Buddhist woman is shot to death by Muslim radicals at a health clinic."], ["2006.11.03", "Thailand", "Yala", 1, 0, "Muslim gunmen murder a 25-year-old man at a school."], ["2006.11.03", "Thailand", "Yala", 1, 1, "A 43-year-old Buddhist man is gunned down by radical Muslims as he is traveling with his wife."], ["2006.11.04", "Chad", "Bandikao", 56, 41, "Arab militias massacre over fifty Africans in a sustained attack on their village."], ["2006.11.04", "Iraq", "Baghdad", 4, 2, "In a brutal attack, Islamic gunmen approach a car and machine-gun four children sitting to death inside it."], ["2006.11.04", "Iraq", "Baghdad", 4, 5, "Two separate attacks by sectarian rivals leave four people dead."], ["2006.11.04", "Iraq", "Baghdad", 27, 0, "Twenty-seven victims of sectarian hatred within the Religion of Peace are found bound and executed."], ["2006.11.04", "Iraq", "Latifiya", 2, 3, "Islamic gunmen murder a mother and her child."], ["2006.11.04", "Iraq", "Mosul", 5, 0, "Five people are murdered by Islamic terrorists in a series of shooting attacks."], ["2006.11.04", "Iraq", "Udhaim", 5, 2, "A Sunni assassination attempt kills five presidential bodyguards with a roadside bomb."], ["2006.11.04", "Pakistan", "Inzar", 1, 0, "A pro-government tribal elder is killed by the Taliban."], ["2006.11.04", "Somalia", "Baidoa", 2, 4, "Islamic militants attack a transport, killing two Somali troops."], ["2006.11.04", "Thailand", "Narathiwat", 1, 0, "A 41-year-old man is gunned down by Islamists in front of his garage."], ["2006.11.04", "Thailand", "Narathiwat", 1, 0, "Islamic terrorists shoot a man to death at a fish shop."], ["2006.11.04", "Thailand", "Pattani", 1, 0, "A government official is murdered by Islamists."], ["2006.11.04", "Thailand", "Songkhla", 1, 0, "A Buddhist rubber trader is shot to death by Muslim radicals."], ["2006.11.05", "India", "Manglogi", 4, 0, "Three women and a man, all members of the same family, are slaughtered by Islamic militants angry that the family would not let their teenage daughter marry a terrorist."], ["2006.11.05", "India", "Sunervani", 1, 3, "An 8-year-old boy is blown apart in a Mujahideen bombing."], ["2006.11.05", "Iraq", "Adamiya", 2, 4, "Terrorists kill two people in a mortar attack on a residential neighborhood."], ["2006.11.05", "Thailand", "Narathiwat", 1, 0, "A 55-year-old villager is murdered by Islamic gunmen."], ["2006.11.05", "Thailand", "Pattani", 1, 0, "A 56-year-old Buddhist man is shot to death by Muslim extremists."], ["2006.11.05", "Thailand", "Pattani", 1, 0, "Muslims kill a 44-year-old civilian."], ["2006.11.05", "Thailand", "Yala", 2, 0, "A 61-year-old Buddhist man and his daughter are gunned down by militant Muslims."], ["2006.11.05", "Thailand", "Yala", 2, 3, "Thai Islamists bomb a military truck, killing two soldiers."], ["2006.11.06", "Chechnya", "Grozny", 1, 3, "Jihad warriors kill a policeman with a landmine."], ["2006.11.06", "India", "Nalwa Nullah", 1, 0, "The Mujahideen shoot a civilian to death as he is returning home."], ["2006.11.06", "Ingushetia", "Ordzhonikidze", 1, 0, "A woman is shot to death in front of her son, in her home, by radical Muslims angry at her religious practices."], ["2006.11.07", "Chad", "Koloy", 6, 8, "Arab militias attack an African village, killing at least six innocents."], ["2006.11.07", "Chechnya", "Tai", 7, 1, "Islamic terrorists kill seven Russian policemen in a brutal ambush in a remote area."], ["2006.11.07", "India", "Sarmarg", 1, 0, "A man is killed in his home by Islamic radicals."], ["2006.11.07", "Iraq", "Adhamiya", 5, 26, "Five residents are killed when Islamic terrorists send mortar rounds into a neighborhood."], ["2006.11.07", "Iraq", "Baghdad", 10, 0, "Ten victims of sectarian hatred within the Religion of Peace are found shot to death over a 24-hour period."], ["2006.11.07", "Iraq", "Baghdad", 21, 25, "A Fedayeen suicide bomber sends twenty-one innocent cafe patrons to Allah"], ["2006.11.07", "Iraq", "Fallujah", 3, 8, "Students are among the casualties as Jihadis end the lives of three civilians with a bombing."], ["2006.11.07", "Iraq", "Mahmudiya", 2, 0, "Islamic terrorists kill two people, one of who is beheaded."], ["2006.11.07", "Iraq", "Suwayra", 15, 0, "Fifteen people are murdered by their sectarian rivals and dumped in a river."], ["2006.11.07", "Thailand", "Narathiwat", 1, 0, "A 36-year-old janitor is murdered by Islamic gunmen as he is on his way to work."], ["2006.11.07", "Thailand", "Narathiwat", 1, 0, "A 42-year-old man is gunned down by Muslim radicals."], ["2006.11.07", "Thailand", "Pattani", 1, 0, "A teacher is murdered by Islamic extremists as he is traveling home."], ["2006.11.07", "Thailand", "Pattani", 1, 0, "Muslims shoot a Buddhist civilian to death."], ["2006.11.07", "Thailand", "Pattani", 2, 0, "A man and wife are gunned down by Islamic radicals."], ["2006.11.07", "Thailand", "Yala", 1, 0, "A Buddhist teacher is murdered by Islamists as he is riding his motorcycle."], ["2006.11.08", "Afghanistan", "Zabul", 2, 5, "Two Afghan police are killed in an ambush by Taliban extremists."], ["2006.11.08", "India", "Warpora", 1, 0, "A 50-year-old woman is shot to death by the Mujahideen."], ["2006.11.08", "Iraq", "Baghdad", 8, 24, "Sunnis rain down bombs on a soccer field, killing eight youths playing a game."], ["2006.11.08", "Iraq", "Baghdad", 10, 21, "Sunnis send mortars into two Shiite neighborhoods and a government building, killing ten people."], ["2006.11.08", "Iraq", "Mahmudiya", 6, 25, "Islamic terrorists car-bomb a market, killing six innocents."], ["2006.11.08", "Iraq", "Mosul", 6, 0, "Six people are gunned down by sectarian rivals."], ["2006.11.08", "Iraq", "Muqdadiya", 8, 6, "Jihadis kill four people with a marketplace car-bombing and gun down four members of a family in a separate attack."], ["2006.11.08", "Pakistan", "Dargai", 42, 20, "A suicide bomber, wrapped in a prayer shawl, runs into the midst of Pakistani soldiers exercising in an area and slaughters dozens."], ["2006.11.08", "Sudan", "Abu Jira", 5, 0, "The Janjaweed massacre another five villagers."], ["2006.11.09", "Algeria", "Bouira", 11, 13, "Eleven Algerian soldiers are ambushed and killed by the Salafist Group for Preaching and Combat."], ["2006.11.09", "India", "Qazigund", 1, 0, "A woman is murdered by the Mujahideen, who dump her body in a field."], ["2006.11.09", "India", "Thannamandi", 1, 1, "The Mujahideen assassinate an off-duty soldier, and injure a neighbor coming to his rescue."], ["2006.11.09", "Iraq", "Baghdad", 18, 93, "Eighteen people are killed in five terrorist bombings."], ["2006.11.09", "Iraq", "Baghdad", 26, 0, "Twenty-six victims of sectarian hatred within the Religion of Peace are found murdered in the city."], ["2006.11.09", "Iraq", "Latifiya", 18, 0, "Eighteen victims of sectarian hatred within the Religion of Peace are found in the Sunni triangle outside the capital."], ["2006.11.09", "Iraq", "Tal Afar", 4, 8, "Jihadis kill four Iraqis in a roadside attack."], ["2006.11.09", "Thailand", "Pattani", 1, 0, "A Buddhist civilian is gunned down by Muslim militants in front of a school."], ["2006.11.09", "Thailand", "Pattani", 1, 0, "A groundskeeper is murdered by militant Muslim gunmen while cutting grass."], ["2006.11.09", "Thailand", "Pattani", 1, 1, "Two men are shot at by Islamists while helping to build a house.  One dies of wounds suffered."], ["2006.11.09", "Thailand", "Yala", 0, 13, "Thirteen people are injured when Thai Islamists bomb eight car showrooms."], ["2006.11.10", "Algeria", "T'Kout", 1, 0, "Islamic fundamentalists behead a shepherd and place his head on a pole."], ["2006.11.10", "India", "Pulwama", 6, 50, "Six people, including four girls, are killed by the shrapnel of a grenade thrown by Muslim militants."], ["2006.11.10", "India", "Rawuchh", 1, 0, "Two days after a Mujahideen ambush, a civilian is succumbs to injuries."], ["2006.11.10", "Iraq", "Mosul", 1, 0, "A woman is kidnapped, tortured and executed by Islamic militants."], ["2006.11.10", "Iraq", "Tal Afar", 5, 17, "Five people are killed by a Fedayeen suicide car-bomber."], ["2006.11.10", "Iraq", "Yusufiya", 14, 0, "Fourteen people sleeping in their home are kidnapped by Muslim terrorists and murdered."], ["2006.11.10", "Pakistan", "Shakai", 4, 2, "al-Qaeda backed militants four people, including a pro-government tribal leader, in a bombing attack on their vehicle."], ["2006.11.11", "Iraq", "Baghdad", 5, 0, "A woman is among five people kidnapped, tortured and murdered by Islamic terrorists."], ["2006.11.11", "Iraq", "Baghdad", 10, 0, "Terrorists kill ten people on a bus and kidnap fifty more."], ["2006.11.11", "Iraq", "Baghdad", 10, 38, "Eight people are killed when Sunnis car-bomb a shopping district.  Two foreign journalists are killed in a separate attack."], ["2006.11.11", "Iraq", "Tal Afar", 6, 10, "A suicide bomber drives a car into an Iraqi police checkpoint, killing six officers."], ["2006.11.11", "Iraq", "Zaghinya", 2, 0, "A Fedayeen suicide bomber blows two innocent people to bits, including a woman."], ["2006.11.11", "Sudan", "Sirba", 31, 40, "Arab militia fighters on horseback attack a refugee camp, killing over thirty displaced persons."], ["2006.11.11", "Sudan", "Western Darfur", 11, 8, "Sudanese government troops raid a village, killing eleven civilians, including a woman burned to death in her house."], ["2006.11.11", "Thailand", "Pattani", 1, 0, "A 48-year-old farmer is murdered by Islamists as he is walking home."], ["2006.11.11", "Thailand", "Yala", 2, 0, "Islamists gun down two police officers and take their guns."], ["2006.11.12", "Iraq", "Baghdad", 3, 15, "Three children are killed when Sunni terrorists car-bomb a school."], ["2006.11.12", "Iraq", "Baghdad", 4, 0, "Sunni gunmen storm a gas station and kill four employees."], ["2006.11.12", "Iraq", "Baghdad", 25, 0, "Twenty-five victims of Islamic sectarian violence are found bound and executed."], ["2006.11.12", "Iraq", "Baghdad", 35, 58, "Two suicide bombers massacre thirty-five innocent people waiting in front a police recruiting station."], ["2006.11.12", "Iraq", "Baqubah", 50, 0, "Fifty bodies are found dumped behind a power company building, victims of sectarian hatred within the Religion of Peace."], ["2006.11.12", "Sudan", "Madu", 6, 0, "Six people are killed by Islamic militias, including four children thought to have been burned alive."], ["2006.11.12", "Thailand", "Narathiwat", 1, 1, "A man is gunned down in a tea shop by Islamic terrorists."], ["2006.11.12", "Thailand", "Narathiwat", 1, 1, "A man is murdered, and his wife critically injured, in an ambush by Muslim terrorists while shopping."], ["2006.11.13", "India", "Mehar", 1, 0, "A civilian is abducted from his home and then beheaded by Muslim militants."], ["2006.11.13", "India", "Sofshali", 1, 0, "The Mujahideen murder a man in his home."], ["2006.11.13", "Iraq", "Baghdad", 5, 0, "Five oil company employees are shot to death.  One was a woman."], ["2006.11.13", "Iraq", "Baghdad", 20, 18, "A suicidal Sunni murders twenty passengers in a minibus with an incendiary device strapped to his body."], ["2006.11.13", "Iraq", "Baghdad", 46, 0, "Forty-six victims of sectarian hatred within the Religion of Peace are found bound, tortured and executed."], ["2006.11.13", "Iraq", "Kirkuk", 4, 0, "Four elementary school teachers are murdered in their vehicle by Islamic terrorists."], ["2006.11.13", "Iraq", "Yusufiya", 5, 0, "Five people are brutally killed by Muslim terrorists, including at least one that was beheaded."], ["2006.11.13", "Pakistan", "Quetta", 2, 15, "A 10-year-old girl is one of two people killed when a bicycle bomb goes off in a market."], ["2006.11.13", "Thailand", "Narathiwat", 1, 0, "A rubber tapper is murdered by Islamic extremists."], ["2006.11.13", "Thailand", "Yala", 1, 0, "Muslim militants machine-gun a 53-year-old man to death as he is sitting in his pickup truck."], ["2006.11.14", "India", "Kashmir", 0, 40, "Forty people are injured in two Hizb-ul Mujahideen car bombings."], ["2006.11.14", "Iraq", "Baghdad", 7, 27, "A woman and child are among the Shias killed in a car bombing near a mosque."], ["2006.11.14", "Iraq", "Baghdad", 10, 25, "Sunnis car-bomb a market, killing at least ten innocents."], ["2006.11.14", "Iraq", "Baqubah", 10, 0, "Ten kidnap victims are found executed."], ["2006.11.14", "Iraq", "Basra", 4, 1, "Four British soldiers patrolling a waterway in a boat are blown apart in a terror attack."], ["2006.11.14", "Iraq", "Mosul", 11, 0, "Eleven people are murdered by sectarian rivals."], ["2006.11.14", "Pakistan", "Thari Mirwah", 2, 0, "A man uses an axe to murder his daughter and their boyfriend after learning of 'un-Islamic' behavior between them."], ["2006.11.15", "Iraq", "Baghdad", 3, 15, "At least three people are killed when Islamic terrorists bomb a funeral."], ["2006.11.15", "Iraq", "Baghdad", 12, 33, "Muslim bombers blow apart a dozen people waiting in line at a fuel station."], ["2006.11.15", "Iraq", "Baghdad", 55, 0, "Fifty-five victims, mostly of a sectarian kidnapping, are found bound, tortured and murdered."], ["2006.11.15", "Iraq", "Latifiya", 10, 0, "Ten bodies found are thought to be those of Shiites abducted by Sunnis a few days earlier."], ["2006.11.15", "Iraq", "Mosul", 6, 0, "Gunmen murder six people, including a woman, in separate Jihad attacks."], ["2006.11.15", "Israel", "Sderot", 1, 2, "A 57-year-old woman is killed in a Palestinian rocket attack on her neighborhood.  A survivor loses both legs."], ["2006.11.15", "Sudan", "Deir Mazza", 52, 12, "Dozens of civilians, including women and children, are killed in an attack by Arab militias backed by the Islamic Republic of Sudan."], ["2006.11.15", "Thailand", "Yala", 1, 0, "Islamists shoot a man to death as he is taking his children to school."], ["2006.11.16", "Chad", "Koloy", 1, 3, "Arab militias kill a \"Doctors without Borders\" volunteer."], ["2006.11.16", "Iraq", "Baghdad", 9, 2, "Sunni fundamentalists murder nine workers at a bakery."], ["2006.11.16", "Iraq", "Baghdad", 43, 18, "Thirty-five victims of sectarian hatred within the Religion of Peace are found.  Six separate bombings leave another eight dead."], ["2006.11.16", "Pakistan", "Bara", 22, 5, "Twenty-two people are killed in sectarian violence between rival factions of the Religion of Peace."], ["2006.11.16", "Thailand", "Narathiwat", 1, 0, "A Buddhist woman who worked as a schoolteacher is brutally shot to death by Muslim militants."], ["2006.11.17", "Iraq", "Baghdad", 20, 0, "Twenty people are killed in sectarian violence in at least three separate attacks."], ["2006.11.17", "Iraq", "Kirkuk", 3, 1, "A man and his baby daughter are among four people shot at by Islamic terrorists."], ["2006.11.17", "Pakistan", "Lahore", 1, 7, "A bomb on a passenger van kills one and injures seven."], ["2006.11.17", "Somalia", "Mogadishu", 1, 3, "Islamists fire into a crowd of people protesting their ban on khat, killing a teenage boy."], ["2006.11.17", "Thailand", "Narathiwat", 1, 27, "Twenty-seven people are injured when Islamists set off three bombs.  A flower seller is killed."], ["2006.11.17", "Thailand", "Pattani", 1, 0, "A Buddhist security guard is murdered by Islamic extremists."], ["2006.11.17", "Thailand", "Pattani", 1, 0, "A Buddhist villager is murdered by Muslim terrorists while shopping at a market."], ["2006.11.17", "Thailand", "Yala", 1, 0, "A Buddhist ice-cream seller is gunned down by Islamic terrorists."], ["2006.11.17", "Thailand", "Yala", 1, 0, "An elderly Buddhist cattle-raiser is shot to death by Muslims, who then burn his body."], ["2006.11.17", "Thailand", "Yala", 1, 0, "Islamists shoot a man off of his motorcycle."], ["2006.11.18", "Iraq", "Baghdad", 36, 3, "Thirty-six people are killed in at least three attacks by Muslim terrorists, including a man and his wife brutally gunned down."], ["2006.11.18", "Iraq", "Ishaqi", 7, 0, "Seven Shia are murdered by Sunni extremists."], ["2006.11.19", "Chechnya", "Kurchaloi", 3, 0, "Three occupants of a car are slaughtered by Jihad fighters."], ["2006.11.19", "India", "Cheke Natnussa", 2, 0, "A forest employee and a civilian are murdered in their home by the Mujahideen."], ["2006.11.19", "Iraq", "Baghdad", 13, 48, "Thirteen people are killed in two coordinated bombings, one at a bus stop."], ["2006.11.19", "Iraq", "Baghdad", 45, 0, "Forty-five victims of sectarian hatred within the Religion of Peace are found bound and executed around the city."], ["2006.11.19", "Iraq", "Hawi Jah", 3, 0, "Jihadis kill three children with explosives."], ["2006.11.19", "Iraq", "Hilla", 22, 44, "In a senseless attack on laborers looking for work, Sunni extremists massacre nearly two dozen in a suicide bombing."], ["2006.11.19", "Iraq", "Sadiya al-Jabal", 8, 2, "Eight laborers are machine-gunned to death at point blank range by Sunni \"freedom fighters.\""], ["2006.11.19", "Pakistan", "Razmak", 1, 0, "Islamists murder a cleric and pin a note to his body."], ["2006.11.19", "Somalia", "Bardaleh", 6, 20, "Six Ethiopian soldiers are ambushed and killed by Islamists."], ["2006.11.19", "Thailand", "Hat Yai", 1, 0, "Islamists murder a civilian and dump his body in a ditch."], ["2006.11.19", "Thailand", "Narathiwat", 3, 0, "Islamists drive up to three men having tea and pound them with automatic weapons for 30 seconds."], ["2006.11.19", "Thailand", "Pattani", 1, 0, "Muslims gun down a middle-aged Buddhist taxi driver standing in line for food."], ["2006.11.19", "Thailand", "Yala", 1, 0, "A 68-year-old Buddhist man is nearly decapitated by Muslim attackers."], ["2006.11.20", "Iraq", "Baghdad", 2, 0, "A doctor and an actor are murdered by Islamic gunmen in separate attacks."], ["2006.11.20", "Iraq", "Baghdad", 3, 5, "Jihadis kill three people with a bomb at a market."], ["2006.11.20", "Iraq", "Baghdad", 14, 0, "Fourteen victims of sectarian hatred within the Religion of Peace are found bound and executed."], ["2006.11.20", "Iraq", "Dujayl", 7, 0, "Seven men are kidnapped and brutally killed by Muslim terrorists."], ["2006.11.20", "Iraq", "Mosul", 3, 4, "Three people are killed by a suicide bomber."], ["2006.11.20", "Iraq", "Ramadi", 2, 6, "Two people are killed by a suicide bomber."], ["2006.11.20", "Iraq", "Taji", 5, 0, "Extremists kidnap five men from a restaurant, torture and murder them."], ["2006.11.20", "Iraq", "Tal Afar", 3, 0, "A Fedayeen suicide bomber kills three other people."], ["2006.11.20", "Thailand", "Sungai Kolok", 2, 16, "Muslim terrorists detonate a bomb at a market, killing two people."], ["2006.11.21", "Afghanistan", "Helmand", 2, 0, "Religious extremists attack a police station, kidnap two officers, then kill them in captivity."], ["2006.11.21", "Afghanistan", "Kandahar", 1, 0, "A female legislator's husband is mowed down by the Taliban at a bakery."], ["2006.11.21", "India", "Awantipora", 1, 0, "The Mujahideen abduct and hang a post-graduate student."], ["2006.11.21", "India", "Mamoosa", 1, 0, "A 50-year-old Christian convert is gunned down by members of his former religion."], ["2006.11.21", "Iraq", "Baghdad", 7, 0, "Seven students riding home in a minibus are slaughtered by Sunni extremists."], ["2006.11.21", "Iraq", "Baghdad", 35, 19, "Islamic terrorists kill thirty-five people in a series of attacks on civilians."], ["2006.11.21", "Iraq", "Baqubah", 19, 5, "Five separate Jihad attacks against civilians leaves about twenty dead."], ["2006.11.21", "Iraq", "Latifiyah", 6, 0, "Sunnis kidnap, torture and kill six Shiites."], ["2006.11.21", "Iraq", "Suwayrah", 7, 0, "Muslim terrorists kill six people and dump their bodies in a river."], ["2006.11.21", "Lebanon", "Beirut", 1, 0, "A Christian leader is gunned down by Muslim terrorists supported by Syria."], ["2006.11.22", "Iraq", "Baghdad", 52, 0, "Police report finding fifty-two victims of sectarian hatred with the Religion of Peace around the capital."], ["2006.11.22", "Iraq", "Iskandariya", 7, 1, "Jihadis kill seven people with a bomb."], ["2006.11.22", "Iraq", "Mosul", 14, 0, "Fourteen people, including three women, are murdered by Islamic terrorists."], ["2006.11.22", "Israel", "Sderot", 1, 0, "An Israeli man is killed by Palestinians firing Qassam rockets into his town."], ["2006.11.22", "Pakistan", "Tando Masti", 2, 0, "An imam shoots his daughter to death, and a second family member murders another girl on suspicion of sexual activity with two males."], ["2006.11.22", "Thailand", "Narathiwat", 2, 0, "A husband and wife are pulled from their pickup truck and brutally killed by radical Muslims.  The woman's body is burned."], ["2006.11.23", "Iraq", "Baghdad", 9, 3, "Nine people are killed in a retaliatory Shia mortar attack for a massive bombing."], ["2006.11.23", "Iraq", "Baghdad", 202, 217, "Sunni terrorists murder over two-hundred innocents in five massive bombings spaced minutes apart."], ["2006.11.23", "Thailand", "Narathiwat", 1, 0, "Islamists gun down a rubber-tapper on his way to work."], ["2006.11.23", "Thailand", "Pattani", 1, 0, "A 40-year-old Buddhist teacher is shot to death by Muslim militants."], ["2006.11.23", "Thailand", "Pattani", 1, 0, "A man is murdered near his home by Islamic gunmen."], ["2006.11.23", "Thailand", "Yala", 1, 0, "Islamists murder a young man as he is sitting in his car."], ["2006.11.24", "Afghanistan", "Khost", 2, 1, "Taliban extremists attack a convoy of trucks, killing two Pakistani drivers."], ["2006.11.24", "Algeria", "Biskra", 5, 0, "Two civilians are among three people killed in an ambush by the Salafist Group for Preaching and Combat."], ["2006.11.24", "India", "Rampur", 8, 2, "Terrorists kill eight people in a shootout with security forces."], ["2006.11.24", "Iraq", "Baghdad", 25, 14, "Shia militia are responsible for twenty-five Sunni deaths."], ["2006.11.24", "Iraq", "Baghdad", 30, 0, "Thirty bodies are found dumped over a 24-hour period, victims of sectarian hatred."], ["2006.11.24", "Iraq", "Tal Afar", 23, 43, "A double suicide attack near a car dealership leaves nearly two dozen people dead and many more in agony."], ["2006.11.24", "Pakistan", "Sharif Chachar", 1, 0, "A 15-year-old girl is hacked to death with an axe in an honor killing by her father, who suspected her of illicit relations."], ["2006.11.24", "Thailand", "Narithiwat", 1, 0, "Islamists break into a man's home and kill him."], ["2006.11.24", "Thailand", "Pattani", 1, 0, "A school administrator is shot and then burned to death by Muslim terrorists."], ["2006.11.25", "Iraq", "Baghdad", 25, 0, "Twenty-five victims of sectarian hatred within the Religion of Peace are found executed around the city."], ["2006.11.25", "Iraq", "Diyala", 21, 0, "Sunni extremists invade two homes and murder twenty-one men in front of their families."], ["2006.11.25", "Iraq", "Khaldiya", 4, 9, "Four people, including two Iraqi children, are killed by a suicide bomber."], ["2006.11.25", "Thailand", "Yala", 1, 2, "Muslims fire into a Buddhist-owned store, killing the owner and injuring two others."], ["2006.11.25", "Thailand", "Yala", 3, 0, "Three Buddhist pig hunters are shot and hacked to death by Muslim radicals."], ["2006.11.26", "Afghanistan", "Paktika", 15, 25, "A Fedayeen suicide bomber walks into a restaurant and slaughters fifteen innocents."], ["2006.11.26", "Iraq", "Baqubah", 25, 0, "Terrorists kidnap and execute twenty-five people, including seven teenagers."], ["2006.11.26", "Iraq", "Basra", 4, 0, "Four people, including a woman, are dragged from their car and brutally shot to death by Muslim gunmen."], ["2006.11.26", "Iraq", "Haqlaniya", 11, 0, "In a vicious attack, radical Muslims pull ten men and one boy out of a van and shoot them to death."], ["2006.11.26", "Iraq", "Haswa", 5, 23, "Jihadis car-bomb a crowded market, killing at least five innocents."], ["2006.11.26", "Iraq", "Iskandiriya", 8, 28, "Eight patrons at a market are blown apart by a Jihad car-bombing."], ["2006.11.26", "Thailand", "Narathiwat", 1, 0, "A 24-year-old villager is shot to death by Islamic terrorists."], ["2006.11.26", "Thailand", "Narathiwat", 1, 1, "A 46-year-old Buddhist man is shot off the back of a motorcycle while riding with his wife."], ["2006.11.26", "Thailand", "Pattani", 1, 1, "A Buddhist rubber-tapper is murdered by radical Muslims."], ["2006.11.26", "Thailand", "Yala", 2, 0, "Islamic militants approach two police officers at a food market and shoot them at point-blank range."], ["2006.11.27", "Afghanistan", "Kandahar", 2, 0, "Two Canadian soldiers are killed on the road by a Fedayeen suicide bomber."], ["2006.11.27", "Chechnya", "Gudermes", 1, 2, "A Russian is killed by Jihad gunmen while traveling in a car."], ["2006.11.27", "Iraq", "Baghdad", 44, 0, "Forty-four victims of sectarian hatred within the Religion of Peace are found in an around the city."], ["2006.11.27", "Iraq", "Mosul", 2, 0, "Sunnis shoot an off-duty policeman and his mother to death as they are heading to the man's wedding."], ["2006.11.27", "Iraq", "Muqdidiya", 5, 25, "Muslim terrorists shoot a mobile telephone shop owner dead, then plant bombs to kill on-lookers."], ["2006.11.27", "Pakistan", "Kahero Golo", 1, 0, "A young woman is shot to death by her brother in an 'honor killing.'"], ["2006.11.27", "Pakistan", "Makeen", 1, 0, "A moderate cleric is assassinated by Taliban supporters, who pin a note to the body."], ["2006.11.28", "Afghanistan", "Herat", 1, 1, "A suicide bomber kills a policeman who is trying to stop him from hurting others."], ["2006.11.28", "Dagestan", "Khasavyurt", 1, 0, "An apostate is killed with a bomb."], ["2006.11.28", "Iraq", "Baghdad", 4, 40, "Islamic terrorists bomb a hospital, killing four Iraqis."], ["2006.11.28", "Iraq", "Baghdad", 36, 23, "Thirty-six victims of sectarian violence are found as a Jihad mortar attack injures twenty-three others."], ["2006.11.28", "Iraq", "Kirkuk", 1, 12, "A religious fanatic straps explosives to his body and kills at least one civilian."], ["2006.11.28", "Thailand", "Yala", 2, 0, "A Buddhist husband and wife are murdered by Islamic gunmen as they return home."], ["2006.11.29", "Afghanistan", "Kandahar", 2, 0, "Two civilians are murdered by a Fedayeen suicide bomber."], ["2006.11.29", "Iraq", "Baghdad", 52, 0, "Fifty-two victims of sectarian hatred within the Religion of Peace are found in various locations."], ["2006.11.29", "Iraq", "Baqubah", 29, 0, "A mass grave containing the bodies of twenty-nine recent victims of Sunni-Shia violence unearthed."], ["2006.11.29", "Iraq", "Mosul", 2, 23, "A suicide bomber kills a civilian.  Elsewhere a teacher is kidnapped and murdered."], ["2006.11.29", "Iraq", "Samarra", 6, 4, "Six Iraqi police are killed when Sunni extremists set off a car bomb."], ["2006.11.29", "Pakistan", "Sukkur", 4, 0, "A man kills his three daughters and a daughter in law on suspicion of adultery."], ["2006.11.30", "Iraq", "Baghdad", 4, 22, "Three Jihad bombings kill at least four people.  Elsewhere, a teacher is shot to death."], ["2006.11.30", "Iraq", "Samarra", 6, 4, "A car bomb near a police station kills a half-dozen innocents."], ["2006.11.30", "Somalia", "Baidoa", 4, 5, "A botched suicide bombing attempt leaves at least four people dead, not including the bombers."], ["2006.11.30", "Thailand", "Narathiwat", 1, 0, "A 44-year-old man is murdered by Islamic gunmen."], ["2006.11.30", "Thailand", "Narathiwat", 1, 1, "Thai Islamists gun down a woman in a tea house, severely injuring her daughter as well."], ["2006.11.30", "Thailand", "Pattani", 0, 1, "A 75-year-old man is beaten in his home and set on fire by Muslim radicals."], ["2006.12.01", "India", "Mangalore", 1, 0, "A Hindu leader is brutally assaulted by twelve Muslims with a sword as he is working in his office."], ["2006.12.01", "Iraq", "Baghdad", 25, 35, "Two car bombs, one at a market, leave five civilians dead and dozens more in agony.  Twenty bodies are also found."], ["2006.12.01", "Iraq", "Baquba", 3, 2, "Islamic gunmen open fire on a family vehicle, killing three members."], ["2006.12.01", "Iraq", "Kirkuk", 2, 4, "Two civilians are killed by a Fedayeen suicide bomber."], ["2006.12.01", "Iraq", "Mosul", 4, 29, "Two children are among four horribly killed by a Fedayeen suicide bomber."], ["2006.12.01", "Iraq", "Mosul", 14, 0, "Fourteen laborers are kidnapped by Islamic terrorists and executed in captivity."], ["2006.12.01", "Iraq", "Rashidiya", 4, 3, "Jihadis mortar a residential neighborhood, killing four innocents."], ["2006.12.02", "Iraq", "Baghdad", 2, 6, "Two family members are killed when Jihadis fire a rocket at their home."], ["2006.12.02", "Iraq", "Baghdad", 44, 0, "Forty-four bullet-riddled victims of sectarian hatred within the Religion of Peace are found."], ["2006.12.02", "Iraq", "Baghdad", 51, 90, "Sunnis blow over fifty fellow Muslims to Allah in a triple marketplace bombing that leaves blood and body parts scattered."], ["2006.12.02", "Iraq", "Khalis", 2, 3, "Sunni radicals attack a funeral procession, killing two Shias."], ["2006.12.02", "Pakistan", "Bara Qadim", 4, 2, "Four tribal leaders are killed when their car is attacked over a religious dispute."], ["2006.12.02", "Pakistan", "Naushki", 1, 1, "Taliban-backed militants thought responsible for a bombing in a remote area."], ["2006.12.02", "Pakistan", "Nushki", 1, 0, "A young boy is killed in a bomb blast, believed set by Taliban-backed militants."], ["2006.12.02", "Pakistan", "Peshawar", 1, 0, "A bicycle bomb kills a passerby outside the U.S. consulate."], ["2006.12.02", "Thailand", "Narathiwat", 2, 0, "Muslim terrorists fire into a grocery store, killing the owner and an elderly female customer."], ["2006.12.02", "Thailand", "Pattani", 1, 0, "A 60-year-old food vendor is murdered by a Muslim posing as a customer."], ["2006.12.02", "Thailand", "Yala", 1, 1, "A 34-year-old truck driver is murdered by Islamic gunmen as he is traveling with his wife."], ["2006.12.03", "Afghanistan", "Kandahar", 8, 19, "Three civilians are killed in a suicide attack, and several more in other shootings across the city."], ["2006.12.03", "India", "Baramulla", 1, 0, "A civilian is gunned down by the Mujahideen."], ["2006.12.03", "Iraq", "Baghdad", 3, 15, "Jihadis kill three civilians with a car-bomb near a bakery."], ["2006.12.03", "Iraq", "Baghdad", 50, 0, "Fifty victims of sectarian hatred within the Religion of Peace are found bound and executed in various locations."], ["2006.12.03", "Iraq", "Kirkuk", 3, 2, "A Fedayeen suicide car bomber kills two and injures three."], ["2006.12.03", "Iraq", "Latifiya", 3, 2, "Sunni gunmen open up on a family car, killing three people."], ["2006.12.03", "Iraq", "Mosul", 1, 0, "A 69-year-old Christian church leader is kidnapped and murdered by Islamic extremists."], ["2006.12.03", "Iraq", "Mosul", 8, 4, "Two people are killed in a suicide bombing, and six others from gunshot wounds by Islamic terrorists."], ["2006.12.03", "Pakistan", "Bannu", 1, 1, "An Uzbeki suicide bomber takes out a policeman (and himself)."], ["2006.12.03", "Thailand", "Narathiwat", 1, 0, "A 35-year-old rubber-tapper is murdered by radical Islamic gunmen while working at his plantation."], ["2006.12.03", "Thailand", "Yala", 2, 0, "Two men are casually murdered by Muslim gunmen while drinking tea in a shop."], ["2006.12.04", "India", "Sopore", 1, 0, "A 20-year-old man is gunned down by the Mujahideen."], ["2006.12.04", "Iraq", "Baghdad", 52, 0, "Fifty-two victims of sectarian hatred within the Religion of Peace are found executed over 24 hours."], ["2006.12.04", "Iraq", "Baqubah", 4, 0, "Four engineers are brutally gunned down by Islamic terrorists."], ["2006.12.04", "Iraq", "Mosul", 11, 5, "Seven civilians are among eleven killed in two separate Jihad attacks."], ["2006.12.04", "Israel", "Kafr Qassem", 1, 0, "A Muslim woman is shot by a 70-year-old relative in an 'honor killing.'"], ["2006.12.04", "Thailand", "Narathiwat", 1, 0, "Muslim radicals murder a woman as she is leaving a market."], ["2006.12.04", "Thailand", "Pattani", 2, 0, "Two men, including a 51-year-old rubber tapper are shot to death in separate attacks."], ["2006.12.04", "Thailand", "Yala", 2, 0, "A father is killed in his vehicle in an Islamist attack.  His 3-year-old daughter clings to life for a few hours before dying as well."], ["2006.12.05", "India", "Varmul", 1, 15, "A boy is killed when Muslim militants toss a grenade into the street."], ["2006.12.05", "Iraq", "Baghdad", 8, 23, "Three separate Jihad bombings leave eight dead.  One was at a hospital."], ["2006.12.05", "Iraq", "Baghdad", 14, 4, "Sunnis stop a bus carrying Shias and gun down fourteen in cold blood."], ["2006.12.05", "Iraq", "Baghdad", 16, 25, "Sixteen people are killed and dozens of others horribly burned when Sunni terrorists bomb a petrol station."], ["2006.12.05", "Thailand", "Narathiwat", 2, 0, "A 13-year-old boy is among two people brutally shot to death by Muslim militants."], ["2006.12.05", "Thailand", "Yala", 2, 18, "Muslims kill two Buddhist men with a bomb at a vegetable market."], ["2006.12.06", "Afghanistan", "Herat", 1, 1, "Taliban extremists open fire on a car, killing one occupant."], ["2006.12.06", "Afghanistan", "Kandahar", 7, 3, "Another suicide bombing takes the lives of seven people."], ["2006.12.06", "India", "Srinagar", 0, 15, "Islamic militants injure fifteen people with a grenade attack on a city street."], ["2006.12.06", "Iraq", "Baghdad", 10, 54, "Jihadis mortar a market, killing at least ten shoppers."], ["2006.12.06", "Iraq", "Baghdad", 13, 70, "A suicide bombing on a minibus and a separate rocket attack leave thirteen civilians dead."], ["2006.12.06", "Iraq", "Iskandariya", 4, 12, "A Fedayeen suicide bomber blows himself up in a shop, killing the owner and three other innocents."], ["2006.12.06", "Iraq", "Khalis", 1, 8, "Islamic gunmen attack a bus carrying farm workers, killing one."], ["2006.12.06", "Iraq", "Mahmudiya", 3, 0, "Three people are kidnapped, blindfolded and executed by Muslim rivals."], ["2006.12.06", "Thailand", "Narathiwat", 1, 0, "A shopkeeper is murdered by Islamic terrorists posing as customers."], ["2006.12.06", "Thailand", "Pattani", 2, 0, "Two cops are gunned down by Muslim radicals."], ["2006.12.06", "Thailand", "Yala", 1, 0, "A Buddhist man is gunned down by Muslim radicals."], ["2006.12.06", "Thailand", "Yala", 1, 2, "A Thai soldier is killed by a remote control device."], ["2006.12.06", "Thailand", "Yala", 2, 1, "Islamists open fire on a group of Buddhist civilians in front of a school, killing two."], ["2006.12.07", "Afghanistan", "Kandahar", 2, 7, "Two civilians are killed by a Fedayeen suicide bomber."], ["2006.12.07", "India", "Brinti Batpora", 1, 0, "The Mujahideen murder a civilian in his home."], ["2006.12.07", "Jordan", "Amman", 2, 0, "A young couple in their early 20's is shot to death by the girl's father, who suspected them of having sex."], ["2006.12.07", "Saudi Arabia", "Jeddah", 2, 0, "Two prison guards are killed in a shooting attack by Islamic extremists."], ["2006.12.07", "Thailand", "Yala", 3, 0, "A family of three is murdered in cold blood by Islamists.  The victims include a 1-year-old child."], ["2006.12.08", "Afghanistan", "Kunar", 5, 0, "Religious extremists murder a grandmother, mother and two daughters, along with a grandson, in an invasion on their home."], ["2006.12.08", "India", "Zachaldara", 1, 0, "Muslim terrorists murder a dentist."], ["2006.12.08", "Iraq", "Baghdad", 23, 11, "Scattered shootings and a bombing leave about two dozen Iraqis dead at the hands of Islamic terrorists."], ["2006.12.09", "Afghanistan", "Muradabad", 2, 0, "The Taliban kill two translators in a mine attack."], ["2006.12.09", "Afghanistan", "Paktia", 6, 0, "Six Afghans are killed by a Taliban bomb."], ["2006.12.09", "Iraq", "Baghdad", 43, 0, "Forty-three bodies, at least three of which were missing heads, are found in Baghdad, victims of sectarian hatred."], ["2006.12.09", "Iraq", "Karbala", 8, 36, "A suicidal Sunni murders eight Shia civilians with a bomb near a mosque."], ["2006.12.09", "Iraq", "Kirkuk", 1, 0, "A hairdresser is gunned down by religious fundamentalists."], ["2006.12.09", "Sudan", "Sirba", 22, 10, "Arab militias attack a bus, killing twenty-two African civilians."], ["2006.12.09", "Sudan", "al-Fashir", 2, 8, "Militant Muslims shoot a shop owner and one other civilian to death."], ["2006.12.09", "Thailand", "Narathiwat", 1, 0, "A 37-year-old civilian is gunned down by Muslim radicals."], ["2006.12.10", "Algeria", "Algiers", 1, 8, "Islamic fundamentalists stage an ambush on a convoy of foreign civilians, killing the driver."], ["2006.12.10", "Iraq", "Baghdad", 2, 6, "Two children are killed in an attack on a family vehicle by Islamic terrorists."], ["2006.12.10", "Iraq", "Baghdad", 4, 0, "A man and his three sons are brutally murdered in their home by the Religion of Peace."], ["2006.12.10", "Iraq", "Baghdad", 5, 0, "Five Shiite brothers are murdered in their home by Sunni gunmen."], ["2006.12.10", "Iraq", "Baghdad", 17, 0, "Seventeen victims of sectarian hatred within the Religion of Peace are found executed."], ["2006.12.10", "Iraq", "Kirkuk", 1, 0, "Fundamentalists murder a 15-year-old worker at a bakery."], ["2006.12.10", "Pakistan", "Punjabi Dob", 1, 1, "Taliban-backed separatists kill a man and injure his mother in a mine attack."], ["2006.12.10", "Pakistan", "Tirah", 4, 0, "Four people are killed in sectarian violence with the Religion of Peace."], ["2006.12.10", "Somalia", "Baidoa", 20, 0, "About twenty people are killed when Islamists attack a government-held town."], ["2006.12.10", "Thailand", "Pattani", 1, 1, "A woman is gunned down by the Religion of Peace in a shooting attack that leaves her husband injured."], ["2006.12.10", "Thailand", "Pattani", 2, 0, "A 28-year-old rubber-tapper and his father are murdered by Islamists."], ["2006.12.10", "Thailand", "Yala", 2, 0, "Two rubber workers are murdered on the job by Islamic gunmen."], ["2006.12.11", "Iraq", "Baghdad", 10, 18, "Four Jihad bombings leave at least ten people dead."], ["2006.12.11", "Iraq", "Baghdad", 46, 0, "Forty-six victims of sectarian violence within the Religion of Peace are found blindfolded and executed."], ["2006.12.11", "Iraq", "Mosul", 4, 0, "Terrorists massacre four brothers sitting in their car."], ["2006.12.11", "Iraq", "Tuz Khurmato", 6, 1, "Sectarian extremists storm a house, killing six members of the same family."], ["2006.12.11", "Pal. Auth.", "Gaza", 3, 1, "Three young children are killed by Hamas gunmen.  (Hamas means 'Islamic Resistance')."], ["2006.12.11", "Sudan", "Hashaaba", 8, 0, "Eight civilians, including a mother and her five young children, are killed in a government air strike on their village."], ["2006.12.11", "Turkey", "Bursa", 1, 0, "A 23-year-old woman is stabbed 27 times by her father in an 'honor killing.'"], ["2006.12.12", "Afghanistan", "Khost", 1, 1, "A 13-year-old girl is killed after Muslim militants open fire on security forces."], ["2006.12.12", "Afghanistan", "Lashkar Gah", 8, 8, "A suicide bomber on foot sends eight innocents to Allah."], ["2006.12.12", "Iraq", "Baghdad", 47, 0, "Forty-seven victims of sectarian violence within the Religion of Peace are found bound and executed."], ["2006.12.12", "Iraq", "Baghdad", 71, 236, "Freedom fighters slaughter dozens of day laborers looking for work by first luring them with promises of jobs, then setting off coordinated suicide car bombs."], ["2006.12.12", "Iraq", "Kirkuk", 5, 15, "A Fedayeen suicide bomber ends the lives of five other people."], ["2006.12.12", "Iraq", "Mosul", 4, 0, "An elderly woman is among four people murdered by Islamic gunmen."], ["2006.12.12", "Iraq", "Riyadh", 3, 2, "Jihadis murder a mother and her two children in an attack on their house."], ["2006.12.12", "Thailand", "Pattani", 1, 1, "Islamists open fire on a teacher and a medical doctor."], ["2006.12.13", "Iraq", "Baghdad", 5, 10, "Five people are killed in a residential district by Jihad car bombs."], ["2006.12.13", "Iraq", "Baghdad", 11, 27, "Jihad bombers attack a crowded bus stop, packed with Shia laborers, women and children, killing at least eleven."], ["2006.12.13", "Iraq", "Riyadh", 17, 15, "A Jihad attack on a checkpoint leaves seven Iraqi soldiers dead.  Ten other bodies are found elsewhere."], ["2006.12.13", "Iraq", "al-Hesna", 9, 0, "Sunnis enter a family home and slaughter four men, two women and three children."], ["2006.12.13", "Pal. Auth.", "Gaza", 1, 0, "Palestinian gunmen force a judge to his knees on the sidewalk and shoot him in the head."], ["2006.12.13", "Thailand", "Yala", 1, 0, "A 55-year-old Buddhist man is gunned down by Muslim radicals."], ["2006.12.13", "Thailand", "Yala", 1, 0, "A 69-year-old Buddhist man is killed in his home by Muslim radicals."], ["2006.12.13", "Thailand", "Yala", 2, 1, "Radical Muslims storm an office and shoot two Buddhist engineers to death."], ["2006.12.14", "Afghanistan", "Qalat", 4, 25, "A suicide bomber kills four civilians on a crowded street and injures two dozen more."], ["2006.12.14", "India", "Mamoosa", 1, 0, "A convert to Christianity, and father of four, is gunned down in broad daylight by Islamic radicals."], ["2006.12.14", "Iraq", "Baghdad", 47, 7, "Forty-five victims of sectarian hatred within the Religion of Peace are found dead, in addition to a car bombing.  Some were decapitated."], ["2006.12.14", "Iraq", "Mahaweel", 2, 6, "Two people are killed by a Jihad car bombing."], ["2006.12.14", "Iraq", "al-Lij", 2, 0, "Two people are tortured and shot to death by religious rivals."], ["2006.12.15", "Afghanistan", "Paktia", 1, 5, "An Afghan soldier is killed when a suicide bomber rams his car into a convoy."], ["2006.12.15", "India", "Chandiyal", 1, 0, "Two al-Badr militants kidnap a young girl from her house and then execute her as a rescue attempt is made."], ["2006.12.15", "Iraq", "Mosul", 18, 0, "Eighteen people are killed over a 24 hour period by Muslim gunmen."], ["2006.12.16", "India", "Pateli Daraj", 2, 0, "A young girl is among two people killed their home by the Mujahideen."], ["2006.12.16", "Iraq", "Baghdad", 53, 0, "Muslim terrorists dump 53 bodies in at least two locations, victims of sectarian violence."], ["2006.12.16", "Iraq", "Iskandiriyah", 2, 1, "A 4-year-old girl is among two people killed by Religion of Peace terrorists."], ["2006.12.17", "Chad", "Aradib", 15, 0, "Fifteen civilians are killed by Arab militias, including a man who was disemboweled and a woman set on fire."], ["2006.12.17", "India", "Tenkasi", 1, 0, "A Hindu leader is hacked to death by a Muslim gang."], ["2006.12.17", "Iraq", "Rutba", 5, 0, "Islamic militants torture and shoot five people to death."], ["2006.12.18", "Afghanistan", "Bazar Talukan", 26, 0, "The Taliban murder twenty-six young men and hang their headless bodies from trees."], ["2006.12.18", "Iraq", "Baghdad", 1, 2, "Islamic militants murder a woman at an education ministry building."], ["2006.12.18", "Iraq", "Baghdad", 44, 0, "Forty-four victims of sectarian violence within the Religion of Peace are found over 24 hours."], ["2006.12.18", "Iraq", "Diyala", 4, 0, "Four tribal leaders are abducted and executed."], ["2006.12.18", "Iraq", "Saidiya", 5, 19, "Jihadis bomb a vegetable market, killing five civilians."], ["2006.12.19", "Iraq", "Baghdad", 53, 0, "Fifty-three victims of sectarian hatred within the Religion of Peace are found murdered over a 24 hour period."], ["2006.12.19", "Iraq", "Baqubah", 12, 0, "Two women are among a dozen people murdered by Islamic terrorists."], ["2006.12.19", "Thailand", "Narathiwat", 1, 0, "Islamists murder a 27-year-old civilian."], ["2006.12.19", "Thailand", "Pattani", 1, 0, "A 33-year-old Buddhist man is shot and set on fire by Muslim radicals in front of his home."], ["2006.12.20", "Iraq", "Baghdad", 7, 8, "A university professor and his family are among seven people senselessly murdered by Muslim terrorists."], ["2006.12.20", "Iraq", "Baghdad", 11, 31, "A Fedayeen suicide bomber punches his ticket to paradise on the souls of eleven innocents."], ["2006.12.20", "Iraq", "Baghdad", 73, 0, "Seventy-three victims of sectarian hatred within the Religion of Peace are found over 24 hours."], ["2006.12.20", "Iraq", "Mosul", 11, 0, "Eleven people are murdered by Islamic terrorists."], ["2006.12.20", "Thailand", "Yala", 1, 0, "A 55-year-old Buddhist rubber-tapper is senselessly gunned down by Islamic gunmen."], ["2006.12.20", "Thailand", "Yala", 1, 0, "Islamists brutally murder a 69-year-old Buddhist man in his home."], ["2006.12.21", "Afghanistan", "Herat", 4, 6, "Four civilians are killed when the Taliban bomb a bridge."], ["2006.12.21", "Afghanistan", "Khost", 3, 2, "Religious extremists kill three Afghan police officers with a bomb."], ["2006.12.21", "Iraq", "Baghdad", 2, 2, "A suicide bomber murders two civilians."], ["2006.12.21", "Iraq", "Baghdad", 15, 15, "At least fifteen Iraqis are killed when a Fedayeen suicide bomber attack an academy."], ["2006.12.21", "Iraq", "Kirkuk", 2, 0, "A man and his wife are brutally gunned down by Muslim militants."], ["2006.12.21", "Thailand", "Pattani", 1, 1, "A female Buddhist teacher is gunned down by Muslim militants."], ["2006.12.22", "Afghanistan", "Kabul", 1, 7, "An attempted suicide attack on a lawmaker kills a bystander."], ["2006.12.22", "Afghanistan", "Tirin Kot", 5, 0, "Five policemen are murdered in an attack by Taliban extremists."], ["2006.12.22", "Bangladesh", "Binnakuri", 1, 0, "A man is murdered by the Jama'atul Mujahideen."], ["2006.12.22", "India", "Ajas", 1, 0, "Lashkar-e-Toiba terrorists gun down a civilian."], ["2006.12.22", "India", "Sopore", 2, 5, "Two civilians are killed when the Mujahideen attack a convoy."], ["2006.12.22", "Iraq", "Samarrah", 2, 4, "Freedom fighters detonate a car bomb in front of a family home, killing a man, his wife, and injuring their four young children."], ["2006.12.22", "Pakistan", "North Waziristan", 1, 5, "Pro-Taliban militants open fire on a van, killing one and injuring five."], ["2006.12.22", "Thailand", "Pattani", 1, 0, "A 54-year-old Buddhist man is shot to death by Muslim militants, who then set his body on fire."], ["2006.12.23", "Iraq", "Baghdad", 47, 0, "Police recover forty-seven victims of sectarian hatred within the Religion of Peace over a 24-hour period."], ["2006.12.23", "Iraq", "Diwaniya", 2, 0, "Two people are kidnapped by Islamic militants, blindfolded and executed."], ["2006.12.23", "Iraq", "Hawija", 2, 0, "Jihadis bomb a passenger car, killing two occupants."], ["2006.12.23", "Pakistan", "Dera Ismail Khan", 1, 0, "A Shiite professor is gunned down near his home by Sunni radicals."], ["2006.12.23", "Sudan", "Tim", 18, 8, "Eighteen civilians are killed by military forces of the Islamic Republic of Sudan."], ["2006.12.23", "Thailand", "Narathiwat", 1, 0, "Muslim terrorists sneak into a home and kill a man as he is watching television."], ["2006.12.24", "India", "Pattan", 1, 0, "A civilian is gunned down by the Mujahideen."], ["2006.12.24", "Iraq", "Baghdad", 36, 0, "Thirty-six victims of sectarian hatred within the Religion of Peace are found here and in Mosul"], ["2006.12.24", "Iraq", "Hawija", 2, 0, "Two Shiite brothers are ruthlessly gunned down by Sunni terrorists."], ["2006.12.24", "Iraq", "Muqdadiya", 7, 30, "A Fedayeen suicide bomber slaughters seven Iraqi policemen in their station and causes severe injury to thirty others."], ["2006.12.24", "Pakistan", "Bajur", 1, 0, "An off-duty police officer is sprayed with automatic weapons fire by Muslim militants."], ["2006.12.24", "Pakistan", "Dera Ismail Khan", 4, 8, "Shiites open fire on a Sunni funeral, killing four mourners."], ["2006.12.24", "Thailand", "Pattani", 1, 0, "A 34-year-old Buddhist villager is murdered by Islamic radicals after dropping his daughter off at school."], ["2006.12.24", "Thailand", "Pattani", 1, 0, "An off-duty Thai soldier is shot to death by Jihadis while riding a motorcycle."], ["2006.12.25", "India", "Chingam", 1, 0, "A civilian is shot to death by the Mujahideen."], ["2006.12.25", "Iraq", "Baghdad", 3, 1, "Jihadis kill three military police with a roadside bomb."], ["2006.12.25", "Iraq", "Baghdad", 3, 20, "A suicide bomber sends three others to Allah, and injures nearly two dozen people sitting on a crowded bus."], ["2006.12.25", "Iraq", "Baghdad", 10, 15, "Sunnis detonate a car bomb in a commercial center, killing ten innocents."], ["2006.12.25", "Iraq", "Baqubah", 6, 0, "Six people are kidnapped, bound and executed by Islamic rivals."], ["2006.12.25", "Pakistan", "Dera Murad Jamali", 3, 0, "Three people, including a woman, are shot to death by a Muslim concerned about illicit sexual relations."], ["2006.12.25", "Thailand", "Pattani", 1, 0, "A 36-year-old civilian is murdered by Muslim terrorists."], ["2006.12.26", "India", "Pulwama", 2, 2, "Two people, including a civilian, are killed in a Mujahideen ambush."], ["2006.12.26", "Iraq", "Baghdad", 17, 35, "Shiites bomb a Sunni mosque, killing over a dozen innocent people."], ["2006.12.26", "Iraq", "Baghdad", 25, 55, "More than two-dozen innocents are blown to bits by a Jihad car bomb in a retail district."], ["2006.12.26", "Iraq", "Baghdad", 54, 50, "Several terror attacks and victims of sectarian violence add up to over four dozen people killed by Islamic terrorists."], ["2006.12.26", "Iraq", "Kirkuk", 2, 3, "A child and an elderly man are killed when Sunni terrorists detonate a bomb."], ["2006.12.26", "Israel", "Ramle", 1, 0, "A divorced mother is gunned down in front of her home in an 'honor killing'."], ["2006.12.26", "Pakistan", "Peshawar", 1, 3, "Radicals bomb an airport, killing one other person."], ["2006.12.26", "Thailand", "Narathiwat", 3, 0, "Militant Muslims shoot three Buddhist civilians to death in separate attacks."], ["2006.12.27", "Afghanistan", "Takhtapul", 1, 3, "A Pakistani truck driver is killed in a Taliban ambush."], ["2006.12.27", "Iraq", "Baghdad", 40, 0, "Forty victims of sectarian hatred within the Religion of Peace are found tortured and executed."], ["2006.12.27", "Iraq", "Ramadi", 2, 3, "Muslim terrorists enter a policeman's home, kill him and a woman, and shoot three others."], ["2006.12.27", "Iraq", "Talbiya", 8, 10, "Sunnis car bomb a Shia neighborhood, killing eight people."], ["2006.12.27", "Thailand", "Pattani", 1, 0, "A man is brutally murdered by radical Muslims while having tea in a shop."], ["2006.12.27", "Thailand", "Yala", 1, 0, "A 52-year-old farmer is shot to death by Islamic terrorists."], ["2006.12.27", "Thailand", "Yala", 1, 0, "A Buddhist civilian is gunned down by radical Muslims."], ["2006.12.28", "India", "Nadihal", 1, 0, "A civilian is shot to death by the Mujahideen."], ["2006.12.28", "Iraq", "Baghdad", 17, 60, "Separate bombings leave at least seventeen innocents dead at the hands of Islamic terrorists."], ["2006.12.28", "Iraq", "Baghdad", 41, 0, "Forty-one victims of sectarian hatred within the Religion of Peace are found over a 24 hour period."], ["2006.12.28", "Iraq", "Mosul", 5, 19, "Two people are killed by a suicide bomber in a minibus, and three others are kidnapped and beheaded."], ["2006.12.29", "Dagestan", "Makhachkala", 1, 0, "A religious leader is murdered by Islamists."], ["2006.12.29", "India", "Srinagar", 1, 0, "Islamic militants trigger an IED blast in the heart of the capital."], ["2006.12.29", "Iraq", "Khalis", 13, 17, "A suicide bomber attacks a Shia mosque, killing thirteen people."], ["2006.12.29", "Pakistan", "Damadola", 13, 6, "Thirteen people are killed when al-Qaeda backed militants stage a rocket attack on a village."], ["2006.12.29", "Thailand", "Narathiwat", 1, 0, "A village defense volunteer is ambushed and murdered by Islamists."], ["2006.12.29", "Thailand", "Pattani", 1, 0, "Muslim radicals gun down a 50-year-old storeowner in his shop."], ["2006.12.29", "Thailand", "Yala", 2, 0, "Two Buddhist teachers are shot, brutally dragged from their truck and set on fire by militant Muslims."], ["2006.12.29", "Yemen", "Saada", 5, 0, "Shiite radicals open fire on a military checkpoint, killing five Yemeni soldiers."], ["2006.12.30", "India", "Pampore", 2, 3, "Lashkar-e-Taiba militants fire into a market, killing a civilian and a security guard."], ["2006.12.30", "Iraq", "Baghdad", 12, 0, "A dozen victims of sectarian hatred within the Religion of Peace are found dead across the capital."], ["2006.12.30", "Iraq", "Baghdad", 36, 77, "Sunni bombers slaughter three dozen Shia civilians in a triple bombing of a residential neighborhood."], ["2006.12.30", "Iraq", "Mahmudiya", 4, 0, "Four people are tortured and shot to death by Islamic terrorists."], ["2006.12.30", "Iraq", "Najaf", 36, 58, "Another three dozen Shiites are blown up at a market by determined Sunni bombers."], ["2006.12.30", "Iraq", "Tal Afar", 5, 8, "A suicide bomber straps explosives to his body and murders five people."], ["2006.12.30", "Sudan", "Kutum", 5, 0, "The Islamic Republic of Sudan stages an air force bombing run over a village, killing at least five civilians."], ["2006.12.30", "Thailand", "Yala", 1, 0, "Islamists gun down a government official."], ["2006.12.31", "Iraq", "Baghdad", 4, 12, "Two children are among four people murdered by Jihadis in three attacks."], ["2006.12.31", "Thailand", "Bangkok", 3, 40, "Jemaah Islamiyah bomb New Years Eve celebrations in the capital, leaving three people dead and forty injured."]], "columns": ["Date", "Country", "City", "Killed", "Injured", "Description"], "year": 2006}