{"rows": [["2010.01.01", "Pakistan", "Shah Hason Khel", 105, 100, "Children are amply represented among over one hundred spectators massacred at a volleyball tournament by a Fedayeen suicide bomber."], ["2010.01.01", "Somalia", "Hodan", 1, 0, "Islamists murder a 41-year-old Christian convert and church leader."], ["2010.01.02", "Afghanistan", "Kandahar", 4, 0, "Four American soldiers guarding a marketplace are murdered by a Taliban bomb."], ["2010.01.02", "Afghanistan", "Nimroz", 5, 6, "Five civilians are killed when Sunni terrorists bomb their pickup truck."], ["2010.01.02", "Iraq", "Baghdad", 1, 21, "Jihadi bombers take out a civilian and injure two dozen others."], ["2010.01.02", "Iraq", "Mosul", 2, 0, "Two local cops are gunned down by Sunni terrorists."], ["2010.01.02", "Pakistan", "Orakzai", 3, 0, "Three civilian village guards are ambushed and killed by Islamic militants."], ["2010.01.02", "Somalia", "Dhusamareb", 47, 150, "al-Shabaab Islamists assault a small town.  At least four dozen people are killed in the fighting."], ["2010.01.03", "Iraq", "Tal Abta", 3, 0, "Three road construction workers are gunned down by Muslim terrorists."], ["2010.01.03", "Pakistan", "Bajaur", 2, 4, "Two tribal elders are blown to bits by a Taliban roadside bomb."], ["2010.01.03", "Pakistan", "Hangu", 4, 2, "A Taliban roadside bomb ends the lives of four people."], ["2010.01.03", "Pakistan", "Waziristan", 2, 5, "A bombing and separate rocket attack leave two people dead."], ["2010.01.04", "Iraq", "Kirkuk", 3, 7, "Three Iraqis are murdered in a Mujahideen double bombing."], ["2010.01.04", "Iraq", "Mosul", 3, 1, "Sunni bombers blast three civilians into pieces."], ["2010.01.05", "Pakistan", "Karachi", 1, 0, "A 70-year-old leader of a religious minority is murdered while sitting in his store by Jihadi gunmen."], ["2010.01.05", "Pakistan", "Mohmand", 2, 2, "Two civilians are taken down by Taliban rockets."], ["2010.01.06", "Dagestan", "Makhachkala", 6, 12, "A suicide bomber murders six Russian police officers."], ["2010.01.06", "Egypt", "Rafah", 1, 0, "Hamas snipers take down an Egyptian soldier."], ["2010.01.06", "India", "Srinagar", 3, 11, "Jamiat-ul-Mujahideen militants toss grenades and fire into a crowd at a shopping center, killing at least three people."], ["2010.01.06", "Ingushetia", "Nazran", 1, 0, "Fundamentalists murder a shop owner who ignored their warnings not to sell alcohol (2010)."], ["2010.01.06", "Iraq", "Mosul", 2, 1, "Two children are killed by a bomb in their home, suspected to have been stored there by their father."], ["2010.01.06", "Pakistan", "Sudhanoti", 3, 11, "Three local soldiers are incinerated by a suicide bomber."], ["2010.01.06", "Somalia", "Bosasso", 1, 0, "A lawmaker is assassinated by suspected fundamentalists."], ["2010.01.07", "Afghanistan", "Nangarhar", 9, 44, "Four children are among nine Afghans murdered by Islamic bombers in two attacks."], ["2010.01.07", "Afghanistan", "Uruzgan", 8, 0, "All eight Afghan soldiers riding in a vehicle are killed by a Taliban roadside bomb."], ["2010.01.07", "Egypt", "Nag Hamadi", 7, 10, "Six worshippers and one guard are gunned down by Muslim radicals as they leave mass at a Christian church.  A 14-year-old is among the dead."], ["2010.01.07", "Iraq", "Hit", 7, 6, "Women and children are among the dead when Mujahideen detonate planted bombs around the bedrooms of four homes."], ["2010.01.07", "Iraq", "Khanaqin", 3, 15, "Three Iraqis are cut down by a Jihadi bomb."], ["2010.01.07", "Thailand", "Yala", 1, 0, "A man is ripped in two by a Religion of Peace nail bomb."], ["2010.01.08", "Afghanistan", "Logar", 2, 0, "Two Afghans are blown away at point blank range by a Fedayeen."], ["2010.01.08", "Iraq", "Ras Al-Jadeh", 2, 0, "Jihad bombers kill two local cops."], ["2010.01.08", "Pakistan", "Bajaur", 2, 2, "Two people are blown to bits by a Taliban roadside bomb."], ["2010.01.08", "Pakistan", "Karachi", 5, 7, "Five mourners at a funeral are shot to death by sectarian Jihadis."], ["2010.01.08", "Pakistan", "Khyber", 8, 11, "Three children are among eight civilians murdered by a Lashkar-e-Islam suicide bomber outside a mosque."], ["2010.01.09", "Afghanistan", "Helmand", 2, 6, "A British journalist is among two killed in a roadside Mujahideen bombing."], ["2010.01.09", "Iraq", "Mosul", 1, 0, "Freedom fighters kill a 16-year-old boy with a bomb."], ["2010.01.10", "Afghanistan", "Uruzgan", 3, 0, "Three humanitarian workers die in a Taliban roadside attack."], ["2010.01.10", "India", "Kulgam", 2, 1, "Hizb-ul-Mujahideen gun down two former members who had renounced violence."], ["2010.01.10", "Pakistan", "Mohmand", 2, 0, "Suspected Islamists murder two tribal elders."], ["2010.01.10", "Thailand", "Narathiwat", 2, 0, "Two men sitting in a tea shop are blown away by Muslim terrorists with automatic weapons."], ["2010.01.11", "Afghanistan", "Uruzgan", 1, 2, "A policeman is cut down by a suicide bomber."], ["2010.01.11", "Dagestan", "Kizlyar", 2, 0, "A moderate cleric and a former policeman are murdered in separate attacks."], ["2010.01.11", "India", "Jammu", 1, 0, "Pakistani terrorists shoot an Indian border guard to death."], ["2010.01.11", "Iraq", "Mosul", 1, 0, "A 51-year-old Christian man is brutally gunned down while selling vegetables by the side of the road."], ["2010.01.11", "Pakistan", "Peshawar", 1, 5, "One person is crushed to death in a Taliban rocket attack."], ["2010.01.12", "France", "Paris", 0, 1, "An actress-playwright is doused with petrol and nearly set on fire by three Algerians angered by her negative portrayal of Muslim men."], ["2010.01.12", "Iraq", "Diyala", 3, 5, "Terrorists murder three people with a brutal bomb blast."], ["2010.01.12", "Iraq", "Mosul", 1, 0, "A 75-year-old Christian is gunned down in his grocery story by Religion of Peace militants."], ["2010.01.13", "Afghanistan", "Ghazni", 1, 6, "An Afghan police officer is murdered by Sunni roadside bombers."], ["2010.01.13", "Algeria", "Allaghane", 2, 0, "Two security personnel are shot to death by Islamic extremists."], ["2010.01.13", "Iraq", "Saqlawiya", 7, 6, "A suicide bomber sends seven Iraqis to Allah."], ["2010.01.13", "Pakistan", "Hangu", 1, 0, "A man is kidnapped and beheaded by Muslim militants, who then booby-trap the body."], ["2010.01.13", "Pakistan", "Tank", 1, 6, "A child is killed from an explosive planted by religious radicals at a playground."], ["2010.01.13", "Thailand", "Pattani", 1, 4, "Islamic terrorists ambush a group of electricians, killing one."], ["2010.01.13", "Yemen", "Shabwa", 2, 0, "Two local soldiers are cut down in an al-Qaeda ambush."], ["2010.01.14", "Afghanistan", "Helmand", 1, 4, "A Shahid suicide bomber sends a local cop to paradise."], ["2010.01.14", "Afghanistan", "Uruzgan", 20, 13, "Three children are among twenty civilians blown to bits at a market place by a Fedayeen suicide bomber."], ["2010.01.14", "India", "Uttar Pradesh", 1, 0, "A 14-year-old member of the area's oppressed Hindu community is raped and killed by two Muslim men."], ["2010.01.14", "Ingushetia", "Nazran", 1, 3, "Islamists shoot a cop to death outside a mosque."], ["2010.01.14", "Iraq", "Baqubah", 2, 10, "Two people at a market are killed by a Mujahideen market blast."], ["2010.01.14", "Iraq", "Najaf", 27, 111, "Twenty-seven people are massacred by three separate bomb blasts at a Shia market."], ["2010.01.14", "Pakistan", "Mohmand", 2, 7, "Two members of a peace committee are murdered by Taliban roadside bombers while on their way home."], ["2010.01.14", "Thailand", "Pattani", 2, 0, "A Buddhist couple is shot to death by Muslims while riding to work.  Their bodies are then burned."], ["2010.01.15", "Afghanistan", "Spin Boldak", 5, 0, "A mother and her four children are successfully taken out by a fundamentalist bomb attack on their car."], ["2010.01.15", "India", "Sopore", 2, 7, "Islamic militants assault a police station, killing a civilian and one officer."], ["2010.01.15", "Kenya", "Nairobi", 1, 5, "A Muslim gunmen fires into a crowd, killing one Christian and injuring five."], ["2010.01.15", "Somalia", "Lasanod", 1, 0, "Suspected Islamists assassinate a senior police officer outside a mosque."], ["2010.01.15", "Somalia", "Mogadishu", 1, 2, "Three aid workers are kidnapped by suspected Hizbul Islam.  One is found brutally murdered."], ["2010.01.16", "Iraq", "Baghdad", 5, 3, "Five Iraqis are murdered in various Mujahideen attacks."], ["2010.01.16", "Philippines", "North Cotabato", 3, 3, "Three civilians are machine-gunned to death in their village by Moro Islamists."], ["2010.01.17", "Afghanistan", "Chishti Sharif", 6, 0, "Sunni hardliners open fire on a vehicle, killing six local occupants."], ["2010.01.17", "Iraq", "Kharab", 3, 0, "According to reports, three brothers are dragged out of their home and shot to death on their doorstep by Muslim terrorists."], ["2010.01.17", "Iraq", "Mosul", 2, 0, "At least one of two men gunned down in a targeted shooting is a Christian father of two."], ["2010.01.17", "Nigeria", "Jos", 48, 96, "Muslim youth go on a rampage, hacking about 48 Christians to death after an attack outside a church.  The victims include two pastors."], ["2010.01.17", "Thailand", "Pattani", 1, 0, "A Buddhist woman is dismembered by a Muslim bomb thrown into a karaoke bar."], ["2010.01.17", "Thailand", "Pattani", 2, 0, "Two civilians are gunned down by Islamic radicals in separate attacks."], ["2010.01.18", "Afghanistan", "Kabul", 5, 71, "Fedayeen stage a massive suicide attack against government buildings in the capital, leaving at least five dead."], ["2010.01.18", "Algeria", "Kabylie", 1, 0, "Armed fundamentalists cut down a cop at point blank range."], ["2010.01.18", "Iraq", "Baghdad", 5, 0, "Muslim gunmen storm a humanitarian office, killing four workers and a mother in front of her 3-year-old daughter."], ["2010.01.18", "Iraq", "Mosul", 1, 0, "Islamic terrorists gun down a Christian man inside a grocery."], ["2010.01.18", "Pakistan", "Mohmand", 1, 2, "The Taliban attack a village, killing a defense volunteer."], ["2010.01.19", "Pakistan", "Jandola", 2, 0, "Islamic hardliners end the lives of two local soldiers with a bomb."], ["2010.01.19", "Pakistan", "Mohmand", 2, 2, "Religious extremists open fire on a peace committee, killing two members."], ["2010.01.19", "Somalia", "Bosasso", 1, 0, "Fundamentalists shoot a man to death inside his bookstore."], ["2010.01.19", "Somalia", "Mogadishu", 19, 30, "Women and children are among nineteen killed when Islamists launch multiple assaults on 'apostates and Christian backers.'"], ["2010.01.20", "Iraq", "Mosul", 0, 45, "A suicide bomber injures over forty Iraqis, but manages to kill only himself."], ["2010.01.20", "Pakistan", "Karachi", 1, 0, "A woman 8-months pregnant is stabbed to death with an axe and dagger by her family for marrying against their will."], ["2010.01.21", "Iraq", "Mussayab", 1, 5, "Mujahideen murder a cop with a roadside bomb."], ["2010.01.21", "Pakistan", "Bajaur", 3, 22, "A woman is among three people blown to bits by an Islamic bomb."], ["2010.01.21", "Thailand", "Narathiwat", 1, 0, "A 42-year-old defense volunteer is gunned down by Islamic radicals while riding a motorcycle."], ["2010.01.22", "Afghanistan", "Ghazni", 4, 1, "Four soldiers are sent to Allah by Taliban bombers."], ["2010.01.22", "Bangladesh", "Netrokona", 0, 2, "A Catholic humanitarian worker and his wife are attacked by a gang of Muslims."], ["2010.01.22", "Iraq", "Baghdad", 2, 0, "Jihadi gunmen assassinate two police officers."], ["2010.01.22", "Pakistan", "Lahore", 1, 0, "A 12-year-old Christian girl is raped, tortured and killed by her Muslim employer, a respected lawyer."], ["2010.01.22", "Pakistan", "Pattar", 2, 0, "Two tribal elders are murdered by Muslim militants and dumped under a bridge."], ["2010.01.23", "Afghanistan", "Helmand", 1, 0, "A young marine is murdered by a Fedayeen suicide bomber."], ["2010.01.23", "Afghanistan", "Helmand", 2, 2, "Muslim radicals take out two children with an IED blast."], ["2010.01.23", "Afghanistan", "Khost", 1, 0, "A 16-year-old boy is sent straight to Allah by Taliban bombers."], ["2010.01.23", "Afghanistan", "Paktika", 4, 3, "Islamic hardliners fire into a taxi, killing three women and a boy."], ["2010.01.23", "Pakistan", "Gomal", 4, 11, "Two children are among four people dismembered by a suicide bomber."], ["2010.01.23", "Pakistan", "North Waziristan", 7, 0, "Seven civilians are kidnapped and executed by Sunni hardliners."], ["2010.01.23", "Pakistan", "Orakzai", 3, 0, "Three local soldiers are ambushed and killed by religious extremists."], ["2010.01.24", "Iraq", "Mosul", 6, 2, "Six Iraqis are killed in two Mujahid bomb blasts."], ["2010.01.25", "Iraq", "Baghdad", 41, 102, "Three horrific bomb attacks on hotels leave at least three dozen dead and many more in agony."], ["2010.01.25", "Iraq", "Kirkuk", 2, 0, "Two cops sitting at a gas station are wasted by Sunni gunmen."], ["2010.01.25", "Iraq", "Mosul", 2, 0, "A woman and her daughter are shot to death in their own home by Holy Warriors."], ["2010.01.25", "Somalia", "Sool", 2, 3, "Two police officers are killed by a bomb hidden in a mosque."], ["2010.01.25", "Yemen", "Sanaa", 3, 0, "al-Qaeda militants attack a checkpoint, killing three local soldiers."], ["2010.01.26", "Afghanistan", "Helmand", 4, 0, "Talibanis ambush and kill four local policemen in the middle of the night."], ["2010.01.26", "Iraq", "Baghdad", 22, 80, "A Shahid suicide bomber murders over twenty people working at a police crime lab."], ["2010.01.26", "Iraq", "Mosul", 0, 1, "A Christian shopkeeper is targeted by Muslim gunmen and seriously injured."], ["2010.01.26", "Pakistan", "Salarzai", 1, 0, "A local tribesman is abducted and murdered by Sunni extremists."], ["2010.01.26", "Somalia", "Mogadishu", 5, 3, "al-Shabaab Islamists bomb a hospital clinic, killing at least five."], ["2010.01.26", "Thailand", "Pattani", 3, 0, "Two Buddhist construction workers are among three people gunned down Islamic separatists in two attacks."], ["2010.01.27", "Ingushetia", "Nazran", 2, 2, "Two police officers die in the hospital from injuries suffered in a Islamic ambush."], ["2010.01.27", "Iraq", "Baghdad", 2, 5, "A woman is among two people murdered by Mujahid gunmen."], ["2010.01.27", "Iraq", "Mosul", 2, 0, "Muslim terrorists shoot two people to death."], ["2010.01.27", "Pakistan", "Dir", 3, 0, "Three children are murdered by Taliban bombers while grazing their family goats."], ["2010.01.27", "Pakistan", "Mardan", 1, 5, "A drive-by attack by Sunni hardliners leaves one cop dead."], ["2010.01.27", "Somalia", "Hiran", 8, 0, "Rival Islamic groups Hizbul Islam and al-Shabaab go on a beheading spree, lopping off at least four heads apiece."], ["2010.01.27", "Somalia", "Mogadishu", 1, 0, "Islamists assassinate a local official at a market."], ["2010.01.28", "Ingushetia", "Nazran", 1, 0, "Islamic militants fire on a car, killing the driver."], ["2010.01.28", "Iran", "Tehran", 2, 0, "Two people are executed for 'waging war against Allah'."], ["2010.01.28", "Iraq", "Adel", 1, 0, "An imam is gunned down by Muslim rivals while leaving a mosque."], ["2010.01.28", "Iraq", "Mosul", 4, 3, "Jihadi bombers take down four Iraqis."], ["2010.01.28", "Somalia", "Mogadishu", 2, 5, "Two Ugandan peacekeepers die from shrapnel injuries suffered during an Islamist mortar attack."], ["2010.01.29", "Afghanistan", "Lashkar Gah", 1, 3, "At least one civilian is killed during a sustained Taliban assault on a commercial district."], ["2010.01.29", "Afghanistan", "Wardak", 2, 0, "An interpreter suddenly turns on two US soldiers, killing both."], ["2010.01.29", "India", "Kishtwar", 2, 0, "Two Indian troops are gunned down in cold blood by Islamic militants."], ["2010.01.29", "Somalia", "Mogadishu", 10, 35, "An al-Shabaab ambush leaves at least 10 people dead."], ["2010.01.29", "Thailand", "Pattani", 1, 2, "A bomb detonated at a mosque kills a local soldier."], ["2010.01.30", "Afghanistan", "Uruzgan", 1, 1, "A baby is killed when religious extremists use the mother as a human shield in an attack on Afghan troops."], ["2010.01.30", "Iraq", "Baghdad", 1, 4, "Sunni bombers take out a Shia pilgrim."], ["2010.01.30", "Iraq", "Samarrah", 2, 20, "Two people at a restaurant are blown to bits by a Fedayeen suicide bomber."], ["2010.01.30", "Pakistan", "Bajaur", 16, 20, "A suicide bomber at a market sends sixteen shoppers straight to Allah."], ["2010.01.30", "Pakistan", "Bolochistan", 3, 7, "Sectarian Jihadis fire into a bus filled with Shia pilgrims, killing at least three."], ["2010.01.30", "Pakistan", "North Waziristan", 2, 0, "The Taliban abduct two civilians, then shoot them to death in captivity."], ["2010.01.30", "Somalia", "Mogadishu", 12, 25, "A mother and her two children are among a dozen civilians burned or blasted to death when Islamists lob mortars into their neighborhood."], ["2010.01.30", "Thailand", "Pattani", 2, 0, "A man and his wife are murdered by Islamic radicals while on their way to work at a rubber plantation."], ["2010.01.31", "Iraq", "Mosul", 1, 0, "A young woman is shot to death inside her home by Muslim terrorists."], ["2010.01.31", "Pakistan", "Mohmand", 2, 2, "The Taliban take out two local troops with a landmine."], ["2010.01.31", "Somalia", "Mogadishu", 8, 55, "A mother and her 4-year-old child are among eight civilians killed during an al-Shabaab mortar attack."], ["2010.01.31", "Thailand", "Pattani", 3, 1, "A 6-year-old boy and his parents are brutally shot to death by Religion of Peace advocates."], ["2010.02.01", "Ingushetia", "Nazran", 1, 3, "A bomb planted in a kindergarten explodes, leaving one person dead."], ["2010.02.01", "Ingushetia", "Nazran", 1, 3, "Islamists fire five grenades into a building, killing at least one occupant."], ["2010.02.01", "Iraq", "Baghdad", 54, 117, "A female suicide bomber murders fifty-four innocent Shia pilgrims at a hospitality tent, mostly women and children."], ["2010.02.02", "Iraq", "Karbalah", 3, 21, "Three Shia pilgrims are murdered by Sunni bombers."], ["2010.02.02", "Pakistan", "Mohmand", 2, 2, "Two members of a peace community pay the ultimate price when Islamic hardliners blow them up."], ["2010.02.02", "Philippines", "Maluso", 1, 8, "Suspected Abu Sayyaf militants plant a landmine that kills one local soldier."], ["2010.02.03", "Germany", "Northrhein-Westphalia", 1, 0, "A mother of four is beheaded and then has her fingers cut off in a suspected 'honor' attack by her husband."], ["2010.02.03", "Iraq", "Baghdad", 1, 3, "Sunni bombers send a Shia pilgrim straight to Allah."], ["2010.02.03", "Iraq", "Karbalah", 23, 147, "A Fedayeen bomber passes out fruit to children before detonating, killing nearly two dozen."], ["2010.02.03", "Iraq", "Touz Khormato", 1, 0, "A teacher is kidnapped and killed by Muslim radicals."], ["2010.02.03", "Pakistan", "Swat", 9, 115, "Four children are among nine people killed when the Tehrik-e-Taliban bomb am opening ceremony at a girl's school."], ["2010.02.03", "Thailand", "Narathiwat", 1, 0, "A rubber tapper working with his wife is shot in the back by Muslim militants with a shotgun"], ["2010.02.04", "Afghanistan", "Kandahar", 3, 17, "Three people are dismembered by a Shahid suicide bomber."], ["2010.02.04", "Iraq", "Baghdad", 1, 0, "A man leaving a mosque is killed by a suspected Mujahid."], ["2010.02.04", "Somalia", "Mudug", 1, 0, "A young boy is shot to death by Islamists after trying to escape forced prayers at a mosque."], ["2010.02.04", "Turkey", "Kahta", 1, 0, "A 16-year-old girl is buried alive by her family as punishment for talking to boys."], ["2010.02.05", "Afghanistan", "Helmand", 2, 20, "Two civilians are incinerated by a Taliban roadside bomb."], ["2010.02.05", "India", "Baramulla", 2, 0, "A civilian and local cop are murdered in a Mujahideen ambush."], ["2010.02.05", "India", "Sopore", 3, 0, "Islamic terrorists approach a police checkpoint and open fire, killing a civilian and two officers."], ["2010.02.05", "Iraq", "Karbalah", 41, 154, "A barbaric Sunni double car-bombing against Shia pilgrims at a religious festival leaves at least forty dead."], ["2010.02.05", "Pakistan", "Karachi", 33, 80, "A Christian family and dozens of Shiites are blown to bits by Sunni bombers at two locations, one a hospital."], ["2010.02.05", "Pakistan", "Malakand", 1, 0, "A local soldier standing guard is gunned down in cold blood by Islamists."], ["2010.02.06", "Thailand", "Narathiwat", 1, 1, "A local soldier in a moving truck is killed by a Mujahideen sniper."], ["2010.02.07", "Afghanistan", "Kandahar", 4, 2, "Islamists detonate a hidden bomb under a bridge, taking out a car full of local cops."], ["2010.02.07", "Afghanistan", "Mazar-e Sharif", 3, 1, "Two Swedes and their interpreter are shot to death by religious extremists dresses as police."], ["2010.02.07", "Iraq", "Diwaniya", 1, 3, "Jihadis bomb a minibus, killing one occupant."], ["2010.02.07", "Iraq", "Mosul", 1, 1, "A female veterinarian is shot to death by Holy Warriors."], ["2010.02.07", "Pakistan", "North Waziristan", 1, 0, "An Afghan refugee is kidnapped and murdered by Islamic hardliners."], ["2010.02.08", "India", "Sopore", 1, 0, "A police officer is gunned down by Muslim militants."], ["2010.02.08", "Iraq", "Baghdad", 1, 3, "One civilian is killed by Jihadi bombers while crossing a bridge."], ["2010.02.08", "Pakistan", "Khyber", 1, 4, "A young girl is killed in a rocket attack by Sunni hardliners."], ["2010.02.08", "Pakistan", "Punjab", 0, 1, "A Christian man is beaten unconscious for refusing to embrace Islam."], ["2010.02.08", "Pakistan", "Rawalpindi", 4, 1, "Muslim terrorists open fire on a vehicle, killing two occupants and two bystanders."], ["2010.02.08", "Somalia", "Mogadishu", 10, 20, "al-Shabaab claims responsibility for a series of attacks that leave at least ten civilians dead."], ["2010.02.08", "Thailand", "Pattani", 1, 0, "Islamic radicals target a Buddhist teacher riding home on his motorcycle.  He is shot and then set on fire."], ["2010.02.08", "Thailand", "Yala", 1, 0, "A 41-year-old man is shot to death in his own backyard by Islamists."], ["2010.02.09", "Egypt", "Menoufia", 1, 0, "A young Christian carpenter is gunned down at close range by a Muslim policeman in a suspected sectarian attack."], ["2010.02.09", "Iraq", "Baghdad", 1, 1, "Muslim assassins murder a man in front of his wife."], ["2010.02.09", "Sudan", "al-Baytari", 4, 15, "Janjiweed militia attack a refugee camp and murder four residents."], ["2010.02.10", "Iraq", "Abu Ghraib", 2, 4, "Two Iraqi cops are blown apart by Mujahideen bombers."], ["2010.02.10", "Iraq", "Baquba", 2, 1, "Jihadi gunmen take down two Iraqis in their own home."], ["2010.02.10", "Israel", "Nablus", 1, 0, "A Palestinian policeman walks up to an Israeli soldier and stabs him to death."], ["2010.02.10", "Pakistan", "Khyber", 1, 2, "The Taliban murder a member of a rescue team."], ["2010.02.10", "Pakistan", "Khyber", 18, 10, "A teenage Fedayeen suicide bomber detonates along a highway, killing nearly twenty others."], ["2010.02.10", "Somalia", "Hamarjajab", 5, 7, "al-Shabaab militants take out five Somalis with a roadside bomb."], ["2010.02.10", "Thailand", "Pattani", 1, 0, "A Buddhist man at a bird singing competition is brutally gunned down by Muslim radicals."], ["2010.02.10", "Thailand", "Pattani", 2, 0, "Two men are shot to death by Mujahideen in separate attacks."], ["2010.02.11", "Dagestan", "Makhachkala", 2, 0, "Bombing and shooting attacks leave two people dead."], ["2010.02.11", "Iraq", "Baghdad", 1, 0, "An imam at a mosque is gunned down by sectarian rivals."], ["2010.02.11", "Iraq", "Mosul", 1, 0, "Jihadis murder a 17-year-old with an IED."], ["2010.02.11", "Pakistan", "Bannu", 15, 24, "Fifteen innocents are blown to bits in a double suicide bombing by Islamic militants."], ["2010.02.11", "Philippines", "Cotabato", 1, 0, "Muslim extremists shoot a man to death as he is riding a motorbike to work."], ["2010.02.11", "Thailand", "Narathiwat", 1, 0, "A tailor is gunned down while carrying his young son in front of his home."], ["2010.02.12", "Iraq", "Buhriz", 2, 0, "A man and his son are blown to bits by Jihadi bombers."], ["2010.02.12", "Somalia", "Afgoye", 2, 0, "al-Shabaab Islamists shoot two civilians to death."], ["2010.02.12", "Thailand", "Pattani", 1, 0, "A 38-year-old man is murdered by Muslim gunmen."], ["2010.02.12", "Yemen", "Saada", 1, 7, "Militant Shiites ambush and kill a government soldier."], ["2010.02.13", "Afghanistan", "Kandahar", 2, 7, "A Fedayeen suicide bomber sends two other souls to Allah."], ["2010.02.13", "India", "Pune", 17, 37, "Five women are more than a dozen innocents blasted to death by a Mujahid bomber at a bakery near a Jewish center."], ["2010.02.13", "Iraq", "Kufa", 6, 10, "A female suicide bomber murders at least six Shia pilgrims headed to a religious ceremony."], ["2010.02.13", "Pakistan", "Kasur", 1, 0, "A Muslim mob beats a young man to death after his father declares himself a prophet."], ["2010.02.13", "Thailand", "Narathiwat", 1, 0, "A 44-year-old man is gunned down by Islamic militants while using the restroom."], ["2010.02.13", "Thailand", "Pattani", 1, 2, "Muslim militants shoot a man sitting on his front porch with friends."], ["2010.02.14", "Dagestan", "Novogodari", 3, 0, "A young girl is among three people killed when Muslim gunmen open up on a vehicle."], ["2010.02.14", "Ingushetia", "Nazran", 2, 0, "Jihadis wipe out a young man and his mother near the entrance to a mosque."], ["2010.02.14", "Iraq", "Baghdad", 2, 6, "Mujahideen bomb a cafe, killing two patrons."], ["2010.02.14", "Iraq", "Mosul", 1, 1, "Islamists enter a Christian businessman's home and murder him."], ["2010.02.14", "Pakistan", "Khyber", 3, 0, "Muslim radicals gun down three civilians in separate attacks."], ["2010.02.14", "Pakistan", "Sindh", 3, 16, "Suspected fundamentalists bomb a movie theater, leaving at least three innocents dead."], ["2010.02.14", "Thailand", "Pattani", 2, 0, "Islamists brutally murder a Buddhist woman and her 13-year-old daughter."], ["2010.02.15", "Iraq", "Mosul", 1, 0, "A 20-year-old Christian student is kidnapped and brutally murdered by Mujahideen."], ["2010.02.15", "Iraq", "Mosul", 1, 0, "A 42-year-old Christian is shot to death in front of his store."], ["2010.02.15", "Lebanon", "Ain el Hilweh", 2, 0, "An attack by a Sunni fundamentalist group leaves two people dead, including a woman."], ["2010.02.15", "Somalia", "Diif", 1, 0, "A man is beheaded by al-Shabaab."], ["2010.02.15", "Somalia", "Mogadishu", 2, 2, "An al-Shabaab suicide bomber targets a moving vehicle, killing two bystanders."], ["2010.02.15", "Thailand", "Narathiwat", 1, 0, "A 36-year-old man is shot to death by Islamic militants at his work site."], ["2010.02.15", "Thailand", "Narathiwat", 2, 0, "A rubber tapper and her daughter are gunned down by Muslim radicals on the plantation where they worked."], ["2010.02.15", "Yemen", "Jawf", 1, 0, "A 51-year-old man is shot to death by Shia radicals while eating lunch."], ["2010.02.16", "Iraq", "Mosul", 2, 0, "A woman and a civil servant are gunned down in separate Jihad attacks."], ["2010.02.16", "Iraq", "Mosul", 2, 9, "Holy Warriors manage to kill two Iraqis with a car bomb."], ["2010.02.17", "Iraq", "Mosul", 1, 0, "Another young Christian is shot to death by Muslim extremists."], ["2010.02.17", "Philippines", "Mindanao", 1, 2, "A 9-year-old boy is taken down by a Moro Islamist landmine."], ["2010.02.17", "Thailand", "Narathiwat", 2, 0, "Religion of Peace advocates behead two government soldiers trying to guard teachers."], ["2010.02.18", "Iraq", "Baghdad", 13, 26, "A Fedayeen suicide bomber sends over a dozen Iraqis to Allah."], ["2010.02.18", "Iraq", "Mosul", 0, 22, "A Jihadi car bombing injures two dozen people."], ["2010.02.18", "Pakistan", "Mingora", 1, 2, "Taliban hard-liners ambush a police patrol, killing one officer."], ["2010.02.18", "Pakistan", "Tirah", 31, 110, "Thirty people are incinerated by a Shahid suicide bomber at a rival mosque."], ["2010.02.18", "Thailand", "Yala", 1, 12, "Industrious Islamists shoot a civilian to death in one district and set off a motorcycle bomb in another."], ["2010.02.19", "Afghanistan", "Kandahar", 4, 0, "Four civilians are taken down by a Taliban roadside bomb."], ["2010.02.19", "Iraq", "Ramadi", 10, 15, "Terrorists successfully kill ten Iraqis with a car bomb."], ["2010.02.19", "Iraq", "Tal Afar", 1, 0, "Islamic gunmen murder a cop on his way home."], ["2010.02.19", "Philippines", "Basilan", 2, 1, "Two local soldiers killed by an Abu Sayyaf bomb."], ["2010.02.19", "Somalia", "Kismayo", 1, 0, "al-Shabaab Islamists shoot a man to death at a roadblock."], ["2010.02.20", "Afghanistan", "Helmand", 2, 0, "Two civilians on a motorcycle are murdered by Mujahid bombers."], ["2010.02.20", "Afghanistan", "Helmand", 6, 2, "The Taliban open fire on a group of police officers clearing a poppy field, killing six."], ["2010.02.20", "Bangladesh", "Baghaichhari", 8, 200, "At least eight people are killed when Muslim villagers riot against Christian and Buddhist neighbors."], ["2010.02.20", "England", "Huddersfield", 1, 0, "A Muslim gang of five beats a Sikh shopkeeper to death with a hammer."], ["2010.02.20", "Ingushetia", "Nazran", 2, 37, "Two people are blown to bits by an Islamic bomb."], ["2010.02.20", "Iraq", "Mosul", 1, 0, "A 57-year-old Christian shopkeeper is kidnapped and brutally shot to death by Muslim kidnappers."], ["2010.02.20", "Iraq", "Mosul", 3, 2, "Three Iraqis are dismembered by Sunni bombers."], ["2010.02.20", "Pakistan", "Balakot", 1, 3, "Three suicide attackers manage to kill only one police officer in assaults on two stations."], ["2010.02.20", "Pakistan", "Swat", 1, 0, "The body of a businessman kidnapped earlier by Islamic fundamentalists is discovered."], ["2010.02.20", "Somalia", "Buale", 1, 0, "Muslim extremists murder a man for refusing to pay zakat."], ["2010.02.21", "Iraq", "Khanaqin", 5, 1, "Jihadis gun down five guards at a power station at point-blank range"], ["2010.02.21", "Iraq", "Taji", 1, 7, "Sunni gunmen fire on a bus carrying Shia pilgrims, killing at least one passenger."], ["2010.02.21", "Iraq", "Tikrit", 1, 2, "A suicide bomber targeting a mosque manages to kill one civilian."], ["2010.02.21", "Pakistan", "Khyber", 2, 0, "The heads of three Sikhs, kidnapped by the Taliban, are discovered.  Two were businessmen who did not pay the Jizya.  The other would not embrace Islam."], ["2010.02.21", "Somalia", "Mogadishu", 3, 0, "Three men are killed in a Hizbul Islam bombing."], ["2010.02.22", "Algeria", "Boumerdes", 1, 5, "A local soldier is killed in a bomb attack by Islamic fundamentalists."], ["2010.02.22", "India", "Baramulla", 1, 3, "A local family is brutally assaulted by Muslim thugs, who smash the head of their 10-day old infant with a rock."], ["2010.02.22", "Indonesia", "Aceh", 2, 0, "A man and his son are shot to death by Jemaah Islamiyah linked terrorists."], ["2010.02.22", "Iraq", "Baghdad", 4, 0, "Sunni militants invade a home and gun down a Shia woman and her three daughters."], ["2010.02.22", "Iraq", "Baghdad", 7, 8, "A university professor and a street sweeper are among seven people shot to death by Muslim terrorists in separate attacks."], ["2010.02.22", "Iraq", "Baghdad", 8, 0, "Eight Shia family members, including a pregnant woman are shot and beheaded in their home by suspected al-Qaeda."], ["2010.02.22", "Iraq", "Ramadi", 5, 5, "A Jihadi car bomb takes down five Iraqis outside a government building, including a 6-year-old boy."], ["2010.02.22", "Pakistan", "Mingora", 13, 41, "Four women are among more than a dozen innocents blasted to death by a Shahid suicide bomber."], ["2010.02.22", "Pakistan", "Peshawar", 1, 1, "A prominent Shia leader is assassinated by Sunni gunmen."], ["2010.02.22", "Pakistan", "Swat", 6, 5, "A half-dozen people are taken down by a Shahid suicide bomber at a marketplace."], ["2010.02.22", "Thailand", "Narathiwat", 2, 0, "Two guards at a shop are shot to death in a Muslim drive-by."], ["2010.02.23", "Afghanistan", "Lashkar Gah", 7, 14, "Seven civilians at a bus stop are blown to pieces by a bicycle bomb."], ["2010.02.23", "India", "Baramulla", 3, 3, "Islamic militants open fire on a group of Indian soldiers, killing three."], ["2010.02.23", "Ingushetia", "Ordzhonikidzevskaya", 1, 0, "A security officer is gunned down in his car by Muslim rebels."], ["2010.02.23", "Iraq", "Baghdad", 3, 5, "Islamists plant a bomb on a dead body, which kills three people assigned to remove the corpse."], ["2010.02.23", "Iraq", "Mosul", 2, 5, "Jihadis gun down two local cops."], ["2010.02.23", "Iraq", "Mosul", 3, 0, "A Christian father and his two sons are murdered in their home.  They were relatives of a priest."], ["2010.02.24", "Dagestan", "Gergebilsky", 5, 1, "Three separate terror attacks over four days leave five police officers dead."], ["2010.02.24", "Iraq", "Baghdad", 1, 0, "Terrorists assassinate a judge with a bomb outside his home."], ["2010.02.24", "Pakistan", "Hangu", 3, 3, "Suspected Islamic radicals fire on a railway car, killing three passengers, including a college student."], ["2010.02.24", "Pakistan", "North Waziristan", 3, 0, "Three civilians have their throats cut by the Taliban, who throw their headless bodies into a ditch."], ["2010.02.24", "Pakistan", "Peshawar", 4, 0, "Four young brothers, ages 4 to 17, are destroyed by a Taliban rocket attack on their home."], ["2010.02.25", "India", "Pulwama", 1, 0, "Mujahideen gun down a shopkeeper."], ["2010.02.25", "Iraq", "Mosul", 2, 0, "Two members of a minority community are gunned down in their store by militant Muslims."], ["2010.02.25", "Iraq", "Mosul", 2, 0, "Two women are killed in separate Jihad attacks.  One is stabbed and the other beheaded."], ["2010.02.25", "Saudi Arabia", "Riyadh", 1, 3, "Four British cyclists are deliberately run down by drivers in two cars.  A 54-year-old humanitarian worker dies from injuries."], ["2010.02.25", "Somalia", "Dhobley", 1, 0, "Islamists behead a man for expressing loyalty to a rival group."], ["2010.02.26", "Afghanistan", "Kabul", 17, 32, "Religious extremists attack guesthouses with suicide bombs and gunfire, killing seventeen people, including several foreigners."], ["2010.02.26", "Iraq", "Baghdad", 1, 0, "An imam is shot to death by members of a rival mosque."], ["2010.02.26", "Iraq", "Mosul", 3, 22, "Three Iraqis are taken down by a Jihadi bomb planted in a dumpster."], ["2010.02.26", "Liberia", "Voinjama", 4, 23, "A Muslim mob burns churches and kills at least four Christians."], ["2010.02.26", "Pakistan", "Lahore", 0, 3, "A Christian family is terrorized in their home by a Muslim gang.  One girl is raped and the other stabbed four times."], ["2010.02.26", "Somalia", "Mogadishu", 4, 5, "An Islamist landmine attack leaves four local soldiers dead."], ["2010.02.27", "Egypt", "Teleda", 0, 2, "A pastor and his wife are brutally gunned down by Religion of Peace advocate, angry that they are trying to build a church."], ["2010.02.27", "Pakistan", "Dera Ismail Khan", 1, 7, "A sectarian sniper takes down one civilian in a Sunni procession."], ["2010.02.27", "Pakistan", "Dera Ismail Khan", 7, 38, "Seven people are killed in a sectarian mob attack on a seminary."], ["2010.02.27", "Pakistan", "Karak", 4, 23, "A child is among four locals murdered in separate suicide bombings."], ["2010.02.27", "Philippines", "Tubigan", 15, 13, "Women and five children (ages 1 to 11) are among thirteen gunned down by Moro Islamists sweeping through a Christian village."], ["2010.02.27", "Somalia", "Diif", 1, 0, "A man is beheaded by Islamic militia."], ["2010.02.27", "Thailand", "Pattani", 1, 0, "Islamic separatists pump a 70-year-old man full of bullets as he is walking home."], ["2010.02.28", "Afghanistan", "Helmand", 11, 0, "Two women and two children are among eleven civilians taken down by Islamic bombers."], ["2010.02.28", "Afghanistan", "Kabul", 5, 2, "Muslim terrorists shoot five family members to death inside their home."], ["2010.02.28", "Afghanistan", "Khost", 6, 0, "Six local soldiers die in two Taliban bomb attacks."], ["2010.02.28", "Iraq", "Khalidiya", 2, 2, "Jihadis take out two Iraqis with a car bomb."], ["2010.03.01", "Afghanistan", "Baghdad", 3, 0, "A 10-year-old boy is among three people killed by dedicated Islamic bombers."], ["2010.03.01", "Afghanistan", "Kandahar", 1, 15, "A civilian is killed by a Taliban bomb."], ["2010.03.01", "Afghanistan", "Kandahar", 4, 0, "Four civilians die in a brutal suicide attack on a bridge."], ["2010.03.01", "Afghanistan", "Lashkar Gah", 2, 0, "Two employees of a construction company are incinerated by a Sunni roadside bomb."], ["2010.03.01", "India", "Shimoga", 1, 0, "A man dies from injuries after being hit with stones thrown by a mob angered over a newspaper article deemed insulting to Islam."], ["2010.03.01", "Iraq", "Baghdad", 4, 0, "Islamic fundamentalists bomb a liquor store, killing the owner and three patrons."], ["2010.03.01", "Pakistan", "Karak", 4, 24, "A Holy Warrior sends four innocents to Allah with a suicide bomb."], ["2010.03.01", "Philippines", "Mindanao", 1, 0, "A Chinese national dies from health complications suffered during an Abu Sayyaf kidnapping."], ["2010.03.02", "Pakistan", "Khuzdar", 2, 12, "Suspected fundamentalists bomb a music show, killing two college students."], ["2010.03.02", "Thailand", "Pattani", 2, 2, "Islamists open fire on a father and his three daughters, killing him and a 7-year-old."], ["2010.03.03", "Iraq", "Baquba", 33, 55, "Three Shahid suicide bombers take down more than thirty Iraqis in coordinated attacks."], ["2010.03.03", "Iraq", "Kirkuk", 2, 0, "Terrorists stab a man and his wife to death inside their home."], ["2010.03.03", "Iraq", "Mosul", 1, 0, "An imam is gunned down in his mosque by Religion of Peace rivals."], ["2010.03.03", "Somalia", "Mogadishu", 12, 49, "Children are among those killed during an al-Shabaab assault."], ["2010.03.04", "Afghanistan", "Kandahar", 5, 0, "Five construction workers are shot to pieces at point-blank range by Islamic terrorists."], ["2010.03.04", "Iraq", "Baghdad", 17, 61, "Three separate Jihad bombings take the lives of seventeen people, including voters waiting in line."], ["2010.03.04", "Pakistan", "Chamarkand", 1, 0, "One person is killed when religious extremists attack a security post with rockets."], ["2010.03.05", "Iraq", "Mussayab", 1, 0, "A child is blown apart by Mujahideen bombers."], ["2010.03.05", "Pakistan", "Hangu", 12, 35, "At least four women are among a dozen dead Shiites after a Sunni suicide bomber detonates near a passenger bus."], ["2010.03.05", "Somalia", "Dhobley", 1, 0, "A mother of four is dragged out of her home and beheaded by Islamic hardliners."], ["2010.03.06", "Iraq", "Garma", 1, 2, "A woman is taken out by a Jihadi bomber."], ["2010.03.06", "Iraq", "Najaf", 4, 54, "Four Shia pilgrims are killed when Sunni radicals bomb a shrine."], ["2010.03.06", "Thailand", "Narathiwat", 1, 0, "A taxi driver dies after a savage machete attack by Muslim separatists."], ["2010.03.07", "Afghanistan", "Baghlan", 19, 0, "At least 19 civilians are killed when the Taliban and Hezb-e-Islami fundamentalist terror groups clash."], ["2010.03.07", "India", "Srinagar", 1, 0, "A 30-year-old shopkeeper is murdered by Islamic gunmen."], ["2010.03.07", "Iraq", "Baghdad", 51, 140, "Over fifty Iraqis are taken down in a series of bomb blasts and shootings around the country by Mujahideen intent on disrupting elections."], ["2010.03.07", "Nigeria", "Dogo Nahauwa", 528, 600, "Over five-hundred Christians, mostly women and children, are hacked to death by Muslim raiders with machetes in a night-time attack on their village.  The killers yelled 'Allah Akbar,' as they chopped."], ["2010.03.07", "Pakistan", "Lahore", 1, 0, "A Christian man dies during a home invasion by Muslim gunmen."], ["2010.03.07", "Pakistan", "Orakzai", 1, 0, "The beheaded body of a tribal elder is found a few days after his abduction by the Taliban."], ["2010.03.07", "Yemen", "Sanaa", 2, 0, "Two hospital guards are gunned down by an al-Qaeda terrorist."], ["2010.03.08", "Afghanistan", "Badghis", 12, 0, "Ten civilians and two local cops are dismembered by two Sunni bombs."], ["2010.03.08", "Iraq", "Fallujah", 2, 1, "Two civilians are gunned down by Sunni terrorists."], ["2010.03.08", "Niger", "Niamey", 5, 0, "Five members of a border patrol lose their lives to an al-Qaeda ambush."], ["2010.03.08", "Pakistan", "Lahore", 15, 60, "Fifteen people are blown to bits by a Fedayeen suicide bomber at an office park."], ["2010.03.08", "Pakistan", "Lashkar-e-Islam", 2, 0, "Lashkar-e-Islam gunmen take down two people in separate attacks."], ["2010.03.08", "Pakistan", "South Waziristan", 2, 1, "Two tribal elders are blown apart by a Taliban roadside bomb."], ["2010.03.09", "Afghanistan", "Khost", 2, 3, "A Shahid suicide bomber at a military base kills two soldiers."], ["2010.03.09", "Iraq", "Mosul", 1, 0, "Sunni terrorists gun down a man at a bus station."], ["2010.03.09", "Lebanon", "Hakr al-Daheri", 1, 0, "A 24-year-old woman with a boyfriend is shot twice in the head by her brother to 'cleanse the family honor.'"], ["2010.03.09", "Pakistan", "Punjab", 1, 0, "A 36-year-old Christian is hacked to death with an ax after refusing to embrace Islam."], ["2010.03.09", "Somalia", "Mogadishu", 1, 0, "Islamists assassinate a rival in an open-air market."], ["2010.03.09", "Somalia", "Mogadishu", 3, 0, "At least three civilians are killed during an attack by Islamic militia."], ["2010.03.09", "Thailand", "Pattani", 1, 0, "A 45-year-old salesman is shot once in the back of the head, then set on fire by Religion of Peace terrorists."], ["2010.03.10", "Afghanistan", "Faryab", 2, 4, "Two children are blown apart by a terrorist landmine.  Four others are injured."], ["2010.03.10", "Afghanistan", "Paktika", 5, 4, "Five security personnel are killed by a Shahid suicide bomber."], ["2010.03.10", "Dagestan", "Yasnaya Polyana", 1, 0, "A local religious teacher is shot to death by rivals."], ["2010.03.10", "Pakistan", "Oghi", 6, 0, "Six aid workers of a Christian charity are herded out of their office by Muslim gunmen and machine-gunned to death."], ["2010.03.10", "Somalia", "Mogadishu", 42, 83, "At least forty civilians are killed during a sustained assault by al-Shabaab militia."], ["2010.03.11", "Afghanistan", "Kapisa", 5, 3, "Four children and one adult are dismembered by a Taliban roadside blast."], ["2010.03.11", "Afghanistan", "Paktia", 3, 1, "Three local security personnel are murdered by fundamentalist bombers."], ["2010.03.11", "Pakistan", "Bajaur", 2, 0, "Two people are killed in a shooting ambush by Islamic militants."], ["2010.03.11", "Pakistan", "Karachi", 4, 0, "Four Sunnis are shot to death by Shiites while riding in a car."], ["2010.03.11", "Pakistan", "Peshawar", 4, 21, "A child is among four people taken down by a suicide bomber."], ["2010.03.11", "Somalia", "Mogadishu", 2, 0, "Two telecom employees are dragged into the street and beheaded by Religion of Peace extremists."], ["2010.03.11", "Thailand", "Pattani", 1, 0, "Islamists gun down a 61-year-old Buddhist broom salesman."], ["2010.03.11", "Thailand", "Pattani", 3, 1, "Three telephone company workers are shot by Mujahideen and then set on fire while still alive."], ["2010.03.12", "Egypt", "Marsa Matruh", 0, 23, "Twenty-three Christians are injured when a Muslim mob attacks their community after rumors of a church construction."], ["2010.03.12", "India", "Srinagar", 1, 0, "A civilian standing outside a mosque is murdered by a Mujahideen sniper."], ["2010.03.12", "Iraq", "Karbalah", 2, 3, "A car bomb follows prayers, leaving two dead."], ["2010.03.12", "Iraq", "Zoubaa", 1, 1, "Freedom fighters kill a young boy outside of a policeman's home."], ["2010.03.12", "Pakistan", "Lahore", 62, 85, "Over sixty innocents are sent to Allah by two Fedayeen suicide bombers."], ["2010.03.12", "Thailand", "Yala", 2, 2, "A respected police chief is murdered by Islamic bombers six months short of retirement."], ["2010.03.13", "Afghanistan", "Kandahar", 35, 52, "About thirty innocent people are incinerated by a series of paradise-seeking suicide bombers"], ["2010.03.13", "Iraq", "Baghdad", 3, 19, "Three Iraqis are taken down by a pair of Jihad blasts."], ["2010.03.13", "Pakistan", "Mingora", 17, 51, "Seventeen people at a courthouse are blown to bits by a Tehreek-e-Taliban suicide bomber pulling a rickshaw."], ["2010.03.13", "Pakistan", "Mohmand", 3, 0, "Three tribal members are machine-gunned to death by Religion of Peace radicals."], ["2010.03.14", "Afghanistan", "Marjah", 1, 0, "A reported beheading of a local civilian by the Taliban is confirmed."], ["2010.03.14", "India", "Srinagar", 1, 5, "Islamic militants lob a hand grenade at a police vehicle, killing one officer."], ["2010.03.14", "Iraq", "Mosul", 1, 0, "An imam leaving a mosque is gunned down by Religion of Peace rivals."], ["2010.03.14", "Iraq", "Mosul", 4, 2, "Four local cops are cut to pieces by Jihadi roadside bombers."], ["2010.03.14", "Pakistan", "Dera Ismail Khan", 1, 0, "Islamic terrorists kill a civilian with a landmine."], ["2010.03.14", "Pakistan", "Khyber", 2, 0, "An electrician is among two civilians shot to death by Islamic militants."], ["2010.03.15", "Afghanistan", "Ghazni", 3, 0, "Three civilians are shredded by a Taliban shrapnel bomb."], ["2010.03.15", "Iraq", "Fallujah", 8, 28, "A Shahid suicide bomber detonates among a group of laborers, leaving at least eight dead."], ["2010.03.15", "Iraq", "Khaldiya", 1, 0, "A Sunni cleric is assassinated by Religion of Peace rivals."], ["2010.03.15", "Iraq", "Mosul", 3, 2, "Three police are killed in separate Mujahideen attacks."], ["2010.03.15", "Somalia", "Mahaday", 1, 0, "The Christian pastor of an underground church is hunted down like an animal by Islamists and shot to death.  (He was not a convert to Islam)."], ["2010.03.16", "India", "Srinagar", 4, 9, "A salesman is among four people murdered in two separate attacks by Islamic snipers."], ["2010.03.16", "Iraq", "Mosul", 2, 0, "A woman and her daughter are gunned down by Sunni terrorists."], ["2010.03.16", "Iraq", "Mussayab", 8, 11, "Jihadis plant two bombs on a bus that leave eight dead and eleven more in agony."], ["2010.03.16", "Pakistan", "Kurram", 3, 0, "Three local tribesmen are killed in a botched kidnapping attempt by Taliban hardliners."], ["2010.03.16", "Thailand", "Narathiwat", 1, 1, "Islamic radicals shoot a 43-year-old Buddhist civilian to death."], ["2010.03.16", "Thailand", "Pattani", 1, 1, "Islamists shoot a 38-year old teacher to death in an attack that leaves his 7-year-old son injured."], ["2010.03.17", "Dagestan", "Vedeno", 3, 2, "Arab Jihadists gun down three local cops."], ["2010.03.17", "Iraq", "Mosul", 1, 0, "A 55-year-old Christian father is shot down in cold blood."], ["2010.03.17", "Nigeria", "Dyie", 13, 6, "Thirteen more Christian villagers are massacred by Muslim raiders in an overnight attack, including a mother and two children burned to death.  Victims also had their tongues cut out."], ["2010.03.17", "Pakistan", "Khyber", 5, 2, "Five security personnel are slain by an Islamist attack on a check post."], ["2010.03.17", "Thailand", "Yala", 1, 2, "Muslim militants murder a teenage boy and seriously injure his parents."], ["2010.03.18", "Dagestan", "Batayurt", 1, 0, "An investigator is ambushed and murdered by armed Muslims on his way home."], ["2010.03.18", "Iraq", "Baghdad", 1, 0, "Islamic terrorists murder a woman inside her home."], ["2010.03.18", "Iraq", "Mosul", 2, 1, "A woman in her home is among two people murdered by Islamic terrorists."], ["2010.03.18", "Iraq", "Sherquat", 2, 0, "Two men are abducted and beheaded by suspected al-Qaeda."], ["2010.03.18", "Israel", "Netiv Haasara", 1, 0, "A 30-year-old farm laborer is killed by a Palestinian rocket fired from Gaza."], ["2010.03.18", "Pakistan", "Bajaur", 1, 0, "Islamists gun down an off-duty policeman on his way home."], ["2010.03.18", "Pakistan", "Mohmand", 1, 0, "A young girl is taken out by a Taliban landmine."], ["2010.03.19", "Iraq", "Baghdad", 4, 7, "Four Iraqis are blown to bits by Mujahideen bombers."], ["2010.03.19", "Pakistan", "Kurram", 2, 3, "Islamists attack the houses of peace committee members, leaving two dead."], ["2010.03.19", "Thailand", "Pattani", 1, 0, "Muslim radicals gun down an auto parts salesman."], ["2010.03.20", "Pakistan", "Kurram", 1, 6, "A woman is killed in the crossfire when rival religious groups clash."], ["2010.03.20", "Pakistan", "Peshawar", 1, 0, "Hardliners beat a student to death for playing music, which they consider to be against Islamic teaching."], ["2010.03.20", "Pakistan", "Quetta", 4, 0, "Four Shias are shredded by gunfire in a suspected sectarian attack."], ["2010.03.20", "Somalia", "Kismayo", 1, 0, "Islamists gun down a rival."], ["2010.03.21", "Afghanistan", "Helmand", 10, 7, "Ten Afghans at a market are blown to bits by a Shahid suicide bomber."], ["2010.03.21", "Afghanistan", "Khost", 3, 3, "Three young men are killed when Islamists bomb a picnic area."], ["2010.03.21", "Iraq", "Garma", 2, 0, "A man and wife are shot to death in their home by al-Qaeda."], ["2010.03.21", "Iraq", "Mosul", 1, 0, "An elderly man is gunned down in his home by Islamic terrorists."], ["2010.03.21", "Iraq", "Yusufiya", 3, 5, "Three Iraqis are taken down by a roadside bomb."], ["2010.03.21", "Pakistan", "North Waziristan", 4, 0, "Tehreek-e-Taliban hardliners abduct and execute four local tribesmen."], ["2010.03.21", "Pakistan", "Quetta", 4, 5, "A suicide bomber on a bicycle pedals to paradise, taking four innocents with him."], ["2010.03.22", "Iraq", "Baghdad", 2, 0, "Two city workers are brutally shot to death by Muslim terrorists."], ["2010.03.22", "Iraq", "Mosul", 1, 0, "An electrician is murdered in front of his home by drive-by Jihadis."], ["2010.03.22", "Iraq", "Radwaniya", 2, 0, "Islamic 'insurgents' gun down two policemen."], ["2010.03.22", "Pakistan", "Rawalpindi", 1, 1, "A Christian dies after being burned alive three days earlier for refusing to embrace Islam.  His wife was also raped."], ["2010.03.23", "Iraq", "Balad Ruz", 1, 0, "Suspected al-Qaeda bombers take down a Sunni leader."], ["2010.03.23", "Pakistan", "Orakzai", 1, 0, "A tribal elder is abducted and executed by religious extremists."], ["2010.03.23", "Somalia", "Afgoye", 1, 0, "Islamists execute a Christian father of ten children at close range in front of his home."], ["2010.03.24", "Afghanistan", "Ghazni", 3, 0, "Three local cops are blasted to death by Taliban bombers."], ["2010.03.24", "Afghanistan", "Kabul", 2, 1, "Islamic militants stop a vehicle with a roadside bomb, then machine-gun the occupants."], ["2010.03.24", "Afghanistan", "Uruzgan", 2, 0, "Two men working for a land-mine clearing operation are murdered by Islamists."], ["2010.03.24", "Iraq", "Hit", 3, 2, "A teenage suicide bomber murders three people in their home."], ["2010.03.24", "Iraq", "Radwaniya", 5, 0, "Five Iraqi soldiers are shot to death execution style at a checkpoint."], ["2010.03.25", "Afghanistan", "Khost", 2, 4, "Two Afghan civilians are killed when Islamic hardliners attack a NATO base."], ["2010.03.25", "Iraq", "Baghdad", 2, 0, "A mother and daughter are brutally shot to death in their home by Muslim terrorists."], ["2010.03.25", "Iraq", "Baghdad", 2, 0, "Suspected al-Qaeda bombers murder a Sunni."], ["2010.03.25", "Iraq", "Ramadi", 1, 8, "A Shahid suicide bomber takes out an Iraqi."], ["2010.03.25", "Iraq", "Touz Khormato", 2, 6, "Two people are killed by Jihadi bombers."], ["2010.03.25", "Pakistan", "Orakzai", 2, 0, "Two tribal elders are abducted and beheaded by Religion of Peace radicals."], ["2010.03.26", "Afghanistan", "Khost", 1, 3, "An aid worker is killed when Talibanis fire on a group rebuilding a school."], ["2010.03.26", "Germany", "Berlin", 0, 3, "Two Jewish women and a man are brutally beaten after their identity is confirmed by Muslim attackers."], ["2010.03.26", "Iraq", "Khalis", 53, 105, "Two massive bomb blasts at a shopping area leave over fifty innocent people dead."], ["2010.03.26", "Israel", "Gaza Border", 2, 2, "Two Israeli soldiers are killed by Hamas gunfire."], ["2010.03.27", "Afghanistan", "Helmand", 1, 0, "A suicide bomber murders a British soldier clearing mines from a civilian road."], ["2010.03.27", "Afghanistan", "Kabul", 6, 7, "Children are among the casualties of three bombings that leave six civilians dead around the country."], ["2010.03.27", "Iraq", "Saadiya", 3, 1, "Islamic terrorists open fire on a group of civilians outside their home, killing three."], ["2010.03.27", "Somalia", "Mogadishu", 4, 2, "al-Shabaab Islamists kill four people, including a woman, with a roadside bomb."], ["2010.03.28", "Iraq", "Mosul", 1, 3, "A 3-year-old child dies when Mujahideen bombers target a Christian woman and her three daughters in their home."], ["2010.03.28", "Iraq", "Quaim", 6, 24, "Six people at a construction site are killed in a coordinated series of bomb blasts."], ["2010.03.28", "Pakistan", "Thal", 6, 0, "Six truck drivers bringing supplies to a Shia town are kidnapped and shot dead in captivity by Sunni radicals."], ["2010.03.28", "Somalia", "Mogadishu", 1, 0, "A Somali tribal elder is assassinated by suspected Hizbul-Islam militants."], ["2010.03.29", "Iraq", "Karbala", 12, 74, "A triple suicide bombing at a restaurant and an ambulance stand leaves a dozen dead."], ["2010.03.29", "Iraq", "Kirkuk", 1, 0, "Terrorists kidnap a police officer and shoot him to death."], ["2010.03.29", "Pakistan", "Kurram", 3, 0, "The Taliban kidnap and cut the throats of three tribal elders."], ["2010.03.29", "Pakistan", "Mamoond", 2, 8, "Two people are killed by a Fedayeen suicide bomber."], ["2010.03.29", "Pakistan", "Peshawar", 2, 3, "A teenage suicide bomber sends two Pakistanis to Allah."], ["2010.03.29", "Pakistan", "Tank", 1, 2, "A Shahid suicide bomber murders a civilian on his way home from a village defense meeting."], ["2010.03.29", "Russia", "Moscow", 38, 102, "Female suicide bombers massacre about forty subway commuters and leave another one-hundred in agony."], ["2010.03.29", "Thailand", "Yala", 1, 0, "A village chief is brutally gunned down at a wedding by Muslim separatists."], ["2010.03.30", "Afghanistan", "Herat", 5, 2, "The Taliban murder five civilians with a roadside bomb."], ["2010.03.30", "India", "Hyderabad", 1, 25, "Muslims attack a Hindu festival, burning cows, destroying property and stabbing a 22-year-old to death."], ["2010.03.30", "Iraq", "Mosul", 2, 0, "Two civilians are shot to death by Sunni militants."], ["2010.03.31", "Afghanistan", "Lashkar Gah", 13, 43, "A dozen people at a wheat market (including eight children) are blown to bits by a Jihad bicycle bomb."], ["2010.03.31", "Dagestan", "Kizlyar", 12, 23, "Two suicide bombers send twelve innocent souls to Allah, including rescue workers."], ["2010.03.31", "Iraq", "Mosul", 2, 0, "Sunni bombers take out a couple of local cops."], ["2010.03.31", "Pakistan", "Khyber", 6, 20, "Six security personnel are killed in a sustained attack by armed fundamentalists."], ["2010.03.31", "Thailand", "Pattani", 1, 0, "A 45-year-old civilian is shot twice in the back of the head by Muslim militants."], ["2010.03.31", "Thailand", "Pattani", 1, 2, "Islamic militants shoot one man to death and wound two others as they are watching TV in their home."], ["2010.04.01", "Iraq", "Baghdad", 2, 0, "A woman and girl are 'slaughtered' by suspected terrorists."], ["2010.04.01", "Pakistan", "Faisalabad", 3, 0, "Two brothers are among three members of the Ahmadi religious minority brutally gunned down on their way home from work."], ["2010.04.01", "Thailand", "Narathiwat", 6, 10, "Six Buddhist villagers are ambushed and shot to death by Religion of Peace radicals."], ["2010.04.02", "Afghanistan", "Khost", 3, 0, "Three security guards are killed by Sunni hardliners in two bombings."], ["2010.04.02", "India", "Rajouri", 1, 0, "Lashkar-e-Toiba members draw in and kill a soldier with a phony surrender offer."], ["2010.04.02", "Iraq", "Hor Rajib", 25, 6, "al-Qaeda Islamists roll into a village and tie up 20 men and five women, then shoot some to death and slit the throat of others."], ["2010.04.02", "Iraq", "Jalawla", 2, 1, "A boy and his father are killed by roadside bombers.  The boy's mother is injured."], ["2010.04.02", "Pakistan", "Kurram", 1, 1, "Islamic militants fire into a civilian vehicle, killing one occupant."], ["2010.04.02", "Somalia", "Mogadishu", 20, 62, "At least twenty civilians are killed in a 'relentless' assault by al-Shabaab on government positions."], ["2010.04.03", "Afghanistan", "Helmand", 3, 0, "Three Afghan cops are taken down by Taliban bombers."], ["2010.04.03", "Afghanistan", "Marja", 2, 4, "Women and children are among the casualties when a loaded tractor runs over a Taliban landmine."], ["2010.04.03", "Algeria", "Tifra", 8, 4, "Fundamentalists detonate two bombs an hour apart, sending eight souls to Allah."], ["2010.04.03", "Dagestan", "Kizlyar", 1, 0, "A cop is gunned down in an Islamic drive-by."], ["2010.04.03", "Iraq", "Baghdad", 41, 237, "Three bloody suicide blasts target the Iranian, Egyptian and German embassies, leaving at least forty dead."], ["2010.04.04", "Iraq", "Mosul", 3, 40, "Jihadis detonate a car bomb that kills at least three Iraqis."], ["2010.04.04", "Pakistan", "Mohmand", 3, 0, "Three villagers are cut down by a Taliban ambush."], ["2010.04.04", "Pakistan", "Punjab", 0, 10, "Ten Christians are severely beaten by Muslim fundamentalists."], ["2010.04.04", "Thailand", "Narathiwat", 3, 9, "Muslim terrorists open fire inside a tea shop, killing at least three civilians."], ["2010.04.05", "Ingushetia", "Karabulak", 2, 1, "Two Russian cops are murdered by a Fedayeen suicide bomber."], ["2010.04.05", "Iraq", "Baghdad", 6, 0, "Four children, ages 6 to 11, are among a family of six Shia massacred in their home by Sunni gunmen"], ["2010.04.05", "Iraq", "al-Shalamija", 2, 2, "Jihadi bombers take down two local cops."], ["2010.04.05", "Nigeria", "Jos", 3, 12, "Three Christians are killed when their peaceful rally is attacked by militant Muslims."], ["2010.04.05", "Pakistan", "Nasirabad", 2, 0, "A woman and her lover are shot by her brother in an honor killing."], ["2010.04.05", "Pakistan", "Peshawar", 4, 18, "Tehreek-e-Taliban attack the US consulate in a coordinated bombing and shooting attack that leaves four dead."], ["2010.04.05", "Pakistan", "Timergarah", 55, 80, "Fifty-five people at a political rally are dismembered by Mujahideen bombers."], ["2010.04.06", "Iraq", "Baghdad", 50, 187, "At least fifty Iraqi civilians, including children, are blown to Allah by dedicated Sunni bombers."], ["2010.04.07", "Afghanistan", "Jalalabad", 1, 15, "A Shahid suicide bomber murders a civilian."], ["2010.04.07", "Algeria", "Boumerdes", 1, 2, "Fundamentalists kill a civilian along a busy street."], ["2010.04.07", "India", "Kupwara", 1, 1, "Lashkar-e-Toiba terrorists shoot an Indian soldier to death."], ["2010.04.07", "Iraq", "Mosul", 2, 4, "Two civilians are murdered by Jihadi bombers."], ["2010.04.07", "Pakistan", "Hangu", 2, 0, "Two brothers are gunned down in their home by a religious extremist."], ["2010.04.07", "Russia", "Baksan", 2, 0, "Two police officers are gunned down in a brutal ambush by suspected Islamists."], ["2010.04.08", "Iraq", "Khalis", 2, 0, "Two civilians are shot dead at a marketplace by Mujahideen."], ["2010.04.08", "Iraq", "Shabak", 1, 1, "Islamic militants invade the home of a Shabak religious minority member and shoot him to death."], ["2010.04.08", "Nigeria", "Dakyo", 2, 0, "A teenager is among two Christians stabbed to death by Muslim attackers."], ["2010.04.09", "Ingushetia", "Ekazhevo", 1, 0, "A female suicide bomber walks up to a group of local cops and detonates, killing at least one of them."], ["2010.04.09", "Iraq", "Mosul", 2, 0, "Two Iraqis are murdered by Islamic gunmen along a city street."], ["2010.04.10", "Afghanistan", "Herat", 3, 8, "Three civilians are blown to bits by a Taliban bomb."], ["2010.04.10", "Afghanistan", "Kandahar", 2, 3, "A bomb and rocket attack on a home leave two Afghans dead and a mother and two daughters severely injured."], ["2010.04.10", "Iraq", "Fallujah", 1, 4, "A woman is the only fatality when an Islamic bomb breaks up a family gathering."], ["2010.04.10", "Iraq", "Mosul", 2, 0, "A 10-year-old child is among two people blown apart by Mujahid bombers."], ["2010.04.10", "Iraq", "Qayara", 3, 0, "Three Iraqis are taken down by Jihadi bombers."], ["2010.04.10", "Russia", "Nalchik", 1, 0, "Muslim terrorists are suspected in the car bombing death of a police officer."], ["2010.04.11", "Iraq", "Udhaim", 3, 1, "Three young brothers are dismembered by a terrorist bomb."], ["2010.04.11", "Pakistan", "Mardan", 1, 2, "A police officer is killed by an Islamist ambush."], ["2010.04.12", "Afghanistan", "Faryab", 4, 2, "Four police officers are murdered by Taliban bombers."], ["2010.04.12", "Afghanistan", "Kabul", 3, 4, "Three women die from trauma suffered during a Sunni mortar attack."], ["2010.04.12", "Iraq", "Baghdad", 5, 12, "A Fedayeen detonates along a city street, killing five innocents."], ["2010.04.12", "Iraq", "Mosul", 3, 15, "Three Iraqis are taken out by a Shahid suicide car bomber."], ["2010.04.12", "Somalia", "Mogadishu", 1, 0, "A university student is killed when Islamic militia mortar an airport."], ["2010.04.12", "Somalia", "Mogadishu", 6, 10, "Six Somalis are destroyed by coordinated al-Shabaab bombings."], ["2010.04.13", "Afghanistan", "Kandahar", 1, 0, "An 18-year-old woman is brutally shot to death by an Islamic fundamentalist."], ["2010.04.13", "Iraq", "Baghdad", 3, 5, "Suspected fundamentalists plant a shrapnel bomb at a liquor store shredding three patrons."], ["2010.04.13", "Pakistan", "Sargodha", 0, 1, "A Christian barber is badly beaten and sodomized by an angry mob for cutting a Muslim's beard (on request)."], ["2010.04.13", "Philippines", "Isabela", 9, 7, "Abu Sayyaf terrorists disguised as policemen attack a Christian town, shooting and blasting nine people to death and destroying a Catholic church."], ["2010.04.14", "Indonesia", "Jarkata", 3, 156, "Muslims enraged by a rumor of a revered scholar's tomb desecration attack security forces, hacking at least three to death."], ["2010.04.14", "Iraq", "Baghdad", 2, 6, "A Sunni cleric is cut down by Religion of Peace rivals outside his mosque. A separate al-Qaeda attack leaves another Iraqi dead."], ["2010.04.14", "Iraq", "Mosul", 2, 0, "A nurse is among two civilians gunned down by Islamic terrorists."], ["2010.04.14", "Thailand", "Narathiwat", 1, 0, "Islamic radicals murder a village defense volunteer by slashing the back of his head and letting him bleed to death."], ["2010.04.14", "USA", "Marquette Park, IL", 5, 2, "After quarrelling with his wife over Islamic dress, a Muslim convert shoots his family members to 'take them back to Allah' and out of the 'world of sinners'."], ["2010.04.15", "Afghanistan", "Kandahar", 6, 16, "A half dozen innocents are sent to Allah by Shahid suicide bomber."], ["2010.04.15", "Chechnya", "Achkhoi-Martan", 3, 1, "Holy Warriors rip apart three Russians with a roadside bomb."], ["2010.04.15", "Dagestan", "Krasny Voskhod", 1, 0, "A local village chieftain is shot for resisting Islamic insurgents."], ["2010.04.15", "Iraq", "Mosul", 4, 0, "Three women are among four civilians shot to death in their own home by Mujahideen."], ["2010.04.15", "Iraq", "Samarrah", 14, 0, "The bodies of fourteen kidnapping victims of a Sunni terror group are found in a mass grave."], ["2010.04.15", "Nigeria", "Boto", 2, 0, "A Christian pastor and his wife are abducted by Muslims and burned to a crisp."], ["2010.04.15", "Pakistan", "Mingora", 2, 0, "Teenage Talibanis gun down two people in broad daylight."], ["2010.04.15", "Thailand", "Pattani", 2, 1, "Muslim militants shoot three people, including a pork vendor."], ["2010.04.15", "Turkey", "Istanbul", 1, 0, "An entire family is involved in the 'honor' suffocation of a 2-day-old out-of-wedlock infant."], ["2010.04.15", "Yemen", "Shabwa", 2, 1, "Separate al-Qaeda bomb blasts leave two people dead."], ["2010.04.16", "Iraq", "Baaj", 2, 0, "Islamists kidnap two men and shoot them in the back of the head."], ["2010.04.16", "Pakistan", "Quetta", 10, 35, "A suicidal Sunni detonates in a crowd of Shia protesters outside a hospital, sending at least ten to Allah."], ["2010.04.17", "Iraq", "Basra", 1, 2, "Islamists gun down a woman and injure her husband and son."], ["2010.04.17", "Pakistan", "Kohat", 41, 62, "Two suicide bombers, dressed in burqas, blow up forty-one refugees lining up for food at a displaced persons camp."], ["2010.04.18", "Iran", "Urmiye Prison", 2, 0, "The Islamic republic tortures to Kurdish prisoners to death on the same day."], ["2010.04.18", "Iraq", "Bartala", 1, 0, "A member of the Shabak religious minority is kidnapped and murdered."], ["2010.04.18", "Iraq", "Mosul", 4, 0, "Three women are among four civilians shot to death in their home by Mujahideen."], ["2010.04.18", "Pakistan", "Peshawar", 7, 26, "A child is among seven people blown into pieces by a Shahid car bomber."], ["2010.04.18", "Somalia", "Mogadishu", 16, 24, "Islamists murder sixteen people with a landmine and mortar attack on an airport."], ["2010.04.19", "Afghanistan", "Kabul", 2, 6, "A suicide bomber kills two soldiers at their base."], ["2010.04.19", "Afghanistan", "Kandahar", 1, 0, "A popular politician is assassinated by hardliners at a mosque."], ["2010.04.19", "Afghanistan", "Kandahar", 3, 4, "Three children are brutally killed when Islamists set off a bomb hidden in a donkey cart."], ["2010.04.19", "Iraq", "Baqubah", 2, 2, "Jihadi bombers take down two civilians."], ["2010.04.19", "Nigeria", "Riyom", 4, 0, "Four Christian farmers are murdered in their field by Muslim terrorists."], ["2010.04.19", "Pakistan", "Landikotal", 1, 1, "Islamists send a mortar into a school principal's home, killing a woman and injuring her daughter."], ["2010.04.19", "Pakistan", "Peshawar", 1, 15, "A young boy is killed when a Fedayeen suicide bomber attacks a school."], ["2010.04.19", "Pakistan", "Peshawar", 25, 48, "About two dozen patrons at a market are sent to Allah by a Holy Warrior in a suicide vest."], ["2010.04.19", "Pakistan", "Swat", 2, 3, "Two villagers sitting outside a shop are gunned down by Mujahideen."], ["2010.04.20", "Dagestan", "Makhachkala", 3, 0, "Islamic militants ambush two policemen with automatic weapons."], ["2010.04.20", "Iraq", "Hit", 3, 0, "Three Iraqis are murdered by a roadside bomb."], ["2010.04.20", "Iraq", "Tarmiyah", 5, 0, "Three young children are beheaded along with two women in a home by suspected al-Qaeda."], ["2010.04.20", "Pakistan", "Hangu", 4, 12, "Four locals are blown to bits by Sunni bombers."], ["2010.04.20", "Pal. Auth.", "Surif", 1, 0, "A 20-year-old woman is tied up and thrown down a well by her conservative family for dating the wrong man."], ["2010.04.21", "India", "Jammu", 1, 0, "Mujahideen shoot an Indian police officer to death."], ["2010.04.21", "Iraq", "Baghdad", 2, 0, "Two victims of sectarian violence are found dead."], ["2010.04.21", "Iraq", "Baqubah", 3, 14, "Jihadis bomb a restaurant near a school, a teacher and student are among three who die from shrapnel."], ["2010.04.21", "Pakistan", "Khyber", 1, 4, "A woman is killed, and her four children injured, by mortar shell fired by suspected militants."], ["2010.04.21", "Pakistan", "Sargodha", 1, 1, "Two young Christian brothers (ages 12 and 14) are beaten with an iron rod by a Muslim yelling religious slurs.  One dies."], ["2010.04.21", "Somalia", "Mogadishu", 5, 0, "Five construction workers are kidnapped and beheaded by Islamic fundamentalists."], ["2010.04.21", "Thailand", "Narathiwat", 1, 0, "Islamists shoot a 20-year-old man to death in his home."], ["2010.04.21", "Thailand", "Pattani", 1, 0, "A 56-year-old man is murdered by Muslim gunmen."], ["2010.04.21", "Thailand", "Pattani", 2, 52, "An Islamic insurgent throws a grenade into a group of policemen."], ["2010.04.22", "Iraq", "Souz", 1, 3, "Terrorists set off a bomb at a home, killing a resident."], ["2010.04.22", "Pakistan", "Charsadda", 4, 0, "The Taliban spray a car with automatic weapons, slaying the four occupants."], ["2010.04.22", "Thailand", "Narathiwat", 1, 0, "A young man is gunned down by Muslim radicals at a nightclub."], ["2010.04.23", "England", "Leicester", 0, 1, "A Sikh man is brutally beaten by a gang of Muslims, who shout \"Allah\" during the attack and pull off his religious necklace."], ["2010.04.23", "Iraq", "Baghdad", 69, 303, "Devoted Sunnis slaughter seventy Shiite Iraqis in at least five deadly bomb blasts at mosques, homes and a shopping district."], ["2010.04.23", "Pakistan", "Datta Khel", 7, 16, "Religious extremists ambush a Pakistani military convoy, killing seven."], ["2010.04.23", "Pakistan", "Miranshah", 4, 0, "Four captives are butchered by Islamic hardliners, two of whom are beheaded."], ["2010.04.24", "Iraq", "Baghdad", 3, 19, "Jihadis bomb a marketplace, taking down three Iraqis."], ["2010.04.24", "Iraq", "Mosul", 3, 0, "Two civilians and one defense volunteer are gunned down by Muslim militants."], ["2010.04.24", "Nigeria", "Jos", 5, 0, "Three Christians stabbed to death and two others hacked to pieces with machetes by a Muslim mob."], ["2010.04.24", "Pakistan", "Akwal", 3, 1, "Three guards are gunned down when Taliban terrorists attack NATO tankers."], ["2010.04.24", "Pakistan", "Karachi", 1, 0, "A Christian police officer is kidnapped and brutally tortured to death by Religion of Peace advocates."], ["2010.04.24", "Somalia", "Mogadishu", 2, 2, "al-Shabaab Islamists kill two government soldiers with a landmine."], ["2010.04.25", "Afghanistan", "Zabul", 4, 12, "A suicide bomber detonates at a bazaar, blowing four innocents straight to Allah."], ["2010.04.25", "Thailand", "Pattani", 1, 4, "Islamists fire on a garbage truck, killing one worker."], ["2010.04.26", "Afghanistan", "Kunduz", 3, 4, "Three people die from a Taliban rocket attack."], ["2010.04.26", "India", "Budgam", 1, 1, "Islamic militants gun down a local cop."], ["2010.04.26", "Iraq", "Baqubah", 2, 7, "Two people are murdered in separate Mujahideen bomb blasts."], ["2010.04.26", "Iraq", "Fallujah", 3, 2, "Three Iraqis are taken out by Jihadi bombers."], ["2010.04.27", "Afghanistan", "Kandahar", 3, 35, "A Fedayeen suicide bomber sends three airport workers to Allah."], ["2010.04.27", "Iraq", "Baghdad", 2, 12, "Two local soldiers are killed when Jihadis fire mortars from a residential neighborhood."], ["2010.04.27", "Iraq", "Baghdad", 4, 2, "A family of four is obliterated by sectarian bombers."], ["2010.04.27", "Iraq", "Kirkuk", 1, 1, "Jihadis take down a student in a drive-by attack."], ["2010.04.27", "Somalia", "Afgoi", 1, 0, "A respected humanitarian worker is shot to death by suspected Hizbul Islam."], ["2010.04.27", "Somalia", "Mogadishu", 2, 8, "Islamists attack a rival mosque, killing two."], ["2010.04.28", "Afghanistan", "Khost", 12, 0, "Islamic hardliners murder a dozen civilians, mostly women and children, with a roadside bomb."], ["2010.04.28", "Iraq", "Baghdad", 6, 18, "Jihadi bombers manage to take down six Iraqis along a city street."], ["2010.04.28", "Pakistan", "Peshawar", 4, 15, "A Shahid suicide car bomber plows into a group of Pakistanis, killing at least four."], ["2010.04.28", "Pakistan", "Quetta", 1, 0, "A Christian man is gunned down by suspected Muslim militants as he is washing a car."], ["2010.04.28", "Thailand", "Pattani", 1, 2, "A 41-year-old female health volunteer is shot in the head by Muslim rebels."], ["2010.04.28", "Yemen", "Damaj", 4, 0, "Shiite rebels kill four people in two separate attacks."], ["2010.04.29", "Dagestan", "Kazbekovsky", 2, 17, "Two local cops are blown to bits by a Fedayeen suicide bomber."], ["2010.04.29", "Iraq", "Baghdad", 1, 0, "A car bomb at a rival mosque leaves one dead."], ["2010.04.29", "Iraq", "Baghdad", 8, 20, "Suspected fundamentalists bomb a liquor store, killing eight civilians."], ["2010.04.29", "Somalia", "El Bahay", 6, 10, "Six people are taken out by an al-Shabaab attack on a village."], ["2010.04.30", "France", "Strasbourg", 0, 1, "A Jewish man is stabbed in the neck and hit in the face with an iron bar by a Muslim yelling about a Zionist conspiracy."], ["2010.04.30", "India", "Batamaloo", 1, 0, "Angry Muslims stone an innocent civilian to death over the cancellation of a religious march."], ["2010.04.30", "Iraq", "Garma", 3, 10, "Three patrons are killed when Islamic militants toss a bomb into a marketplace."], ["2010.04.30", "Pakistan", "Karachi", 1, 5, "Islamists murder a civilian with a bomb attached to a motorcycle."], ["2010.04.30", "Pakistan", "Karam Kot", 1, 0, "The body of a brutally slain intelligence officer is found three weeks after being kidnapped."], ["2010.05.01", "Iraq", "Baghdad", 3, 2, "Three Iraqis are killed by a car bomb."], ["2010.05.01", "Iraq", "Mosul", 1, 0, "Sectarian Jihadis gun down a teacher leaving a mosque."], ["2010.05.01", "Pakistan", "Swat", 3, 12, "Three innocents are incinerated by a suicide bomber at a shop."], ["2010.05.01", "Russia", "Nalchik", 1, 29, "Muslim radicals set off a bomb at a race track, killing an elderly veteran of World War II."], ["2010.05.01", "Somalia", "Mogadishu", 45, 70, "Forty-five people die from shrapnel and burn injuries when Islamists bomb a rival mosque."], ["2010.05.02", "Afghanistan", "Paktia", 8, 14, "Religion of Peace hardliners massacre a busload of women and children with a roadside bomb."], ["2010.05.02", "Iraq", "Mosul", 4, 171, "Four people are killed, and over one-hundred injured when Islamic bombers target buses carrying young Christian students."], ["2010.05.02", "Pakistan", "Swat", 1, 3, "A young woman is killed when religious extremists throw a grenade into her home."], ["2010.05.02", "Somalia", "Kismayo", 2, 12, "Two people are killed when Muslim terrorists toss a grenade into a rival mosque."], ["2010.05.03", "Afghanistan", "Khost", 1, 2, "A civilian is blown to bits by a Shahid suicide bomber."], ["2010.05.03", "Iraq", "Kirkuk", 1, 0, "An accused sorcerer is shot to death outside his home."], ["2010.05.03", "Iraq", "Sharqat", 2, 4, "Jihadi bombers take down two Iraqis."], ["2010.05.04", "Afghanistan", "Kunduz", 3, 0, "Three civilians are captured and executed by the Taliban."], ["2010.05.04", "Iraq", "Mosul", 3, 0, "Freedom fighters gun down a pharmacist, woman, and rival imam in separate attacks."], ["2010.05.04", "Somalia", "Hawa Abdi", 1, 0, "A man is assassinated by Islamic gunmen as he leaves a mosque."], ["2010.05.04", "Somalia", "Xarardheere", 1, 0, "Islamists pull a 57-year-old Christian father of three from his home and execute him for running an underground church."], ["2010.05.05", "Afghanistan", "Nimruz", 4, 15, "A woman is among four Afghans murdered by a Fedayeen assault on a government building."], ["2010.05.05", "Iraq", "Ameriya", 4, 0, "Four people, including a rival imam are murdered by Sunni gunmen."], ["2010.05.05", "Iraq", "Mosul", 1, 0, "A college student is kidnapped and murdered by Ansar al-Islam."], ["2010.05.05", "Iraq", "Mosul", 2, 1, "Islamic terrorists gun down two Iraqis in cold blood."], ["2010.05.05", "Somalia", "Mogadishu", 1, 0, "An anti-Islamist journalist is kidnapped and slain by his abductors."], ["2010.05.06", "India", "Rafiabad", 2, 0, "Two security personnel are killed when Mujahid open fire on them from a house."], ["2010.05.06", "Iraq", "Baghdad", 2, 4, "Jihadi bombers take down two locals at a town square."], ["2010.05.06", "Pakistan", "Bahawalnagar", 1, 0, "A 15-year-old teenager dies from shrapnel injuries after militants throw a grenade into his home."], ["2010.05.06", "Pakistan", "Cantt", 1, 0, "A civilian is murdered by a Shahid suicide bomber."], ["2010.05.06", "Thailand", "Yala", 1, 0, "A 52-year-old man is shot to death by Mujahideen while sitting in this truck"], ["2010.05.07", "Dagestan", "Derbent", 1, 5, "A woman standing on a railway platform is shredded by a Jihad bomb."], ["2010.05.07", "Iraq", "Mosul", 1, 0, "A 16-year-old boy dies from gunshot wounds to the head, suffered during an Ansar al-Islam kidnapping."], ["2010.05.07", "Iraq", "Rashad", 3, 4, "Three Iraqis are taken down in a suspected al-Qaeda ambush."], ["2010.05.07", "Pakistan", "Ghazi Kot", 4, 1, "Religious extremists machine-gun four local cops taking shelter from the rain inside a shed."], ["2010.05.07", "Somalia", "Shabelle", 4, 10, "Four hospital guards are shot dead by Hizbul Islam members while working their post."], ["2010.05.08", "Afghanistan", "Herat", 4, 0, "Talibanis behead four Afghans."], ["2010.05.08", "Iraq", "Amirli", 3, 5, "A mother and her son are among three killed when Islamic terrorists plant a bomb in a home."], ["2010.05.08", "Iraq", "Mosul", 3, 2, "A woman is among three people gunned down in separate Mujahideen attacks."], ["2010.05.09", "India", "Ganderbal", 1, 0, "Hizb-ul-Mujahideen murder the young brother of a former militant in his home in revenge for his leaving."], ["2010.05.09", "Iraq", "Mosul", 1, 0, "An elderly man is shot to death in front of his home by terrorists."], ["2010.05.09", "Iraq", "Tehran", 5, 0, "The Islamic Republic executes five political prisoners, calling them 'enemies of Allah.'"], ["2010.05.09", "Philippines", "Cotabato", 1, 9, "Militant Muslims are suspected of tossing a grenade into a rival mosque, leaving at least one dead."], ["2010.05.10", "Iraq", "Baghdad", 114, 350, "Suicide bombings at a textiles factory and a wave of other terror attacks on Iraqis, including at marketplaces and mosques, leave over one-hundred dead."], ["2010.05.10", "Pakistan", "Karachi", 1, 0, "A Shia doctor and father of two is gunned down in a sectarian attack."], ["2010.05.10", "Pakistan", "Orakzai", 9, 5, "Islamic fundamentalists attack a local army post, killing nine defenders."], ["2010.05.10", "Switzerland", "Hongg", 1, 0, "A 16-year-old girl is honor killed by her father with an axe."], ["2010.05.11", "Afghanistan", "Kandahar", 1, 0, "Islamic hardliners shoot a civilian to death inside his home."], ["2010.05.11", "Iraq", "Baghdad", 5, 16, "A Christian community may have been the target of a double bombing that leaves five dead."], ["2010.05.12", "Afghanistan", "Kandahar", 1, 0, "Islamic militants claim credit for the targeted assassination of a prison official."], ["2010.05.12", "Afghanistan", "Uruzgan", 3, 0, "A Fedayeen suicide bomber takes out three local cops."], ["2010.05.12", "Iraq", "Baghdad", 7, 22, "Jihadis detonate a bomb outside a cafe, murdering seven patrons."], ["2010.05.12", "Iraq", "Baghdad", 9, 39, "Nine Iraqis are brought down by two terrorist bombings."], ["2010.05.12", "Pakistan", "Chaman", 2, 2, "A teenager is among two killed when Muslim extremists blow up a tanker truck."], ["2010.05.12", "Pakistan", "North Waziristan", 2, 0, "Tehreek-e-Taliban members kidnap and shoot two civilians to death."], ["2010.05.12", "Pakistan", "Peshawar", 3, 3, "Islamic bombers send three seminary students to Allah."], ["2010.05.12", "Somalia", "Mogadishu", 1, 5, "An al-Shabaab bombing leaves one person dead."], ["2010.05.13", "Dagestan", "Makhachkala", 8, 4, "Eight workers on their way to repair a cell phone tower are blown to bits by Islamic bombers."], ["2010.05.13", "Iraq", "Baghdad", 5, 12, "Five Iraqis are sent to paradise by Mujahideen bombers."], ["2010.05.13", "Pakistan", "Karachi", 1, 0, "A child is shot dead in a suspected sectarian attack."], ["2010.05.14", "Afghanistan", "Ghazni", 5, 0, "Five private security guards are murdered in a Muslim ambush."], ["2010.05.14", "India", "Hyderabad", 1, 0, "Tehreek Galba-e-Islam terrorists on a motorcycle gun down a cop."], ["2010.05.14", "India", "Srinagar", 1, 5, "One officer is killed when Islamists hurl a grenade toward a group of local cops."], ["2010.05.14", "Iraq", "Baghdad", 4, 8, "Four people are killed when terrorists detonate a bomb at a park."], ["2010.05.14", "Iraq", "Jbala", 0, 20, "Twenty Shias are injured when rivals blow up their mosque."], ["2010.05.14", "Iraq", "Mosul", 1, 0, "A tailor who makes military uniforms is shot to death by Mujahideen."], ["2010.05.14", "Iraq", "Tal Afar", 25, 108, "Muslim terrorists stage a huge suicide bombing on a soccer game, leaving at least two dozen spectators dead."], ["2010.05.14", "Thailand", "Narathiwat", 1, 0, "Islamists shoot a public health official six times in the chest and head."], ["2010.05.15", "Afghanistan", "Khost", 4, 0, "The Taliban kidnap and brutally slaughter four Afghan members of a wedding party, including the groom."], ["2010.05.15", "Iraq", "Mosul", 3, 0, "A child, shepherd and mosque official are killed in separate Mujahid attacks."], ["2010.05.15", "Yemen", "Hibailin", 1, 2, "Suspected al-Qaeda assassinate a guard."], ["2010.05.16", "Afghanistan", "Herat", 2, 2, "Two Italian peacekeepers succumb to injuries from a roadside bombing."], ["2010.05.16", "Afghanistan", "Kandahar", 1, 0, "Muslim gunmen on a motorcycle murder a man sitting in his car."], ["2010.05.16", "Afghanistan", "Kunar", 3, 0, "A pro-peace cleric is gunned down along with two family members by Islamic hardliners."], ["2010.05.16", "Somalia", "Mogadishu", 16, 31, "Sixteen civilians are killed during a vicious mortar attack by Islamic militia."], ["2010.05.17", "Iraq", "Sadiyah", 1, 0, "al-Qaeda behead a rival cleric and hang his head from a utility pole."], ["2010.05.17", "Iraq", "al-Bushaneen", 1, 0, "A cleric is shot to death in front of his family by Muslim radicals."], ["2010.05.17", "Pakistan", "Tank", 1, 0, "A pro-government tribal elder is murdered by Islamists on his way home."], ["2010.05.17", "Thailand", "Pattani", 1, 0, "Three Muslims shoot a Buddhist public works official to death."], ["2010.05.17", "Thailand", "Yala", 1, 0, "A Buddhist school administrator is murdered by Muslim assassins on his way to work."], ["2010.05.18", "Afghanistan", "Kabul", 1, 9, "A Taliban rocket attack kills a US citizen."], ["2010.05.18", "Afghanistan", "Kabul", 18, 47, "At least eighteen people are massacred by a Fedayeen suicide bomber."], ["2010.05.18", "India", "Poonch", 2, 3, "Two Indian soldiers are murdered in a Jihad ambush."], ["2010.05.18", "Iraq", "Yathrib", 2, 1, "Islamic terrorists blow up two Iraqi women in their home."], ["2010.05.18", "Pakistan", "Dera Ismail Khan", 14, 17, "A bicycle bomber blasts fourteen souls to Allah, including a small girl."], ["2010.05.19", "Algeria", "Boumerdes", 2, 18, "An al-Qaeda roadside blast takes out two local soldiers."], ["2010.05.19", "Iraq", "Mosul", 2, 1, "Mujahideen gun down two local soldiers at a checkpoint."], ["2010.05.19", "Iraq", "Mussayab", 6, 19, "Six people at a restaurant are blown to bits by Islamic bombers."], ["2010.05.19", "Philippines", "Basilan", 2, 2, "Abu Sayyaf militants ambush and kill two policemen."], ["2010.05.19", "Russia", "Dagestan", 3, 0, "Muslim radicals gun down two local cops and kill a third with a bomb in neighboring Chechnya."], ["2010.05.19", "Somalia", "Mogadishu", 1, 0, "An African peacekeeper is taken out by an Islamist bomb."], ["2010.05.19", "Somalia", "Mogadishu", 2, 0, "Two children are killed when Islamic militia fire a mortar into their home."], ["2010.05.19", "Thailand", "Yala", 1, 0, "A 46-year-old civilian is shot and then set on fire by Religion of Peace separatists."], ["2010.05.20", "Iraq", "Mosul", 3, 8, "A Shahid suicide bomber takes out three Iraqis."], ["2010.05.20", "Pakistan", "North Waziristan", 2, 0, "The Taliban strap explosives to two civilians and detonate them in a public execution."], ["2010.05.20", "Thailand", "Narathiwat", 1, 0, "Muslim gunmen murder a 56-year-old villager."], ["2010.05.20", "Thailand", "Yala", 1, 0, "A Buddhist woman is gunned down in her grocery story by Muslim terrorists."], ["2010.05.21", "Iraq", "Diyala", 35, 69, "A Fedayeen drives an explosives-laden minibus into a crowd of shoppers and cafe patrons."], ["2010.05.21", "Iraq", "Muqdadiya", 4, 1, "Mujahideen invade a home and shoot four family members to death."], ["2010.05.21", "Pakistan", "Mir Ali", 1, 0, "Hardliners abduct and murder a local tribesman."], ["2010.05.21", "Somalia", "Mogadishu", 3, 5, "Three civilians are killed during an al-Shabaab attack."], ["2010.05.21", "Thailand", "Pattani", 1, 0, "Holy Warriors shoot a Buddhist nurse in the head as she is riding to work."], ["2010.05.22", "Afghanistan", "Kandahar", 3, 0, "A civilian and two military engineers are killed by a Taliban roadside bomb."], ["2010.05.22", "Iraq", "Mosul", 2, 4, "Two Iraqis are taken out in a bomb blast."], ["2010.05.22", "Pakistan", "Baizai", 1, 3, "A member of a peace committee is murdered in an Islamist ambush."], ["2010.05.22", "Pakistan", "FATA", 1, 0, "A tribesman, abducted the Taliban, is found dead."], ["2010.05.22", "Russia", "Prokladnyi", 3, 0, "Two women and one man are gunned down in cold blood by suspected Islamic insurgents."], ["2010.05.22", "Somalia", "Mogadishu", 20, 55, "Twenty civilians are crushed and dismembered during an Islamic mortar attack."], ["2010.05.22", "Thailand", "Narathiwat", 2, 0, "Two civilians are shot to death by Muslim terrorists."], ["2010.05.22", "Thailand", "Yala", 2, 0, "Two women, one of whom was pregnant, are murdered in cold blood by Mujahid gunmen."], ["2010.05.23", "India", "Sopore", 1, 0, "Islamic militants are suspected in the murder of a local official."], ["2010.05.23", "Nigeria", "Jos", 2, 0, "Two Christians are hacked to death with machetes by passing Muslims."], ["2010.05.24", "Afghanistan", "Farah", 5, 8, "Five civilians riding a bus are blown to bits by Taliban bombers."], ["2010.05.24", "Afghanistan", "Faryab", 1, 2, "Taliban terrorists assassinate an Afghan elder and peace advocate."], ["2010.05.24", "Afghanistan", "Khost", 6, 0, "Six residents of a small village are shot to death in cold blood by Islamic fundamentalists."], ["2010.05.24", "Iraq", "Mosul", 1, 0, "An elderly woman is murdered inside her home by Mujahideen."], ["2010.05.24", "Iraq", "Mosul", 2, 1, "Religious extremists assassinate a secular lawmaker and his driver."], ["2010.05.24", "Iraq", "Ramadi", 1, 0, "Jihadis kill a young man with a bomb planted outside his kitchen."], ["2010.05.24", "Pakistan", "Quetta", 2, 15, "Women and children are among the casualties when Sunni bombers target a Shia scholar."], ["2010.05.25", "Iraq", "Baghdad", 15, 3, "al-Qaeda radicals gun down fifteen people working at a gold market."], ["2010.05.25", "Philippines", "Talipao", 3, 3, "Three members of a family are blown apart, when Abu Sayyaf members throw a grenade into their home."], ["2010.05.26", "Iraq", "Mosul", 3, 0, "Three policemen are murdered by Mujahideen."], ["2010.05.26", "Pakistan", "Lahore", 1, 0, "Terrorists murder a lawyer outside a courthouse with a grenade."], ["2010.05.26", "Russia", "Starvropol", 7, 40, "Two young girls are among seven killed when terrorists bomb a concert hall."], ["2010.05.26", "Somalia", "Mogadishu", 6, 20, "Six people are counted dead following an al-Shabaab militia attack around a city square."], ["2010.05.26", "Thailand", "Yala", 2, 52, "Islamic militants set off a bomb in front of a car dealership, killing two people."], ["2010.05.27", "Iraq", "Mosul", 1, 11, "Mujahid gun down a civilian and mortar a factory, wounding eleven people."], ["2010.05.27", "Pakistan", "Bajur", 3, 1, "A married couple and their son are brutally gunned down in their home by Islamic fundamentalists."], ["2010.05.28", "Pakistan", "Faisalabad", 0, 5, "Muslims fire into a Christian community, hitting five innocents."], ["2010.05.28", "Pakistan", "Karachi", 1, 0, "One person is killed when rival Islamic sects clash."], ["2010.05.28", "Pakistan", "Lahore", 98, 110, "Orthodox Sunni terrorists stage a bloody grenade and firearms assault on two mosques belonging to a minority sect.  Nearly one hundred worshippers are murdered."], ["2010.05.28", "Pakistan", "Quetta", 4, 0, "Lashkar-e-Jhangvi gunmen take down four policemen at point-blank range."], ["2010.05.28", "Somalia", "Mogadishu", 3, 1, "Two children are among three civilians blown to bits by Islamic militia bombers."], ["2010.05.29", "Dagestan", "Kaspiysk", 1, 2, "Islamic militants send a police officer to Allah with a roadside bomb."], ["2010.05.29", "Iraq", "Mosul", 2, 0, "Terrorists gun down a farmer and his son in their field."], ["2010.05.29", "Pakistan", "Lahore", 3, 1, "Three police officers are cut down by Islamic gunmen at a checkpoint."], ["2010.05.30", "Afghanistan", "Badakhshan", 7, 1, "Taliban fundamentalists murder seven local cops with a roadside bomb."], ["2010.05.30", "Afghanistan", "Khost", 19, 23, "A Fedayeen suicide bomber takes out nearly twenty local recruits."], ["2010.05.30", "Dagestan", "Botayurt", 1, 1, "Muslim militants fire into a cafe, killing a patron."], ["2010.05.30", "Iraq", "Mosul", 1, 3, "One civilian is killed in a shooting attack by Muslim radicals."], ["2010.05.30", "Thailand", "Pattani", 1, 0, "A 50-year-old Buddhist is shot to death by four Muslims while sitting in a tea shop."], ["2010.05.31", "Ingushetia", "Malgobek", 1, 2, "Islamic militants kill an off-duty policeman at a gas station."], ["2010.05.31", "Iraq", "Baghdad", 2, 10, "Jihadis gun down a man sitting in a cafe and successfully kill a civilian in a separate bomb attack."], ["2010.05.31", "Jordan", "Amman", 1, 0, "A 20-year-old woman is stabbed to death by her older brother in an honor killing."], ["2010.05.31", "Pakistan", "Lahore", 6, 6, "Six people are killed when Islamic militants storm a hospital."], ["2010.05.31", "Pakistan", "Quetta", 2, 0, "A prayer leader and his companion are murdered by sectarian rivals."], ["2010.06.01", "Iraq", "Mosul", 3, 1, "Mujahid successfully kill three Iraqis with an incendiary bomb."], ["2010.06.01", "Pakistan", "Karachi", 1, 0, "A Shia is brutally shot to death in a sectarian attack."], ["2010.06.01", "Pakistan", "Mohmand", 3, 0, "Three civilians are gunned down by Taliban militants."], ["2010.06.01", "Pakistan", "Muslimabad", 2, 0, "A woman and her new husband are murdered by her former in-laws in an honor killing."], ["2010.06.02", "Afghanistan", "Marjah", 4, 0, "Four civilians are killed in their home during a Taliban ambush on a security patrol."], ["2010.06.02", "Afghanistan", "Nawzad", 4, 0, "Two young boys are among four civilians taken out by Islamist roadside bomb."], ["2010.06.02", "Dagestan", "Gubden", 1, 0, "A year after murdering a forester, Islamic radicals return to the home and kill his son as well."], ["2010.06.02", "Iraq", "Abu Ghraib", 1, 3, "A Jihad bomb blast leaves one Iraqi dead."], ["2010.06.02", "Iraq", "Mosul", 1, 0, "Islamic militants kidnap a local soldier and slit his throat."], ["2010.06.03", "Iraq", "Abu Ghraib", 8, 0, "Eight victims of a Shiite death squad are found in a mass grave."], ["2010.06.03", "Iraq", "Sinjar", 4, 14, "Four people are killed when Islamic fundamentalist bombers target and liquor stores."], ["2010.06.03", "Pakistan", "Quetta", 2, 0, "A man murders his sister and her lover for having 'illicit relations'."], ["2010.06.03", "Pakistan", "Sahiwal", 0, 3, "A pastor and his pregnant wife are brutally assaulted by angry Muslims accusing them of evangelism."], ["2010.06.03", "Somalia", "Mogadishu", 2, 5, "Two Ugandan peacekeepers are murdered by al-Shabaab terrorists."], ["2010.06.03", "Thailand", "Pattani", 1, 0, "A Buddhist schoolteacher is gunned down by Religion of Peace proponents."], ["2010.06.03", "Turkey", "Iskenderun", 1, 0, "A Catholic bishop is stabbed to death by a Muslim who says it was Allah's will."], ["2010.06.04", "Dagestan", "Makhachkala", 1, 1, "Muslim radicals shoot a rival imam to death in front of his mosque."], ["2010.06.04", "Ingushetia", "Malgobek", 1, 16, "An attack on a shop by Islamic militants leaves one person dead."], ["2010.06.04", "Ingushetia", "Sagapshi", 2, 21, "A grocery store clerk is gunned down by Islamists who plant a bomb that then kills a rescue worker."], ["2010.06.04", "Iraq", "Missan", 2, 2, "Two Iraqis are killed when Muslim radicals rocket an airport."], ["2010.06.04", "Iraq", "Mosul", 2, 4, "Terrorists murder two civilians with a roadside bomb."], ["2010.06.04", "Pakistan", "Datta Khel", 1, 0, "An elderly man is beheaded by Religion of Peace zealots."], ["2010.06.04", "Pakistan", "Miranshah", 1, 0, "A civilian is captured by the Taliban and shot to death."], ["2010.06.04", "Philippines", "Basilan", 3, 0, "Abu Sayyaf members kidnap and murder three villagers.  The victims were manual laborers."], ["2010.06.04", "Philippines", "Sumisip", 2, 1, "Two residents are killed when Abu Sayyaf fire into a village."], ["2010.06.05", "Afghanistan", "Kandahar", 1, 15, "Muslim terrorists set off a bicycle bomb in front of a Red Cross office, killing a bystander."], ["2010.06.05", "Iraq", "Mosul", 2, 0, "Two politicians are assassinated by Muslim terrorists in separate attacks."], ["2010.06.05", "Pakistan", "Khyber", 2, 0, "Two passersby are killed in a shootout between rival Islamist groups."], ["2010.06.05", "Yemen", "Marib", 3, 0, "An al-Qaeda ambush leaves three locals dead."], ["2010.06.06", "Afghanistan", "Kandahar", 1, 11, "At least one person is killed by a Taliban roadside attack."], ["2010.06.06", "Iraq", "Baghdad", 6, 18, "Six people are ripped apart by two Jihad bomb blasts."], ["2010.06.06", "Thailand", "Narathiwat", 1, 0, "A 34-year-old man is gunned down in front of his home by Muslim radicals."], ["2010.06.06", "Thailand", "Pattani", 3, 0, "Three Buddhist workers, including a woman, are shot to death by Islamic terrorists on a shrimp farm."], ["2010.06.07", "Afghanistan", "Kandahar", 2, 0, "An American civilian training Afghan police officers is among two killed in a Fedayeen attack."], ["2010.06.07", "Algeria", "Bejaia", 3, 5, "Fundamentalists kill three security personnel with two planted bombs."], ["2010.06.07", "Iraq", "Abu Ghraib", 3, 2, "An imam and his family are cut down in front of their house by Religion of Peace rivals."], ["2010.06.07", "Iraq", "Baghdad", 6, 37, "A series of bombs packed with ball-bearings shred at least six Iraqis."], ["2010.06.07", "Iraq", "Sunidij", 3, 1, "Three brothers are shot to death in their home by Muslim terrorists."], ["2010.06.08", "Afghanistan", "Sangin", 1, 0, "A 7-year-old boy is kidnapped and hanged by Sunni fundamentalists."], ["2010.06.08", "Iraq", "Kirkuk", 1, 0, "A Christian father is murdered outside his home by Islamist gunmen."], ["2010.06.08", "Iraq", "Mosul", 2, 0, "Islamic militants gun down an unmarried couple."], ["2010.06.08", "Iraq", "al-Halla", 3, 1, "Jihadis spray the inside of a vehicle with automatic weapons, taking out three civilians."], ["2010.06.08", "Pakistan", "Orakzai", 6, 8, "Religious fanatics storm a police checkpoint, killing six officers."], ["2010.06.08", "Pakistan", "Punjab", 4, 3, "Four drivers are burned to death when Mujahideen set fire to a supply convoy."], ["2010.06.08", "Pakistan", "Quetta", 1, 0, "A Hindu trader is shot to death by Muslim kidnappers."], ["2010.06.09", "Afghanistan", "Kandahar", 1, 0, "Religious fanatics drag a local city official from his home and murder him."], ["2010.06.09", "Afghanistan", "Nadahan", 40, 73, "Forty people at a wedding are incinerated by a Fedayeen suicide bomber."], ["2010.06.09", "Iraq", "Baghdad", 2, 5, "A husband and his wife are brutally executed in their own home by Mujahideen."], ["2010.06.09", "Iraq", "Muqdadiya", 2, 4, "A suicide bomber on a motorcycle murders two civilians."], ["2010.06.09", "Iraq", "Shurqat", 2, 2, "Two Iraqis are gunned down by suspected al-Qaeda."], ["2010.06.09", "Pakistan", "Karachi", 1, 0, "A Shia is shot to death by sectarian rivals."], ["2010.06.09", "Pakistan", "Mohmand", 2, 0, "Two local soldiers are killed by a Taliban ambush."], ["2010.06.09", "Pakistan", "Quetta", 4, 0, "The Taliban are suspected in a shooting attack that leaves four local cops dead."], ["2010.06.09", "Somalia", "Mogadishu", 5, 0, "Five government workers are blown to bits by an Islamist roadside bomb."], ["2010.06.09", "Thailand", "Yala", 1, 23, "A 5-year-old girl is murdered in a grenade attack by Islamic separatists."], ["2010.06.10", "Iraq", "Baghdad", 4, 8, "A Shahid suicide bomber murders four civilians."], ["2010.06.10", "Iraq", "Kirkuk", 1, 0, "A woman is shot to death inside her home by Mujahid."], ["2010.06.10", "Iraq", "Tikrit", 5, 15, "Five people are taken out in a Religion of Peace bomb blast."], ["2010.06.10", "Pakistan", "Karachi", 1, 3, "Islamists are suspected of bombing a Navy office, leaving one dead."], ["2010.06.11", "Afghanistan", "Kandahar", 9, 8, "Four women and three children riding a minibus are among nine civilians torn apart by an Islamist shrapnel bomb."], ["2010.06.11", "Afghanistan", "Mata Khan", 4, 0, "Four construction workers are brutally shot to death by Sunni fundamentalists."], ["2010.06.11", "Afghanistan", "Zabul", 4, 0, "Four human beings at a market are blown to Allah by a suicide bomber."], ["2010.06.11", "Algeria", "Lakhdaria", 4, 20, "Four people are killed when fundamentalists blow up an explosives laden truck along a city street."], ["2010.06.11", "Iraq", "Baghdad", 3, 9, "Terrorists plant a bomb in a garbage pile, killing three bystanders."], ["2010.06.11", "Iraq", "Jalawla", 8, 27, "Jihadis take out eight souls with a suicide blast."], ["2010.06.11", "Pakistan", "Karachi", 1, 0, "Sunni assassins shoot a Shia father to death on his way to work."], ["2010.06.11", "Philippines", "Maluso", 3, 0, "Three lumberjacks are kidnapped and beheaded by Abu Sayyaf militants."], ["2010.06.11", "Russia", "Nalchik", 1, 0, "A cop is killed by gunfire from a mosque."], ["2010.06.11", "Thailand", "Pattani", 1, 0, "A 29-year-old man is gunned down by Islamic militia outside a motorcycle repair shop."], ["2010.06.12", "Afghanistan", "Kandahar", 5, 0, "Five local cops are dismembered by a Taliban roadside blast."], ["2010.06.12", "Dagestan", "Derbent", 2, 1, "Islamic snipers take down two local police."], ["2010.06.12", "Dagestan", "Kaspiisk", 1, 5, "A bomb takes down a firefighter."], ["2010.06.12", "Iraq", "Mosul", 1, 0, "Holy Warriors shoot a woman to death in her home."], ["2010.06.12", "Pakistan", "Karachi", 2, 0, "Sunni and Shia exchange targeted assassinations."], ["2010.06.12", "Pakistan", "Khyber", 2, 0, "Two tribesmen are kidnapped and murdered by Islamic fundamentalists."], ["2010.06.12", "Somalia", "Huruwaa", 2, 0, "Two men are shot to death by Islamic militia for watching the World Cup on TV."], ["2010.06.12", "Thailand", "Yala", 4, 0, "Four civilians are gunned down in separate attacks by Muslim radicals."], ["2010.06.13", "Canada", "Montreal, QB", 0, 1, "A 19-year-old girl is stabbed by her mother in an honor attack."], ["2010.06.13", "Iraq", "Baghdad", 24, 46, "al-Qaeda militants storm a bank, killing two dozen people with bombs and bullets."], ["2010.06.13", "Iraq", "Mosul", 3, 0, "Mujahideen gun down three Iraqis, including a woman."], ["2010.06.13", "Pakistan", "Bajaur", 3, 0, "A married couple and their young son are murdered by her strict Muslim family for marrying for love."], ["2010.06.13", "Pakistan", "Karachi", 1, 0, "A member of a peace committee is shot full of holes by local Taliban."], ["2010.06.13", "Pakistan", "Quetta", 1, 0, "A videotape is released showing the slaughter of a humanitarian worker in captivity."], ["2010.06.13", "Thailand", "Yala", 1, 3, "A soldier protecting teachers is taken apart by an Islamic bomb."], ["2010.06.13", "Thailand", "Yala", 2, 26, "A 34-year-old Buddhist is among two who die from injuries suffered when Islamic separatists throw a bomb into a tea shop."], ["2010.06.14", "Afghanistan", "Wardok", 4, 0, "Four local cops are taken down in two attacks by Sunni fundamentalists."], ["2010.06.14", "Iraq", "Baghdad", 2, 4, "Muslim terrorists murder two local policemen with an IED."], ["2010.06.14", "Iraq", "Balad", 3, 0, "Three Iraqis are shot to death by suspected al-Qaeda."], ["2010.06.14", "Iraq", "Mosul", 1, 25, "Jihadis manage to kill a patron with a bomb at a local market."], ["2010.06.14", "Iraq", "Sammarah", 1, 0, "A convert to Christianity is murdered by his own son and nephew for 'abandoning Islam'."], ["2010.06.14", "Israel", "Hebron", 1, 2, "Palestinian gunmen shoot an Israeli police officer to death."], ["2010.06.14", "Pakistan", "Bannu", 2, 4, "Two police officers are killed when Islamic militants ambush them with grenades and gunfire."], ["2010.06.14", "Pakistan", "Karachi", 2, 0, "An elderly man is among two people shot to death in separate sectarian attacks."], ["2010.06.14", "Pakistan", "Peshawar", 0, 1, "A Christian professor is badly beaten by his students for refusing to embrace Islam."], ["2010.06.14", "Thailand", "Narathiwat", 1, 0, "A Buddhist man on his way to buy food is shot twice in the head and back by Muslim terrorists."], ["2010.06.15", "Afghanistan", "Helmand", 2, 0, "Two British soldiers are shot while trying to guard Afghan civilians."], ["2010.06.15", "Afghanistan", "Herat", 6, 0, "The Taliban take down six civilians with two remote-controlled bomb attacks."], ["2010.06.15", "Afghanistan", "Kandahar", 3, 1, "The Taliban detonate a bomb next to a car, killing a 17-year-old boy and two others."], ["2010.06.15", "Iraq", "Mosul", 1, 0, "al-Qaeda militants assassinate a local official."], ["2010.06.15", "Iraq", "Mosul", 3, 0, "Three Iraqis are murdered in their home by Mujahid gunmen."], ["2010.06.15", "Pakistan", "Mohmand", 2, 0, "Two members of a peace committee are cut down by religious extremists while returning home."], ["2010.06.16", "Dagestan", "Kizilyurt", 1, 0, "A suspected Muslim gunmen kills the head of a local employment center."], ["2010.06.16", "Iraq", "Baghdad", 1, 4, "A street beggar is killed when terrorists attach a bomb to a car."], ["2010.06.17", "Iraq", "Abu Saida", 2, 3, "Two policemen are murdered by Jihadi bombers."], ["2010.06.17", "Iraq", "Fallujah", 5, 1, "al-Qaeda gunmen wipe out a family of five Iraqis in their home, including a baby."], ["2010.06.17", "Pakistan", "Karachi", 2, 0, "A Shia doctor is among two people shot to death in sectarian attacks."], ["2010.06.17", "Pakistan", "Maidan Wardak", 1, 0, "A civilian is abducted by the Taliban and brutally beheaded."], ["2010.06.17", "Thailand", "Pattani", 2, 0, "Two Buddhists are gunned down by Muslim terrorists in separate attacks."], ["2010.06.18", "Dagestan", "Kaspiisk", 1, 3, "Muslim 'insurgents' fire into a car, killing a Russian."], ["2010.06.18", "Iraq", "Baqubah", 0, 30, "Thirty people are injured when Mujahideen set off a car bomb in a residential neighborhood."], ["2010.06.18", "Iraq", "Qaim", 4, 6, "Four local security personnel are murdered by Jihadi roadside bombers."], ["2010.06.18", "Iraq", "Qaim", 7, 10, "Seven Iraqi soldiers are taken down by Islamic gunmen."], ["2010.06.18", "Iraq", "Samarrah", 1, 0, "An older man is shot to death in his home by his own son because he interpreted for U.S. troops."], ["2010.06.18", "Iraq", "Tuz Khurmato", 8, 63, "Eight people are cut to pieces by a parked car bomb outside a home."], ["2010.06.18", "Pakistan", "Mohmand", 6, 0, "Six local soldiers are abducted and executed in captivity by Sunni fundamentalists."], ["2010.06.18", "Somalia", "Mogadishu", 3, 0, "At least three Somali troops are killed during a brutal al-Shabaab ambush."], ["2010.06.19", "Iraq", "Jbala", 3, 0, "Three Iraqis are shot to death by suspected al-Qaeda."], ["2010.06.19", "Pakistan", "Dera Ismail Khan", 1, 8, "A passerby is killed when Jihadi bombers target a police vehicle."], ["2010.06.19", "Thailand", "Pattani", 2, 1, "A married couple is murdered in their car by Religion of Peace gunmen, who also injure their 2-year-old daughter."], ["2010.06.19", "Yemen", "Aden", 11, 4, "al-Qaeda gunmen walk into a government building and calmly gun down eleven people, including women and a young child."], ["2010.06.20", "Afghanistan", "Lashkar Gah", 3, 15, "A 12-year-old girl is among three civilians killed when Islamists bomb a bank."], ["2010.06.20", "Afghanistan", "Nangarhar", 2, 0, "Fundamentalists murder two children when they hit their home with a rocket."], ["2010.06.20", "India", "Poonch", 1, 2, "An Indian trooper is taken down by an Islamist IED blast."], ["2010.06.20", "India", "Sopore", 1, 0, "Mujahideen shoot a civilian to death."], ["2010.06.20", "Iraq", "Baghdad", 4, 16, "Four Iraqis are taken out by Jihadi bombers."], ["2010.06.20", "Iraq", "Baghdad", 8, 0, "Six prostitutes and two johns are shot to death by Islamic fundamentalists in a brothel."], ["2010.06.20", "Iraq", "Baghdad", 28, 57, "Twenty-eight souls, including women and children, are sent to Allah by two Shahid two suicide bombers at a bank."], ["2010.06.20", "Pakistan", "Dir", 2, 2, "Two recruits are killed when Fedayeen storm a police training camp."], ["2010.06.20", "Pakistan", "Khyber", 5, 2, "Five members of a family are exterminated in their own home by Muslim gunmen."], ["2010.06.20", "Pakistan", "Kupwara", 2, 2, "Pakistanis fire across the border into India, killing two porters."], ["2010.06.20", "Pakistan", "Peshawar", 2, 0, "Two women are executed by the Taliban for committing adultery."], ["2010.06.21", "Afghanistan", "Awtar", 1, 0, "Sunni fundamentalists kidnap and behead a local leader."], ["2010.06.21", "Afghanistan", "Helmand", 10, 2, "Ten local police are cut down by a Taliban roadside bomb."], ["2010.06.21", "Afghanistan", "Kunar", 12, 14, "The Taliban claim a suicide bombing at a clinic that leaves a dozen dead."], ["2010.06.21", "Pakistan", "Karachi", 1, 2, "Sectarian Jihadis fire on a group of brothers, killing one."], ["2010.06.21", "Pakistan", "Punjab", 5, 0, "Religious clerics lead a mob into the home of a Christian man and slaughter his wife and four children."], ["2010.06.21", "Pakistan", "Quetta", 2, 0, "Two Shia brothers are shot dead by a Sunni terrorist outfit."], ["2010.06.21", "Sudan", "Darfur", 3, 1, "Three UN troops are murdered by suspected Islamic-backed militia while guarding civilian engineers."], ["2010.06.21", "Thailand", "Pattani", 0, 3, "A mother and two children suffer shrapnel injuries when Muslim rivals toss a grenade into their mosque."], ["2010.06.22", "India", "Kupwara", 1, 0, "An Indian officer succumbs to injuries from a militant terror attack."], ["2010.06.22", "Iraq", "Baghdad", 2, 8, "Two Iraqis are killed by a roadside bomb."], ["2010.06.22", "Iraq", "Fallujah", 1, 0, "A critic of al-Qaeda is assassinated by the Islamist group."], ["2010.06.22", "Iraq", "Mosul", 3, 0, "Two women and a man are reported killed by Sunni bombers."], ["2010.06.22", "Pakistan", "Orakzai", 7, 12, "Seven security personnel are slain in two Taliban ambushes."], ["2010.06.22", "Ukraine", "Dneprovka", 1, 0, "A Muslim fanatic yells 'Allah Akbar' as he stabs a 5-year-old boy to death."], ["2010.06.23", "Afghanistan", "Uruzgan", 7, 0, "Seven construction workers are blown to bits by Taliban bombers."], ["2010.06.23", "Pakistan", "Karachi", 2, 0, "Two lovers are gunned down in an honor killing."], ["2010.06.23", "Philippines", "Basilan", 4, 2, "Four mini-bus passengers are machine-gunned to death by Religion of Peace advocates."], ["2010.06.24", "Iraq", "Khalis", 7, 0, "A woman and two brothers are among seven Sunnis shot to death by suspected al-Qaeda in three attacks."], ["2010.06.24", "Iraq", "Mosul", 8, 19, "Dedicated Fedayeen suicide bombers take out eight Iraqis in two attacks."], ["2010.06.25", "Afghanistan", "Uruzgan", 11, 0, "Eleven civilians are murdered by the Taliban, six of whom are beheaded."], ["2010.06.25", "Algeria", "Stah Guenter", 5, 1, "Five members of a wedding party are cut to pieces by Islamic gunmen."], ["2010.06.25", "Algeria", "Tebessa", 0, 5, "Two children, including a baby, are injured when Islamic fundamentalists open up on their car with automatic weapons."], ["2010.06.25", "Dagestan", "Nazran", 2, 0, "Two local cops are gunned down in their vehicle by passing Jihadis."], ["2010.06.25", "Iraq", "Samarrah", 11, 0, "Eleven victims of Islamic terrorists are pulled from a well."], ["2010.06.26", "Afghanistan", "Panjwaii", 2, 0, "Two Canadian medics are murdered by Taliban ambushers while traveling to defuse a bomb."], ["2010.06.26", "Dagestan", "Kizilyurt", 2, 0, "A local businessman is among two people shot to death by suspected Islamic militia."], ["2010.06.26", "Iraq", "Fallujah", 4, 0, "al-Qaeda gunmen murder four jewelry shop owners."], ["2010.06.27", "Afghanistan", "Meymaneh", 4, 0, "Four Norwegian soldiers riding along a highway are killed by a Taliban bomb blast."], ["2010.06.27", "Bosnia", "Bugojno", 1, 6, "Wahhabis bomb a police station, killing one officer."], ["2010.06.27", "India", "Jolly", 1, 0, "A 21-year-old Muslim girl dies from being thrown down the stairs by her family for having sex."], ["2010.06.28", "Afghanistan", "Ghazni", 8, 0, "Sunni hardliners use a roadside bomb to kill eight civilians."], ["2010.06.28", "Afghanistan", "Zabul", 6, 5, "Religious extremists bomb a vehicle from a private security firm, killing six occupants."], ["2010.06.28", "DRC", "Mutwanga", 16, 0, "ADF Islamic rebels attack a village and murder sixteen civilians."], ["2010.06.28", "Ethiopia", "Jarar", 7, 6, "Seven soldiers are killed in a raid by Ogaden Jihadis."], ["2010.06.28", "Iraq", "Baghdad", 2, 4, "Mujahid bombers take down two local cops."], ["2010.06.28", "Iraq", "Baghdad", 2, 4, "Muslim terrorists attack a family inside their home, leaving two women dead."], ["2010.06.28", "Pakistan", "Bajaur", 4, 0, "Four local soldiers are murdered in a Taliban ambush."], ["2010.06.28", "Pakistan", "Karachi", 4, 0, "Four civilians are murdered in separate sectarian attacks."], ["2010.06.29", "Afghanistan", "Farah", 4, 0, "Four local soldiers are dismembered by a roadside bomb."], ["2010.06.29", "Afghanistan", "Kabul", 1, 0, "A UN staffer is gunned down in a brutal Islamic ambush at an intersection."], ["2010.06.29", "Iraq", "Baghdad", 1, 0, "An 18-year-old girl is taken down by Mujahid gunmen."], ["2010.06.29", "Iraq", "Baiji", 3, 13, "A Jihadi car bomb leaves three people dead."], ["2010.06.29", "Iraq", "Khalis", 4, 0, "Suspected insurgents murder four members of the same family outside their home, including a 9-year-old girl."], ["2010.06.29", "Iraq", "Mosul", 3, 0, "A woman shot to death in her home is among three people killed in separate attacks."], ["2010.06.29", "Somalia", "Mogadishu", 4, 15, "Four civilians are killed during an al-Shabaab attack on a government building."], ["2010.06.30", "Algeria", "Tinzaouatine", 11, 0, "Eleven local security personnel are shot to pieces at point-blank range by Islamic fundamentalists."], ["2010.06.30", "Chechnya", "Grozny", 0, 7, "A suicide bomber near a concert hall injures seven people."], ["2010.06.30", "Ethiopia", "Nogob", 9, 11, "Ogaden Fedayeen stage a nighttime raid and kill eleven local soldiers"], ["2010.06.30", "Iraq", "Baghdad", 2, 1, "Mujahid shoot two policemen to death at a checkpoint."], ["2010.06.30", "Iraq", "Kirkuk", 1, 0, "A woman is tortured and killed by Sunni insurgents."], ["2010.06.30", "Iraq", "Mosul", 1, 0, "A 13-year-old girl is murdered by an Islamist bomb blast near her home."], ["2010.06.30", "Pakistan", "Hub", 4, 5, "Four factory workers are killed when sectarian Jihadis toss a grenade under their car."], ["2010.06.30", "Pakistan", "Tumair", 1, 0, "A 17-year-old girl is shot in the head by her uncle after a jirga determines that she deserves to die for marrying for love."], ["2010.07.01", "Ethiopia", "Shabelle", 6, 8, "A Muslim 'commando' murders six Ethiopian soldiers."], ["2010.07.01", "India", "Kupwara", 2, 0, "Islamic militants shoot two Indian soldiers to death during an infiltration attempt from Pakistan."], ["2010.07.01", "India", "Udhampur", 1, 0, "Hizb-ul-Mujahideen abduct a civilian, then shoot him as he is trying to escape."], ["2010.07.01", "Iraq", "Baghdad", 1, 9, "A Sunni leader is killed by a bomb planted by suspected a Shia militia."], ["2010.07.01", "Iraq", "Samarrah", 1, 2, "One person is killed in their own home by sectarian bombers."], ["2010.07.01", "Pakistan", "Lahore", 44, 175, "Over forty Sufi worshippers are blown to bits in their own mosque by Sunni bombers."], ["2010.07.01", "Pakistan", "Quetta", 2, 1, "Two young girls die from splinter injuries suffered in a grenade attack on their home."], ["2010.07.01", "Somalia", "Hudur", 1, 0, "A Christian convert from Islam is publicly executed in a soccer stadium by Islamists, leaving behind a pregnant widow."], ["2010.07.01", "Thailand", "Narathiwat", 5, 0, "Civilians are among five shot to pieces at point-blank range by Muslim radicals while riding in a truck."], ["2010.07.01", "Yemen", "Zinjibar", 1, 0, "al-Qaeda gunmen assassinate a local official."], ["2010.07.02", "Afghanistan", "Kunduz", 5, 20, "Six Shahid suicide bombers target a humanitarian agency, murdering five innocents."], ["2010.07.02", "Iraq", "Mandali", 1, 0, "A pregnant woman is found dead from a suspected honor killing."], ["2010.07.02", "Iraq", "Ramadi", 1, 0, "A Sunni scholar is murdered by sectarian rivals."], ["2010.07.02", "Kosovo", "Mitrovica", 1, 10, "Muslims throw a grenade into a pro-Serb rally, killing one participant."], ["2010.07.02", "Pakistan", "Khyber", 3, 2, "Islamic hardliners execute three local soldiers and keep two others in captivity."], ["2010.07.02", "Pakistan", "Quetta", 1, 0, "Sunnis fire from a moving car on a Shia scholar, killing him on the spot."], ["2010.07.02", "Thailand", "Pattani", 1, 0, "A 46-year-old man is gunned down by Muslim radicals while riding home."], ["2010.07.02", "Thailand", "Yala", 3, 0, "Jihadis take out three school guards with a roadside blast on their vehicle."], ["2010.07.03", "Nigeria", "Kizachi", 7, 5, "A school teacher and mother of six are among seven Christians brutally executed in their homes by Muslim raiders."], ["2010.07.03", "Pakistan", "Gurguri", 4, 7, "Four security personnel are murdered by Taliban roadside bombers."], ["2010.07.03", "Pakistan", "Khyber", 2, 5, "Islamic militants kill two locals with a bomb."], ["2010.07.03", "Yemen", "Batis", 1, 0, "al-Qaeda kidnap and execute a local intelligence officer."], ["2010.07.04", "Afghanistan", "Helmand", 5, 8, "Four children are among five innocents blown to bits by Taliban bombers at a market."], ["2010.07.04", "India", "Kerala", 0, 1, "A Christian professor has his forearm and hand hacked off by Muslims for the alleged crime of insulting Muhammad."], ["2010.07.04", "Ingushetia", "Magas", 2, 4, "Islamists murder two Russian soldiers in a brutal ambush."], ["2010.07.04", "Iraq", "Baqubah", 2, 0, "Two brothers are gunned down by Muslim terrorists."], ["2010.07.04", "Iraq", "Mosul", 1, 0, "Suspected Mujahid shoot a young child in the head and chest."], ["2010.07.04", "Iraq", "Mosul", 2, 4, "A Shahid suicide bomber takes out two Iraqis."], ["2010.07.04", "Iraq", "Ramadi", 4, 23, "Women and children are among the casualties when a female suicide bomber blows herself outside a building entrance."], ["2010.07.04", "Nigeria", "Ganawuri", 3, 0, "Muslims hack three Christians to death."], ["2010.07.04", "Pakistan", "Kalat", 4, 7, "Sectarian Jihadis open fire on a vehicle carrying day laborers, taking down four."], ["2010.07.04", "Thailand", "Yala", 2, 3, "Two people are killed when Islamic insurgents detonate a bomb outside a school."], ["2010.07.05", "Chechnya", "Vedensky", 1, 2, "A Russian serviceman is assassinated by Mujahideen gunmen."], ["2010.07.05", "Egypt", "Cairo", 0, 1, "A Christian convert survives an attempt by Muslim radicals to behead him for leaving the faith."], ["2010.07.05", "Iraq", "Kirkuk", 1, 0, "A Sunni is handcuffed and murdered by suspected al-Qaeda."], ["2010.07.05", "Iraq", "Mosul", 1, 0, "A 54-year-old Christian father of three bleeds to death after Islamists bomb his car in a targeted attack."], ["2010.07.05", "Nigeria", "Jos", 3, 0, "Three Christian farmers are brutally slain in a 'mindless' attack by militant Muslims."], ["2010.07.05", "Pakistan", "Lower Dir", 1, 14, "One person is killed by a suicide car bomber."], ["2010.07.05", "Pakistan", "Peshawar", 1, 0, "A tribal elder is gunned down by Islamic militants."], ["2010.07.05", "Somalia", "Labadhagah", 8, 0, "Rival Islamic groups clash, leaving eight dead in drive-by assassinations."], ["2010.07.05", "Yemen", "Hadramout", 2, 3, "An al-Qaeda ambush leaves two locals soldiers dead."], ["2010.07.06", "Afghanistan", "Ghazni", 6, 0, "Six construction workers are kidnapped by Sunni hardliners and then murdered in captivity."], ["2010.07.06", "Iraq", "Baghdad", 6, 37, "Six Shiite pilgrims are dismembered by Sunni bombers in three attacks."], ["2010.07.06", "Iraq", "Mosul", 2, 0, "Two women are brutally shot to death by Jihadis passing by in a car."], ["2010.07.06", "Pakistan", "Karachi", 1, 0, "A Shia civilian is killed by Sunni gunmen."], ["2010.07.07", "Afghanistan", "Kabul", 1, 0, "Talibanis gun down a cop."], ["2010.07.07", "Iraq", "Abu Ghraib", 5, 6, "al-Qaeda gunmen target the homes of policemen and other officials, leaving several family members dead."], ["2010.07.07", "Iraq", "Baghdad", 54, 265, "Women and children are among the dead as three suicide bombers target Shia pilgrims in separate and horrific attacks."], ["2010.07.07", "Iraq", "Fallujah", 5, 4, "A Fedayeen suicide bomber takes out five Iraqis."], ["2010.07.07", "Somalia", "Elasha", 2, 3, "A teenager is among two people slain when Islamic fundamentalists toss a grenade into a house where people are watching the World Cup."], ["2010.07.08", "Afghanistan", "Paktia", 6, 0, "Six civilians are crushed by debris when hardliners fire a rocket into a bazaar."], ["2010.07.08", "Iraq", "Baghdad", 28, 98, "Twenty-eight more Shia pilgrims are massacred in at least four separate Sunni bomb attacks."], ["2010.07.08", "Pakistan", "Karachi", 0, 7, "Seven Hindus are badly beaten after one of them (a boy) drinks water from a mosque."], ["2010.07.08", "Philippines", "Talipao", 3, 0, "Three men are hacked to death by Abu Sayyaf ambushers."], ["2010.07.09", "Afghanistan", "Ghazni", 1, 0, "A government official is assassinated by the Taliban on his way into work."], ["2010.07.09", "Iraq", "Baghdad", 6, 20, "A Shahid suicide successfully takes out six Iraqis in a neighborhood."], ["2010.07.09", "Jordan", "Naur", 1, 0, "A married woman suspected of having an extra-marital affair is stabbed to death by her brothers."], ["2010.07.09", "Pakistan", "Mohmand", 105, 75, "Children are among over one hundred innocents blown apart by a suicide bomber while they are waiting in line for humanitarian aid, including wheelchairs."], ["2010.07.10", "Afghanistan", "Kabul", 11, 0, "Eleven policemen are killed in two Taliban terror attacks."], ["2010.07.10", "Afghanistan", "Kandahar", 1, 5, "Islamists use a remote-controlled bomb on a motorcycle to take down a civilian."], ["2010.07.10", "Afghanistan", "Paktia", 11, 0, "Eleven Shia men are shot to death by Sunni rivals in a sectarian attack."], ["2010.07.10", "Dagestan", "Makhachkala", 1, 0, "A senior judge is assassinated by Islamic terrorists."], ["2010.07.10", "India", "Gari Madhiya", 2, 0, "A 16-year-old girl and her lover are honor killed execution style by her family."], ["2010.07.10", "Pakistan", "Makeen", 3, 5, "Tehreek-e-Taliban ambush a police post, killing three officers."], ["2010.07.11", "India", "Doda", 1, 0, "A civilian is cut down outside his home by Mujahideen gunmen."], ["2010.07.11", "Iraq", "Dania", 1, 2, "A civilian is killed in a Jihad bombing."], ["2010.07.11", "Pakistan", "Quetta", 1, 0, "A man is kidnapped and tortured to death by sectarian rivals."], ["2010.07.11", "Uganda", "Kampala", 76, 65, "Over seventy innocent people watching the World Cup are blown to bits in two separate bombings by Islamic extremists."], ["2010.07.12", "Afghanistan", "Helmand", 0, 21, "Twenty-one civilians are wounded by a Taliban blast at a crowded bazaar."], ["2010.07.12", "England", "London", 0, 1, "A religious studies teacher is badly beaten by four Muslims intent on punishing him for 'insulting Islam' by teaching girls."], ["2010.07.12", "India", "Nadia", 0, 3, "Three Hindu girls are gang-raped and tortured by a group of Muslims.  The youngest two are 13-years-old."], ["2010.07.12", "Pakistan", "Karachi", 1, 1, "A seminary teacher's driver is killed during an assassination attempt by disgruntled fundamentalists."], ["2010.07.12", "Pakistan", "Orakzai", 1, 4, "Islamists blow up a primary school and kill a security official."], ["2010.07.12", "Thailand", "Narathiwat", 1, 1, "Islamic insurgents ambush and murder a 55-year-old cop."], ["2010.07.13", "Afghanistan", "Helmand", 9, 0, "Sunni hardliners manage to take down nine Afghan civilians by bombing their minibus."], ["2010.07.13", "Afghanistan", "Kandahar", 9, 9, "A suicide bomb attack on an Afghan security headquarters leaves nine dead, including five civilians."], ["2010.07.13", "Afghanistan", "Paktika", 2, 0, "Two security guards are sent to Allah by Taliban roadside bombers."], ["2010.07.13", "Afghanistan", "Uruzgan", 1, 0, "Fundamentalists set up a fake roadblock and then shoot a motorist to death."], ["2010.07.13", "Dagestan", "Derbent", 1, 3, "Terrorists fire on a group of youth, killing one."], ["2010.07.13", "Iraq", "Baghdad", 2, 5, "Two local cops are taken down by Jihad bombers."], ["2010.07.13", "Iraq", "Khalis", 3, 7, "Three people are killed by a terrorist bombing while protesting terrorist bombings."], ["2010.07.13", "Iraq", "Yusufiya", 5, 0, "Five members of a family are brutally slaughtered in their own home by al-Qaeda."], ["2010.07.13", "Pakistan", "Karachi", 0, 1, "A Christian woman is raped and then thrown from a roof by a Muslim doctor."], ["2010.07.13", "Pakistan", "Karachi", 1, 0, "A woman is shot to death by her son in an honor killing."], ["2010.07.14", "Dagestan", "Kirov-Aul", 1, 0, "A local village administrator loses his life to Muslim terror while riding home from work."], ["2010.07.14", "Iraq", "Amiriya", 4, 7, "Three women and a child are brutally slaughtered in the home of a Sufi cleric by sectarian Jihadis."], ["2010.07.14", "Iraq", "Baghdad", 1, 0, "A university professor is assassinated by suspected fundamentalists."], ["2010.07.14", "Iraq", "Baghdad", 2, 4, "Jihadis take down two civilians with a roadside bomb."], ["2010.07.14", "Pakistan", "Bostikhel", 2, 0, "Two brothers are abducted and beheaded by religious extremists."], ["2010.07.14", "Thailand", "Yala", 1, 0, "A villager is gunned down by Islamic terrorists."], ["2010.07.14", "Yemen", "Zijibar", 3, 10, "Hooded al-Qaeda militants assault a government building.  At least three defenders are killed."], ["2010.07.15", "Iran", "Zahedan", 27, 80, "At least twenty-seven people are killed when a Sunni suicide bomber takes out a mosque full of Shia worshippers."], ["2010.07.15", "Iraq", "Mahmoudiya", 2, 10, "Two people are killed by a bomb planted on a motorcycle."], ["2010.07.15", "Iraq", "Tikrit", 9, 15, "A Mujahid car bomb along a city street takes down nine Iraqis."], ["2010.07.15", "Pakistan", "Mingora", 6, 45, "Six innocents are taken down by a suicide bomber, including women and children."], ["2010.07.15", "Pakistan", "Sukkur", 5, 6, "Five members of a church, including the pastor are brutally shot to death outside the building by Religion of Peace advocates."], ["2010.07.16", "Dagestan", "Makhachkala", 1, 0, "A Pentecostal pastor and father of five is shot in the head by Muslim extremists."], ["2010.07.16", "Ethiopia", "Addis Ababa", 0, 1, "A Christian convert is brutally beaten by angry Muslims."], ["2010.07.16", "Iraq", "Abu Ghraib", 3, 2, "Jihadis take down three Iraqis with a roadside bomb."], ["2010.07.16", "Iraq", "Fallujah", 2, 0, "A teacher is among two civilians shot to death by Islamic terrorists."], ["2010.07.16", "Pakistan", "North Waziristan", 2, 0, "The Taliban execute two men by strapping dynamite to their bodies."], ["2010.07.16", "Pakistan", "Tirah Valley", 10, 14, "Three children are among ten innocents blown to bits at a marketplace by Religion of Peace advocates."], ["2010.07.16", "Thailand", "Yala", 2, 1, "A 53-year-old Buddhist woman bleeds to death after Islamists set off two bombs, killing two people."], ["2010.07.16", "Turkey", "Diyarbakir", 1, 0, "A young member of an Islamist organization is arrested for strangling his 17-year-old sister in an honor killing a month earlier."], ["2010.07.17", "Algeria", "Tebessa", 4, 0, "Four people are killed in a suspected al-Qaeda bombing."], ["2010.07.17", "Iraq", "Tuz Khormato", 2, 3, "Two boys are murdered in what is thought to be a sectarian bombing."], ["2010.07.17", "Nigeria", "Jos", 10, 14, "Young children are among ten Christians hacked to death in their homes by Muslims, who also burn a church."], ["2010.07.17", "Pakistan", "Kurram", 18, 2, "A brutal ambush on Shia civilians by Sunni radicals leaves eighteen dead."], ["2010.07.18", "Afghanistan", "Kabul", 3, 42, "Sunni fundamentalists take out three civilians in a bomb attack."], ["2010.07.18", "Iraq", "Balasim", 48, 50, "Nearly fifty people are shredded into pieces by suicide bombers striking two crowds."], ["2010.07.18", "Pakistan", "Sargodha", 6, 20, "Six Shia worshippers lose their lives, and several others are dismembered when a Sunni suicide bomber visits their mosque."], ["2010.07.18", "Somalia", "Lasanod", 1, 0, "Islamic militants assassinate a court official."], ["2010.07.18", "Somalia", "Mogadishu", 12, 43, "A dozen people are left dead after a reported al-Shabaab attack."], ["2010.07.18", "Thailand", "Narathiwat", 1, 0, "A Malaysian karaoke bar owner is shot to death by Muslim extremists."], ["2010.07.18", "Thailand", "Pattani", 2, 0, "A middle-aged Buddhist man is among two people shot to death by Islamists in separate attacks."], ["2010.07.19", "Afghanistan", "Kandahar", 6, 4, "Religious extremists assassinate six local police with a roadside bomb."], ["2010.07.19", "Iraq", "Baqubah", 4, 15, "Holy warriors bomb a cafe killing four Iraqis."], ["2010.07.19", "Iraq", "Fallujah", 1, 0, "al-Qaeda members kill a local leader with a car bomb."], ["2010.07.19", "Iraq", "Mosul", 4, 5, "A Fedayeen suicide bomber plows into another vehicle and detonates, leaving at least four dead."], ["2010.07.19", "Pakistan", "Faislabad", 2, 1, "Two Christian brothers who were pastors, are accused of blasphemy and then brutally gunned down outside a courthouse while in chains."], ["2010.07.20", "Afghanistan", "Baghlan", 6, 0, "Six police officers are beheaded by Islamic fundamentalists."], ["2010.07.20", "Afghanistan", "Mazar-i-Sharif", 3, 2, "Two NATO civilians and an Afghan soldier are gunned down by a rogue Afghan soldier."], ["2010.07.20", "Iraq", "Qsaireen", 6, 8, "Six Iranian pilgrims are sent straight to Allah by a Sunni suicide bomber at a restaurant."], ["2010.07.20", "Iraq", "Qurat Tabba", 8, 22, "Jihadis blow up a market, killing at least eight patrons."], ["2010.07.20", "Kenya", "Liboi", 1, 1, "al-Shabaab snipers attack a Kenyan military patrol across the border, killing one officer."], ["2010.07.20", "Pakistan", "Khar", 1, 0, "A local soldiers is shot to death in a terrorist ambush."], ["2010.07.20", "Yemen", "Harf Sufyan", 34, 12, "Thirty-four people are killed when two Shiite groups clash over 'ideological differences.'"], ["2010.07.21", "India", "Kishtwar", 1, 0, "Mujahideen beat a shopkeeper in his home in front of his family, then pull him out and shoot him."], ["2010.07.21", "Iraq", "Abu Saida", 15, 44, "At least fifteen innocents are blown to bits in a bombing outside a mosque."], ["2010.07.21", "Iraq", "Mosul", 1, 1, "A woman is killed, and her child injured, by Jihadi bombers."], ["2010.07.21", "Russia", "Baksanskaya", 2, 0, "Islamic militants murder two guards at a power plant."], ["2010.07.21", "Somalia", "Mogadishu", 1, 4, "Islamic militants enter a Christian home, gun down the father in front of the family and kidnap his wife and children."], ["2010.07.21", "Thailand", "Pattani", 1, 0, "A civilian is gunned down by Muslim militants while on his way home from a tea shop."], ["2010.07.22", "India", "Kishtwar", 1, 0, "A 42-year-old contractor is abducted, tied up, tortured and then beheaded by Holy Warriors."], ["2010.07.22", "Iraq", "Baghdad", 3, 15, "Muslim terrorists send rockets into a commercial district, killing three people."], ["2010.07.22", "Iraq", "Mosul", 9, 10, "An imam and a baker are among nine people murdered in various ways in several Mujahid attacks."], ["2010.07.22", "Pakistan", "Rawalpindi", 0, 2, "Two Christian girls are gang-raped by Muslims."], ["2010.07.22", "Yemen", "Ataq", 6, 1, "Six local soldiers are taken down in an al-Qaeda ambush."], ["2010.07.23", "Afghanistan", "Kandahar", 2, 2, "Two local cops are blown to bits by Sunni bombers."], ["2010.07.23", "Afghanistan", "Logar", 1, 1, "The Taliban ambush a vehicle carrying two US sailors, killing one and kidnapping the other."], ["2010.07.23", "Dagestan", "Chernyaevka", 2, 4, "Children are among the casualties when Muslim gunmen open up on a school bus in one of two separate attacks."], ["2010.07.23", "India", "Poonch", 1, 1, "An army officer is killed by a terrorist landmine."], ["2010.07.23", "Jordan", "Deir Alla", 1, 0, "A man machine-guns his 16-year-old niece after she loses her virginity from a sexual assault."], ["2010.07.23", "Pakistan", "Bajaur", 3, 0, "The Taliban blow three members of a peace committee to kingdom come."], ["2010.07.23", "Pakistan", "Lahore", 1, 5, "A police officer is taken down in an Islamist bombing."], ["2010.07.24", "Afghanistan", "Khost", 1, 20, "Muslim radicals plant a bomb in a mosque that kills one person."], ["2010.07.24", "Dagestan", "Kizlyarsky", 3, 0, "Muslim militants shoot three local soldiers to death in their vehicle."], ["2010.07.24", "Iraq", "Basra", 1, 4, "An innocent civilian is murdered by a Jihad bomber."], ["2010.07.24", "Iraq", "Mosul", 2, 18, "A shooting and a bombing at a store, leave two people dead."], ["2010.07.24", "Pakistan", "Naushehra", 1, 1, "A young man is gunned down by the Taliban while standing outside his home."], ["2010.07.25", "Algeria", "Kabylie", 1, 8, "A suicide bomber murders a night watchman."], ["2010.07.25", "Iraq", "Mosul", 7, 2, "A child is among seven Iraqis killed in a Jihad bombing and separate shooting attack."], ["2010.07.25", "Mali", "Baskno", 1, 0, "al-Qaeda beheads a 78-year-old French hostage."], ["2010.07.25", "Pakistan", "Khyber", 2, 0, "Mujahideen pull two occupants out of a vehicle and shoot them in the back of the head."], ["2010.07.25", "Yemen", "Shabwa", 6, 0, "Six soldiers sitting in a car are machine-gunned to death by al-Qaeda at point-blank range."], ["2010.07.26", "Iraq", "Baghdad", 4, 16, "A suicide bomber targets a news channel staff, killing four members."], ["2010.07.26", "Iraq", "Karbalah", 40, 68, "Sunni bombers take out about forty Shia pilgrims in twin bombings."], ["2010.07.26", "Pakistan", "Darra Adamkhel", 5, 0, "Three children are killed when Islamic terrorists fire a rocket into a family home."], ["2010.07.26", "Pakistan", "Peshawar", 8, 23, "Two children are among eight people murdered when a suicide bomber detonates outside the home of a family mourning an earlier killing."], ["2010.07.26", "Pakistan", "Swat", 4, 4, "Islamic gunmen ambush a family vehicle, leaving four dead, including two children."], ["2010.07.26", "Thailand", "Pattani", 1, 0, "A 55-year-old Buddhist teacher is shot to death by Islamic militants while driving home."], ["2010.07.26", "Yemen", "Lahej", 4, 9, "al-Qaeda gunmen take down four local soldiers in an ambush."], ["2010.07.27", "Iraq", "Baghdad", 1, 4, "A civilian is taken out by a roadside bomb."], ["2010.07.27", "Iraq", "Mosul", 2, 0, "Suspected Islamists storm a home and kill a woman and her son."], ["2010.07.27", "Nigeria", "Maiduguri", 32, 0, "At least thirty-two policemen are assassinated and 'roasted like animals' by Boko Haram Islamists."], ["2010.07.27", "Somalia", "Mogadishu", 13, 40, "At least thirteen civilians are killed when Hizbul Islam terrorists attack a government building."], ["2010.07.27", "Thailand", "Narathiwat", 1, 0, "A 50-year-old villager is murdered outside his home by Muslim gunmen."], ["2010.07.27", "Thailand", "Pattani", 2, 0, "Two civilians are shot to death by Muslim militants in separate drive-bys."], ["2010.07.27", "Thailand", "Yala", 1, 0, "A 26-year-old man is gunned down by Islamic insurgents."], ["2010.07.28", "Afghanistan", "Herat", 2, 0, "Two Italian soldiers are killed by a Taliban roadside bomb while guarding a highway."], ["2010.07.28", "Afghanistan", "Nimroz", 25, 20, "Twenty-five bus passengers are murdered in a bloody bombing by Sunni fundamentalists."], ["2010.07.28", "Afghanistan", "Zabul", 6, 3, "Six civilians are killed in two Taliban roadside bombings."], ["2010.07.28", "Iraq", "Baghdad", 6, 15, "Six people waiting in line at a bank lose their place in life, courtesy of Muslim bombers."], ["2010.07.28", "Iraq", "Fallujah", 2, 8, "Children are among the casualties of an Islamic bombing outside a rival mosque."], ["2010.07.28", "Iraq", "Karbala", 16, 37, "Jihadis take down sixteen innocents in a rocket attack."], ["2010.07.28", "Iraq", "Mosul", 5, 6, "A young girl is among five Iraqis murdered in a series of Mujahideen attacks."], ["2010.07.29", "Afghanistan", "Ghazni", 8, 3, "Eight security guards are ambushed and murdered by religious extremists."], ["2010.07.29", "Iraq", "Adhamiya", 16, 14, "al-Qaeda terrorists stage a brutal attack on a neighborhood, killing sixteen people and burning their bodies."], ["2010.07.29", "Iraq", "Shurqat", 4, 11, "A Fedayeen suicide bomber takes down four Iraqis."], ["2010.07.29", "Pakistan", "Kurram", 10, 0, "Shia terrorists pull ten Sunnis from their homes and shoot them to death, then torch the houses."], ["2010.07.30", "Afghanistan", "Kandahar", 2, 1, "A mother and child are exterminated by Jihadi bombers."], ["2010.07.30", "Afghanistan", "Kunduz", 3, 19, "Children are among the casualties when a suicide bomber detonates at a soccer game."], ["2010.07.30", "Iraq", "Buhriz", 4, 0, "Four members of a family are blasted to death by al-Qaeda bombers."], ["2010.07.30", "Pakistan", "Karachi", 1, 0, "A young pregnant woman is tortured and murdered in a suspected honor killing."], ["2010.07.31", "Chechnya", "Grozny", 2, 0, "Holy Warriors shoot two policemen to death at a checkpoint."], ["2010.07.31", "Iraq", "Tarmiya", 3, 8, "Three civilians on a minibus are taken out by Jihadi bombers."], ["2010.07.31", "Iraq", "Yusufiya", 4, 11, "Four rescue workers are lured to the scene of an earlier bombing and then blasted in a second attack."], ["2010.07.31", "Pakistan", "North Waziristan", 2, 0, "Two Afghan refugees are abducted and shot to death by Islamic fundamentalists."], ["2010.08.01", "Pakistan", "South Waziristan", 2, 0, "Religious extremists kill two local soldiers with a roadside bomb."], ["2010.08.02", "Afghanistan", "Faryab", 4, 3, "Four civilians are cut to pieces by Taliban gunmen."], ["2010.08.02", "Afghanistan", "Kandahar", 5, 1, "Five children are blown apart by a suicide car bomber."], ["2010.08.02", "Dagestan", "Gubden", 1, 0, "A long-time campaigner against Islamic extremism is finally taken out by gunmen."], ["2010.08.02", "Iraq", "Baghdad", 10, 22, "A coffee shop and a residential neighborhood are among a series of bomb blast sites that leave ten dead."], ["2010.08.02", "Iraq", "Fallujah", 3, 7, "A 4-year-old girl is among three sleeping family members murdered by Islamic bombers."], ["2010.08.02", "Jordan", "Aqaba", 1, 5, "A Palestinian rocket attack on an Israeli resort overshoots its mark and kills a taxi driver in Jordan."], ["2010.08.03", "Dagestan", "Makhachkala", 2, 0, "Two police officers are assassinated by Islamic separatists at a market."], ["2010.08.03", "Iraq", "Baghdad", 5, 0, "The Islamic State of Iraq machine-guns five soldiers to death at point-blank range."], ["2010.08.03", "Iraq", "Kut", 12, 55, "Two car bombs at a market leave a dozen people dead and fifty others wounded."], ["2010.08.03", "Iraq", "Mosul", 9, 15, "Two vicious bombings leave nine Iraqis dead."], ["2010.08.04", "Afghanistan", "Helmand", 1, 0, "A young child is killed in a fundamentalist IED attack."], ["2010.08.04", "Afghanistan", "Uruzgan", 1, 1, "Terrorists detonate a bomb at a bazaar, killing one civilian."], ["2010.08.04", "Pakistan", "Peshawar", 4, 11, "A hero cop is among four blown apart by a Shahid suicide car bomber."], ["2010.08.04", "Somalia", "Bondhere", 3, 12, "Three cleaning women are exterminated by an al-Shabaab bomb blast."], ["2010.08.04", "Thailand", "Pattani", 1, 0, "A Buddhist is gunned down in an Islamist drive-by."], ["2010.08.05", "Afghanistan", "Kunduz", 7, 13, "A Fedayeen suicide bomber murders seven local police."], ["2010.08.05", "India", "Baramulla", 1, 2, "Islamic militants fire on a security patrol, killing one member."], ["2010.08.05", "Ingushetia", "Nazran", 2, 0, "Two cops are gunned down by suspected Islamic separatists."], ["2010.08.05", "Iraq", "Abu Ghraib", 3, 0, "A woman is among three people shot to death in their home by Muslim radicals."], ["2010.08.05", "Iraq", "Baghdad", 6, 8, "Two shootings by terrorists take down six Iraqis."], ["2010.08.05", "Iraq", "Tikrit", 3, 0, "An al-Qaeda attack leaves three people dead."], ["2010.08.05", "Pakistan", "Quetta", 1, 1, "Islamic militants open fire on an oil tanker, killing the driver."], ["2010.08.05", "Philippines", "Zamboanga", 5, 24, "A suicide bomber at an airport murders five other people."], ["2010.08.05", "Yemen", "Abyan", 3, 1, "al-Qaeda terrorists ambush and kill three members of a patrol."], ["2010.08.06", "Iraq", "Baghdad", 2, 13, "Two civilians are blown to bits by Jihadi bombers."], ["2010.08.06", "Iraq", "Kirkuk", 1, 0, "Muslim radicals shoot a woman to death."], ["2010.08.06", "Russia", "Baksan", 2, 0, "Two security personnel are brutally shot to death while sitting in their car."], ["2010.08.07", "Afghanistan", "Helmand", 1, 0, "A British father of four is shot to death by a Taliban prisoner who seizes a weapon on his way to a prayer session."], ["2010.08.07", "Afghanistan", "Helmand", 5, 13, "A bomb hidden in a wheelbarrow leaves five innocents dead."], ["2010.08.07", "Afghanistan", "Maiwand", 1, 1, "A child is murdered by Sunni bombers."], ["2010.08.07", "Afghanistan", "Nuristan", 10, 0, "Ten members of a medical team, including Christian doctors, are pulled out of their cars and executed by devout Muslim fundamentalists, who spare an Afghan able to recite the Quran."], ["2010.08.07", "Iraq", "Basra", 43, 185, "Over forty people are massacred by Islamic terrorists at a market.  Most burn to death in a fire caused by bombs."], ["2010.08.07", "Iraq", "Garma", 3, 15, "al-Qaeda militants detonate a bomb outside a home, killing three residents."], ["2010.08.07", "Thailand", "Narathiwat", 1, 0, "A 43-year-old Buddhist woman is brutally machine-gunned to death by Muslim radicals on her farm."], ["2010.08.07", "Thailand", "Pattani", 2, 1, "A Buddhist husband and wife are murdered by Muslim gunmen in their motorcycle shop.  Their 4-year-old nephew is wounded."], ["2010.08.07", "Thailand", "Yala", 1, 0, "Muslim terrorists kill an off-duty soldier on his motorcycle."], ["2010.08.08", "Indonesia", "Bekasi", 0, 12, "A mob of hundreds of Muslims chase and beat Christian worshippers after disrupting their service."], ["2010.08.08", "Iraq", "Fallujah", 4, 14, "Four civilians lose their lives in two car bombings."], ["2010.08.08", "Iraq", "Ramadi", 8, 50, "Eight Iraqis are pasted by Jihadi bombers."], ["2010.08.09", "Afghanistan", "Badghis", 1, 0, "A pregnant woman accused of adultery is whipped 200 times and then shot three times in the head by Islamic fundamentalists."], ["2010.08.09", "Iraq", "Baghdad", 3, 10, "Three traffic cops are taken down by Jihadi bombers."], ["2010.08.09", "Thailand", "Narathiwat", 1, 0, "Muslim terrorists stab and partially behead a young plantation worker."], ["2010.08.10", "Afghanistan", "Helmand", 5, 0, "Five local security personnel are killed when Islamic fundamentalists fire a rocket through their vehicle."], ["2010.08.10", "Afghanistan", "Kabul", 5, 1, "Blood and body parts are scattered about following a double suicide attack that leaves five Afghans dead."], ["2010.08.10", "India", "Baramulla", 3, 0, "Islamic radicals machine-gun three cops to death."], ["2010.08.10", "Iraq", "Baghdad", 5, 16, "Terrorists take down five Iraqis with two bombs."], ["2010.08.10", "Pakistan", "Mohmand", 3, 0, "Three members of a security patrol are killed in an ambush by Islamic militants."], ["2010.08.10", "Russia", "Kabardino-Balkaria", 2, 0, "Two people are killed when Muslim terrorists fire at tourists at a resort."], ["2010.08.11", "India", "Rajouri", 2, 21, "Lashkar e-Toiba terrorists fire on a bus, murdering two civilians, including a woman."], ["2010.08.11", "Iraq", "Baghdad", 1, 1, "Jihadis gun down two cops and kill a civilian with a bomb."], ["2010.08.11", "Iraq", "Sadiya", 11, 4, "Islamists lure eight police to their deaths by first killing three members of a family and then booby-trapping the house."], ["2010.08.11", "Pakistan", "Karachi", 2, 0, "Two Shias are shot to death by Sunnis in separate drive-by attacks."], ["2010.08.11", "Pakistan", "Mohmand", 1, 3, "A woman is killed, and her three sons injured, when militants fire a rocket into their home."], ["2010.08.12", "Iraq", "Baaj", 4, 0, "A bomb placed by Jihadis kills four disposal workers."], ["2010.08.13", "Afghanistan", "Herat", 4, 12, "The Taliban ambush a convoy of security guards, killing four."], ["2010.08.13", "Pakistan", "Quetta", 1, 0, "Sunni fundamentalists are suspected of firing into a barbershop, killing the owner."], ["2010.08.13", "Yemen", "Lahj", 1, 0, "A man is gunned down in an al-Qaeda drive-by outside a mosque."], ["2010.08.14", "Afghanistan", "Dam Abad", 3, 1, "Three children are torn apart by a rocket fired into their home by Islamic hardliners."], ["2010.08.14", "Afghanistan", "Kunduz", 1, 0, "A local cop is shot to death by Uzbek Islamists."], ["2010.08.14", "Egypt", "Shimi", 0, 11, "Eleven Christians are injured in assaults by Muslims stirred to anger by a local cleric."], ["2010.08.14", "India", "Sopore", 1, 0, "Islamic terrorists kidnap and murder a civilian."], ["2010.08.14", "Iraq", "Baghdad", 6, 15, "Islamic terrorists take down six Iraqis in a series of attacks, including policemen who were set on fire."], ["2010.08.14", "Pakistan", "Sindh", 2, 8, "A woman and boy are left dead when Muslim rivals attack each other over where to build a madrasah."], ["2010.08.14", "Thailand", "Pattani", 1, 0, "A local cop is shot to death by Islamic militants while traveling to work."], ["2010.08.14", "Thailand", "Yala", 2, 0, "A Buddhist man and wife are brutally murdered by Muslim gunmen while riding to their plantation."], ["2010.08.15", "Iraq", "Baghdad", 9, 27, "Nine Iraqis are taken down by Jihadis in a series of attacks."], ["2010.08.15", "Iraq", "Jurf al-Sakhar", 3, 2, "Three worshippers are shot to death outside a mosque by sectarian rivals."], ["2010.08.15", "Iraq", "Numaniya", 1, 0, "Muslim gunmen murder an Iraqi pharmacist who had returned from studies in the U.S."], ["2010.08.16", "Afghanistan", "Farah", 2, 0, "Two people are killed when Taliban gunmen fire into a bazaar."], ["2010.08.16", "Afghanistan", "Ghazni", 2, 5, "A remote-controlled bomb on a bridge takes out two civilians."], ["2010.08.16", "Afghanistan", "Herat", 5, 2, "Three women and a child are among five civilians killed by a Taliban bomb attack on their car."], ["2010.08.16", "Afghanistan", "Kunduz", 2, 0, "A couple in their 20's is stoned by Islamic fundamentalists for having sex.  The man has to be finished off with a gunshot."], ["2010.08.16", "Iraq", "Muqdadiya", 4, 9, "Four Iranian pilgrims on a bus are targeted and killed by Sunni bombers.  Women and children are among the victims."], ["2010.08.16", "Pakistan", "Karachi", 4, 0, "Sunnis shoot four Shia to death in separate attacks."], ["2010.08.16", "Somalia", "Elasha Biyaha", 1, 0, "A cleric who advocated peace is assassinated by Islamists."], ["2010.08.16", "Somalia", "Mogadishu", 9, 53, "Nine refugees are killed when al-Shabaab Islamists attack a displaced persons camp."], ["2010.08.17", "Afghanistan", "Spin Boldak", 8, 0, "Eight civilians are murdered by a Taliban bomb attack on a home."], ["2010.08.17", "Afghanistan", "Zabul", 2, 0, "A man and his wife are shot to death in their home by religious extremists."], ["2010.08.17", "Iraq", "Baghdad", 10, 46, "Sunni militants detonate a fuel tanker in a Shia neighborhood, incinerating ten innocents."], ["2010.08.17", "Iraq", "Baghdad", 61, 129, "Over sixty young Iraqis lining up for work are senselessly cut to shreds by a Shahid suicide nail-bomber."], ["2010.08.17", "Iraq", "Diyala", 3, 0, "An auditor and two judges are assassinated by Islamic terrorists in separate attacks."], ["2010.08.17", "Pakistan", "Karachi", 1, 0, "A leader of a minority religious sect is gunned down by mainstream rivals."], ["2010.08.17", "Pakistan", "Peshawar", 2, 0, "Two civilians are murdered at a mosque by Taliban gunmen."], ["2010.08.17", "Russia", "North Ossetia", 2, 23, "Two people are dead and twenty-three others injured in a suicide attack and separate cafe bombing."], ["2010.08.17", "Somalia", "Mogadishu", 1, 2, "A civilian is killed when Mujahideen toss a grenade at a police station."], ["2010.08.18", "Afghanistan", "Kandahar", 1, 0, "A suicide bomber takes out an Afghan cop."], ["2010.08.18", "India", "Kulgam", 2, 0, "Two civilians grazing cattle are abducted and murdered by Religion of Peace radicals."], ["2010.08.18", "India", "Sopore", 1, 2, "Islamic militants attack a lawmaker's home, killing a guard."], ["2010.08.18", "Indonesia", "Medan", 1, 1, "A security guard is killed when a terror cell linked to a radical cleric robs a bank."], ["2010.08.18", "Iraq", "Diyala", 3, 0, "Three brothers are brutally murdered on their own farm by Mujahideen."], ["2010.08.18", "Iraq", "Mosul", 4, 2, "Four Iraqis are taken down in separate terror attacks."], ["2010.08.18", "Iraq", "Tikrit", 2, 3, "Two civilians are blown to bits by a Jihadi bomb."], ["2010.08.18", "Pakistan", "Nazimabad", 1, 0, "A children's doctor is shot to death by sectarian rivals."], ["2010.08.18", "Pal. Auth.", "Gaza", 1, 0, "A 62-year-old woman is murdered outside her own home by Islamic fundamentalists."], ["2010.08.19", "Afghanistan", "Logar", 2, 0, "The bodies of two men are discovered after they were kidnapped and murdered in captivity."], ["2010.08.19", "Afghanistan", "Nangarhar", 2, 14, "Two civilians are killed when the Taliban blow up a fuel truck."], ["2010.08.19", "Algeria", "Baghlia", 3, 4, "Fundamentalists ambush a group of soldiers, killing three."], ["2010.08.19", "China", "Xinjiang", 7, 14, "An explosives-laden vehicle is plowed into a crowd and detonated, leaving seven dead."], ["2010.08.19", "Iraq", "Mosul", 3, 4, "A kidnapped civilian is among three Iraqis murdered in separate attacks."], ["2010.08.19", "Pakistan", "Orakzai", 1, 0, "A security guard is gunned down by Muslim militants."], ["2010.08.19", "Yemen", "Abyan", 2, 1, "al-Qaeda militants machine-gun two cops to death at point-blank range."], ["2010.08.20", "Afghanistan", "Helmand", 30, 17, "Some thirty workers and guards are massacred when Islamic fundamentalists assault a construction company."], ["2010.08.20", "Afghanistan", "Kandahar", 1, 0, "A civilian is brutally executed and tied between two roadside bombs by the Taliban."], ["2010.08.20", "Iraq", "Baghdad", 3, 6, "Jihadis shoot an electrical worker to death and take out two other civilians with a bomb."], ["2010.08.20", "Pakistan", "Dera Ismail Khan", 2, 1, "Islamic militants are suspected of gunning down two cops."], ["2010.08.20", "Pakistan", "Sanghar", 1, 0, "A leader of the peaceful Ahmadi sect is shot in the head by orthodox Sunni."], ["2010.08.20", "Thailand", "Yala", 1, 0, "A 63-year-old civilian is shot to death by Muslim terrorists."], ["2010.08.20", "Yemen", "Loder", 11, 0, "Eleven local soldiers are killed when al-Qaeda militants fire a rocket into a passing vehicle."], ["2010.08.21", "Afghanistan", "Helmand", 6, 0, "Six Afghan cops are bound and executed by religious hardliners."], ["2010.08.21", "Afghanistan", "Herat", 2, 0, "Two men are shot to death by the Taliban (the second in Kandahar)."], ["2010.08.21", "Afghanistan", "Paktika", 8, 5, "Eight Afghans are murdered by Taliban bombers in two attacks."], ["2010.08.21", "Dagestan", "Kizlyar", 1, 3, "Children are among the casualties when Jihadis attempt to blow up a passing car."], ["2010.08.21", "Ethiopia", "Addis Ababa", 0, 1, "A popular church leader is brutally assaulted by Muslims with wooden clubs."], ["2010.08.21", "Iraq", "Baghdad", 3, 1, "Three cops are taken down by Islamic terrorists in separate attacks."], ["2010.08.21", "Pakistan", "Baghlia", 6, 5, "Six members of a peace committee are blow to bits by Mujahid bombers."], ["2010.08.22", "India", "Kulgam", 2, 0, "A mother and her teen daughter are brutally murdered in their own home by Religion of Peace gunmen."], ["2010.08.22", "India", "Pulwama", 1, 0, "Islamic radicals murder the son of a welfare employee."], ["2010.08.22", "Iraq", "Mussayab", 1, 11, "One employee is killed when a sectarian bomb blast rips through a store."], ["2010.08.22", "Pakistan", "Dera Ismail Khan", 1, 0, "Sunni terrorists gun down an innocent Shia father of two young children."], ["2010.08.22", "Pakistan", "Peshawar", 1, 3, "A civilian is taken down in a militant ambush."], ["2010.08.22", "Tajikistan", "Dushanbe", 5, 1, "Islamic militants beat five prison guards to death."], ["2010.08.23", "Iraq", "Baghdad", 3, 15, "A mortar attack and separate bombing at a coffee shop leave three dead."], ["2010.08.23", "Iraq", "Baiji", 7, 0, "Suspected al-Qaeda shoot seven oil workers to death."], ["2010.08.23", "Pakistan", "Kurram", 8, 10, "Islamist bombers take out seven tribal elders and a teacher at a school."], ["2010.08.23", "Pakistan", "Landikotal", 2, 0, "Local Taliban burn two men alive in their truck."], ["2010.08.23", "Pakistan", "Matni", 3, 3, "Three people are blown to bits by Mujahid bombers at a market"], ["2010.08.23", "Pakistan", "South Waziristan", 26, 40, "A suicide bomber at a seminary sends two-dozen other souls to Allah."], ["2010.08.23", "Thailand", "Pattani", 2, 4, "Two civilians are machine-gunned to death by Muslim insurgents in separate attacks."], ["2010.08.24", "Iraq", "Baghdad", 3, 0, "A man at a market and another in his home are among three gunned down by Muslim assassins."], ["2010.08.24", "Iraq", "Baqubah", 3, 13, "Three Iraqis are taken out by a Fedayeen suicide bomber."], ["2010.08.24", "Iraq", "Fallujah", 2, 2, "Two children are successfully killed by Mujahideen bombers in a blast that also leaves their mother wounded."], ["2010.08.24", "Mali", "Bamako", 1, 0, "An older pensioner taken prisoner by al-Qaeda is murdered in captivity."], ["2010.08.24", "Pakistan", "Bajaur", 1, 0, "A young man is abducted and murdered by Tehreek-e-Taliban."], ["2010.08.24", "Pakistan", "Peshawar", 1, 0, "A peace activist and father is killed in captivity by Sunni militants."], ["2010.08.24", "Somalia", "Mogadishu", 33, 150, "A barbaric assault on a hotel by Muslim terrorists leaves women, children and more than a dozen visiting lawmakers dead."], ["2010.08.25", "Afghanistan", "Badghis", 3, 0, "Two Spanish soldiers training local cops are shot to death along with their translator by their driver."], ["2010.08.25", "Iraq", "Baghdad", 63, 277, "Jihadis take out over sixty Iraqis in a series of coordinated blasts from Basra to Kut."], ["2010.08.25", "Pakistan", "Bajaur", 1, 0, "Islamic militants shoot a tax collector to death on his way home."], ["2010.08.25", "Pakistan", "Mohmand", 2, 2, "A mother and her 9-year-old child are brutally murdered by Islamist gunmen."], ["2010.08.25", "Pakistan", "Swat", 3, 6, "Three Christian aid workers helping flood victims are kidnapped and murdered by Islamic fundamentalists."], ["2010.08.25", "Thailand", "Pattani", 1, 0, "A 57-year-old rubber tapper is killed by drive-by Jihadis."], ["2010.08.25", "Yemen", "Zinjibar", 4, 1, "al-Qaeda gunmen on motorcycles massacre four security men in a drive-by."], ["2010.08.26", "Afghanistan", "Kunduz", 8, 1, "Eight policemen are machine-gunned to death by Taliban ambushers."], ["2010.08.26", "Iraq", "Mosul", 4, 11, "Children are among the casualties in a series of Mujahideen attacks."], ["2010.08.26", "Iraq", "Muqdadiya", 6, 0, "Six Sunnis are gunned down by suspected al-Qaeda."], ["2010.08.26", "Pakistan", "Bajaur", 1, 0, "Islamists murder the son of a surrendered militant."], ["2010.08.26", "Philippines", "Balili", 4, 0, "Maranao Muslims pull four people off a bus and shoot them to death."], ["2010.08.26", "Somalia", "Mogadishu", 14, 8, "Fourteen Somalis are shredded by two al-Shabaab bomb blasts."], ["2010.08.26", "Thailand", "Narathiwat", 1, 0, "A 30-year-old teacher is shot to death by Islamic radicals while leaving school."], ["2010.08.26", "Thailand", "Pattani", 1, 0, "A 42-year-old civilian dies from injuries after being shot twice in the chest by Muslim militants."], ["2010.08.26", "Thailand", "Pattani", 1, 0, "A 52-year-old man is killed in a Muslim ambush."], ["2010.08.26", "Thailand", "Yala", 1, 0, "Muslim terrorists gun down a Buddhist railway worker."], ["2010.08.27", "Iraq", "Baaj", 3, 0, "Three Iraqis are gunned down by Mujahid."], ["2010.08.27", "Iraq", "Kirkuk", 1, 3, "A child is taken down by Islamic bombers."], ["2010.08.27", "Iraq", "Mahaweel", 2, 0, "A blast takes down two civilians."], ["2010.08.27", "Iraq", "Mosul", 1, 0, "The body of a Christian man is found several days after he is kidnapped."], ["2010.08.27", "Iraq", "Mosul", 2, 0, "A middle-aged Buddhist couple is brutally murdered by Muslim gunmen as they are returning from market."], ["2010.08.27", "Iraq", "Shurqat", 3, 3, "A suspected al-Qaeda attack leaves three dead."], ["2010.08.27", "Nigeria", "Borno", 3, 0, "Boko Haram Islamists shoot three policemen to death in two drive-bys."], ["2010.08.27", "Pakistan", "Ghaziabad", 1, 0, "A 35-year-old mother of three is killed by her brother on suspicion of unauthorized sex."], ["2010.08.27", "Thailand", "Pattani", 1, 0, "A 21-year-old man is murdered by Muslim gunmen."], ["2010.08.27", "Thailand", "Yala", 1, 0, "A young woman is shot to death by Religion of Peace proponents."], ["2010.08.28", "Pakistan", "Khyber", 1, 0, "A local soldier is kidnapped and shot full of holes by Mujahideen."], ["2010.08.28", "Thailand", "Narathiwat", 1, 0, "A 40-year-old man is shot in the head by Muslim militants."], ["2010.08.28", "Yemen", "Abyan", 10, 2, "Ten local soldiers are ambushed and killed by terrorists who burn their bodies while chanting 'Allah akbar.'"], ["2010.08.29", "Afghanistan", "Kabul", 6, 0, "Five election workers and a candidate are kidnapped and murdered by Taliban freedom fighters."], ["2010.08.29", "Chechnya", "Tsentoroi", 7, 5, "A wave of armed Islamists attack a village, killing at least seven."], ["2010.08.29", "Iraq", "Mosul", 5, 12, "A woman is among five Iraqis murdered by Islamic terrorists."], ["2010.08.29", "Pakistan", "Khyber", 2, 4, "The Taliban kill two local soldiers with a roadside bomb."], ["2010.08.29", "Philippines", "Bukidnon", 0, 2, "'Irate Muslims' throw a grenade into a Catholic church during mass."], ["2010.08.29", "Thailand", "Narathiwat", 1, 0, "A 2-year-old boy dies after being shot in the head by Muslim militants."], ["2010.08.29", "Thailand", "Pattani", 2, 0, "A middle-aged Buddhist couple are shot to death in their pickup by Islamic separatists."], ["2010.08.30", "Afghanistan", "Helman", 1, 0, "An Estonian solder is murdered by Taliban bombers."], ["2010.08.30", "Afghanistan", "Jalalabad", 1, 3, "The Taliban assassinate a local official with a bomb."], ["2010.08.30", "Afghanistan", "Marjah", 2, 1, "Two civilians are shot to death at a mosque by fundamentalists."], ["2010.08.30", "Iraq", "Baghdad", 1, 3, "Jihadi car bombers kill a civilian."], ["2010.08.30", "Somalia", "Mogadishu", 4, 8, "Four guards at the presidential palace are killed during an al-Shabaab mortar attack."], ["2010.08.31", "Afghanistan", "Badakhshan", 3, 0, "Three Oxfam humanitarian workers are taken out in a brutal roadside blast."], ["2010.08.31", "Afghanistan", "Kabul", 3, 12, "Three supreme court employees are riddled with bullets by Holy Warriors."], ["2010.08.31", "Afghanistan", "Kabul", 11, 0, "Eleven US troops on security patrol are killed in three roadside bombings."], ["2010.08.31", "India", "Bandipora", 1, 2, "An Indian soldier is ambushed and killed by Pakistani terrorists."], ["2010.08.31", "India", "Kishtwar", 1, 0, "A cop is murdered inside his home by Hizb-ul- Mujahideen."], ["2010.08.31", "Iraq", "Mosul", 2, 1, "Two brothers are shot to death by suspected Mujahideen."], ["2010.08.31", "Israel", "Hebron", 4, 0, "A pregnant woman is among four young Jews gunned down in cold blood by Hamas terrorists."], ["2010.08.31", "Pakistan", "Kurram", 7, 1, "At least one woman and two children are among seven murdered in two home invasions by Religion of Peace radicals."], ["2010.08.31", "Somalia", "Las Anod", 1, 0, "A man is shot outside his doorstep by Islamic militia."], ["2010.08.31", "Somalia", "Mogadishu", 8, 14, "Five men and three women are taken down by al-Shabaab bombers."], ["2010.09.01", "Afghanistan", "Helmand", 0, 15, "Fifteen people at a market are badly injured, many with limbs torn from their bodies, by a Taliban blast."], ["2010.09.01", "Afghanistan", "Kandahar", 2, 2, "Two Afghans are blown to bits by a Taliban bomb hidden on a motorcycle."], ["2010.09.01", "Algeria", "Boumerdes", 2, 26, "A Fedayeen suicide bomber kills two local soldiers and injures dozens more."], ["2010.09.01", "Iraq", "Mosul", 3, 6, "A woman is among three Iraqis taken down by a Jihadi bombing and shooting attack."], ["2010.09.01", "Israel", "Samaria", 0, 2, "A rabbi and his wife are shot by Palestinian terrorists while riding in their car."], ["2010.09.01", "Pakistan", "Karachi", 1, 0, "A young mother is burned to death by her in-laws in a suspected honor killing."], ["2010.09.01", "Pakistan", "Lahore", 43, 270, "Over thirty Shia pilgrims in a procession are dismantled by a car bomb blast and two Sunni suicide bombers."], ["2010.09.01", "Thailand", "Pattani", 2, 0, "A Buddhist couple in their 50's are brutally murdered by Jihadi gunmen."], ["2010.09.01", "Thailand", "Yala", 1, 0, "A 49-year-old security worker is shot to death as he is riding home from work."], ["2010.09.02", "Iraq", "Baghdad", 2, 0, "A taxi driver and senior education ministry official are gunned down in separate attacks."], ["2010.09.02", "Iraq", "Baiji", 2, 5, "Suspected al-Qaeda shoot two opponents to death."], ["2010.09.02", "Pakistan", "Bajaur", 1, 2, "A female teacher is shot to death by Holy Warriors."], ["2010.09.02", "Pakistan", "Kyber", 1, 0, "Mujahideen kidnap and brutally murder a taxi driver returning from a friend's funeral."], ["2010.09.02", "Pakistan", "Turbat", 2, 8, "Sunni gunmen open fire on a bus full of Shia pilgrims, killing at least two."], ["2010.09.02", "Sudan", "Tabra", 74, 79, "Janjiweed militia on camels sweep through a market and slaughter over seventy people, including eighteen children."], ["2010.09.02", "Thailand", "Pattani", 1, 1, "A 35-year-old man is murdered in an Islamist drive-by."], ["2010.09.03", "Azerbaijan", "Gumbashly", 1, 1, "One dead as a 'religious dispute' between mosque members results in gunfire."], ["2010.09.03", "Iraq", "Baghdad", 4, 4, "Four Iraqis are shot or blown up around the country by Mujahideen."], ["2010.09.03", "Iraq", "Mosul", 1, 0, "An imam is gunned down outside his mosque by Religion of Peace rivals."], ["2010.09.03", "Pakistan", "Mardan", 1, 2, "A Sunni suicide bomber detonates at an Ahmadiyya (minority sect) mosque, killing one."], ["2010.09.03", "Pakistan", "Peshawar", 1, 3, "Muslim militants slay a local cop with a roadside bomber."], ["2010.09.03", "Pakistan", "Quetta", 73, 149, "Over sixty innocents are slaughtered when a suicide bomber targets a Shia procession."], ["2010.09.03", "Somalia", "Galgala", 5, 0, "At least five Puntland soldiers are killed in an ambush by Islamic militants."], ["2010.09.03", "Tajikistan", "Khujand", 2, 25, "A suicide bomber injures twenty-five and kills 2."], ["2010.09.04", "Afghanistan", "Faryab", 3, 5, "Three local cops are exterminated in a brutal ambush."], ["2010.09.04", "Afghanistan", "Ghazni", 1, 0, "Sunni extremists behead a Shia businessman."], ["2010.09.04", "Afghanistan", "Kandahar", 3, 11, "Three civilians including a child are blown to bits by a Fedayeen martyr."], ["2010.09.04", "Afghanistan", "Kunduz", 7, 17, "A child is among seven murdered by a Shahid suicide bomber outside a butcher shop."], ["2010.09.04", "Dagestan", "Makhachkala", 1, 3, "Terrorists manage to kill one person with a car bomb."], ["2010.09.04", "Pakistan", "Sindh", 2, 0, "The wife and nephew of a police officer are murdered by suspected radicals."], ["2010.09.04", "Thailand", "Pattani", 1, 1, "Islamist open fire on two civilians riding a motorcycle, killing one."], ["2010.09.05", "Dagestan", "Buinaksk", 5, 36, "A Shahid suicide car bomber sends five other souls to Allah."], ["2010.09.05", "Iraq", "Baghdad", 12, 36, "Six Fedayeen attack a government building, killing a dozen Iraqis."], ["2010.09.05", "Nigeria", "Borno", 2, 4, "A trader is among two men shot to death by Boko Haram Islamists."], ["2010.09.05", "Pakistan", "Punjab", 1, 0, "An oil rig driver is killed by Islamic snipers."], ["2010.09.05", "Yemen", "Abyan", 3, 0, "Three people are shot to death in an al-Qaeda ambush."], ["2010.09.06", "Afghanistan", "Baghlan", 2, 0, "The Taliban kill a district governor and his bodyguard in an ambush."], ["2010.09.06", "Afghanistan", "Kabul", 1, 0, "A 45-year-old news anchor is the target of a 'brutal beheading' near his home."], ["2010.09.06", "Afghanistan", "Paktika", 3, 5, "Freedom fighters shoot three children to death."], ["2010.09.06", "Algeria", "Skikda", 3, 2, "al-Qaeda murder three local cops with a roadside bomb."], ["2010.09.06", "Algeria", "Tebessa", 2, 0, "Fundamentalists kill two local security personnel with a bomb."], ["2010.09.06", "Iraq", "Samarra", 5, 0, "Five construction workers building a youth center are stabbed and shot to death in a barbaric Mujahideen attack."], ["2010.09.06", "Pakistan", "Kohat", 21, 40, "Women and children are most of the two dozen victims in a powerful suicide blast on their residential compound."], ["2010.09.06", "Pakistan", "Lakki Marwat", 19, 46, "Nine schoolchildren are among nineteen innocent lives snuffed out by Holy Warrior suicide bombers."], ["2010.09.06", "Tajikistan", "Dushanbe", 0, 7, "Fundamentalists toss a bomb into a disco."], ["2010.09.06", "Thailand", "Pattani", 2, 0, "A janitor is among two civilians assassinated by Muslim gunmen in separate attacks."], ["2010.09.06", "Thailand", "Yala", 1, 0, "A middle-aged woman is shot to death by Mujahid while walking home."], ["2010.09.07", "Iraq", "Baghdad", 1, 0, "A TV anchor who tried to end sectarian violence is shot outside his home by a sectarian faction."], ["2010.09.07", "Iraq", "Baghdad", 2, 6, "Mujahid manage to take down two Iraqis with a roadside bomb."], ["2010.09.07", "Iraq", "Mosul", 1, 0, "A woman is shot to death by Muslim terrorists."], ["2010.09.07", "Iraq", "Samarra", 3, 0, "A married couple are among three family members slain in their home by Sunni gunmen."], ["2010.09.07", "Pakistan", "Hangu", 1, 2, "A police officer succumbs to injury after clinging to life for a few days following an Islamist bombing."], ["2010.09.07", "Pakistan", "Punjab", 2, 0, "Terrorists murder a man and his nephew."], ["2010.09.07", "Russia", "Baksanenok", 1, 0, "Suspected Islamists assassinate a judge."], ["2010.09.07", "Thailand", "Narathiwat", 1, 0, "A young Buddhist is gunned down in an Muslim drive-by attack."], ["2010.09.07", "Thailand", "Narathiwat", 2, 0, "Two middle aged Buddhist teachers, husband and wife, are murdered by Islamic radicals."], ["2010.09.08", "Iraq", "Baghdad", 3, 12, "A Shahid suicide bomber takes out three Iraqis."], ["2010.09.08", "Iraq", "Baghdad", 3, 19, "Three people are killed by a car bomb blast."], ["2010.09.08", "Iraq", "Kirkuk", 4, 10, "Four people are murdered by Islamic bombers."], ["2010.09.08", "Nigeria", "Bauchi", 4, 8, "Boko Haram Islamists assault a prison, killing two employees and two civilians."], ["2010.09.08", "Pakistan", "Khyber", 4, 0, "Four political activists are shot to death by suspected Taliban."], ["2010.09.09", "Dagestan", "Derbent", 2, 0, "Two men are gunned down in separate Mujahideen attacks."], ["2010.09.09", "Iraq", "Abu Ghraib", 1, 0, "A policeman is killed in his own home by terrorists."], ["2010.09.09", "Iraq", "Baghdad", 2, 2, "Two people are reportedly killed when gunmen open fire on an Anglican church in an incident tied to a threatened Quran burning."], ["2010.09.09", "Iraq", "Baghdad", 3, 10, "Three Iraqis are taken out by Jihadi car bombers."], ["2010.09.09", "Iraq", "Diyala", 1, 0, "A woman is beheaded in her own home by suspected al-Qaeda 'insurgents'."], ["2010.09.09", "Iraq", "Muqdadiya", 1, 1, "A cleric is beheaded and set on fire by Freedom Fighters."], ["2010.09.09", "Pakistan", "Khyber", 3, 0, "Three laborers working in a forest are abducted and murdered by Tehreek-e-Taliban."], ["2010.09.09", "Pakistan", "Kurram", 10, 4, "Militants murder ten bus passengers with an explosive device."], ["2010.09.09", "Pakistan", "Quetta", 5, 4, "A suicide bomber detonates inside an official's home, taking five lives."], ["2010.09.09", "Russia", "Vladikavkaz", 18, 123, "A Shahid drives an explosives-laden vehicle into a market, blasting seventeen shoppers to bits."], ["2010.09.09", "Somalia", "Mogadishu", 9, 3, "Five Fedayeen suicide bombers storm an airport and kill nine others, including two women."], ["2010.09.09", "Thailand", "Yala", 1, 0, "Muslim separatists shoot a 52-year-old Buddhist in the head then kick his body under a bridge."], ["2010.09.09", "Yemen", "Moudia", 3, 4, "al-Qaeda assault a military checkpoint, killing three Yemenis."], ["2010.09.10", "Dagestan", "Makhachkala", 1, 0, "An off-duty cop is gunned down at his father's home by Islamic radicals."], ["2010.09.10", "Ingushetia", "Nazran", 1, 0, "Muslim separatists shoot a man to death outside an auto repair shop."], ["2010.09.11", "Iraq", "Baghdad", 2, 4, "Two Iraqis die from splinter injuries after Jihadis send rockets into a commercial district."], ["2010.09.12", "Afghanistan", "Helmand", 2, 12, "Two locals are taken down by a bomb.  A rocket attack elsewhere injures ten family members."], ["2010.09.12", "Dagestan", "Makhachkala", 1, 0, "Muslim extremists shoot a man to death in his car."], ["2010.09.12", "Indonesia", "Bekasi", 0, 2, "Holy Warriors beat a pastor with a board and stab a worshipper in the stomach as there are on their way to church."], ["2010.09.12", "Iraq", "Baquba", 2, 1, "Two Iraqis are blown up by Jihadi bombers."], ["2010.09.12", "Iraq", "Buhriz", 1, 3, "A woman and two children are among the casualties of a vicious bombing."], ["2010.09.12", "Iraq", "Hudayyeb", 1, 1, "Two men are shot, one of them an elderly man by his own al-Qaeda sons."], ["2010.09.12", "Somalia", "Mogadishu", 5, 24, "Five Somalis are blown to bits when Islamic militia detonate a bomb outside a mosque."], ["2010.09.13", "Ethiopia", "Dufti", 0, 1, "A group of Islamists stab a Christian who had left Islam."], ["2010.09.13", "India", "Poonch", 1, 0, "Islamic terrorists abduct a civilian from his home and murder him."], ["2010.09.13", "India", "Pulwama", 1, 0, "Lashkar-e-Toiba radicals intrude into a local soldier's home and shoot him to death."], ["2010.09.13", "Iraq", "Baghdad", 4, 6, "Four Iraqis are murdered in separate Mujahideen attacks, including a father in front of his family."], ["2010.09.13", "Pakistan", "Kurram", 6, 4, "A half dozen people are sent to Allah by suspected Tarik-e-Taliban bombers."], ["2010.09.14", "Ingushetia", "Nazran", 0, 1, "An imam who spoke out against Islamic terrorism is quickly neutralized by a car bomb."], ["2010.09.14", "Iraq", "Baghdad", 1, 0, "A woman of 'ill-repute' is hanged in her own home by suspected fundamentalists."], ["2010.09.14", "Iraq", "Mosul", 2, 0, "Two men are gunned down in separate attacks."], ["2010.09.14", "Pakistan", "Hangu", 1, 0, "Islamists shoot a journalist to death outside a press club."], ["2010.09.15", "Afghanistan", "Balkh", 2, 0, "Two election workers are gunned down in cold blood by religious radicals."], ["2010.09.15", "Afghanistan", "Kandahar", 2, 0, "Two children are murdered by Taliban bombers."], ["2010.09.15", "Iraq", "Tal Afar", 10, 5, "A minibus is blasted by Jihadi bombers, leaving ten riders dead."], ["2010.09.16", "Afghanistan", "Ghazni", 5, 2, "Five employees of a security firm are brutally murdered in their office by Taliban fundamentalists."], ["2010.09.16", "Dagestan", "Kaspiisk", 1, 0, "A shooting at a hospital by suspected 'insurgents' leaves one person dead."], ["2010.09.16", "Iraq", "Abu Saida", 2, 0, "A man and his wife are gunned down by al-Qaeda."], ["2010.09.16", "Iraq", "Samarrah", 3, 6, "A Fedayeen suicide bomber takes out three Iraqis."], ["2010.09.16", "Pakistan", "Khar", 2, 0, "Islamic militants attack a home, killing two people inside, including a teen."], ["2010.09.16", "Philippines", "Basilan", 3, 0, "Abu Sayyaf militants shoot three local soldiers to death in a surprise attack."], ["2010.09.16", "Somalia", "Mogadishu", 3, 6, "Islamic militia send mortars into a government complex, killing at least three."], ["2010.09.16", "Thailand", "Narathiwat", 2, 0, "Islamic 'insurgents' riddle a Buddhist father and his teenage son with automatic weapons fire."], ["2010.09.16", "Yemen", "Shabwa", 2, 0, "al-Qaeda ambush two local security personnel, leaving both dead."], ["2010.09.17", "Afghanistan", "Balkh", 9, 0, "Nine people are dismembered when a horse-drawn cart gets blasted by Taliban bombers."], ["2010.09.17", "Iraq", "Hawija", 4, 9, "Jihadi bombers take down four civilians with a roadside blast."], ["2010.09.18", "Afghanistan", "Asadabad", 1, 1, "A child is murdered by a Taliban rocket attack."], ["2010.09.18", "Afghanistan", "Baghlan", 7, 5, "Seven locals are killed in an Islamist assault on a voting station."], ["2010.09.18", "Afghanistan", "Kunar", 1, 1, "A voter and a woman are shot by Sunni terrorists at a polling station."], ["2010.09.18", "Afghanistan", "Nazyan", 2, 1, "Two people are killed by a Taliban rocket attack."], ["2010.09.18", "Afghanistan", "Sharsharak", 3, 4, "Children are the casualties of a vicious bombing by Islamic fundamentalists."], ["2010.09.18", "Afghanistan", "Zabul", 3, 0, "Taliban bombers take out three Afghans."], ["2010.09.18", "Iran", "Iranshahr", 1, 0, "Jundallah (Soldiers of God) kidnap a civilian and kill him during a rescue attempt."], ["2010.09.18", "Iraq", "Mosul", 1, 0, "A civilian is brought down by Sunni gunmen."], ["2010.09.18", "Kenya", "Nairobi", 0, 6, "Six Christian missionaries are abducted, raped and tortured for three days by Muslims proclaiming the truth of Islam."], ["2010.09.19", "Afghanistan", "Balkh", 3, 0, "Three election workers are kidnapped and brutally murdered by Religion of Peace enthusiasts."], ["2010.09.19", "Afghanistan", "Ghazni", 1, 8, "The Taliban send a mortar into a family home, killing at least one."], ["2010.09.19", "Afghanistan", "Kunduz", 8, 0, "Eight children bleed out following a Taliban rocket attack."], ["2010.09.19", "India", "New Delhi", 0, 2, "Two Taiwanese tourists riding a bus are shot by Mujahideen."], ["2010.09.19", "Iraq", "Baghdad", 2, 0, "Two minibus passengers are taken down by a roadside bomb."], ["2010.09.19", "Iraq", "Baghdad", 12, 36, "A vicious bomb blast takes down a dozen innocents."], ["2010.09.19", "Iraq", "Baghdad", 19, 58, "Islamic bombers disassemble nineteen people waiting in line at a cell phone provider."], ["2010.09.19", "Iraq", "Fallujah", 6, 14, "Six Iraqis are blown to bits by Jihadi car bombers."], ["2010.09.19", "Pakistan", "Karachi", 1, 0, "A Shia man is murdered by Sunni gunmen."], ["2010.09.19", "Tajikistan", "Rasht", 25, 20, "The Islamic Movement of Uzbekistan ambushes and kills twenty-five Tajik troops along the border."], ["2010.09.19", "Thailand", "Narathiwat", 2, 0, "Muslim terrorists murder a Buddhist man and his wife and set fire to their house."], ["2010.09.19", "Thailand", "Narathiwat", 2, 0, "Two elderly Buddhist villagers are shot to death in their homes by Islamic gunmen."], ["2010.09.20", "Iraq", "Mosul", 1, 0, "Terrorists gun down a cop."], ["2010.09.20", "Pakistan", "Liaquatabad", 3, 2, "Sectarian snipers take out three mourners at a funeral."], ["2010.09.21", "Afghanistan", "Parwan", 5, 5, "Five construction workers are taken apart by Taliban bombers."], ["2010.09.21", "Algeria", "Bordj Menaiel", 2, 3, "Fundamentalists take down two local security personnel with a roadside blast."], ["2010.09.21", "Iraq", "Mosul", 4, 3, "A woman is among four Iraqis killed in separate terror attacks."], ["2010.09.21", "Iraq", "Mosul", 4, 20, "Four local cops are taken out by a Jihadi bomb."], ["2010.09.21", "Nigeria", "Maiduguri", 2, 0, "Two people are shot to death by Boko Harem Islamists in a motorbike drive-by."], ["2010.09.21", "Pakistan", "Karachi", 2, 2, "Sunni radicals fire into a Shia bakery, killing two people."], ["2010.09.22", "Indonesia", "Sumatra", 3, 0, "Islamic radicals murder three local cops during an assault on their station."], ["2010.09.22", "Iraq", "Mosul", 1, 0, "Terrorists gun down a civilian."], ["2010.09.22", "Pakistan", "Khyber", 3, 1, "Three local security forces are blown apart by a roadside bomb."], ["2010.09.22", "Somalia", "Bosaso", 2, 2, "al-Qaeda linked militants kill security personnel with a roadside bomb."], ["2010.09.22", "Yemen", "Hawta", 1, 0, "A civilian is murdered by al-Qaeda."], ["2010.09.23", "Iraq", "Baghdad", 4, 4, "Four young boys under the age of ten are murdered by a Mujahid bomb attack on their car."], ["2010.09.23", "Iraq", "Mosul", 2, 0, "A woman is among two people killed in their own homes by Mujahideen."], ["2010.09.23", "Iraq", "Taji", 2, 0, "A man and his wife are shot to death by Holy Warriors."], ["2010.09.23", "Pakistan", "Landi Kotal", 3, 0, "Three people burn to death when Islamic militants bomb an oil tanker."], ["2010.09.23", "Thailand", "Pattani", 2, 0, "Two Buddhists are shot to death by militant Muslims as they are delivering noodles to a store."], ["2010.09.24", "Chechnya", "Grozny", 3, 0, "Three soldiers are slain in a Jihadi ambush."], ["2010.09.24", "Dagestan", "Makhachkala", 1, 0, "A high school principal is murdered in her home by Muslim radicals."], ["2010.09.24", "Dagestan", "Makhachkala", 2, 44, "Forty-four people are injured when a suicide bomber detonates along a city sidewalk."], ["2010.09.24", "Iraq", "Kohat", 2, 4, "Two laborers are shot to death by Islamic militants."], ["2010.09.24", "Iraq", "Mosul", 1, 2, "A Shahid suicide bomber detonates at a mosque, killing a bystander."], ["2010.09.24", "Mogadishu", "Hiran", 2, 2, "Two civilians are killed during an al-Shabaab ambush."], ["2010.09.25", "Afghanistan", "Balkh", 1, 15, "A civilian is blown to bits by a Fedayeen suicide bomber."], ["2010.09.25", "Iraq", "Baghdad", 1, 0, "Terrorists kill a traffic cop with an IED."], ["2010.09.25", "Pakistan", "Bahawalpur", 2, 6, "Gunmen open fire on a rival mosque, killing at least two."], ["2010.09.25", "Pakistan", "Kalat", 1, 0, "Taliban sympathizers are suspected of shooting a driver to death and setting fire to his truck."], ["2010.09.25", "Yemen", "Sanaa", 2, 8, "al-Qaeda snipers fire into a police bus, taking down two occupants."], ["2010.09.26", "India", "Baramulla", 1, 0, "Islamic militants gun down a civilian coming out of a mosque."], ["2010.09.26", "Ingushetia", "Yandare", 1, 1, "Islamists roll up on a police post and take down one officer at point-blank range."], ["2010.09.26", "Iraq", "Baghdad", 4, 0, "Four local police are gunned down in separate terror attacks."], ["2010.09.26", "Iraq", "Garma", 4, 4, "Four Iraqis are blown up by Jihadi car bombers."], ["2010.09.26", "Iraq", "Mosul", 3, 0, "Two brothers shot in their home are among three people murdered by Mujahideen."], ["2010.09.27", "Dagestan", "Makhachkala", 2, 1, "A girl and her father are shot to death on the doorstep of their home by Muslim terrorists."], ["2010.09.27", "India", "Hat Thymmai", 1, 2, "A Hindu woman is murdered by Bangladeshi radicals."], ["2010.09.27", "Iraq", "Mosul", 2, 1, "A woman and a teacher are shot to death by religious militants."], ["2010.09.27", "Pakistan", "Karachi", 1, 0, "Sectarian Jihadis gun down a Shia civilian."], ["2010.09.28", "Afghanistan", "Ghazni", 5, 17, "Five people are shredded by a Fedayeen suicide bomber."], ["2010.09.28", "Iraq", "Samarrah", 1, 0, "Terrorists barge into a house and murder a policeman."], ["2010.09.28", "Iraq", "Tarmiya", 2, 8, "Two Iraqis are killed when a cafe is blasted by a Jihad bomb."], ["2010.09.28", "Thailand", "Pattani", 5, 3, "Children are among the victims when Islamic radicals brutally gun down five people buying fruit at a warehouse."], ["2010.09.29", "Iraq", "Baqubah", 1, 1, "A civilian standing near a minibus is gunned down by Holy Warriors."], ["2010.09.29", "Russia", "Elbrus", 2, 20, "A woman is among two people shot to death by Islamists."], ["2010.09.29", "Yemen", "Shabwa", 3, 0, "Three Yemenis are riddled with bullets by al-Qaeda cadres."], ["2010.09.30", "Afghanistan", "Kandahar", 3, 9, "Three civilians are dismembered by a Shahid suicide bomber."], ["2010.10.01", "Iraq", "Baghdad", 3, 7, "A suspected al-Qaeda blast near a mosque leaves three people dead."], ["2010.10.01", "Pakistan", "Haripur", 7, 0, "A Christian couple and their five children (ages 6-17) are brutally shot to death in their home by Muslim extremists."], ["2010.10.01", "Pakistan", "Sindh", 5, 8, "Five people are burned alive when Jihadis fire rockets into oil tankers in two separate attacks."], ["2010.10.01", "Yemen", "Sanaa", 1, 1, "Two Westerners working for an oil company are gunned down."], ["2010.10.02", "Afghanistan", "Helmand", 1, 1, "Islamic hardliners kill a child with an IED."], ["2010.10.02", "Afghanistan", "Paktika", 7, 0, "Seven members of a family are ripped apart by a Taliban roadside blast, including three children."], ["2010.10.02", "Iraq", "Mosul", 3, 0, "Three police officers are taken down by Jihadi bombers."], ["2010.10.02", "Pakistan", "Mardan", 1, 0, "Tehreek-e-Taliban militants are suspected of assassinating a rival religious scholar."], ["2010.10.03", "Algeria", "Tizi Ouzou", 5, 10, "Five security personnel in a shooting and bombing ambush by armed fundamentalists."], ["2010.10.03", "Iraq", "Fallujah", 5, 4, "Five Iraqis are murdered in a series of area terror attacks."], ["2010.10.03", "Iraq", "Mosul", 1, 0, "A university professor is killed by fundamentalist gunmen."], ["2010.10.03", "Iraq", "Mosul", 1, 0, "Terrorists shoot a shepherd to death in his home."], ["2010.10.03", "Italy", "Modena", 1, 1, "A woman is beaten to death by her own husband for trying to stop the forced marriage of her daughter, who is also put in a coma by her brother."], ["2010.10.03", "Pakistan", "Islamabad", 6, 14, "Six people are burned to death by a Sunni rocket attack on an industrial complex."], ["2010.10.03", "Pakistan", "Miranshah", 3, 0, "Three civilians are abducted and executed by Taliban militants."], ["2010.10.03", "Thailand", "Yala", 3, 3, "Three local soldiers are ambushed and killed by Muslim separatists."], ["2010.10.04", "Afghanistan", "Ghazni", 2, 6, "Hardliners send rockets into a civilian district, killing two."], ["2010.10.04", "Afghanistan", "Kandahar", 1, 0, "A local official is gunned down by Islamist while praying at a mosque."], ["2010.10.04", "Afghanistan", "Kandahar", 4, 17, "Islamic hardliners murder four local cops with a series of bomb blasts."], ["2010.10.04", "Dagestan", "Chiryurt", 2, 0, "Suspected Islamists assassinate two local farm officials, both fathers."], ["2010.10.04", "Iraq", "Garma", 1, 0, "A television camera man bleeds out following a targeted bombing."], ["2010.10.04", "Iraq", "Jalawla", 4, 17, "Four local cops lose their lives to Jihadi bombers."], ["2010.10.04", "Iraq", "Mussayab", 1, 0, "An Iraqi is murdered by al-Qaeda gunmen."], ["2010.10.04", "Somalia", "Mogadish", 5, 19, "Two women and a child are among five civilians killed during an al-Shabaab attack along a city street."], ["2010.10.05", "Afghanistan", "Kandahar", 9, 25, "Eight civilians are among nine brutally slain in a Taliban ambush."], ["2010.10.05", "Pakistan", "North Waziristan", 2, 8, "Two local soldiers are sent to Allah by Islamic bombers."], ["2010.10.05", "Pakistan", "Sindh", 1, 0, "A teacher is gunned down by sectarian assassins."], ["2010.10.05", "Thailand", "Pattani", 1, 0, "A 43-year-old man is shot to death by Muslim militants."], ["2010.10.05", "Thailand", "Pattani", 3, 0, "Three Buddhists transporting chickens are pumped full of holes by Muslim separatists at point-blank range."], ["2010.10.05", "Thailand", "Yala", 1, 0, "A 33-year-old man is murdered in his driveway by Islamic gunmen."], ["2010.10.06", "Afghanistan", "Mizan", 3, 0, "Three farmers carrying produce are brutally blasted to pieces by Taliban hardliners."], ["2010.10.06", "Iraq", "Mosul", 2, 0, "Two civilians die from injuries following a drive-by Mujahid shooting."], ["2010.10.06", "Nigeria", "Borno", 2, 0, "Two statehouse guards are gunned down by Boko Haram Islamists."], ["2010.10.06", "Pakistan", "Kohat", 0, 3, "Islamists throw a grenade into a house with children, injuring three."], ["2010.10.07", "Afghanistan", "Baghlan", 1, 6, "A Shahid suicide bomber murders a German soldier guarding a road."], ["2010.10.07", "Iraq", "Iskandariyah", 5, 20, "Sunni militia target a busy marketplace with a shrapnel bomb.  Five patrons are taken out."], ["2010.10.07", "Iraq", "Mosul", 2, 0, "A woman and her 13-year-old daughter are murdered in their home by terrorists."], ["2010.10.07", "Iraq", "al-Mohandeseen", 2, 0, "Suspected Sunni insurgents shoot a 3-year-old girl and her sister to death."], ["2010.10.07", "Nigeria", "Maiduguri", 1, 0, "Boko Haram Islamists assassinate a top politician."], ["2010.10.07", "Pakistan", "Kar Kandari", 2, 0, "Two security personnel are taken down by a Taliban landmine."], ["2010.10.07", "Pakistan", "Karachi", 9, 74, "Two children are among nine Sufi worshippers taken down by two barbaric suicide blasts at their mosque."], ["2010.10.07", "Tajikistan", "Rasht", 6, 3, "The Islamic Movement kills six local soldiers with a roadside blast."], ["2010.10.08", "Afghanistan", "Kunar", 1, 0, "A 35-year-old female British aid worker is captured and blown up in captivity by the Taliban."], ["2010.10.08", "Afghanistan", "Takhar", 20, 35, "Twenty people at a mosque are sent straight to Allah by Sunni bombers."], ["2010.10.08", "Georgia", "Gudauta", 1, 2, "A religious leader is killed when suspected Islamic terrorists fire into their mosque."], ["2010.10.08", "Iraq", "Madaen", 1, 0, "A young woman is reportedly tortured and killed by al-Qaeda."], ["2010.10.08", "Pakistan", "Punjab", 0, 2, "An 80-year-old Christian and his elderly wife are beaten unconscious by Muslim attackers."], ["2010.10.08", "Philippines", "Cotabato", 2, 1, "Militant Muslims previously targeting missionaries kill two people and kidnap a woman."], ["2010.10.09", "Bangladesh", "Jhenaidah", 0, 2, "An elderly Christian man and his son are beaten by Muslim villagers for refusing to return to Islam."], ["2010.10.09", "Iraq", "Abu Ghraib", 1, 4, "Sectarian Jihadis invade a home and shoot five members of the same family."], ["2010.10.09", "Iraq", "Fallujah", 3, 0, "Three brothers are pulled out of their home and shot execution style by al-Qaeda."], ["2010.10.09", "Iraq", "Yusufiya", 2, 1, "Two civilians are shot to death in a Religion of Peace drive-by."], ["2010.10.09", "Russia", "Kabardino-Balkaria", 1, 0, "A court official is murdered by suspected Muslim gunmen while walking home."], ["2010.10.10", "Afghanistan", "Farah", 4, 1, "Four Italian soldiers are killed in a brutal ambush on their vehicle by religious radicals."], ["2010.10.10", "Afghanistan", "Paktya", 9, 0, "Three young children and three women are among nine dismembered by a Taliban bomb."], ["2010.10.10", "Iraq", "Leheis", 3, 2, "Sunni bombers take out three civilians by blasting their minibus."], ["2010.10.10", "Iraq", "Mosul", 3, 0, "Three Iraqis are cut down by Mujahid gunmen."], ["2010.10.10", "Nigeria", "Maiduguri", 2, 0, "Islamists gun down a rival cleric and his assistant."], ["2010.10.11", "Afghanistan", "Kunar", 3, 7, "Two Indians are among three people claimed by a Taliban rocket attack."], ["2010.10.11", "Afghanistan", "Zabul", 4, 0, "Four civilians are blown to bits by a Taliban landmine."], ["2010.10.11", "India", "Sopore", 1, 0, "A local cop is gunned down by Lashkar-e-Toiba."], ["2010.10.11", "Iraq", "Fallujah", 2, 1, "Gunmen fire on a man and his wife and murder another person in a home invasion."], ["2010.10.11", "Iraq", "Youssifiyah", 4, 2, "al-Qaeda drag four young men out of their homes and shoot them to death."], ["2010.10.11", "Thailand", "Pattani", 1, 0, "A fruit trader is machine-gunned by militant Muslims while sitting in his truck."], ["2010.10.11", "Thailand", "Yala", 1, 0, "A local soldier is ambushed and murdered on his way to work by Islamic terrorists."], ["2010.10.12", "Afghanistan", "Kunar", 1, 8, "One local is killed during a Taliban rocket attack."], ["2010.10.12", "Afghanistan", "Paktika", 5, 1, "A vicious Islamist RPG attack leaves five civilians dead, including a woman and two children."], ["2010.10.12", "Iraq", "Mosul", 3, 11, "Three Iraqis are taken down by two terror bombings."], ["2010.10.12", "Nigeria", "Maiduguri", 11, 4, "Six civilians and five cops are reportedly gunned down by Boko Haram radicals."], ["2010.10.12", "Somalia", "Mogadishu", 5, 10, "A woman and two children are among five killed when an al-Shabaab mortar hits their home."], ["2010.10.13", "Algeria", "Tlidjen", 5, 0, "Fundamentalists take down five public works officials with a remote-controlled bomb."], ["2010.10.13", "Pakistan", "Mohmand", 3, 0, "Three tribal elders are assassinated by religious hardliners."], ["2010.10.13", "Thailand", "Pattani", 1, 0, "A man is shot to death by Islamic insurgents while walking home."], ["2010.10.13", "Thailand", "Yala", 2, 0, "Two villagers are ambushed and killed while guarding their village from Muslim insurgents."], ["2010.10.14", "Iraq", "Baghdad", 1, 0, "A rival cleric is gunned down by militant Islamists."], ["2010.10.14", "Iraq", "Baghdad", 3, 7, "Three Iraqis, including a university professor, are murdered in a series of bomb attacks."], ["2010.10.14", "Iraq", "Diala", 4, 7, "Four people are killed when Islamic terrorists attempt to kill a member of parliament."], ["2010.10.14", "Iraq", "Mosul", 1, 2, "Islamic radicals detonate a bomb on a bridge, killing at least one."], ["2010.10.14", "Nigeria", "Bauchi", 1, 0, "Islamists assassinate a police officer guarding a private residence."], ["2010.10.14", "Pakistan", "Kotwali", 1, 0, "A religious scholar is shot to death by sectarian Jihadis."], ["2010.10.14", "Pakistan", "Sararogha", 5, 1, "At least five local soldiers are killed in a Taliban ambush."], ["2010.10.14", "Somalia", "Haradhere", 4, 12, "Pregnant women and children are killed when Hizbul Islam militants open fire on a group protesting their beating teenagers."], ["2010.10.14", "Thailand", "Pattani", 1, 0, "Islamists murder a bank teller riding a motorcycle."], ["2010.10.14", "Yemen", "Abyan", 5, 8, "An al-Qaeda ambush on a local military convoy leaves five dead."], ["2010.10.14", "Yemen", "Mudia", 2, 1, "al-Qaeda attempts to assassinate a government official, but kills his brother instead."], ["2010.10.15", "Afghanistan", "Zabul", 9, 2, "Nine civilians, including three women and one child, are taken apart by a Taliban IED blast."], ["2010.10.15", "Pakistan", "Kalat", 1, 1, "Suspected Islamists murder the driver of a NATO supply vehicle."], ["2010.10.15", "Pakistan", "Khyber", 2, 0, "Religious hardliners set fire to a truck, burning the driver and a passenger to death."], ["2010.10.15", "Pakistan", "Orakzai", 4, 6, "Four villagers are murdered by Mujahideen attackers."], ["2010.10.16", "Afghanistan", "Kandahar", 1, 2, "A civilian is incinerated when Mujahideen blow up a fuel tanker."], ["2010.10.16", "Afghanistan", "Kandahar", 1, 4, "A motorbike bomb blast kills a civilian."], ["2010.10.16", "Afghanistan", "Uruzgan", 2, 7, "Hardliners murder two civilians with a roadside bomb."], ["2010.10.16", "Iraq", "Baghdad", 2, 2, "Two police officers are gunned down at point-blank range by Islamic terrorists."], ["2010.10.16", "Yemen", "Zinjibar", 3, 2, "al-Qaeda militants send three local soldiers to Allah via a roadside blast."], ["2010.10.17", "Afghanistan", "Farah", 8, 20, "The Taliban claim to have killed eight humanitarian workers in an attack on their project."], ["2010.10.17", "Chechnya", "Grozny", 2, 0, "Suspected Muslim insurgents take out two local cops in a drive-by shooting."], ["2010.10.17", "Iraq", "Baghdad", 4, 7, "A doctor is among four Iraqis taken down by Jihadi bombers."], ["2010.10.17", "Pakistan", "Hangu", 1, 0, "A peace activist is murdered by Tehreek-e-Taliban gunmen."], ["2010.10.17", "Pakistan", "Orakzai", 2, 0, "Two people are beheaded by Islamic militants, who then post their heads at a bazaar."], ["2010.10.18", "Afghanistan", "Gereshk", 9, 0, "Nine security guards are gunned down by Sunni radicals."], ["2010.10.18", "Afghanistan", "Herat", 3, 0, "Three civilians bleed out following a Taliban roadside blast."], ["2010.10.18", "Afghanistan", "Nangarhar", 1, 3, "A Taliban roadside blast ends the life of a local cop."], ["2010.10.18", "Iraq", "Baghdad", 1, 8, "Islamists assassinate a local politician with a bomb."], ["2010.10.18", "Iraq", "Mosul", 1, 0, "Mujahideen shoot an elderly man to death inside his home."], ["2010.10.18", "Iraq", "Mosul", 2, 7, "A Shahid suicide bomber kills one Iraqi."], ["2010.10.18", "Pakistan", "Lakki Marwat", 0, 14, "Women and children are among the casualties when a suicide bomber detonates at an intersection."], ["2010.10.18", "Thailand", "Pattani", 1, 0, "A 65-year-old man is shot in the head by terrorists while shopping with his daughter."], ["2010.10.19", "Chechnya", "Grozny", 3, 17, "A coordinated Fedayeen assault on a government building leaves three victims dead."], ["2010.10.19", "Ingushetia", "Malgobek", 1, 0, "Islamic militants gun down a cop."], ["2010.10.19", "Iraq", "Samarrah", 3, 2, "Three Iraqis are blown apart by Jihadi bombers."], ["2010.10.19", "Iraq", "Tikrit", 10, 4, "Children are among the casualties when Islamic militants blow up a home."], ["2010.10.19", "Nigeria", "Maiduguri", 1, 0, "Boko Haram Islamists shoot a police officer to death in a drive-by attack."], ["2010.10.19", "Pakistan", "Khyber", 3, 3, "Mujahideen murder three local security personnel with a remote-controlled bomb."], ["2010.10.19", "Pakistan", "Wana", 3, 2, "Three local soldiers are taken out by a terrorist ambush."], ["2010.10.20", "Afghanistan", "Ghazni", 2, 0, "A man and his 8-year-old daughter are brutally slain by religious hardliners."], ["2010.10.20", "Afghanistan", "Herat", 4, 0, "Four policemen are slaughtered in a Mujahideen ambush"], ["2010.10.20", "Afghanistan", "Nimroz", 8, 6, "Eight civilians are disassembled by a Sunni bomb blast."], ["2010.10.20", "Iraq", "Mosul", 5, 0, "Two women and a 13-year-old girl are among a family of five massacred in their home by Sunni militants."], ["2010.10.20", "Pakistan", "Miranshah", 1, 0, "An Afghan civilian is kidnapped and murdered by Islamic extremists."], ["2010.10.20", "Thailand", "Yala", 1, 1, "Muslim radicals gun down a 27-year-old laborer."], ["2010.10.21", "Afghanistan", "Paktika", 2, 1, "Two children are shot to death by Sunni radicals.  A third child is gravely injured."], ["2010.10.21", "Pakistan", "Hakim Khan", 6, 0, "An internal squabble between Talibanis is settled by a roadside bomb.  Six dead."], ["2010.10.21", "Philippines", "Maguindanao", 2, 1, "Two civilians die from wounds following an Abdul Basit Usman ambush."], ["2010.10.21", "Philippines", "Matalam", 10, 30, "al-Khobar terrorists are suspected in the bombing of a bus that leaves ten civilians dead."], ["2010.10.22", "Afghanistan", "Kunar", 1, 3, "A civilian loses his life to a Taliban ambush."], ["2010.10.22", "Afghanistan", "Nangahar", 3, 0, "Hardliners murder a district governor and two others with an IED."], ["2010.10.22", "Iraq", "Garma", 1, 1, "A suspected al-Qaeda bomb leaves one person dead."], ["2010.10.22", "Iraq", "Mosul", 1, 6, "A civilian is left dead by a Jihad bomb."], ["2010.10.22", "Nigeria", "Bauchi", 1, 0, "Boko Haram Islamists shoot a government official in the head and body at his home."], ["2010.10.22", "Pakistan", "Orakzai", 6, 3, "Six Pakistanis are killed by a Taliban roadside blast."], ["2010.10.22", "Pakistan", "Peshawar", 5, 22, "Sectarian Religion of Peace rivals toss a bomb into a mosque, killing five worshippers."], ["2010.10.22", "Thailand", "Pattani", 1, 0, "A government worker is shot twice in the head by Muslim 'insurgents' on his way to work."], ["2010.10.22", "Thailand", "Pattani", 1, 0, "Two Islamists assassinate a rival imam at his mosque."], ["2010.10.22", "Yemen", "Mukalla", 1, 0, "A security officer is gunned down at his home by al-Qaeda."], ["2010.10.23", "Afghanistan", "Kandahar", 1, 2, "A suicide bomber on a motorcycle kills a passerby."], ["2010.10.23", "Dagestan", "Khasavyurt", 1, 12, "A local cop is taken out by a Shahid suicide bomber."], ["2010.10.23", "Iraq", "Abu Ghraib", 2, 14, "Two Iraqis are blown apart by a bomb."], ["2010.10.23", "Iraq", "Mosul", 4, 0, "Three women and one man from the same family are murdered when terrorists invade their home."], ["2010.10.23", "Somalia", "Boondere", 12, 20, "A dozen civilians are killed during a series of al-Shabaab attacks."], ["2010.10.24", "Iran", "Tehran", 1, 0, "A devout Muslim beats his Christian relative to death for leaving Islam."], ["2010.10.24", "Iraq", "Mosul", 5, 19, "Mujahideen take out five civilians with a car bomb."], ["2010.10.25", "Afghanistan", "Helmand", 2, 0, "Taliban bombers blow two civilians to bits."], ["2010.10.25", "Afghanistan", "Khost", 3, 10, "Three people are dismembered by a Fedayeen suicide car bomber."], ["2010.10.25", "Algeria", "Boumerdes", 2, 3, "Fundamentalist bombers send two Algerians to Allah."], ["2010.10.25", "Iraq", "Baghdad", 1, 0, "A electrical association worker is shot to death by Mujahideen."], ["2010.10.25", "Pakistan", "Bajaur", 1, 0, "A member of a peace committee is assassinated by religious radicals."], ["2010.10.25", "Pakistan", "Bajaur", 1, 1, "Islamic militants ambush a checkpoint, killing a local soldier."], ["2010.10.25", "Pakistan", "Punjab", 7, 15, "Three women are among seven innocents killed by Sunni bombers at a Sufi mosque."], ["2010.10.25", "Thailand", "Narathwat", 1, 15, "A farmer is murdered in one of a series of bombings by Islamic separatists."], ["2010.10.26", "Afghanistan", "Farah", 1, 2, "One other person is killed when two Shahid attack a residence."], ["2010.10.26", "Afghanistan", "Herat", 4, 3, "Taliban blow up four local cops with an IED."], ["2010.10.26", "Iraq", "Kirkuk", 10, 15, "Ten people are killed in a daylight robbery at a market by suspected Islamic 'insurgents'."], ["2010.10.26", "Nigeria", "Chewenkur", 6, 3, "Four teenagers and two women are hacked to death when Muslims armed with machetes attack a Christian village."], ["2010.10.27", "Iraq", "Baghdad", 2, 5, "Shiite militia bomb a Sunni facility, killing two people."], ["2010.10.27", "Iraq", "Himreem", 4, 0, "Four Iraqis soldiers are blown to bits by Islamic bombers."], ["2010.10.27", "Iraq", "Mosul", 3, 10, "A woman is among three Iraqis murdered in two separate attacks."], ["2010.10.27", "Pakistan", "Peshawar", 2, 0, "Two policemen are shot to death by Mujahideen."], ["2010.10.27", "Somalia", "Galguduud", 6, 0, "Six clerics are shot to death by Ahlu-Sunna terrorists."], ["2010.10.27", "Thailand", "Yala", 1, 1, "A villager is murdered by Muslim gunmen."], ["2010.10.28", "Afghanistan", "Kandahar", 1, 0, "A government official is gunned down by religious radicals."], ["2010.10.28", "Afghanistan", "Kandahar", 3, 0, "Three local cops are shredded by a Sunni bombing."], ["2010.10.28", "Iraq", "Bursa", 1, 8, "A Shahid suicide bomber takes out an Iraqi civilian."], ["2010.10.28", "Pakistan", "Ambar", 1, 4, "A member of a local peace committee is ambushed and murdered by Jihadis."], ["2010.10.28", "Pakistan", "Mohmand", 3, 0, "Three accused criminals are beheaded for 'defaming Islam'."], ["2010.10.28", "Pakistan", "Quetta", 4, 0, "Four Shiites are gunned down in a suspected sectarian attack."], ["2010.10.28", "Somalia", "Beletweyne", 2, 0, "Two teenage girls are publicly executed by an al-Shabaab firing squad."], ["2010.10.28", "Somalia", "Hawa Abdi", 1, 0, "A Hizbul Islam militant shoots and kills a civilian bus driver."], ["2010.10.28", "Thailand", "Yala", 1, 0, "A villager is shot once through the head by Muslim militants."], ["2010.10.29", "Iraq", "Baghdad", 1, 1, "Terrorists shoot a government official to death and injure his nephew."], ["2010.10.29", "Iraq", "Diyala", 30, 70, "Thirty Iraqis at a crowded cafe are blown apart by a Holy Warrior."], ["2010.10.29", "Pakistan", "Baghbana", 1, 1, "A 12-year-old boy is among the casualties in an Islamist firing on a tanker."], ["2010.10.30", "India", "Kishtwar", 1, 0, "Mujahideen murder an Indian trooper."], ["2010.10.30", "Iraq", "Abu Ghraib", 2, 5, "Two Iraqis lose their lives to a small arms Mujahideen attack."], ["2010.10.30", "Iraq", "Badar", 2, 0, "Hardliners ambush and kill two local soldiers."], ["2010.10.30", "Iraq", "Baqubah", 2, 0, "Two children are machine-gunned to death in their home by Mujahideen."], ["2010.10.30", "Somalia", "Mogadishu", 10, 7, "Ten civilian and peacekeepers are taken down by an al-Shabaab roadside blast and shooting."], ["2010.10.30", "Thailand", "Pattani", 1, 0, "A 48-year-old man is shot and killed by Islamic militants."], ["2010.10.30", "Thailand", "Yala", 1, 0, "Muslim extremists shoot a 78-year-old man to death."], ["2010.10.31", "Iraq", "Baghdad", 6, 4, "A half dozen people are sent straight to Allah by Jihadi bombers."], ["2010.10.31", "Iraq", "Baghdad", 53, 80, "Forty-four church members and two young priests are slaughtered when Islamic State of Iraq Fedayeen invade a church, shooting members and tossing grenades into the congregation.  Seven policemen are also killed."], ["2010.10.31", "Iraq", "Kurram", 3, 2, "Three tribal elders are murdered by Sunni extremists."], ["2010.10.31", "Iraq", "Mosul", 1, 7, "A suicide bomber takes out a cop."], ["2010.10.31", "Somalia", "Mogadishu", 15, 20, "At least fifteen bodies are counted following a brutal ambush by al-Shabaab radicals."], ["2010.11.01", "Afghanistan", "Helamand", 2, 0, "Two female Afghan aid workers are kidnapped and riddled with bullets by Holy Warriors."], ["2010.11.01", "Dagestan", "Khasavyurt", 1, 0, "A local imam is shot twice in the head by Religion of Peace rivals."], ["2010.11.01", "Iraq", "Mosul", 5, 12, "An elderly man is among five victims of a series of terror attacks."], ["2010.11.01", "Pakistan", "Swabi", 2, 12, "Taliban militants stage a Fedayeen assault on a police station."], ["2010.11.01", "Somalia", "Modagishu", 3, 2, "Three people are torn apart by an Islamist landmine."], ["2010.11.01", "Thailand", "Pattani", 1, 1, "Muslim terrorists shoot and kill a policeman."], ["2010.11.02", "Iraq", "Baghdad", 110, 322, "At least 13 deadly bomb blasts set by Sunni extremists leave over one-hundred dead in Shia neighborhoods."], ["2010.11.02", "Thailand", "Pattani", 1, 1, "A Buddhist man is murdered by militant Muslims."], ["2010.11.03", "Afghanistan", "Helmand", 2, 0, "At least two civilians are killed during a sustained Taliban assault."], ["2010.11.03", "Afghanistan", "Helmand", 3, 5, "The Taliban murder three policemen with a roadside bomb."], ["2010.11.03", "Afghanistan", "Helmand", 5, 9, "Two children are among five civilians cut to pieces by machine-gun fire from religious fundamentalists."], ["2010.11.03", "Afghanistan", "Khost", 2, 6, "Two local soldiers are killed by a Shahid suicide bomber."], ["2010.11.03", "Iraq", "Mosul", 1, 0, "'Insurgents' gun down a 17-year-old boy outside his home."], ["2010.11.04", "Iraq", "Hit", 2, 0, "Terrorists assassinate a town's mayor and his driver."], ["2010.11.04", "Pakistan", "Khyber", 1, 3, "A young boy is killed when Tehreek-e-Taliban militants fire rockets into a village."], ["2010.11.04", "Russia", "Nalchik", 2, 0, "Two hunters are tortured and killed by Islamic militia."], ["2010.11.04", "Yemen", "al-Dhalee", 2, 23, "Two people are sent to Allah by al-Qaeda bombers."], ["2010.11.05", "Afghanistan", "Faryab", 9, 31, "At least nine people at a bazaar are blown to bits by a teenage suicide bomber."], ["2010.11.05", "Afghanistan", "Helmand", 2, 0, "Two coalition troops are gunned down by a suspected terrorist in uniform."], ["2010.11.05", "Iraq", "Baqubah", 3, 9, "Women are among the casualties of a Mujahideen bomb blast."], ["2010.11.05", "Pakistan", "Darra Adam Khel", 82, 80, "Eleven children are among eighty-two worshippers slaughtered at a mosque by a Shahid suicide bomber yelling 'Allah Akbar'.  Many were crushed by the collapsing roof."], ["2010.11.05", "Pakistan", "Kalat", 1, 1, "Terrorists open fire on a truck, killing the driver."], ["2010.11.05", "Pakistan", "Peshawar", 4, 24, "Four worshippers are killed when sectarian terrorists throw three grenades into a mosque."], ["2010.11.06", "Afghanistan", "Ghazni", 5, 0, "The bodies of five policemen are found brutally executed days after their abduction by the Taliban."], ["2010.11.07", "Afghanistan", "Bashran", 5, 6, "Five civilians are killed when Islamists blow up a family vehicle."], ["2010.11.07", "Iraq", "Mosul", 2, 0, "Two more Christian worshippers are murdered by Muslim gunmen in separate attacks."], ["2010.11.07", "Iraq", "Mosul", 5, 1, "Five Iraqis lose their lives to Muslim terrorists in separate attacks."], ["2010.11.07", "Iraq", "Samarrah", 2, 3, "Shia militia are suspected of blowing up two Sunnis."], ["2010.11.08", "Afghanistan", "Lashkar Gah", 1, 4, "Hardliners manage to kill a civilian with a bomb hidden in a handcart."], ["2010.11.08", "Iraq", "Basra", 13, 39, "Thirteen people are blown to bits by a Jihadi car bomb in a commercial district."], ["2010.11.08", "Iraq", "Karbalah", 14, 40, "Fourteen Shia pilgrims are slaughtered by Sunni terrorists in an attack on their bus."], ["2010.11.08", "Iraq", "Najaf", 8, 31, "Sunnis set off a pair of bombs at a Shia shrine, taking down eight innocents."], ["2010.11.08", "Thailand", "Yala", 1, 0, "A 38-year-old villager is shot to death by Muslim militants while grazing his cattle."], ["2010.11.09", "Afghanistan", "Paktia", 1, 0, "A Taliban road mine takes out a local official."], ["2010.11.09", "Afghanistan", "Uruzgan", 7, 1, "Religious extremists attack a police station, killing at least seven inside."], ["2010.11.09", "Thailand", "Narathiwat", 1, 0, "A woman is gunned down by Islamic insurgents."], ["2010.11.09", "Thailand", "Pattani", 1, 0, "A 17-year-old boy is ambushed and killed by Mujahideen."], ["2010.11.09", "Thailand", "Pattani", 1, 0, "A Buddhist man is murdered by Muslim gunmen."], ["2010.11.10", "Afghanistan", "Khost", 1, 3, "A suicide bomber takes out an Afghan cop."], ["2010.11.10", "Dagestan", "Kizlyar", 1, 6, "One is left dead after Muslim 'insurgents' open fire on a roadblock."], ["2010.11.10", "India", "Pattan", 2, 0, "Islamic militants brutally shoot two security personnel to death at point blank range in a market."], ["2010.11.10", "Iraq", "Baghdad", 6, 20, "Islamists blast Christian areas of Baghdad with bombs and mortars, killing at least six."], ["2010.11.10", "Iraq", "Iskandariya", 3, 0, "Mujahideen murder three brothers with a bomb hidden at a water pump."], ["2010.11.10", "Iraq", "Mosul", 1, 0, "A young girl is taken down by Muslim gunmen."], ["2010.11.11", "Dagestan", "Makhachkala", 7, 5, "Muslim rebels attack and kill seven cops."], ["2010.11.11", "Pakistan", "Karachi", 19, 114, "Tehreek-i-Taliban suicide bombers drive an explosives-laden vehicle into a police station, killing at least nineteen."], ["2010.11.11", "Pakistan", "Lahore", 1, 0, "A man is shot to death after being accused of burning pages from the Quran."], ["2010.11.11", "Pakistan", "Peshawar", 2, 4, "A women and her daughter are crushed to death in their own home by a Taliban rocket attack."], ["2010.11.12", "Afghanistan", "Kabula", 2, 4, "A Shahid suicide bomber sends two Afghans to Allah."], ["2010.11.12", "India", "Baramulla", 1, 0, "Terrorists shoot a policeman to death."], ["2010.11.12", "Thailand", "Yala", 1, 0, "An 18-year-old school volunteer is kidnapped and brutally slain by suspected Muslim separatists."], ["2010.11.13", "Afghanistan", "Kunduz", 8, 18, "Eight people at a market are taken apart by a motorcycle bomb."], ["2010.11.13", "Bangladesh", "Doulatpur", 1, 1, "A suicide bomber kills one other person at a residence."], ["2010.11.13", "Iraq", "Samarrah", 1, 0, "A woman is strangled in a suspected honor killing."], ["2010.11.13", "Nigeria", "Borno", 1, 1, "Boko Haram Islamists open fire on two soldiers eating in a restaurant, killing one."], ["2010.11.13", "Pakistan", "Mohmand", 2, 0, "Tehreek-e-Taliban militants ambush and kill two security personnel."], ["2010.11.13", "Pakistan", "Peshawar", 0, 6, "Six children are injured when suspected Taliban throw a grenade into the home of a peace activist."], ["2010.11.13", "Thailand", "Narathiwat", 1, 0, "A 49-year-old man is shot to death by militant Muslims on his way to work."], ["2010.11.14", "Afghanistan", "Jalalabad", 1, 9, "Women and children are among the casualties of a Sunni bomb."], ["2010.11.14", "Afghanistan", "Spin Boldak", 2, 11, "Radicals plant a bomb at a marketplace, killing two patrons."], ["2010.11.14", "Afghanistan", "Uruzgan", 3, 0, "Three policemen are blown apart by a Taliban bomb."], ["2010.11.14", "Algeria", "Freha", 1, 0, "A local business man dies from injuries suffered in al-Qaeda captivity."], ["2010.11.14", "Iraq", "Mosul", 1, 0, "A 17-year-old boy is gunned down in a shop by terrorists."], ["2010.11.14", "Iraq", "Mosul", 2, 8, "A Fedayeen suicide bomber takes out two Iraqis."], ["2010.11.14", "Pakistan", "Shakai", 1, 8, "Fedayeen take down a member of a peace committee in a suicide attack at a market."], ["2010.11.14", "Thailand", "Yala", 1, 0, "Mujahid shoot a man to death in his own living room."], ["2010.11.15", "Chechnya", "Grozny", 1, 0, "A traffic cop is shot to death by Muslim terrorists while on duty."], ["2010.11.15", "Dagestan", "Rostov-on-Don", 1, 0, "Islamic militants barge into a hospital and shoot a man to death."], ["2010.11.15", "Iraq", "Baghdad", 2, 5, "Two bombs at a marketplace take down a pair of Iraqis."], ["2010.11.15", "Iraq", "Mosul", 2, 18, "Two people are killed in a Jihad car bomb blast."], ["2010.11.15", "Iraq", "Mosul", 3, 0, "Three Christian brothers are brutally shot to death in their home by Religion of Peace advocates."], ["2010.11.15", "Pakistan", "Khyber", 2, 3, "Tehrik-e-Taliban bombers murder two people, including a rival prayer leader."], ["2010.11.15", "Sweden", "Katrineholm", 1, 0, "A 21-year-old woman is stabbed 53 times by her Muslim father, who was angered by her 'indecent' lifestyle."], ["2010.11.16", "Afghanistan", "Kunduz", 2, 5, "Fundamentalists kill two men visiting a graveyard."], ["2010.11.16", "Iraq", "Mosul", 2, 0, "A 6-year-old Christian girl and her father are exterminated by Islamic bombers."], ["2010.11.16", "Iraq", "Mosul", 3, 0, "Two women are among three members of a family murdered in their home by Jihad terrorists."], ["2010.11.16", "Nigeria", "Ganmo", 1, 5, "One person is dead when rival Muslim groups clash over a prayer ground."], ["2010.11.16", "Somalia", "Mogadishu", 4, 9, "Four civilians are killed following an al-Shabaab attack."], ["2010.11.17", "Iraq", "Baqubah", 1, 0, "Mujahid bombers take out a civilian."], ["2010.11.17", "Pakistan", "Khuzdar", 0, 18, "Eighteen people are wounded when clerics at a mosque begin shooting at each other to decide who should lead prayer."], ["2010.11.17", "Somalia", "Mogadishu", 5, 9, "An ambush by Islamic militia leaves five civilians dead."], ["2010.11.18", "Iraq", "Baqubah", 1, 0, "A local Sunni is murdered by suspected al-Qaeda."], ["2010.11.18", "Russia", "Oktyabrsky", 0, 2, "A Muslim stabs two police officers, saying he is upset that they do not allow Allah's law to be practiced."], ["2010.11.19", "Iraq", "Mosul", 2, 2, "Two people are killed in separate terror attacks."], ["2010.11.19", "Nigeria", "Maiduguri", 2, 1, "Islamists roll up to a rival mosque and open up with automatic weapons, killing two men and injuring a child."], ["2010.11.19", "Pakistan", "Khurram", 3, 8, "A woman and two children are crushed to death by a Taliban rocket strike."], ["2010.11.20", "Afghanistan", "Laghman", 4, 33, "Four civilians, including a mother and child, are cut to shreds in two Fedayeen suicide attacks."], ["2010.11.20", "Iraq", "Shirqat", 2, 0, "An 8-year-old girl and a woman are disassembled in their own home by Islamist bombers."], ["2010.11.21", "Afghanistan", "Kandahar", 1, 0, "Religious extremists drag a laborer out of his home and murder him in front of his children."], ["2010.11.21", "India", "Kishtwar", 1, 2, "Lashkar-e-Toiba gunmen barge into a home and murder a 60-year-old woman."], ["2010.11.21", "Iraq", "Baqubah", 1, 0, "Terrorists kill an old man with a bomb hidden in a cart."], ["2010.11.21", "Iraq", "Mosul", 1, 0, "al-Qaeda storm a home and shoot an 18-year-old to death in front of his parents."], ["2010.11.21", "Pakistan", "Turbat", 5, 3, "Five Shiites are shot to death in a suspected sectarian attack."], ["2010.11.22", "Afghanistan", "Paktia", 4, 2, "Four civilians are blown to bits by a Taliban bomb."], ["2010.11.22", "Iraq", "Amin", 1, 3, "One Sunni is killed in a sectarian attack."], ["2010.11.22", "Iraq", "Mosul", 1, 0, "An elderly Christian woman is strangled in her home by Religion of Peace activists."], ["2010.11.22", "Iraq", "Mosul", 2, 0, "Two Christian brothers are shot to death in their shop by Muslim extremists."], ["2010.11.22", "Iraq", "Ramadi", 1, 2, "A government official is assassinated by Islamic gunmen."], ["2010.11.22", "Pakistan", "Sargodha", 0, 1, "A protestant pastor is beaten and set on fire by six Muslims who caught him evangelizing."], ["2010.11.23", "Iraq", "Baghdad", 1, 0, "A doctor is shot to death by 'insurgents'."], ["2010.11.23", "Iraq", "Baghdad", 5, 4, "Several government officials are gunned down in separate terror attacks."], ["2010.11.23", "Iraq", "Suwayra", 2, 0, "Jihadi bombers send a married couple to Allah."], ["2010.11.24", "Afghanistan", "Faryab", 5, 4, "The Taliban murder five tribal elders with a rocket-propelled grenade."], ["2010.11.24", "Afghanistan", "Herat", 1, 4, "The Taliban detonate a bomb under a family vehicle, killing once occupant."], ["2010.11.24", "Egypt", "Giza", 1, 68, "Police shouting 'Allah Akbar' block a church construction and then fire on a group of Coptic demonstrators, killing one."], ["2010.11.24", "India", "Moradabad", 1, 0, "An 18-year-old Muslim girl is strangled by her father for falling in love with a Hindu boy."], ["2010.11.24", "Iraq", "Mosul", 4, 6, "Jihadis bombers take down four Iraqis."], ["2010.11.24", "Iraq", "Shurquat", 4, 19, "A suspected al-Qaeda attack leaves four people dead."], ["2010.11.24", "Thailand", "Narathiwat", 3, 0, "A 60-year-old is among three Muslims ambushed and killed for being 'traitors to Islam'."], ["2010.11.24", "Yemen", "al-Jawf", 17, 15, "A Sunni suicide bomber plows his car into a religious procession, taking out seventeen Shias."], ["2010.11.25", "Egypt", "Giza", 1, 0, "A 4-year-old boy suffocates when tear gas is thrown into a church chapel."], ["2010.11.25", "Iraq", "Baaj", 1, 0, "A tailor dies from shrapnel wounds after Jihadis throw a grenade into his home."], ["2010.11.25", "Iraq", "Kirkuk", 3, 0, "A woman is among three Iraqis ambushed and killed by Mujahideen."], ["2010.11.25", "Iraq", "Tal Afar", 3, 12, "Islamic radicals use an IED to kill a 4-year-old child and two others."], ["2010.11.25", "Iraq", "Tuz Khormato", 4, 2, "Children are among the casualties from a terror blast."], ["2010.11.25", "Kenya", "Bardher", 1, 0, "A 17-year-old girl is tortured and murdered by her parents for leaving Islam for Christianity."], ["2010.11.25", "Nigeria", "Kwata Zawan", 3, 1, "Muslim radicals shoot three Christian villagers to death."], ["2010.11.25", "Pakistan", "Khyber", 2, 6, "Terrorists blow up a bridge, killing two passersby."], ["2010.11.26", "Dagestan", "Kizlyarsky", 1, 0, "Muslim terrorists shoot a police officer in the chest."], ["2010.11.26", "Yemen", "Saada", 40, 9, "Sunnis bomb a Shia funeral procession, leaving at least forty people dead."], ["2010.11.27", "Afghanistan", "Paktika", 12, 16, "Shahid suicide bombers take down a dozen local police."], ["2010.11.27", "Iraq", "Mosul", 2, 0, "A man and his young son are blown to bits by Jihadi bombers."], ["2010.11.27", "Pakistan", "Darra Adam Khel", 1, 0, "Tehreek-e-Taliban abduct and murder a local man."], ["2010.11.27", "Pakistan", "Darra Adam Khel", 3, 0, "A woman is among three civilians murdered when Islamists ambush a passenger vehicle."], ["2010.11.27", "Pakistan", "Watta Khel", 1, 0, "A 17-year-old girl is shot to death by her father and brother for dishonoring the family."], ["2010.11.27", "Philippines", "Marantao", 1, 0, "Moro Islamists murder a World Food Program driver delivering rice to the needy."], ["2010.11.27", "Somalia", "Mogadishu", 10, 20, "At least ten people bleed out following an al-Shabaab mortar attack."], ["2010.11.28", "Afghanistan", "Logar", 3, 0, "Three people lose their lives when Sunni hardliners fire on a vehicle."], ["2010.11.28", "Afghanistan", "Takhar", 1, 1, "Holy Warriors take out a market patron with a bicycle bomb."], ["2010.11.28", "Iraq", "Meshahda", 2, 2, "al-Qaeda cadres storm a home and shoot two people to death."], ["2010.11.28", "Pakistan", "Bakht", 1, 2, "A woman is killed and a young boy injured when fundamentalists shell a residential neighborhood."], ["2010.11.29", "Afghanistan", "Nangarhar", 6, 0, "Six US soldiers training local police are murdered by a terrorist in uniform."], ["2010.11.29", "India", "Srinagar", 1, 1, "Mujahideen kill a policeman and injure a civilian with a grenade thrown into a market."], ["2010.11.29", "Iraq", "Baghdad", 13, 29, "Thirteen Iraqis are murdered by Islamic terrorists in various attacks around the country."], ["2010.11.29", "Pakistan", "Karachi", 1, 0, "A Shia leader is dragged out of his car and shot to death by militant Sunnis."], ["2010.11.29", "Pakistan", "Peshawar", 1, 1, "The Taliban attack a local phone exchange, killing a guard."], ["2010.11.30", "Iraq", "Mosul", 1, 1, "Islamists rush into a Christian shop and gun down the proprietor brothers."], ["2010.11.30", "Pakistan", "Bannu", 6, 22, "An 8-year-old girl and 3-year-old boy are among six people sent to Allah by a Shahid suicide bomber."], ["2010.11.30", "Somalia", "Bosaso", 1, 0, "A judge is assassinated by suspected Islamic militia."], ["2010.11.30", "Thailand", "Pattani", 1, 0, "Jihadists shoot a school janitor to death."], ["2010.12.01", "India", "Srinagar", 2, 0, "Mujahideen shoot two local soldiers to death as they are guarding a market."], ["2010.12.01", "Iraq", "Baghdad", 1, 0, "A human rights activist is murdered by Mujahid gunmen."], ["2010.12.01", "Iraq", "Qaim", 2, 2, "Two Iraqis die from shrapnel injuries following an Islamist bombing."], ["2010.12.02", "Iraq", "Abu Ghraib", 2, 1, "A Jihad blast at a water plant leaves two dead."], ["2010.12.02", "Iraq", "Baghdad", 1, 0, "A woman is shot to death in her home by Islamic 'insurgents'."], ["2010.12.02", "Pakistan", "Sukai", 1, 0, "A local truck driver is gunned down by Taliban radicals."], ["2010.12.03", "Dagestan", "Makhachkala", 1, 0, "Suspected fundamentalists gun down the head of the country's Judo program."], ["2010.12.03", "Iraq", "Mosul", 1, 0, "A sanitation worker is taken down by Muslim gunmen."], ["2010.12.03", "Kenya", "Nairobi", 1, 2, "Somali terrorists throw a grenade at a Kenyan police vehicle, killing an occupant."], ["2010.12.03", "Nigeria", "Nwachukwu", 7, 4, "Christian women and children are slaughtered in their homes by Muslim attackers in a midnight raid."], ["2010.12.03", "Philippines", "Langayen", 2, 0, "Two village guards are gunned down by Moro Islamists."], ["2010.12.03", "Thailand", "Narathiwat", 1, 0, "A 36-year-old man is shot to death in his home by Muslim militants."], ["2010.12.03", "Thailand", "Narathiwat", 1, 0, "Muslim terrorists shoot a Buddhist to death in his home."], ["2010.12.03", "Thailand", "Pattani", 2, 1, "Two men are murdered by Mujahid gunmen in separate attacks."], ["2010.12.03", "Thailand", "Yala", 1, 0, "A 41-year-old rubber plantation worker is gunned down by Islamic separatists while walking home."], ["2010.12.04", "Iraq", "Baghdad", 2, 28, "Two Shia pilgrims are sent to Allah by Sunni car bombers."], ["2010.12.04", "Iraq", "Baghdad", 5, 17, "Five Shia pilgrims from Iran are brutally slain by Sunni bombers near a shrine."], ["2010.12.04", "Iraq", "Baghdad", 6, 42, "Terrorists bomb a marketplace, leaving at least a half dozen shoppers dead."], ["2010.12.04", "Nigeria", "Maiduguri", 3, 6, "A child is among three civilians left dead by a Boko Haram ambush."], ["2010.12.05", "Afghanistan", "Gardez", 4, 18, "A Shahid suicide bomber detonates near a small marketplace, taking four innocents with him."], ["2010.12.05", "Dagestan", "Khasavyurt", 1, 0, "A suspected separatist shoots a government official to death in a cafe"], ["2010.12.05", "Iraq", "Baghdad", 2, 0, "Four Holy Warriors bind and stab an elderly Christian couple to death in their home."], ["2010.12.06", "Afghanistan", "Badghis", 3, 1, "The Taliban kill three Afghan troops in a rocket attack."], ["2010.12.06", "Iraq", "Baqubah", 3, 4, "Three children bleed out when terrorists booby-trap a home."], ["2010.12.06", "Pakistan", "Mohmand", 45, 65, "Two Holy Warriors massacre over forty innocents with a dual suicide blast at a gathering of tribal leaders in the name of 'enforcing Sharia.'"], ["2010.12.06", "Russia", "Moscow", 1, 0, "An armed Muslim immigrant targets and kills a young engineer by shooting him three times in the chest and once in the head."], ["2010.12.07", "India", "Varanasi", 1, 32, "A 2-year-old girl is left dead following a Mujahideen blast at a Hindu temple."], ["2010.12.07", "Iraq", "Tal Afar", 1, 3, "Fundamentalists bomb a computer shop, killing an employee."], ["2010.12.08", "Afghanistan", "Kunar", 2, 2, "Two civilians are murdered by Taliban attackers."], ["2010.12.08", "Iraq", "Taji", 3, 16, "Jihadist take down three civilians with a car bomb."], ["2010.12.08", "Iraq", "Tarmiya", 1, 3, "Muslim terrorists shoot a girl to death in her home."], ["2010.12.08", "Pakistan", "Hangu", 1, 1, "Islamic militants abduct seven teachers and shoot a policeman to death."], ["2010.12.08", "Pakistan", "Kohat", 19, 32, "A teen suicide bomber targets a crowd of Shia pilgrims at a bus stop, sending nearly two dozen to Allah, mostly women and children."], ["2010.12.09", "Iraq", "Baghdad", 6, 6, "Six Iraqis are killed in separate Mujahideen attacks."], ["2010.12.09", "Somalia", "Bosaso", 2, 0, "Islamic militia detonate a roadside bomb underneath two Somalis."], ["2010.12.10", "Afghanistan", "Khan Neshin", 15, 4, "Fifteen civilians on their way to a local bazaar are dismembered by Taliban bombers."], ["2010.12.10", "Iraq", "Baghdad", 2, 7, "Two civilians at a coffee shop are blown to bits by Jihad bombers."], ["2010.12.10", "Iraq", "Meshahda", 3, 0, "Three chicken farmers are gunned down in cold blood by Sunni radicals."], ["2010.12.10", "Pakistan", "Hangu", 17, 20, "Seventeen people are ripped to shreds when a Sunni suicide car bomber plows into a Shia hospital."], ["2010.12.11", "Dagestan", "Gubden", 1, 0, "A mosque imam is murdered by Religion of Peace rivals."], ["2010.12.11", "Pakistan", "Peshawar", 2, 0, "Two police are gunned down by Islamic terrorists."], ["2010.12.11", "Pakistan", "Peshawar", 2, 5, "Islamists open fire on a police squad, killing two members."], ["2010.12.11", "Sweden", "Stockholm", 0, 2, "A car bomb and suicide attack on a shopping center leaves two injured."], ["2010.12.11", "Thailand", "Yala", 1, 3, "Muslim terrorists murder a Thai soldier."], ["2010.12.12", "Afghanistan", "Kandahar", 8, 4, "Six U.S. and two local soldiers are killed by a suicide bomber at their base."], ["2010.12.12", "England", "Feltham", 0, 1, "Muslim prisoners batter a guard while yelling 'death to the Kuffar'."], ["2010.12.12", "Iraq", "Baqubah", 2, 3, "Two Shia pilgrims are taken down by a Fedayeen suicide bomber."], ["2010.12.12", "Iraq", "Ramadi", 13, 41, "A Shahid suicide bomber sends thirteen Iraqis straight to Allah."], ["2010.12.12", "Pakistan", "Kurram", 3, 7, "Three children are killed when Sunni militants fire rockets into a Shia residential area."], ["2010.12.12", "Thailand", "Narathiwat", 2, 0, "A 67-year-old woman and her son-in-law are shot to death by Muslim militants."], ["2010.12.13", "Iraq", "Baghdad", 2, 0, "Terrorists blow up a little girl and her mother."], ["2010.12.13", "Iraq", "Diyala", 4, 20, "Four Shiite pilgrims are murdered by a Sunni suicide bomber."], ["2010.12.13", "Iraq", "Hilla", 2, 1, "A married couple is murdered by Muslim gunmen, who also wound their son."], ["2010.12.13", "Pakistan", "Charsadda", 2, 0, "Two brothers are shot to death by Islamic militants while on their way home."], ["2010.12.13", "Pakistan", "Gulabad", 3, 5, "Two children are among three killed when Islamists detonate a shrapnel bomb next to their school bus."], ["2010.12.13", "Somalia", "Mogadishu", 12, 30, "A dozen civilians are caught in the crossfire during an al-Shabaab ambush."], ["2010.12.14", "Afghanistan", "Kabul", 3, 5, "Three local soldiers are murdered in separate Taliban attacks."], ["2010.12.14", "Bangladesh", "Rajshahi", 1, 0, "A woman dies from injuries suffered by a lashing ordered by Muslim clergy over an adultery charge."], ["2010.12.14", "Iraq", "Baghdad", 3, 19, "Sectarian rivals murder three more Shia pilgrims with a roadside bomb."], ["2010.12.14", "Iraq", "Diyala", 2, 22, "Two Shia pilgrims are blown to bits by Sunni bombers."], ["2010.12.14", "Pakistan", "Mohmand", 2, 6, "Muslim radicals attack a police station and kill two officers."], ["2010.12.14", "Pakistan", "Peshawar", 3, 1, "Sunnis attack an 'unIslamic' shrine and shoot three Sufi infidels to death."], ["2010.12.15", "Afghanistan", "Kandahar", 3, 9, "Three children are disassembled by fundamentalists, who hide a bomb on a bicycle."], ["2010.12.15", "Iran", "Chahbahar", 41, 83, "Forty-one Shias, including women and children, are blasted to death in their own mosque by a Sunni suicide bomber."], ["2010.12.15", "Pakistan", "Quetta", 3, 0, "Sectarian Jihadis gun down two brothers and a child."], ["2010.12.15", "Russia", "Nalchik", 1, 0, "A moderate cleric is shot in front of his home for 'resisting religious extremism.'"], ["2010.12.16", "Iraq", "Baghdad", 6, 6, "Gunmen and bombers take down six Iraqis in separate attacks."], ["2010.12.16", "Iraq", "Dujail", 2, 6, "Two Shia pilgrims are sent to Allah by Sunni bombers."], ["2010.12.16", "Pakistan", "Muharram", 1, 25, "A child is left dead after Sunnis throw a grenade into a funeral procession."], ["2010.12.16", "Somalia", "Mogadishu", 10, 24, "At least ten civilians are shot to pieces during a sustained al-Shabaab attack in a commercial area."], ["2010.12.17", "Afghanistan", "Herat", 14, 4, "Fourteen members of the same family are taken apart by a Taliban roadside attack on their minibus."], ["2010.12.17", "Pakistan", "Hangu", 6, 8, "Six villagers, including women and children, are crushed to death by a terrorist mortar barrage."], ["2010.12.17", "Yemen", "Abyan", 3, 7, "Suspected al-Qaeda militants open fire on a group of local soldiers, killing three."], ["2010.12.18", "Afghanistan", "Balkh", 1, 3, "Taliban-linked militants murder a Bangladeshi engineer and take three others hostage."], ["2010.12.18", "Afghanistan", "Kandahar", 2, 11, "A Shahid suicide bomber sends two civilians to Allah."], ["2010.12.18", "Russia", "Kabardino- Balkaria", 7, 2, "Seven hunters are shot to death by Islamic militants in a brutal ambush."], ["2010.12.18", "Thailand", "Yala", 2, 0, "Islamists slash the throats of two people."], ["2010.12.18", "Thailand", "Yala", 2, 0, "Two guards providing security to Buddhists are gunned down by Religion of Peace proponents."], ["2010.12.19", "Afghanistan", "Kabul", 13, 17, "Thirteen security personnel are killed in two attacks, one by Fedayeen suicide bombers."], ["2010.12.19", "Iraq", "Kirkuk", 2, 0, "An oil company employee is among two people gunned down by Mujahideen."], ["2010.12.19", "Israel", "Jerusalem", 1, 1, "An American woman on a Christian mission is kidnapped, tied up and stabbed to death by Arab warriors."], ["2010.12.20", "Iraq", "Mosul", 2, 0, "A university professor and a young woman are gunned down by 'Freedom Fighters'."], ["2010.12.20", "Kenya", "Nairobi", 3, 23, "Suspected Somali Islamists plant a bomb on a bus, which leaves three passengers dead."], ["2010.12.20", "Pakistan", "Dera Bugti", 2, 0, "A father and son are shot to death in their hotel in a suspected sectarian attack."], ["2010.12.20", "Somalia", "Mogadishu", 5, 5, "An old woman is among five who bleed out following a vicious al-Shabaab roadside bombing."], ["2010.12.20", "Somalia", "Mogadishu", 5, 10, "Five civilians are killed when Islamic militia mortar a commercial district."], ["2010.12.21", "Nigeria", "Turu", 3, 2, "Angry Muslims armed with swords and machetes assault a group of local Christian villagers, killing three."], ["2010.12.21", "Pakistan", "Kalat", 1, 0, "An 82-year-old Hindu teacher is kidnapped and presumed murdered by Muslim fundamentalists."], ["2010.12.21", "Thailand", "Pattani", 1, 0, "A 43-year-old construction worker is murdered by Muslim gunmen."], ["2010.12.21", "Thailand", "Pattani", 2, 0, "A married couple selling pork are shot to death in their stall by Holy Warriors."], ["2010.12.22", "Pakistan", "Mohmand", 1, 3, "A civilian is killed in a bomb blast."], ["2010.12.23", "Afghanistan", "Jalalabad", 1, 10, "Taliban bombers take out a civilian with a motorcycle bomb."], ["2010.12.23", "Afghanistan", "Kunduz", 1, 5, "Children are among the casualties of a Shahid suicide blast."], ["2010.12.23", "Iraq", "Baghdad", 1, 0, "A Sunni civilian is murdered in a sectarian shooting attack."], ["2010.12.23", "Pakistan", "Baidnami", 3, 0, "Tehreek-e-Taliban militants ambush and kill three policemen."], ["2010.12.23", "Russia", "Shalushki", 2, 5, "Islamic militants gun down two village policemen."], ["2010.12.23", "Thailand", "Narathiwat", 2, 2, "Two off-duty security personnel riding a motorcycle are shot to death by Muslim militants."], ["2010.12.24", "Afghanistan", "Balkh", 1, 3, "The Taliban murder a German aid worker trying to help the locals build roads."], ["2010.12.24", "Iraq", "Haswa", 5, 4, "Three children are among five family members slain by a sectarian bomb attack on their home."], ["2010.12.24", "Iraq", "Samarrah", 2, 0, "Two Iraqis are killed by Jihadi bombers."], ["2010.12.24", "Nigeria", "Jos", 86, 74, "At least eighty-six people are killed in a series of Islamic bomb blasts and attacks, mostly targeting Christmas Eve church services.  The dead include choir members hacked to death."], ["2010.12.24", "Pakistan", "Khyber", 1, 0, "A guard is killed when Islamic militants attack a press club building."], ["2010.12.24", "Pakistan", "Mohmand", 11, 10, "Religious hardliners launch a surprise assault on a local army post, leaving eleven defenders dead."], ["2010.12.24", "Pakistan", "Shahdra", 0, 1, "A 12-year-old Christian girl is kidnapped, raped for eight months and forcibly converted to Islam."], ["2010.12.24", "Thailand", "Narathiwat", 1, 1, "Muslim separatists walk into a tea shop and machine-gun two patrons."], ["2010.12.24", "Yemen", "Zinjibar", 1, 0, "al-Qaeda gunmen shoot a local soldier to death."], ["2010.12.25", "Pakistan", "Bajaur", 47, 81, "Nearly fifty people lining up for emergency food are blown into pieces by a female suicide bomber.  Children are among the dead."], ["2010.12.25", "Philippines", "Sulu", 0, 11, "A priest and a 9-year-old girl are among eleven injured when Islamists set off a bomb inside a chapel."], ["2010.12.26", "Pakistan", "Mastung", 1, 0, "A truck driver's life is snuffed out by Islamist snipers."], ["2010.12.27", "Afghanistan", "Kandahar", 3, 26, "A Taliban car bombing outside a bank leaves three people dead."], ["2010.12.27", "Iraq", "Dujail", 1, 1, "Jihadi bombers take down a Catholic woman and injure a family member."], ["2010.12.27", "Iraq", "Ramadi", 17, 40, "Twin suicide bombers take down seventeen Iraqis, including women and children waiting in line."], ["2010.12.27", "Pakistan", "Karachi", 5, 3, "A young girl is among three people shot to death in separate sectarian attacks."], ["2010.12.28", "Afghanistan", "Paktika", 1, 7, "An Afghan security official is taken down by a Shahid suicide bomber."], ["2010.12.28", "Iraq", "Mosul", 5, 3, "Five Iraqis are blown to bits in a car bomb blast."], ["2010.12.28", "Iraq", "Tarmiah", 5, 0, "Terrorists abduct and execute five men."], ["2010.12.28", "Nigeria", "Maiduguri", 3, 0, "Boko Haram Islamists kill three people at a hospital."], ["2010.12.28", "Pakistan", "Karachi", 1, 0, "Tehreek-e-Taliban militants shoot a tea vender to death in his stall."], ["2010.12.28", "Pakistan", "Sohbatpur", 3, 0, "Three member of a family are murdered in a suspected sectarian attack."], ["2010.12.28", "Somalia", "Bakara", 8, 32, "Eight civilians are crushed to death by an Islamist rocket attack on their market."], ["2010.12.28", "Thailand", "Narathiwat", 2, 0, "A man and his elderly father are murdered by Islamic gunmen."], ["2010.12.28", "Thailand", "Pattani", 1, 0, "Muslims shoot a Buddhist civilian to death as he is riding his motorcycle."], ["2010.12.28", "Thailand", "Pattani", 2, 0, "A Buddhist man and his wife are machine-gunned by Islamic terrorists in front of their home."], ["2010.12.29", "Iraq", "Mosul", 4, 4, "A police chief and three others are cut down by three al-Qaeda suicide bombers."], ["2010.12.29", "Pakistan", "Khyber", 1, 2, "A truck driver is taken down by a Muslim ambush."], ["2010.12.29", "Philippines", "Mindanao", 1, 1, "Muslim separatists toss a grenade into an army outpost, killing one."], ["2010.12.30", "Afghanistan", "Helmand", 14, 4, "The Taliban bomb a minibus packed with civilians, taking down at least fourteen."], ["2010.12.30", "Iraq", "Baghdad", 2, 13, "Coordinated Mujahideen attacks against Christian families leave at least two dead."], ["2010.12.30", "Iraq", "Kirkuk", 1, 0, "Sunni terrorists gun down a man in his garden."], ["2010.12.30", "Nigeria", "Dala", 4, 8, "Four people are murdered by Boko Haram Islamists."], ["2010.12.30", "Pakistan", "Sindh", 3, 0, "Three intelligence personnel are killed in a suspected Taliban ambush."], ["2010.12.31", "Afghanistan", "Gulistan", 1, 0, "A religious fanatic with a sniper rifle kills an Italian soldier at his base."], ["2010.12.31", "Afghanistan", "Zabul", 1, 6, "A civilian bleeds out following a Taliban attack."], ["2010.12.31", "Nigeria", "Abuja", 4, 12, "Proponents of Islamic law detonate a bomb at a packed market, killing at least four patrons."], ["2010.12.31", "Somalia", "Mogadishu", 4, 10, "Four civilians are caught in the crossfire during an al-Shabaab ambush along a city street."]], "columns": ["Date", "Country", "City", "Killed", "Injured", "Description"], "year": 2010}