{"rows": [["2016.01.01", "Afghanistan", "Kabul", 2, 15, "A suicide bomber strikes a French restaurant, killing two patrons, including a 12-year-old boy."], ["2016.01.01", "France", "Valence", 0, 2, "Two other people are injured when a Muslim deliberately rams French guards outside a mosque."], ["2016.01.01", "Iraq", "Ramadi", 3, 17, "Ten ISIS suicide bombers manage to kill only three other people."], ["2016.01.01", "Iraq", "Ramadi", 12, 0, "The bodies of twelve civilian victims of ISIS executions are discovered."], ["2016.01.01", "Israel", "Tel Aviv", 1, 0, "A taxi driver is shot to death by a Palestinian terrorist."], ["2016.01.01", "Israel", "Tel Aviv", 2, 6, "An Arab terrorist carrying a Quran fires into bars and restaurants, killing two innocents."], ["2016.01.01", "Libya", "Tripoli", 300, 0, "Three-hundred West African migrants are reportedly rounded up by ISIS and executed."], ["2016.01.01", "Somalia", "Mogadishu", 1, 4, "Islamists fire on a group of aid workers, killing one."], ["2016.01.01", "Syria", "Deir ez-Sor", 1, 0, "A 15-year-old boy is thrown to his death from a roof by Sharia enthusiasts for 'being gay'."], ["2016.01.02", "India", "Pathankot", 7, 0, "Jaish-e-Mohammad stage a suicide attack on an Indian air base that leaves seven others dead."], ["2016.01.02", "Somalia", "Mogadishu", 3, 0, "Sharia proponents throw grenades into a police station, killing three occupants."], ["2016.01.02", "Syria", "Raqqa", 1, 0, "A female activist is executed by the caliphate."], ["2016.01.03", "Iraq", "Mosul", 3, 0, "Three university students are executed in cold blood by ISIS."], ["2016.01.03", "Iraq", "Tikrit", 19, 22, "ISIS suicide bombers kill nineteen Iraqis."], ["2016.01.03", "Pakistan", "Naushero Feroz", 1, 0, "A conservative family has a younger brother shoot a daughter to death for marrying without their permission."], ["2016.01.03", "Saudi Arabia", "Awamiya", 1, 1, "Shiite radicals open fire on the home of a Sunni, killing him and wounding an 8-year-old child."], ["2016.01.03", "Somalia", "Mogadishu", 1, 3, "A suicide bomber kills one other person at a restaurant."], ["2016.01.03", "Syria", "Raqqa", 5, 0, "Five British 'kuffar' are executed by the Islamic State."], ["2016.01.03", "Syria", "Raqqa", 15, 0, "Fifteen 'moderates' are beheaded by caliphate members."], ["2016.01.04", "Afghanistan", "Dasht-e-Asfandi", 5, 0, "Five Afghans are pulled from a bus and murdered by the Taliban."], ["2016.01.04", "Afghanistan", "Kabul", 1, 20, "One other person is killed by a Shahid suicide bomber at a hotel entrance."], ["2016.01.04", "Iraq", "Haditha", 11, 30, "At least eleven Iraqis are laid out by a Fedayeen suicide bomber."], ["2016.01.04", "Iraq", "Hillah", 1, 0, "Shiite radicals attack a Sunni mosque and kill a guard."], ["2016.01.04", "Iraq", "Iskandariya", 1, 0, "A Sunni cleric is shot to death in a targeted attack by Shia rivals."], ["2016.01.04", "Iraq", "Ramadi", 40, 0, "A mass grave containing forty ISIS execution victims is discovered."], ["2016.01.04", "Libya", "al-Sidra", 2, 16, "Two others are killed by suicide car bombers at a oil port."], ["2016.01.04", "Nigeria", "Gwoza", 26, 10, "Over two dozen villagers are massacred by Islamists disguised as soldiers, who opened fire after luring the victims from their homes."], ["2016.01.04", "Nigeria", "Udeni Ruwa", 8, 0, "At least eight others are killed when Muslim terrorists attack two villages."], ["2016.01.04", "Syria", "Raqqa", 1, 0, "A man is beheaded by a Sharia court on charges of 'apostasy'."], ["2016.01.04", "Yemen", "Aden", 1, 0, "A Sufi imam is assassinated by Sunni extremists while leaving his mosque."], ["2016.01.04", "Yemen", "Hadramawt", 1, 0, "Fundamentalists put an alleged prostitute in the ground and stone her to death."], ["2016.01.05", "Afghanistan", "Samangan", 1, 0, "A peace activist is gunned down by suspected Taliban."], ["2016.01.05", "Egypt", "Sinai", 4, 0, "ISIS-linked terrorists fire a rocket that claims four lives."], ["2016.01.05", "Libya", "al-Sidra", 7, 25, "Seven more oil port guards are killed during an attack by ISIS militants."], ["2016.01.05", "Nigeria", "Borno", 7, 12, "A suicide bomber detonates at a market, slaughtering seven bystanders."], ["2016.01.05", "Nigeria", "Izgeki", 2, 0, "Two people are riddled with bullets by Boko Haram on bicycles."], ["2016.01.05", "Pakistan", "Bahawalnagar", 1, 0, "A 7-year-old Christian boy is kidnapped, raped and killed by 'influential' Muslims."], ["2016.01.05", "Syria", "Manbij", 1, 0, "A 21-year-old woman is tortured to death by a female fundamentalist for a dress code violation."], ["2016.01.06", "Iraq", "Dawra", 2, 7, "Two civilians are liquidated along a city street by Muslim bombers."], ["2016.01.06", "Syria", "Damascus", 8, 4, "Eight civilians bleed out following a Jaish al-Islam mortar hit on their neighborhood."], ["2016.01.06", "Syria", "Raqqa", 1, 0, "A35-year-old woman is put up against a wall and shot to death by ISIS."], ["2016.01.07", "Bangladesh", "Jhenaidah", 1, 0, "A convert to Christianity is 'eliminated' by devout Muslims for leaving Islam."], ["2016.01.07", "Egypt", "Hurghada", 0, 3, "Three tourists are among the casualties of a suicide attack on a hotel."], ["2016.01.07", "Iraq", "Mosul", 6, 0, "Six Iraqis are shot to death by caliphate members for using the Internet on their phones."], ["2016.01.07", "Libya", "Ras", 7, 11, "A Shahid suicide bomber at an oil facility takes seven others with him."], ["2016.01.07", "Libya", "Zliten", 65, 200, "A massive suicide truck bomb at a police training facility kills dozens of young recruits during their graduation ceremony."], ["2016.01.07", "Nigeria", "Maiduguri", 1, 0, "A displaced person is beheaded by suspected Boko Haram"], ["2016.01.07", "Pakistan", "Shaktoi", 4, 0, "Four displaced refugees are murdered by Taliban gunmen."], ["2016.01.07", "Somalia", "Mogadishu", 1, 1, "An al-Shabaab mortar leaves one civilian dead and another seriously wounded."], ["2016.01.07", "USA", "Philadelphia, PA", 0, 1, "A man shoots a police officer three times 'in the name of Islam'."], ["2016.01.08", "Afghanistan", "Nangarhar", 7, 0, "A local soldier is among seven people beheaded by ISIS."], ["2016.01.08", "Iraq", "Haditha", 18, 7, "Eighteen Iraqis are blown to bits by a caliphate suicide bomber."], ["2016.01.08", "Iraq", "Mosul", 3, 0, "Three university students are executed by the Islamic State."], ["2016.01.08", "Iraq", "Zummar", 16, 3, "Well-placed ISIS shells kill sixteen Iraqis in a residential neighborhood."], ["2016.01.08", "Lebanon", "Arsal", 1, 0, "Masked terrorists fire on a married couple, killing the man and injuring his wife."], ["2016.01.08", "Pakistan", "Gulshan-e-noor", 1, 0, "A 45-year-old man is murdered for no reason than his status as a Shiite."], ["2016.01.08", "Syria", "Raqqa", 1, 0, "A woman is publicly executed her own son on charges of leaving the Islamic faith."], ["2016.01.09", "Egypt", "Giza", 2, 0, "Two local cops are gunned down by ISIS."], ["2016.01.09", "Iraq", "Ghazlani", 80, 0, "Eighty Iraqi civilians are executed by an Islamic State firing squad."], ["2016.01.09", "Iraq", "Jbala", 3, 2, "Sectarian militia storm a home and shoot three people to death, including a woman."], ["2016.01.09", "Pakistan", "Rahim Yar Khan", 2, 0, "Two women are 'honor-killed' by their families for alleged sexual behavior."], ["2016.01.09", "Syria", "Deir ez-Zor", 2, 0, "Two fathers are executed for not allowing their teen daughters to be married off to caliphate members."], ["2016.01.10", "Nigeria", "Madagali", 7, 0, "Seven villagers are beheaded by Sharia proponents."], ["2016.01.10", "Syria", "Faisaliyah", 5, 0, "The Islamic State lines up and crushes five civilians under a bulldozer for the crime of 'apostasy'"], ["2016.01.11", "Afghanistan", "Khost", 3, 8, "Fundamentalists fire a rocket into a secondary school, killing three pupils."], ["2016.01.11", "Afghanistan", "Mirzakhil", 3, 2, "The Taliban set off a bomb near a school, killing two bystanders."], ["2016.01.11", "France", "Marseille", 0, 1, "A Jewish teacher is attacked with a machete 'in the name of Allah.'"], ["2016.01.11", "Iraq", "Baghdad", 7, 15, "An ISIS bomb blast leaves seven suburbanites dead."], ["2016.01.11", "Iraq", "Baghdad", 18, 50, "Religious radicals stage a suicide assault on a shopping mall, killing at least eighteen innocents with bombs and bullets."], ["2016.01.11", "Iraq", "Muqdadiya", 23, 51, "Two dozen Iraqis are torn limb from limb by a couple of well-placed bombs at a crowded coffee shop."], ["2016.01.11", "Iraq", "Nineveh", 85, 0, "Eighty-five Iraqis are arrested and executed by caliphate firing squads."], ["2016.01.11", "Pakistan", "Derai", 2, 0, "Two local cops are shot to death by religious radicals."], ["2016.01.11", "Pakistan", "Rabwa", 1, 0, "A religious minority is brutally slain by suspected Islamists."], ["2016.01.11", "Syria", "Aleppo", 3, 2, "Three children are disassembled by a Sunni rocket."], ["2016.01.12", "Iraq", "Baqubah", 4, 1, "A Fedayeen suicide bomber takes out four Iraqis."], ["2016.01.12", "Iraq", "Diyala", 2, 0, "Two journalists are shot to death by terrorists."], ["2016.01.12", "Iraq", "Muqdadiya", 10, 0, "Ten people are shot to death by sectarian militia."], ["2016.01.12", "Israel", "Nazareth", 1, 0, "A man honor kills his teen sister over clothing and 'lifestyle' by beating her to death with a hammer."], ["2016.01.12", "Turkey", "Istanbul", 12, 14, "A Syrian 'refugee' with a suicide vest self-detonates in a bustling tourist area, slaughtering a dozen bystanders, including eight Germans."], ["2016.01.13", "Afghanistan", "Badghis", 1, 0, "A man is executed by the Taliban on charges of adultery."], ["2016.01.13", "Cameroon", "Kolofata", 10, 11, "Two female suicide bombers detonate at a rival mosque, taking out ten worshippers."], ["2016.01.13", "Iraq", "Abu Ghraib", 6, 0, "Five women and 1 man are slaughtered in their own home by suspected moral fundamentalists."], ["2016.01.13", "Iraq", "Baghdad", 2, 6, "Two people at a market are sectionalized by a Religion of Peace bomb blast."], ["2016.01.13", "Pakistan", "Jalalabad", 7, 7, "Seven other people are blown to bits by a Fedayeen suicide bombing."], ["2016.01.13", "Pakistan", "Lahore", 1, 1, "A 17-year-old girl is killed after telling a group of Muslim men that she would not have sex with them because she is a devout Christian."], ["2016.01.13", "Pakistan", "Quetta", 15, 24, "A Shahid suicide bomber slaughters fifteen people at a polio clinic."], ["2016.01.13", "Thailand", "Yala", 2, 1, "Muslim 'insurgents' ambush and kill a local cop as well as a maid."], ["2016.01.14", "Indonesia", "Jakarta", 4, 20, "Four suicide bombers attack a shopping and restaurant district, managing to kill four civilians."], ["2016.01.14", "Yemen", "Aden", 4, 0, "Four policemen are killed by Jihadists in two separate attacks."], ["2016.01.15", "Burkina Faso", "Ouagadougou", 29, 56, "Dozens of tourists from eighteen countries are massacred by Islamic extremists shouting praises to Allah at a luxury hotel."], ["2016.01.15", "Iraq", "Mosul", 3, 0, "Three women are burned alive by the Islamic State."], ["2016.01.15", "Iraq", "Muqdadiya", 1, 0, "A Sunni cleric is assassinated by Shia militia."], ["2016.01.15", "Libya", "Bin Jawad", 3, 0, "At least three residents are beheaded after Muslim extremists take over a town."], ["2016.01.15", "Mali", "Dioura", 1, 0, "A guard is killed when gunmen attack a market, shouting praises to Allah."], ["2016.01.15", "Mali", "Timbuktu", 2, 3, "Two guards are killed when terrorists ambush an aid convoy."], ["2016.01.15", "Somalia", "El-Adde", 180, 20, "Somalia claims over one-hundred-eighty peacekeepers were taken out by a massive suicide assault on their base."], ["2016.01.15", "Syria", "Hasakah", 2, 6, "A suicide bomber takes out two bystanders in a residential neighborhood."], ["2016.01.16", "Iraq", "Hajj Ali", 19, 0, "Nineteen civilians are executed for trying to flee the Islamic State."], ["2016.01.16", "Iraq", "Mosul", 3, 0, "Three women are burned alive on charges of betraying Islam."], ["2016.01.16", "Iraq", "al-Furat", 1, 0, "An accused homosexual is flung from a roof by Religion of Peace proponents."], ["2016.01.16", "Somalia", "Burhakabo", 2, 0, "A young ice factory worker is among two people executed by al-Shabaab."], ["2016.01.16", "Syria", "Aleppo", 4, 55, "Four residents bleed out following a Sunni rocket attack."], ["2016.01.16", "Syria", "Baghaliyeh", 300, 400, "Three hundred people are reported massacred during an ISIS assault on a small town featuring a suicide blast and 'door-to-door' beheadings."], ["2016.01.16", "Syria", "al-Fu'ah", 1, 5, "A civilian is dismantled by a terrorist rocket."], ["2016.01.17", "Afghanistan", "Jalalabad", 13, 14, "A Shahid suicide bomber detonates at a house, killing thirteen occupants."], ["2016.01.17", "Afghanistan", "Uruzgan", 9, 0, "Nine local police are shot dead by Taliban insiders."], ["2016.01.17", "Israel", "Otniel", 1, 0, "A mother of six children is stabbed to death in her home by an Arab terrorist."], ["2016.01.17", "Yemen", "Aden", 11, 15, "A Fedayeen suicide bomber rams a bus into the home of a policeman, killing eleven."], ["2016.01.18", "Cameroon", "Nguetchewe", 4, 2, "A suicide bomber hits a rival mosque, taking out four worshippers."], ["2016.01.18", "Thailand", "Raman", 2, 0, "A married couple are shot to death by Muslim terrorists."], ["2016.01.18", "Thailand", "Thepa", 1, 7, "A woman is killed when suspected terrorists toss a hand grenade into a restaurant."], ["2016.01.18", "Turkey", "Kilis", 1, 1, "An employee is killed when ISIS hits a school with a rocket."], ["2016.01.18", "Yemen", "Aden", 1, 0, "A judge is assassinated near his home by Islamists on a motorbike."], ["2016.01.19", "Iraq", "Baqubah", 14, 0, "Fourteen young people are tortured and executed by the Islamic State."], ["2016.01.19", "Iraq", "Mopti", 3, 0, "Jihadists gun down three local cops."], ["2016.01.19", "Pakistan", "Jamrud", 12, 39, "Twelve people at a market, including a child, are blown to bits by a Fedayeen suicide bomber."], ["2016.01.19", "Syria", "Raqqa", 1, 0, "A woman is stoned to death for adultery."], ["2016.01.19", "Thailand", "Songkhla", 1, 8, "Muslim 'insurgents' set off a bomb at a restaurant that kills a 28-year-old woman."], ["2016.01.20", "Afghanistan", "Kabul", 7, 24, "Seven TV station employees burn to death after a Shahid suicide bomber slams into their minibus."], ["2016.01.20", "Iraq", "Baghdad", 2, 5, "Jihadis bomb a market, killing two patrons."], ["2016.01.20", "Pakistan", "Charsadda", 31, 19, "Gunmen storm a university and shout praises to Allah while massacring over thirty civilians."], ["2016.01.21", "Egypt", "El-Arish", 5, 3, "Islamists roll up on a police checkpoint and shoot five officers point-blank."], ["2016.01.21", "Egypt", "Giza", 10, 13, "ISIS claims a bombing at a tourist area that leaves ten others dead."], ["2016.01.21", "Iraq", "Baghdad", 2, 5, "Jihadis bomb a commercial district, killing two bystanders."], ["2016.01.21", "Iraq", "Baghdad", 2, 6, "Two people lose their lives when terrorists set off a bomb at a popular restaurant."], ["2016.01.21", "Iraq", "Baghdad", 4, 15, "Three bombings and a shooting produce four dead civilians."], ["2016.01.21", "Iraq", "Hamamiyat", 3, 7, "Mujahideen set off a bomb in a village that leaves three dead."], ["2016.01.21", "Libya", "sirte", 3, 0, "Three men are executed for apostasy."], ["2016.01.21", "Somalia", "Mogadishu", 20, 20, "Gunmen shout praises to Allah as they slaughter patrons at a beach-side restaurant during an attack that began with a suicide bombing."], ["2016.01.23", "Afghanistan", "Jalalabad", 2, 2, "Two others are killed when two suicide bombers detonate near the Indian consulate."], ["2016.01.23", "Iraq", "Fallujah", 10, 0, "Ten young boys are summarily executed for attempting to escape the caliphate."], ["2016.01.23", "Iraq", "Hit", 1, 0, "A civilian is murdered for trying to help families escape the Islamic State."], ["2016.01.23", "Iraq", "Kilo", 43, 0, "Fort-three local police officer are reportedly killed by a Shahid suicide bomber."], ["2016.01.23", "Iraq", "Tal Msheihda", 5, 11, "Five Iraqis are taken out by a Fedayeen suicide bomber."], ["2016.01.23", "Pakistan", "Bhal Syeda", 1, 0, "A Shiite is beheaded by radical Sunnis"], ["2016.01.23", "Pakistan", "Peshawar", 2, 0, "Militants gun down two policemen."], ["2016.01.23", "Syria", "Wafidin", 3, 7, "Women and children are among the casualties of a Jaish al-Islam rocket attack."], ["2016.01.24", "Egypt", "Kafr Keshk", 3, 4, "Islamists fire on a group of villagers, killing three."], ["2016.01.24", "Nigeria", "Babangida", 1, 0, "An elderly man is killed by Boko Haram as they are burning down his home."], ["2016.01.24", "Nigeria", "Girei", 62, 0, "Muslim terrorists raid six villages and slaughter over sixty innocents, most of which are women and children."], ["2016.01.24", "Syria", "Qamishli", 3, 10, "Three Christians are killed in a targeted bomb attack on their restaurant."], ["2016.01.24", "Yemen", "Mansura", 5, 0, "A woman is among five people shot to death by suspected al-Qaeda."], ["2016.01.25", "Afghanistan", "Spin Boldak", 3, 3, "Five suicide bombers manage to take out three border guards."], ["2016.01.25", "Cameroon", "Bodo", 32, 86, "Dozens of shoppers are torn to shreds when three suicide bombers detonate at entrances to a market."], ["2016.01.25", "Iraq", "Ramadi", 40, 0, "About forty victims of ISIS executions are found in a mass grave."], ["2016.01.25", "Israel", "Beit Horon", 1, 1, "Two women are stabbed in a grocery by Palestinian terrorists."], ["2016.01.25", "Syria", "Aleppo", 23, 24, "Two dozen people are blown up by a suicide bomber in a fuel truck."], ["2016.01.25", "Syria", "Deir al-Zour", 5, 6, "ISIS members kill five citizens with a rocket."], ["2016.01.25", "Syria", "Raqqa", 1, 0, "A man is beheaded for refusing to pray at the local mosque."], ["2016.01.26", "Afghanistan", "Chinarto", 10, 0, "A Taliban infiltrator drugs and murders ten local cops."], ["2016.01.26", "Iraq", "Hamamiyat", 2, 8, "Mujahideen set off a bomb that claims two lives."], ["2016.01.26", "Iraq", "Ramadi", 55, 0, "Over fifty Iraqis are reportedly killed in two suicide bombings."], ["2016.01.26", "Kenya", "Lamu", 5, 2, "al-Shabaab ambush and murder five local cops."], ["2016.01.26", "Pakistan", "Safi", 1, 0, "The body of a peace committee member is found a few days after his abduction by fundamentalists."], ["2016.01.26", "Syria", "Homs", 25, 100, "Twenty-five people are laid out by an ISIS suicide bombing in a commercial district."], ["2016.01.26", "Syria", "Manbij", 1, 0, "A local media activist is beheaded by the Islamic State."], ["2016.01.27", "Afghanistan", "Gerishk", 4, 0, "Four members of a crew working to clear landmines are shot dead by the Taliban."], ["2016.01.27", "Egypt", "al-Arish", 4, 12, "Ansar Beit al-Maqdis members set off an IED that takes the live of four policemen."], ["2016.01.27", "Iraq", "al-Baghdadi", 4, 10, "A series of suicide attacks on a guesthouse leave four others dead."], ["2016.01.27", "Nigeria", "Chibok", 16, 32, "Suicide bombers send shrapnel through sixteen innocents at a vegetable market in a Christian town."], ["2016.01.27", "Sweden", "Tanum", 1, 0, "A 60-year-old man is stabbed to death by one of his employees after being accused of 'Islamophobia'…"], ["2016.01.27", "Uganda", "Numuseru", 1, 0, "A Christian convert is murdered after being threatened by an imam."], ["2016.01.28", "Cameroon", "Kerawa", 4, 12, "Two suicide bombers murder four people at a school."], ["2016.01.28", "Egypt", "Rafah", 6, 12, "Four children and two security personnel are killed in a bombing and clash with Islamic militants."], ["2016.01.28", "Iraq", "Baghdad", 2, 9, "Jihadis bomb a popular market, killing two patrons."], ["2016.01.28", "Mali", "Gao", 4, 3, "Four security personnel are killed in two separate attacks."], ["2016.01.28", "Pakistan", "Quetta", 4, 0, "The Taliban gun down four traffic cops."], ["2016.01.28", "Yemen", "Aden", 11, 10, "A Fedayeen suicide car bombing kills eleven, including two children."], ["2016.01.29", "Afghanistan", "Nangarhar", 1, 0, "A journalist is shot to death by ISIS."], ["2016.01.29", "Egypt", "al-Arish", 2, 7, "An bomb planted by extremists near a school leaves two dead."], ["2016.01.29", "Nigeria", "Adamawa", 10, 28, "A young suicide bomber detonates at a busy market near a church, taking out ten innocents."], ["2016.01.29", "Pakistan", "Regi", 1, 0, "A polio worker is murdered by fundamentalists."], ["2016.01.29", "Saudi Arabia", "Mahasen", 5, 36, "Religion of Peace rivals attack a Shiite mosque with a suicide bombing and gunfire, killing five worshippers."], ["2016.01.29", "Syria", "Deir Ezzor", 3, 3, "Three children are disassembled by an ISIS rocket."], ["2016.01.29", "Yemen", "Aden", 7, 7, "Seven people are shredded by a Shahid suicide bomber."], ["2016.01.30", "Afghanistan", "Sarkano", 3, 2, "The Taliban uses a roadside bomb to kill three Afghans."], ["2016.01.30", "Afghanistan", "Sarkanu", 4, 3, "A bomb planted by Islamists takes the lives of four people."], ["2016.01.30", "Iraq", "Hadher", 17, 0, "Seventeen members of two families, including woman and young children, are beheaded by caliphate members."], ["2016.01.30", "Iraq", "Saladin", 1, 0, "A Shiite is beheaded on video by Sunni radicals."], ["2016.01.30", "Iraq", "Shirqat", 3, 0, "Three children are reportedly executed for insulting ISIS."], ["2016.01.30", "Kenya", "Pandanguo", 3, 1, "Islamists murder three men in a fishing village."], ["2016.01.30", "Nigeria", "Dalori", 86, 62, "Children are among eighty-six souls horribly burned to death by Boko Haram."], ["2016.01.30", "Syria", "Jarablus", 1, 0, "A 14-year-old boy is beheaded on charges of apostasy after missing prayers."], ["2016.01.30", "Yemen", "Lahj", 3, 1, "An ISIS gunmen takes down three targets."], ["2016.01.31", "Chad", "Guie", 1, 32, "A suicide bomber on a motorcycle kills one other person."], ["2016.01.31", "Chad", "Miterine", 4, 24, "Four children playing soccer are killed after being deliberately targeted by two suicide bombers."], ["2016.01.31", "Egypt", "Rafah", 2, 4, "Two more security personnel are killed by a homemade bomb planted by Sharia proponents."], ["2016.01.31", "Egypt", "Sheikh Zuwaid", 2, 0, "Two more people are killed by Islamist bombers."], ["2016.01.31", "Iraq", "Khazir", 8, 6, "An ISIS attack produces eight dead Kurds."], ["2016.01.31", "Iraq", "Mosul", 4, 0, "Four Kurdish civilians are forced to their knees and executed by the Islamic State."], ["2016.01.31", "Kenya", "Kaisari", 4, 1, "Militant Muslims raid a Christian village and kill four innocents, one of whom is beheaded and the other burned inside his home."], ["2016.01.31", "Saudi Arabia", "Najran", 1, 9, "An 11-year-old boy is killed when suspected Shiite militia hit his house with a rocket."], ["2016.01.31", "Saudi Arabia", "Qatif", 2, 0, "Two guards are killed by terrorists."], ["2016.01.31", "Syria", "Sayeda Zeinab", 71, 110, "Five children are among seventy Shiite worshippers exterminated outside their mosque by two Fedayeen suicide bombers."], ["2016.01.31", "Yemen", "Aden", 1, 0, "A cleric who opposed extremism is tortured to death."], ["2016.02.01", "Afghanistan", "Kabul", 20, 29, "Twenty people are reported dead in the aftermath of a Fedayeen suicide bombing."], ["2016.02.01", "Iraq", "Anbar", 1, 0, "An elderly man is beheaded for \"disobeying\" the caliphate."], ["2016.02.01", "Iraq", "Hit", 7, 5, "Children are among those eliminated by two Mujahideen bomb blasts."], ["2016.02.01", "Somalia", "Mogadishu", 1, 6, "A child is sectionalized by an al-Shabaab mortar round."], ["2016.02.01", "Syria", "Manbij", 3, 0, "Three brothers are beheaded by the Islamic State."], ["2016.02.02", "Iraq", "Al-Bu Dhiaab", 18, 0, "Eighteen Iraqis are reportedly slain by three ISIS suicide bombers."], ["2016.02.02", "Iraq", "Baghdad", 6, 27, "A half-dozen Iraqis lose their lives to a series of Mujahideen bomb blasts."], ["2016.02.02", "Iraq", "Madain", 2, 9, "Terrorists set off a bomb near a café, killing two bystanders."], ["2016.02.02", "Nigeria", "Goniambari", 6, 1, "Islamists slaughter six villagers."], ["2016.02.02", "Somalia", "Mogadishu", 0, 2, "A suicide bomber detonates on a plane, but manages to kill only himself."], ["2016.02.02", "Thailand", "Narathiwat", 1, 1, "An off-duty cop is shot to death in front of his wife by Muslim 'insurgents.'"], ["2016.02.03", "Afghanistan", "Tirin Kot", 1, 0, "A 10-year-old boy is cut down in a targeted attack by Taliban gunmen."], ["2016.02.03", "Iraq", "Hawija", 2, 0, "Two people are shot to death for trying to escape the caliphate."], ["2016.02.03", "Iraq", "Mosul", 12, 0, "A dozen university students are executed by the Islamic State."], ["2016.02.03", "Iraq", "Ramadi", 13, 0, "ISIS shelling produces thirteen dead Iraqis."], ["2016.02.03", "Israel", "Jerusalem", 1, 2, "A 19-year-old woman bleeds out following a Palestinian shooting and stabbing spree."], ["2016.02.03", "Libya", "Benghazi", 3, 13, "An ISIS assault on a small town leaves three defenders dead."], ["2016.02.03", "Libya", "Sirte", 1, 0, "Islamic State members capture and crucify a young man."], ["2016.02.03", "Syria", "Daraa", 17, 101, "Seventeen civilians are smashed to bits by a Sunni rocket barrage."], ["2016.02.04", "Iraq", "Baghdad", 9, 33, "Nine people are left dead after a string of bombings by Muslim terrorists."], ["2016.02.04", "Mali", "Timbuktu", 1, 3, "A suicide bombing at a UN camp kills a guard."], ["2016.02.04", "Syria", "Raqqa", 1, 0, "A child invokes the name of Allah before beheading a 'kafir'."], ["2016.02.04", "Yemen", "Hadramaut", 6, 0, "An ISIS video shows members opening fire on a busy market and beheading four 'apostates.'"], ["2016.02.05", "Afghanistan", "Zanu", 1, 0, "A woman is executed after being accused of adultery."], ["2016.02.05", "Somalia", "Mogadishu", 3, 0, "A woman is among three people incinerated by a car bombing outside a pharmacy."], ["2016.02.05", "Syria", "Aleppo", 35, 24, "Thirty-five Syrians are reportedly killed in two ISIS suicide car bombings."], ["2016.02.06", "Iraq", "Baghdadi", 9, 16, "A Fedayeen suicide attack leaves nine others dead."], ["2016.02.06", "Iraq", "Fallujah", 14, 0, "A suicide bomber murders fourteen Iraqis."], ["2016.02.06", "Nigeria", "Konduga", 4, 0, "Boko Haram rampage through two villages, burning homes and killing four innocents."], ["2016.02.06", "Nigeria", "Zamfara", 23, 10, "Boko Haram stages a two-hour assault on a village, firing indiscriminately and killing dozens of people."], ["2016.02.06", "Pakistan", "Quetta", 10, 35, "A child and woman are obliterated along with eight others by a suicide bomber."], ["2016.02.07", "Afghanistan", "Kunar", 3, 0, "Three polio workers are found murdered by suspected fundamentalists."], ["2016.02.07", "Afghanistan", "Logar", 1, 8, "Taliban bombers pick off a man on his way to work."], ["2016.02.07", "Iraq", "Baghdad", 3, 0, "A sectarian militia murders three civilians, including an 8-year-old boy."], ["2016.02.07", "Iraq", "Baghdad", 7, 22, "Mujahid bombers eliminate seven Iraqis with four bombs."], ["2016.02.07", "Israel", "Rahat", 0, 1, "An elderly Jewish woman is stabbed in the neck by a young Palestinian man."], ["2016.02.07", "Mali", "Boni", 1, 0, "A civilian is murdered by Islamists."], ["2016.02.08", "Afghanistan", "Dehdadi", 3, 14, "A suicide bomber attacks a bus, killing at least three others."], ["2016.02.08", "Afghanistan", "Yahyakhil", 6, 9, "Six people are massacred by a suicide bomber outside a bakery shop."], ["2016.02.08", "Bangladesh", "Gobindaganj", 1, 0, "Police find the beheaded body of a Hindu trader."], ["2016.02.08", "Iraq", "Albu Diab", 15, 0, "Victim victims of ISIS execution are discovered in a mass grave."], ["2016.02.08", "Iraq", "Hammam al-Alil", 14, 0, "Fourteen people are summarily executed by ISIS at a college."], ["2016.02.08", "Iraq", "Mosul", 4, 0, "Four youth are flung from a roof by caliphate enforcers."], ["2016.02.08", "Iraq", "Mosul", 300, 0, "At least three-hundred people are reported executed by the Islamic State, including activists."], ["2016.02.08", "Pakistan", "Havid", 2, 0, "A terrorist bomb blast outside a shop leaves the owner and a rickshaw driver dead."], ["2016.02.08", "Pakistan", "Peshawar", 1, 1, "A Shiite elder is shot to death in front of his son by sectarian Jihadis."], ["2016.02.08", "Syria", "Hasakah", 9, 4, "Nine corpses are counted after an ISIS Shahid suicide bombing."], ["2016.02.09", "Egypt", "Sinai", 1, 3, "Fundementalists fire on a group of police, killing one."], ["2016.02.09", "Iraq", "Mosul", 1, 0, "A female bank employee is put against a wall and shot to death by caliphate members."], ["2016.02.09", "Iraq", "Mosul", 1, 0, "A journalist is executed by a  caliphate firing squad for taking pictures."], ["2016.02.09", "Syria", "Damascus", 8, 20, "A Fedayeen suicide car bomber sends eight civilians straight to Allah."], ["2016.02.10", "Afghanistan", "Abdul Rauf", 5, 7, "Two religious radicals gun down five local cops at dinner."], ["2016.02.10", "Cameroon", "Nguetchewe", 6, 30, "Two female suicide bombers detonate during a funeral wake, killing six mourners, including two children."], ["2016.02.10", "Iraq", "Taji", 3, 9, "Three Iraqis are disintegrated by a shrapnel blast."], ["2016.02.10", "Iraq", "Wafa", 2, 5, "At least two others are killed during a Shahid sucide attack."], ["2016.02.10", "Nigeria", "Dikwa", 60, 78, "Sixty refugees at a displaced persons camp, including women and children, are massacred by two female suicide bombers."], ["2016.02.10", "Somalia", "Jameo Mubarac", 1, 0, "A cleric is beheaded by Religion of Peace rivals."], ["2016.02.11", "Iraq", "Mosul", 4, 0, "Four women are stoned to death for adultery - after having been raped."], ["2016.02.11", "Mali", "Mopti", 3, 0, "Islamic militants shoot three people to death."], ["2016.02.11", "USA", "Columbus, OH", 0, 4, "Four people at a Christian-owned restaurant with an Israeli flag are slashed by a Muslim wielding a machete yelling 'Allah Akbar'…"], ["2016.02.11", "Yemen", "Aden", 3, 0, "Jihadists kill three security personnel."], ["2016.02.12", "Iraq", "Makhmour", 1, 11, "A 3-year-old girl is killed while trying to escape the caliphate with her family."], ["2016.02.12", "Mali", "Kidal", 5, 30, "Ansar Dine members lob shells into a UN camp, killing five guards."], ["2016.02.12", "Nigeria", "Kachifa", 8, 0, "Boko Haram murder eight villagers and kidnap a number of women and children."], ["2016.02.12", "Pakistan", "Takht-e-Nusrati", 1, 2, "A dispute between clerics at a mosque is settled with gunfire that leaves one of them dead."], ["2016.02.12", "Thailand", "Yala", 1, 1, "Muslim bombers pick off a guard for a group of teachers."], ["2016.02.12", "Yemen", "Aden", 5, 0, "al-Qaeda gunmen sneak up on a police post and murder five officers."], ["2016.02.13", "Afghanistan", "Helmand", 5, 7, "Five Afghans are left dead following a double-suicide attack."], ["2016.02.13", "Egypt", "Sinai", 2, 1, "An ISIS bomb kills two sappers."], ["2016.02.13", "Iraq", "Mahmoudiya", 2, 7, "Mujahideen set off a bomb at a market, killing two patrons."], ["2016.02.13", "Iraq", "Tarmiya", 5, 5, "A vicious double-bombing kills five people overall, including first responders."], ["2016.02.13", "Nigeria", "Yakshari", 22, 0, "Islamists sneak into a village and slit the throats of twenty-two innocents."], ["2016.02.13", "Pakistan", "Islamabad", 1, 2, "A traffic cop is picked off by Islamic State gunmen."], ["2016.02.13", "Syria", "Sfeira", 2, 5, "Two children are disassembled by an ISIS rocket."], ["2016.02.13", "Thailand", "Narathiwat", 1, 0, "A truck driver is executed in cold blood by Muslim 'insurgents'."], ["2016.02.14", "India", "Chowkibal", 2, 2, "Two members are killed when Lashkar-e-Toiba militants open fire on a security patrol."], ["2016.02.14", "Iraq", "Faisaliah", 8, 0, "The Islamic State drowns eight prisoners by herding them into a metal cage and then dipping it into a lake."], ["2016.02.14", "Iraq", "Mosul", 2, 0, "Two young men are shot to death for 'apostasy' after missing prayers."], ["2016.02.14", "Nigeria", "Abbi", 2, 19, "Fulani terrorists attack a Christian community and hack a brother and sister to death."], ["2016.02.14", "Syria", "Mrat", 100, 0, "A mass grave containing the victims of about 100 ISIS victims (including children) is discovered."], ["2016.02.15", "Afghanistan", "Jalalabad", 1, 0, "Radicals are suspected of gunning down a rival religious scholar."], ["2016.02.15", "Afghanistan", "Pul-e-Momin", 2, 7, "Armed fundamentalists attack a security post, killing two members."], ["2016.02.15", "Dagestan", "Makhachkala", 3, 2, "Fedayeen suicide bombers take out three other people."], ["2016.02.15", "Iraq", "Hawija", 5, 0, "Five civilians are executed for trying to escape the caliphate."], ["2016.02.15", "Iraq", "Nineveh", 1, 0, "A man is beheaded for 'insulting Allah'."], ["2016.02.15", "Iraq", "Tarmiya", 3, 8, "Three patrons at a popular market are sectionalized by a Jihadi bomb blast."], ["2016.02.15", "Nigeria", "Kuda", 6, 20, "Boko Haram invade a village and fire at fleeing residents, killing six."], ["2016.02.15", "Saudi Arabia", "Abu Arish", 1, 0, "A retired man is shot to death on his farm by the Islamic State."], ["2016.02.15", "Somalia", "Mogadishu", 1, 1, "A government official is assassinated by Jihadi car bombers."], ["2016.02.16", "Iraq", "Mosul", 1, 0, "A 15-year-old is beheaded for listening to Western pop music."], ["2016.02.16", "Iraq", "Ramadi", 40, 0, "Children are among forty victims of ISIS execution found in a mass grave."], ["2016.02.16", "Philippines", "Datu Salibo", 4, 2, "A father and son are among four people bleeding to death in the aftermath of an Islamist roadside blast."], ["2016.02.17", "Egypt", "Giza", 1, 2, "Islamists gun down a traffic cop."], ["2016.02.17", "Iraq", "Nineveh", 3, 0, "Three civilians are executed for refusing to join the Islamic State."], ["2016.02.17", "Thailand", "Narathiwat", 1, 1, "Bombers target a group of teachers, killing a guard."], ["2016.02.17", "Yemen", "Aden", 13, 60, "Thirteen recruits at a military camp are wiped out by a Fedayeen suicide bombing."], ["2016.02.18", "Afghanistan", "Waskhwa", 6, 0, "Four children are among a family of six eliminated by Taliban bombers."], ["2016.02.18", "England", "Rochdale", 1, 0, "A popular imam is beaten to death by Muslims with terror ties."], ["2016.02.18", "Iraq", "Hawija", 17, 0, "Seventeen young people are beheaded after being accused of drawing anti-ISIS banners."], ["2016.02.18", "Iraq", "Mosul", 3, 0, "Three women who formerly served as election workers are forced to their knees and shot in the back of the head by caliphate members."], ["2016.02.18", "Israel", "Shaare Benjamin", 1, 1, "A 21-year-old father is stabbed to death in a supermarket by Palestinians."], ["2016.02.18", "Pakistan", "Mohmand", 9, 0, "Religious radicals murder nine local security personnel in two attacks."], ["2016.02.18", "Syria", "Aleppo", 1, 0, "A priest is reportedly beheaded for offering prayers at the altar of his church."], ["2016.02.18", "Syria", "Aleppo", 4, 5, "Four civilians lose their lives to Sunni mortar shells on their neighborhood."], ["2016.02.18", "Syria", "Kobane", 13, 24, "Over a dozen people lose their lives during an ISIS bomb attack on several villages."], ["2016.02.18", "Syria", "Palmyra", 2, 0, "Two young men are detained and executed by the Islamic State."], ["2016.02.19", "Afghanistan", "Landi Kotal", 1, 0, "A religious scholar is assassinated by rivals."], ["2016.02.19", "Cameroon", "Meme", 24, 112, "Four Shahid suicide bombers massacre twenty-four others at a market and a nearby school."], ["2016.02.19", "Egypt", "Sinai", 1, 0, "ISIS beheads a hostage taken in a tourist province."], ["2016.02.19", "Iraq", "Hardan", 9, 9, "ISIS bombs targeting a bus kill nine Kurds."], ["2016.02.19", "Mali", "Menaka", 1, 1, "Jihadists fire into a group of village guards, killing one."], ["2016.02.19", "Pakistan", "Faisalabad", 3, 0, "Three policemen are shot to death for \"protecting the unIslamic system of democracy.\""], ["2016.02.20", "Yemen", "Aden", 2, 0, "Two people are gunned down by al-Qaeda operatives on a motorcycle."], ["2016.02.20", "Yemen", "Ahwar", 3, 0, "An al-Qaeda attack on a small town leaves three defenders dead."], ["2016.02.21", "Bangladesh", "Deviganj", 1, 2, "A Hindu priest is hacked to death and beheaded by Muslim extremists outside his temple."], ["2016.02.21", "Egypt", "al-Arish", 2, 10, "Two civilians are taken out by an Islamist IED."], ["2016.02.21", "India", "Pulwama", 3, 10, "Islamic militants open fire on a bus, killing three passengers."], ["2016.02.21", "Iraq", "Kirkuk", 2, 0, "Two more people are publicly beheaded by the Islamic State."], ["2016.02.21", "Iraq", "Kirkuk", 4, 2, "ISIS members target fleeing families, killing four members."], ["2016.02.21", "Pakistan", "Navi Mandi", 3, 1, "Four displaced persons are disassembled by Taliban bombers."], ["2016.02.21", "Philippines", "Butig", 3, 6, "Moro Islamists fire on a group of soldiers guarding a town, killing three."], ["2016.02.21", "Syria", "Damascus", 83, 178, "Children are among the eighty-three destroyed by a horrific suicide bombing outside a Shiite shrine and school."], ["2016.02.21", "Syria", "Zahra", 59, 200, "A double-bombing by ISIS along a commerical strip leaves nearly sixty dead and two-hundred burned and battered."], ["2016.02.21", "Thailand", "Pattani", 2, 0, "'Insurgents' shoot a Buddhist couple to death."], ["2016.02.22", "Afghanistan", "Baghlan", 1, 2, "A Taliban rocket takes out an Afghan citizen."], ["2016.02.22", "Afghanistan", "Jabba", 2, 2, "Religious fundamentalists murder two local cops."], ["2016.02.22", "Afghanistan", "Parwan", 13, 19, "A suicide bomber detonates near a clinic, taking thirteen other souls with him."], ["2016.02.22", "India", "Pompore", 3, 0, "Three more people are killed by Lashkar-e-Toiba."], ["2016.02.22", "Iraq", "Ramadi", 6, 10, "An ISIS assault leaves six town defenders dead."], ["2016.02.22", "Iraq", "Ramadi", 8, 0, "Eight people are killed in their own homes by ISIS booby-traps."], ["2016.02.22", "Philippines", "Tugaya", 1, 0, "Muslim terrorists murder a local soldier guarding a village"], ["2016.02.23", "Iraq", "Fallujah", 12, 0, "A dozen Iraqis are caught trying to flee the caliphate, marched to the city center and executed."], ["2016.02.23", "Iraq", "Hawija", 4, 0, "Four young people are executed by ISIS after members call for 'repentance'."], ["2016.02.23", "Iraq", "Yusufiya", 1, 9, "Terrorists bomb a vegetable market, killing one person."], ["2016.02.23", "Syria", "Deir Ezzor", 2, 14, "Two civilians are pulled apart by a Sunni mortar blast."], ["2016.02.23", "Syria", "Hamidiya", 2, 0, "Two teenage girls are stoned for adultery."], ["2016.02.23", "Syria", "Raqqa", 1, 0, "Radicals execute a man for 'apostasy'."], ["2016.02.24", "Afghanistan", "Kabul", 7, 0, "The Taliban kill seven Afghans over a 24-hour period."], ["2016.02.24", "Iraq", "Mosul", 1, 0, "An imam is beheaded by Religion of Peace rivals."], ["2016.02.24", "Libya", "Sabratha", 12, 0, "A dozen local security agents are captured and beheaded by ISIS."], ["2016.02.24", "Mali", "Timbuktu", 3, 2, "Islamists attack a checkpoint, killing three defenders."], ["2016.02.24", "Nigeria", "Agatu", 300, 0, "Radical Islamic mercenaries sweep through a series of Christian villages and slaughter over three hundred, including pregnant women and children."], ["2016.02.24", "Syria", "Aleppo", 10, 5, "Seven children are among ten civilians disassembled by two Sunni mortar rounds."], ["2016.02.24", "Syria", "Dayr al-Zawr", 2, 14, "Sunni rockets take out two civilians."], ["2016.02.25", "Iraq", "Baghdad", 15, 50, "Two Sunni suicide bombers detonate at a Shiite mosque, slaughtering at least fifteen worshippers."], ["2016.02.25", "Somalia", "Mogadishu", 4, 8, "Four civilians lose their lives to an al-Shabaab attack."], ["2016.02.26", "Egypt", "Giza", 1, 1, "Fundamentalists open fire on two traffic cops, killing one."], ["2016.02.26", "Germany", "Hanover", 0, 1, "A 'radicalized' teen girl stabs a female police officer."], ["2016.02.26", "Somalia", "Mogadishu", 14, 30, "Holy Warriors attack a 'Youth League' hotel with bombs and gunfire, laying out fourteen innocents."], ["2016.02.26", "Syria", "al-Zahra", 1, 0, "A child is killed by Jabhat al-Nusra."], ["2016.02.27", "Afghanistan", "Asadabad", 12, 40, "A dozen people lose their lives to a suicide blast along a city street, including three brothers."], ["2016.02.27", "Afghanistan", "Bolan", 2, 0, "The Taliban wipe out two local police with a roadside bomb."], ["2016.02.27", "Afghanistan", "Kabul", 15, 31, "A suicide bomber targets a bus, killing fifteen passengers and bystanders."], ["2016.02.27", "Afghanistan", "Nangarhar", 1, 5, "Taliban bombers take out a civilian."], ["2016.02.27", "Egypt", "Rafah", 2, 2, "Two local security personnel are cut down by an Islamist bomb."], ["2016.02.27", "Iraq", "Abu Ghraib", 2, 9, "Jihadis bomb an outdoor market, killing two patrons."], ["2016.02.27", "Iraq", "Baghdad", 5, 25, "A series of Mujahideen blasts leave five dead."], ["2016.02.27", "Pakistan", "Qayum", 1, 2, "A Muslim shouts a religious slur and fires into a Christian home, killing a 17-year-old boy."], ["2016.02.27", "Syria", "Ajila", 2, 4, "A suicide car bomber takes out two village guards."], ["2016.02.27", "Syria", "Deir Ezzor", 3, 12, "Three children are disassembled by Sunni mortars."], ["2016.02.27", "Syria", "Salamiya", 2, 3, "An ISIS suicide bomber takes at least two others with him."], ["2016.02.27", "Syria", "Teeba", 4, 4, "Four villagers lose their lives to an Islamic State suicide bomber."], ["2016.02.28", "Afghanistan", "Lashkar Gah", 3, 11, "Three souls are snuffed out by an explosive device planted by Sharia proponents."], ["2016.02.28", "Afghanistan", "Qads", 1, 0, "A tribal elder is tortured to death by religious extremists."], ["2016.02.28", "Egypt", "al-Arish", 1, 0, "A man is shot to death in front of his home by the Islamic State."], ["2016.02.28", "Iraq", "Abu Ghraib", 24, 22, "Two dozen Iraqis are shot or blown apart during a Fedayeen suicide attack by ISIS."], ["2016.02.28", "Iraq", "Baghdad", 78, 112, "Seventy-eight people at a packed market in a Shiite area are exterminated by two Sunni suicide bombers."], ["2016.02.28", "Saudi Arabia", "Qassim", 1, 0, "A local cop is murdered by family members, who then pledge allegiance to ISIS."], ["2016.02.28", "Somalia", "Baidoa", 30, 60, "At least thirty civilians and first responders are slaughtered by a twin suicide attack near a restaurant."], ["2016.02.29", "Afghanistan", "Farah", 3, 3, "Three children are disassembled by a Taliban IED."], ["2016.02.29", "Afghanistan", "Uruzgan", 4, 3, "Four locals are shot to death by the Taliban"], ["2016.02.29", "DRC", "Ntombi", 13, 0, "Four women are among thirteen villagers found hacked to pieces by ADF Islamists."], ["2016.02.29", "Iraq", "Hawija", 3, 0, "Three youth are beheaded for putting up anti-ISIS posters."], ["2016.02.29", "Iraq", "Mosul", 2, 0, "Two religious clerics are murdered by their more radical brethren"], ["2016.02.29", "Iraq", "Mosul", 24, 0, "Two dozen Iraqis are rounded up and executed by the Islamic State."], ["2016.02.29", "Iraq", "Muqdadiya", 40, 58, "A Fedayeen suicide bomber detonates at a funeral, sending at least forty mourners straight into their own afterlife."], ["2016.02.29", "Nigeria", "Badarawa", 15, 22, "Suspected Boko Haram surround a group of villagers gathered to watch a video and pour machine gun fire into them, killing at least fifteen."], ["2016.02.29", "Russia", "Moscow", 1, 0, "A woman beheads a child, saying that it was revenge for 'spilled Muslim blood' in Syria."], ["2016.02.29", "Syria", "Deir ez-Zor", 3, 0, "Three men are crucified by a Sharia court for crimes against Allah."], ["2016.02.29", "Yemen", "Aden", 4, 5, "A Shahid suicide bomber snuffs out four other souls."], ["2016.03.01", "Afghanistan", "Pul-e-Khumri", 3, 2, "Religious extremists hit a house with a rocket, killing three family members."], ["2016.03.01", "Egypt", "al-Arish", 2, 0, "Fundamentalists behead a man and shoot his son to death."], ["2016.03.01", "Iraq", "Haditha", 8, 8, "Eight Iraqis are blown up by four Fedayeen suicide bombers."], ["2016.03.01", "Pakistan", "Noorshah", 2, 0, "Two women are murdered over 'doubts about their character and lifestyles'."], ["2016.03.01", "Pakistan", "Peshawar", 2, 4, "Two employees at the US consulate bleed to death following an Islamist bombing."], ["2016.03.01", "Pakistan", "Sheikhupura", 1, 0, "An Ahmadi religious minority is stabbed to death for his faith."], ["2016.03.01", "Philippines", "Datu Salibo", 1, 2, "Bangsamoro Islamists kill one other person during an ambush."], ["2016.03.01", "Philippines", "Zamboanga", 2, 0, "An assassination attempt on an anti-ISIS preacher outside a university hall leaves two dead."], ["2016.03.01", "Somalia", "Alamada", 5, 8, "An al-Shabaab bomb produces five dead bodies."], ["2016.03.02", "Afghanistan", "Jalalabad", 2, 19, "Four suicide bombers target the Indian consulate, killing two civilians."], ["2016.03.02", "Egypt", "Khariza", 1, 3, "An Islamist bomb claims one life."], ["2016.03.02", "Iraq", "Hawija", 6, 0, "Six people are beheaded and crucified by the Islamic State."], ["2016.03.02", "Iraq", "Nineveh", 5, 0, "A 12-year-old girl is forced by the caliphate to execute five women, including a doctor."], ["2016.03.02", "Syria", "Quneitra", 18, 30, "Two suicide bombers massacre eighteen bystanders."], ["2016.03.03", "Iraq", "Abu Ghraib", 2, 10, "Two civilians are killed when terrorists sent mortar shells into a market."], ["2016.03.03", "Libya", "Surman", 2, 0, "Two Italian hostages are killed while being used as human shields by ISIS."], ["2016.03.03", "Syria", "Kafriya", 1, 3, "Sunni militants machine-gun a civilian in his home."], ["2016.03.03", "Thailand", "Yala", 1, 0, "Militant Muslims shoot a rubber tapper to death, then set his body on fire."], ["2016.03.04", "Yemen", "Aden", 16, 0, "Militant Muslims storm a Catholic retirement home and murder sixteen, including four nuns and the elderly residents."], ["2016.03.05", "Iraq", "Mosul", 132, 0, "One-hundred and thirty-two people are executed by Sharia courts."], ["2016.03.05", "Syria", "Jarablus", 1, 0, "A teen is beheaded for apostasy after missing Friday prayers."], ["2016.03.05", "Yemen", "Aden", 2, 0, "Sectarian terrorists fire on a vehicle, killing two occupants."], ["2016.03.06", "Egypt", "Sheikh Zuweid", 3, 0, "Fundamentalists ambush an ambulance and machine-gun a medic and two injured patients."], ["2016.03.06", "Iraq", "Hillah", 61, 95, "At least sixty people are incinerated when a suicide bomber in a fuel tanker detonates outside a town."], ["2016.03.06", "Iraq", "al-Jahash", 12, 0, "A dozen people are executed by a Sharia court."], ["2016.03.06", "Syria", "Aleppo", 14, 40, "Jaish-al-Sunna terrorists send mortars and rockets into a busy market, massacring over a dozen shoppers."], ["2016.03.07", "Afghanistan", "Shindand", 3, 3, "Three civilians are blown to bits by a Taliban bomb blast."], ["2016.03.07", "Chechnya", "Grozny", 1, 0, "Video surfaces showing religious radicals executing a man with a shot to the head."], ["2016.03.07", "Egypt", "al-Arish", 2, 0, "Two local cops are pulled into pieces by Muslim bombers."], ["2016.03.07", "Iraq", "Abu Ghraib", 3, 7, "Three people at a market are sectionalized by a Jihadi bomb blast."], ["2016.03.07", "Iraq", "Kirkuk", 5, 0, "Five young people are torn to shreds by an ISIS bomb blast."], ["2016.03.07", "Pakistan", "Orangi Town", 2, 0, "A young couple is shot to death by conservative relatives for marrying of their own free will."], ["2016.03.07", "Pakistan", "Shabqadar", 17, 30, "A Jamatul Ahrar suicide bomber murders seventeen people at a courthouse, including two children."], ["2016.03.07", "Somalia", "Beledweyne", 0, 6, "A bomb hidden in a laptop detonates at an airport."], ["2016.03.07", "Syria", "Hasakah", 1, 3, "A woman loses her life to an ISIS explosive device."], ["2016.03.07", "Tunisia", "Ben Guerdane", 19, 17, "A 12-year-old girl is among nineteen others who lose their lives during an Islamist assault on a small town."], ["2016.03.08", "Afghanistan", "Maiwand", 2, 0, "Two men clearing landmines are executed by suspected fundamentalists."], ["2016.03.08", "Iraq", "Baghdad", 3, 7, "Three people are left dead following a Mujahideen bombing."], ["2016.03.08", "Iraq", "Fallujah", 50, 0, "Fifty civilians are executed by the Islamic State."], ["2016.03.08", "Iraq", "al-Hadar", 4, 0, "Four sex slaves are executed for trying to escape captivity in the caliphate."], ["2016.03.08", "Israel", "Jaffa", 1, 15, "Palestinians stab an American tourist to death."], ["2016.03.08", "Syria", "Aleppo", 1, 0, "Devout Muslims implement the 'Rule of Allah' by shooting an 'apostate' in the head."], ["2016.03.08", "Thailand", "Si Sakhon", 1, 0, "A man on a motorcycle is ambushed and killed by Muslim terrorists."], ["2016.03.08", "Thailand", "Tak Bai", 1, 0, "A Muslim 'insurgent' walks up to a man in a crowd and fires a bullet into the back of his head."], ["2016.03.08", "Turkey", "Kilis", 2, 1, "A 4-year-old and his mother die when Sunni extremists hit their car with a rocket."], ["2016.03.08", "Uruguay", "Paysandu", 1, 0, "A Jewish man is stabbed to death by a Muslim convert 'following Allah's order'…"], ["2016.03.09", "Afghanistan", "Gereshk", 4, 30, "A Taliban suicide assault on a government building leaves four guards dead."], ["2016.03.09", "Iraq", "Husseiniya", 1, 6, "Terrorists place a bomb under a bus that kills a passenger."], ["2016.03.09", "Iraq", "Taza", 1, 1500, "A 3-year-old girl dies from an ISIS chemical attack that left hundreds injured."], ["2016.03.09", "Nigeria", "Benue", 8, 0, "Fulani mercenaries invade four villages in the middle of the night, shooting at least eight residents to death."], ["2016.03.09", "Somalia", "Mogadishu", 4, 2, "Four people bleed out following a suicide car bombing outside a café."], ["2016.03.09", "Thailand", "Narathiwat", 2, 3, "Muslim terrorists murder two members of a guard patrol for teachers."], ["2016.03.10", "Iraq", "Mosul", 3, 0, "Three Kurds are beheaded by caliphate members."], ["2016.03.10", "Libya", "Misrata", 3, 0, "Three police are killed when ISIS members attack a checkpoint."], ["2016.03.10", "Nigeria", "Tarka", 3, 0, "Fulani mercenaries kill three villagers and burn their homes."], ["2016.03.10", "Syria", "Deir Ezzor", 2, 0, "A poet and his son are murdered by the Islamic State."], ["2016.03.10", "Syria", "Wilayat al-Khayr", 1, 0, "A man is forced by ISIS to climb a radio tower, from which he is shot off."], ["2016.03.10", "Syria", "Wilayat al-Khayr", 2, 0, "The Islamic State executes two terrified men by blowing them up."], ["2016.03.11", "Ingushetia", "Nazran", 0, 4, "'Problems in the religious sphere' result in a car bomb blast outside a mosque."], ["2016.03.11", "Iraq", "Sheikhan", 11, 2, "Two ISIS rockets claim the lives of eleven Iraqis."], ["2016.03.11", "Iraq", "Sinjar", 5, 3, "Five Kurds are laid out by a Shahid suicide bomber."], ["2016.03.11", "Pakistan", "Kohistan", 2, 0, "A couple is shot to death for 'illicit relations'."], ["2016.03.12", "Afghanistan", "Khanashin", 1, 3, "A child is disassembled by Taliban bombers."], ["2016.03.12", "Iraq", "Mahmoudiyah", 2, 7, "Mujahid bombers kill two patrons at a market."], ["2016.03.12", "Iraq", "Munsiyah", 7, 0, "Three women are among seven people murdered in their home by sectarian militia."], ["2016.03.13", "Afghanistan", "Yengi Qala", 2, 0, "A young couple is murdered over suspected sexual activity."], ["2016.03.13", "Iraq", "Sinjar", 7, 11, "ISIS pour shells into a Yazidi village, killing seven residents."], ["2016.03.13", "Iraq", "Tal Kasab", 8, 22, "Suicide bomb attacks leave eight dead."], ["2016.03.13", "Ivory Coast", "Bassam", 18, 17, "al-Qaeda gunmen assault a hotel and murder anyone refusing to praise Allah with them.  The eighteen killed include a 5-year-old Christian who was cut down while praying."], ["2016.03.14", "Afghanistan", "Kandahar", 1, 0, "A woman is shot to death by the Taliban."], ["2016.03.14", "Bangladesh", "Jhenaidah", 1, 0, "Radical Muslims assassinate a 'polytheist apostate' (i.e. Shia cleric)."], ["2016.03.14", "Canada", "Toronto, ON", 0, 2, "A man stabs two soldiers at a recruiting center, saying that he was just following Allah's instructions."], ["2016.03.14", "Egypt", "al-Arish", 2, 0, "Two Egyptians are picked off by fundamentalist snipers."], ["2016.03.14", "Iraq", "Mosul", 6, 0, "Six young people are rounded up and executed by the caliphate."], ["2016.03.14", "Iraq", "Ramadi", 25, 20, "ISIS suicide bombers massacre over two dozen in attacks on two villages."], ["2016.03.14", "Iraq", "Zankurah", 22, 16, "Twenty-two Iraqis are killed during an assault by the Islamic State."], ["2016.03.14", "Nigeria", "Chul", 3, 7, "Three civilians are taken out by a Boko Haram bomb blast."], ["2016.03.14", "Nigeria", "Huyum", 1, 1, "Islamic gunmen kill a woman and shoot a child in the leg."], ["2016.03.14", "Syria", "Busayrah", 1, 0, "A young man is shot in the head for 'mocking religion'."], ["2016.03.15", "Afghanistan", "Hajiabad", 4, 0, "Women and children are among four civilians exterminated by Taliban bombers."], ["2016.03.15", "Afghanistan", "Laghman", 1, 1, "Sharia state proponents ambush and kill an off-duty police officer."], ["2016.03.15", "Iraq", "Qwar", 9, 17, "An ISIS chlorine gas attack kills nine Kurds."], ["2016.03.15", "Philippines", "Patikul", 2, 0, "Abu Sayyaf members ambush and kill two local soldiers."], ["2016.03.15", "Syria", "Safafa", 68, 0, "Sixty-eight people imprisoned by the Islamic State are executed to 'reduce expenses'."], ["2016.03.15", "Thailand", "Pattani", 1, 0, "Suspected terrorists shoot a young woman twice in the head at a market."], ["2016.03.16", "Nigeria", "Maiduguri", 18, 35, "Two female suicide bombers slaughter two dozen worshippers at a rival mosque."], ["2016.03.16", "Pakistan", "Peshawar", 15, 30, "Fifteen people are torn to shreds when Lashkar-e-Islam bomb a bus carrying commuters."], ["2016.03.17", "Egypt", "Rafah", 5, 10, "Five are killed when religious extremists attack a local military base."], ["2016.03.17", "Iraq", "Fallujah", 6, 0, "Six men are executed in barbaric fashion by the Islamic State, including one whose head is blown off with explosives."], ["2016.03.17", "Iraq", "Hamidat", 1, 0, "Radicals put a rival imam against a wall and shoot him to death."], ["2016.03.17", "Niger", "Diffa", 1, 2, "Four suicide bombers manage to kill one other person."], ["2016.03.17", "Niger", "Dolbel", 3, 3, "Three guards at a market are shot to death point blank by Jihadis."], ["2016.03.17", "Pakistan", "Smagal", 4, 0, "A woman and her child are among four souls obliterated by a suicide bomber."], ["2016.03.17", "Philippines", "Sarangani", 1, 0, "A 43-year-old man is beheaded by a pro-caliphate group."], ["2016.03.17", "Thailand", "Pattani", 1, 0, "A 53-year-old guard at a school is shot to death by Muslim militants."], ["2016.03.18", "Afghanistan", "Seori Tapi", 2, 1, "A Taliban landmine takes out two people, including a child."], ["2016.03.18", "Iraq", "Mosul", 1, 0, "A gentleman's head is removed by the Islamic State."], ["2016.03.18", "Nigeria", "Bori", 5, 3, "A young girl is among five villagers murdered by Boko Haram."], ["2016.03.18", "Pakistan", "Sherabad", 2, 0, "A young couple is shot to death by a conservative family member on suspicion of adultery."], ["2016.03.18", "Syria", "Aleppo", 1, 6, "A Sunni rocket sends a woman to the morgue."], ["2016.03.18", "Syria", "Aleppo", 2, 3, "Two children, a boy and a girl, are reduced to pulp by a series of Sunni rockets on their neighborhood."], ["2016.03.19", "Egypt", "al-Arish", 15, 0, "ISIS claims to have detonated a suicide car bomb that leaves fifteen others dead."], ["2016.03.19", "Iraq", "Kirkuk", 2, 0, "Two more children die from the effects of an ISIS mustard gas attack."], ["2016.03.19", "Iraq", "Mosul", 70, 0, "A mass grave is discovered containing the remains of seventy female Yazidi victims of ISIS torture and execution."], ["2016.03.19", "Somalia", "Afmadhow", 2, 5, "An al-Shabaab attack leaves two others dead."], ["2016.03.19", "Turkey", "Istanbul", 4, 39, "An ISIS suicide bomber murders four people along a city street, including two American tourists."], ["2016.03.20", "Iraq", "Haqlaniyah", 24, 12, "A wave of Shahid suicide bombers kill two dozen Iraqis."], ["2016.03.21", "Egypt", "Cairo", 4, 0, "Four Bible translators for Wycliffe are brutally slain in their office at an undisclosed location in the Middle East."], ["2016.03.21", "Iraq", "Anbar", 30, 0, "A British suicide bomber is said to be responsible for a blast that kills thirty Iraqis."], ["2016.03.21", "Iraq", "Makhmour", 2, 0, "Two others are taken out by a series of suicide bombers."], ["2016.03.21", "Iraq", "al-Baghdadi", 6, 9, "An ISIS attack that began with five suicide bombings manages to kill six Iraqis."], ["2016.03.21", "Somalia", "Laantu Buur", 6, 0, "Six local soldiers are ambushed and killed by an Islamist group."], ["2016.03.21", "Yemen", "Taiz", 1, 3, "Shiite snipers fire on a group of journalists, bringing down one."], ["2016.03.22", "Bangladesh", "Kurigram", 1, 0, "A Christian convert is stabbed to death by Religion of Peace proponents."], ["2016.03.22", "Belgium", "Brussels", 14, 92, "Fourteen people are murdered when two suicide bombers detonate nail-packed explosives at crowded airline counters."], ["2016.03.22", "Belgium", "Brussels", 21, 130, "A Religion of Peace suicide blast on a subway train incinerates twenty-one commuters."], ["2016.03.22", "Iraq", "Tarmiya", 3, 7, "A Mujahid bomb blast claims three lives."], ["2016.03.23", "Iraq", "Baghdad", 2, 6, "Two people outside a shop are sent to the hereafter by Jihadi bombers."], ["2016.03.23", "Iraq", "Zkhaikha", 6, 13, "A suicide car bomber lays out a half-dozen Iraqis."], ["2016.03.23", "Syria", "Foua", 2, 3, "Ahrar al-Sham snipers pick off two civilians."], ["2016.03.24", "Afghanistan", "Arghandab", 7, 0, "Three Taliban in police uniform sprays seven sleeping officers with machine-gun fire."], ["2016.03.24", "Pakistan", "Dera Ismail Khan", 2, 0, "Muslim extremists gun down two police officers."], ["2016.03.24", "Pakistan", "Hayatabad", 1, 0, "A university professor is shot to death by fundamentalists."], ["2016.03.24", "Scotland", "Glasgow", 1, 0, "An Ahmadi minority is stabbed to death by a radical Muslim over his religious beliefs."], ["2016.03.25", "Iraq", "Iskandariyah", 41, 105, "Forty-one innocents are blown to bits by a Fedayeen suicide bomber at a soccer game."], ["2016.03.25", "Libya", "Zaria", 2, 0, "A suspected ISIS bomb blast takes out a woman and her infant son."], ["2016.03.25", "Syria", "Jarablus", 2, 0, "Two teenagers are chained, blindfolded and shot to death by a Sharia court."], ["2016.03.25", "Yemen", "Aden", 25, 15, "Three al-Qaeda suicide bombings leave twenty-five dead."], ["2016.03.26", "Iraq", "Ein al-Asad", 3, 4, "A group of suicide bombers attack an air base, killing three local defenders."], ["2016.03.26", "Nigeria", "Tumpun", 4, 0, "Boko Haram gunmen open fire on a group of villagers, killing four."], ["2016.03.26", "Pakistan", "Lwargi", 1, 0, "A polio worker is gunned down inside his clinic by Lashkar-e-Islam."], ["2016.03.26", "Syria", "Aleppo", 5, 20, "Five civilians lose their lives when Sunni extremists pour rockets into a neighborhood."], ["2016.03.27", "Iraq", "Baghdad", 2, 9, "Jihadists bomb a vegetable market, killing two patrons."], ["2016.03.27", "Pakistan", "Lahore", 78, 362, "A massive suicide blast targeting Christian families celebrating Easter leaves over seventy dead, half of whom were children."], ["2016.03.27", "Thailand", "Yarang", 2, 0, "Two guards at a flea market are sprayed point-blank with machine-gun fire."], ["2016.03.28", "Afghanistan", "Kabul", 1, 0, "Islamists fire rockets at the parliament building, killing a guard."], ["2016.03.28", "Iraq", "Mosul", 3, 0, "Three Kurdish captives are beheaded by the Islamic State."], ["2016.03.28", "Iraq", "Mosul", 15, 0, "Fifteen civilians are rounded up and executed by caliphate members."], ["2016.03.29", "Afghanistan", "Kabul", 2, 3, "A bomb planted by Sunni fundamentalists takes out a woman and teenager."], ["2016.03.29", "Dagestan", "Makhachkala", 1, 2, "ISIS claims responsibility for a car bomb attack that leaves one dead."], ["2016.03.29", "Iraq", "Baghdad", 7, 23, "A Shahid suicide bomber detonates amid a group of civilians, laying out seven."], ["2016.03.29", "Iraq", "Salahudin", 11, 0, "Eleven members of a single family are murdered in their own home by Mujahideen."], ["2016.03.29", "Syria", "Deir Ezzor", 1, 0, "A boy is shot to death for helping his sister-in-law escape the caliphate."], ["2016.03.29", "Syria", "Manbij", 1, 0, "A young woman is beheaded by the Islamic State."], ["2016.03.29", "Thailand", "Ra-Ngae", 3, 9, "Islamist 'rebels' ambush a police convoy, killing three members."], ["2016.03.30", "Afghanistan", "Zabul", 2, 1, "Suspected Taliban bombers exterminate two young children."], ["2016.03.30", "Dagestan", "Sirtych", 1, 0, "A suicide bomber kills one other person."], ["2016.03.30", "Somalia", "Mogadishu", 6, 6, "Six people are killed in a drive-by shooting by al-Qaeda linked militants."], ["2016.03.30", "Thailand", "Prado", 1, 0, "A 40-year-old Buddhist man is gunned down by Muslim terrorists."], ["2016.03.31", "Iraq", "Fallujah", 35, 0, "Thirty-five civilians are executed by firing squad for attempting to flee the caliphate."], ["2016.03.31", "Iraq", "Makhmour", 4, 1, "Four people are blown to bits by two suicide bombers."], ["2016.03.31", "Iraq", "Makhmour", 11, 0, "Eleven Iraqis are take out by two suicide car bombers."], ["2016.03.31", "Iraq", "Mosul", 15, 0, "Fifteen civilians are electrocuted by the Islamic State."], ["2016.03.31", "Iraq", "Tarmiyah", 3, 7, "Mujahideen set off a bomb near a popular market, successfully killing three passersby."], ["2016.03.31", "Niger", "Diffa", 6, 3, "A half-dozen security personnel are ambushed and killed by a radical Islamist group."], ["2016.03.31", "Nigeria", "Abbi", 2, 19, "Two siblings are hacked to death by Fulani mercenaries."], ["2016.03.31", "Pakistan", "Battagram", 2, 0, "Two employees at an Islamic seminary are shot to death on suspicion of sexual activity."], ["2016.03.31", "Somalia", "Galkayo", 9, 10, "Ten people are torn limb from limb by a Shahid suicide bomber."], ["2016.03.31", "Syria", "Manbij", 2, 0, "Fundamentalists stone a man and woman to death over suspected adultery."], ["2016.03.31", "Thailand", "Bangpu", 1, 12, "A series of bomb attacks leaves a civilian dead and a dozen others wounded."], ["2016.04.01", "Syria", "Palmyra", 40, 0, "A mass grave is discovered containing women and children among other victims of the Islamic State."], ["2016.04.01", "Thailand", "Raman", 2, 1, "Runda Kumpulan Kecil Islamists spray a tea shop with bullets, killing two villagers."], ["2016.04.02", "Iraq", "Tarmiya", 1, 0, "Islamic militants storm a house and kill a woman."], ["2016.04.02", "Libya", "Maradah", 2, 0, "Two guards at an oil field are murdered by ISIS."], ["2016.04.02", "Syria", "Aleppo", 1, 5, "A child is disassembled by a Sunni mortar shell."], ["2016.04.02", "Syria", "Raqqa", 1, 0, "Caliphate members murder a man in front of his family and hang from a traffic light."], ["2016.04.03", "India", "Sahaspur", 1, 1, "Suspected Mujahid gun down a man in front of his wife and children."], ["2016.04.03", "Yemen", "Marib", 3, 17, "Three civilians are left dead after a Shiite militant attack on a hospital."], ["2016.04.04", "Afghanistan", "Dawlat Abad", 6, 0, "Sunni fundamentalists ambush and murder six local cops."], ["2016.04.04", "Afghanistan", "Khewa", 2, 6, "Two civilians are laid out by a Taliban bomb blast."], ["2016.04.04", "Iraq", "Basra", 5, 10, "Five Iraqis are blown to bits by a Fedayeen suicide bomber at a commercial area."], ["2016.04.04", "Iraq", "Mishahda", 4, 10, "A Shahid suicide car bomber hits a government building, killing four employees."], ["2016.04.04", "Iraq", "Nasiriyah", 14, 27, "A suicide bomber detonates at a restaurant frequented by Shiites, killing at least fourteen."], ["2016.04.04", "Iraq", "Sadr al-Qanat", 6, 13, "A half-dozen people lose their lives to a suicide car bomber."], ["2016.04.04", "Libya", "Jufra", 1, 1, "One person is murdered by ISIS."], ["2016.04.04", "Nigeria", "Izghe", 5, 0, "At least five others are killed when Boko Haram launch an attack on a small town."], ["2016.04.04", "Syria", "Aleppo", 8, 20, "Eight residents are killed when al-Nusra lob rocket shells into a neighborhood."], ["2016.04.04", "Syria", "Raqqa", 8, 0, "Eight young people are crucified by the Islamic State."], ["2016.04.05", "Afghanistan", "Parwan", 6, 22, "Children are among six killed when a suicide bomber detonates near a school."], ["2016.04.05", "Iraq", "Baghdad", 1, 2, "A suicide bomber manages to kill one other person."], ["2016.04.05", "Iraq", "Mahmoudiya", 2, 7, "A marketplace blast leaves two patrons in pieces."], ["2016.04.05", "Pakistan", "Khyber Pakhtunkhwa", 4, 0, "Four people, including two refugees, are gunned down by Islamic militants."], ["2016.04.05", "Saudi Arabia", "Dawadmi", 1, 0, "ISIS snipers pick off a local military officer."], ["2016.04.06", "Afghanistan", "Andar", 1, 9, "A civilian bleeds out after the Taliban spray a vehicle with bullets."], ["2016.04.06", "Bangladesh", "Dhaka", 1, 0, "A secular student activist is hacked to death at a university by three devotees chanting praises to Allah."], ["2016.04.06", "Iraq", "Fallujah", 15, 0, "The caliphate burns fifteen civilians alive for trying to flee."], ["2016.04.06", "Niger", "Diffa", 3, 3, "Three civilians are reduced to disparate parts by two Fedayeen suicide bombers."], ["2016.04.06", "Pakistan", "Wandala", 1, 1, "A Muslim gang slits the throat of a disabled Christian for trying to defend members of his community."], ["2016.04.06", "Syria", "Aleppo", 18, 70, "A pregnant woman and three children are among over a dozen left dead after terrorists fire rockets into a Kurdish neighborhood."], ["2016.04.06", "Thailand", "Narathiwat", 2, 0, "Two villagers are machine-gunned in their pick-up truck by Muslim terrorists."], ["2016.04.07", "Egypt", "Sheikh Zuweid", 4, 14, "A woman is among four people laid out by Islamic bombers."], ["2016.04.07", "Egypt", "al-Arish", 3, 1, "Terrorists murder three young police recruits with a roadside bomb."], ["2016.04.07", "Iraq", "Abu Ghraib", 2, 8, "Two people are killed when Mujahideen set off a bomb blast near a market."], ["2016.04.07", "Nigeria", "Gurum", 20, 0, "At least twenty innocents are slaughtered when Boko Haram members burn their village."], ["2016.04.07", "Syria", "Aleppo", 23, 100, "ISIS sends shells containing chemical agents into a residential neighborhood, choking two dozen residents to death."], ["2016.04.07", "Syria", "Raqqa", 2, 0, "A video shows a gay man thrown to his death and stoned, while another is beheaded."], ["2016.04.07", "Thailand", "Pattani", 1, 0, "Islamic terrorists shoot a 31-year-old man to death."], ["2016.04.08", "Pakistan", "Karachi", 3, 0, "Three Shiites are gunned down by Sunnis after Friday prayers, including a father and son."], ["2016.04.08", "Somalia", "Hamar Weyne", 3, 10, "Islamists send mortars into a seaside district, killing three residents."], ["2016.04.09", "Iraq", "Albu Bali", 4, 10, "A suicide car bomber takes out four Iraqis."], ["2016.04.09", "Iraq", "Baghdad", 2, 8, "Jihadis bomb a popular market, killing two patrons."], ["2016.04.09", "Iraq", "Madain", 4, 18, "Mujahid bombers murder four young people at a soccer match."], ["2016.04.09", "Philippines", "Basilan", 18, 53, "Abu Sayyaf ambush and kill eighteen local security personnel, some of which are beheaded."], ["2016.04.09", "Philippines", "Bula", 1, 0, "Ansar al Khilafah members behead a 43-year-old non-Muslim."], ["2016.04.09", "Somalia", "Mogadishu", 6, 5, "A Fedayeen suicide car bomber rams a busy restaurant, taking out six bystanders."], ["2016.04.09", "Syria", "Damascus", 4, 0, "Four cement workers are murdered on account of their being members of the Druze religious minority."], ["2016.04.09", "Syria", "Darb Hassan", 6, 3, "A half-dozen children are disassembled by an ISIS landmine."], ["2016.04.09", "Syria", "Qaryatain", 21, 0, "Three women are among twenty-one Christians murdered in cold blood for refusing to submit to Islam."], ["2016.04.09", "Yemen", "Ahwar", 19, 0, "Nineteen local soldiers are ambushed, captured and beheaded by al-Qaeda."], ["2016.04.10", "Iraq", "Hit", 6, 12, "An Islamic State suicide bomber targets fleeing families, killing six members."], ["2016.04.10", "Iraq", "Zab", 6, 4, "ISIS landmines take out a half dozen civilians."], ["2016.04.10", "Nigeria", "Abraka", 1, 0, "A 52-year-old university staffer is shot twice in the head by militant Muslims."], ["2016.04.10", "Syria", "Azaz", 20, 0, "Twenty civilians are reported killed when ISIS members assault several small towns."], ["2016.04.11", "Afghanistan", "Kabul", 14, 38, "A suicide bomber on a motorcycle slaughters fourteen people."], ["2016.04.11", "Afghanistan", "Wesh", 7, 0, "A Taliban in police uniform murders seven border guards."], ["2016.04.11", "Nigeria", "Gashak", 44, 0, "Fulani terrorists invade two villages and massacre over forty residents."], ["2016.04.11", "Pakistan", "Karachi", 1, 0, "A secular-leaning party activist is assassinate in a tea room by suspected fundamentalists."], ["2016.04.11", "Somalia", "Mogadishu", 5, 7, "Children are among those killed by an al-Shabaab bomb blast outside a restaurant."], ["2016.04.11", "Thailand", "Songkla", 2, 8, "A 4-year-old boy is among two killed when Muslim terrorists bomb a train station."], ["2016.04.11", "Turkey", "Kilis", 1, 11, "A 74-year-old man dies from injuries suffered from ISIS rocket shrapnel."], ["2016.04.12", "Afghanistan", "Mingora", 1, 0, "The Taliban shoot an official to death after he stops to buy fruit."], ["2016.04.12", "Iraq", "Madain", 3, 5, "Three people are torn limb from limb by a Jihadi bomb blast."], ["2016.04.12", "Iraq", "Mosul", 1, 0, "Caliphate members execute a university student in front of his home."], ["2016.04.12", "Iraq", "Mosul", 3, 0, "Three women at a market are forced to their knees and shot in the head by the Islamic State."], ["2016.04.12", "Libya", "Bani Waleed", 7, 2, "Seven others die after an attack by ISIS gunmen."], ["2016.04.12", "Mali", "Tessalit", 3, 1, "Three French peacekeepers are reduced to pulp by an Islamist landmine."], ["2016.04.12", "Pakistan", "Sabzi Mandi", 1, 2, "Taliban militants kill a government employee in a targeted attack."], ["2016.04.12", "Philippines", "Butig", 2, 4, "Two sawmill workers are beheaded by Muslim extremists."], ["2016.04.12", "Thailand", "Mae Lan", 3, 0, "A Buddhist monk is among three Thais murdered by Muslim terrorists."], ["2016.04.12", "Turkey", "Gaziantep", 1, 0, "A journalist dies after being shot in the head by Islamists."], ["2016.04.12", "Yemen", "Aden", 5, 7, "A Shahid suicide bomber sends five other souls to Allah."], ["2016.04.13", "Libya", "Misrata", 1, 4, "A security guard is killed during an ISIS drive-by."], ["2016.04.13", "Turkey", "Kilis", 2, 8, "Two lives are cut short by an ISIS rocket attack on a small town."], ["2016.04.14", "Afghanistan", "Takhar", 8, 0, "Taliban ambush and murder eight local security personnel."], ["2016.04.14", "Iraq", "Mahmoudiya", 2, 7, "Two people at a market are sectionalized by a Mujahideen bomb blast."], ["2016.04.15", "Libya", "Benghazi", 2, 3, "An ISIS car bomb near a cemetery leaves two dead."], ["2016.04.15", "Libya", "Benghazi", 6, 25, "Six Libyans are taken out by a suicide bomber at a cement factory."], ["2016.04.15", "Syria", "Raqqa", 1, 0, "A man is beheaded for alleged 'sorcery'."], ["2016.04.16", "Bahrain", "Karbabad", 1, 2, "Shiite radicals are suspected of burning a police officer alive."], ["2016.04.16", "Germany", "Essen", 0, 3, "ISIS-inspired teens bomb a Sikh wedding."], ["2016.04.16", "Iraq", "Kirkuk", 1, 0, "An imam at a mosque is assassinated by Religion of Peace rivals."], ["2016.04.16", "Iraq", "Tarmiya", 2, 4, "Two Iraqis are murdered by Mujahideen bombers."], ["2016.04.17", "Iraq", "Mosul", 2, 0, "A photojournalist and his brother are pulled from their home and executed by the Islamic State."], ["2016.04.17", "Pakistan", "Zakha Khel", 1, 0, "A guard is killed when a suicide bomber tries to enter a bazaar."], ["2016.04.17", "Somalia", "Mogadishu", 1, 1, "Suspected al-Shabaab gun down a cleaning woman outside the UN headquarters."], ["2016.04.17", "Syria", "Raqqa", 1, 0, "A man is beheaded and crucified by the Islamic State."], ["2016.04.17", "Yemen", "Aden", 4, 2, "A Fedayeen suicide bomber kills four people at a checkpoint."], ["2016.04.18", "Egypt", "al-Arish", 2, 11, "Religious radicals murder two civilians with a roadside bomb."], ["2016.04.18", "Iraq", "Abu Karma", 1, 5, "A boy on a farm is disassembled by a terrorist mortar shell."], ["2016.04.18", "Israel", "Jerusalem", 0, 21, "An Hamas suicide bomber detonates on a passenger bus."], ["2016.04.18", "Somalia", "Mogadishu", 4, 0, "An Islamist shooting and suicide blast leaves four civilians dead."], ["2016.04.18", "Syria", "Hama", 2, 3, "Two civilians bleed to death after their neighborhood is hit with a Sunni rocket attack."], ["2016.04.18", "Syria", "Kefraya", 3, 5, "An ISIS rocket ends the lives of three children."], ["2016.04.18", "Turkey", "Kilis", 4, 6, "Three children are among four people cut to ribbons by ISIS shrapnel."], ["2016.04.19", "Afghanistan", "Kabul", 64, 347, "Over sixty are killed when religious extremists stage a massive attack on a government building that begins with a suicide bombing."], ["2016.04.19", "Egypt", "Sheikh Zuweid", 3, 8, "Fundamentalists exterminate three local cops with an RPG."], ["2016.04.19", "Iraq", "Baghdad", 2, 5, "Jihadis set off a bomb outside a row of shops, killing two passersby."], ["2016.04.19", "Iraq", "Makhmour", 13, 18, "Thirteen Kurds are killed following an ISIS chemical attack."], ["2016.04.19", "Pakistan", "Dhok Lona", 4, 0, "A conservative Muslims shoots his own daughter and three other family members to death in an honor killing."], ["2016.04.19", "Pakistan", "Mardan", 1, 23, "A Shahid suicide bomber takes out one person at a tax office."], ["2016.04.19", "Thailand", "Songkhla", 1, 11, "A child is among the casualties of an Islamic 'separatist' bomb blast outside a grocery store."], ["2016.04.19", "Uganda", "Kanginima", 0, 1, "A 22-year-old Christian woman is beaten and gang-raped in a targeted attack by followers of a local imam."], ["2016.04.20", "Egypt", "Sinai", 6, 12, "Beit Ansar al-Maqdis members fire a missile at a police convoy, killing six officers."], ["2016.04.20", "Iraq", "Baghdad", 2, 8, "Jihadis bomb a popular market, killing two patrons."], ["2016.04.20", "Iraq", "Hawija", 2, 1, "An 11-year-old girl is among two Yazidi girls killed while trying to escape caliphate sex slavery."], ["2016.04.20", "Iraq", "Mosul", 5, 0, "Sharia proponents throw five accused homosexuals to their deaths from the roof of a building."], ["2016.04.20", "Iraq", "Nineveh", 14, 0, "Seven employees at a police station and seven more at a market are executed by caliphate members."], ["2016.04.20", "Iraq", "Ramadi", 40, 0, "Women and children are among forty victims of Islamic State execution found in a mass grave."], ["2016.04.20", "Nigeria", "Zango", 11, 6, "Boko Haram gunmen fire into a village, then at fleeing residents, taking out eleven."], ["2016.04.20", "Pakistan", "Orangi", 7, 0, "Islamic militants brutally murder seven guards for an polio vaccination team."], ["2016.04.20", "Syria", "Aleppo", 1, 2, "Sunni snipers pick off a Shiite woman."], ["2016.04.20", "Syria", "Yarmouk", 20, 0, "Twenty Palestinians at a refugee camp are reportedly beheaded by ISIS."], ["2016.04.20", "Thailand", "Songkhla", 1, 11, "A 62-year-old is killed, and an 11-year-old boy is among the injured, when Muslim militants set off a bomb at a grocery."], ["2016.04.21", "Afghanistan", "Kunar", 2, 4, "Two local cops are murdered by Taliban bombers."], ["2016.04.21", "Iraq", "Baghdad", 6, 20, "A half-dozen Iraqis are shot or blown up in a series of attacks by Muslim terrorists."], ["2016.04.21", "Iraq", "Madain", 2, 8, "Two people at a café lose their lives to Mujahid bombers."], ["2016.04.21", "Iraq", "Ramadi", 6, 0, "ISIS members booby-trap the homes of civilians, killing six."], ["2016.04.21", "Nigeria", "Banki", 7, 9, "Two women and their babies are among seven people exterminated by two suicide bombers at a refugee camp."], ["2016.04.21", "Somalia", "Baay", 6, 0, "al-Shabaab bombers take out six AU peacekeepers."], ["2016.04.22", "Iraq", "Abu Ghraib", 2, 9, "Islamist bombers murder two people."], ["2016.04.22", "Iraq", "Baghdad", 9, 25, "At least nine worshippers at a Shiite mosque are blown to bits by a Sunni suicide bomber."], ["2016.04.22", "Iraq", "Dukok", 3, 0, "Three Yazidi sex slaves are killed trying to flee captivity."], ["2016.04.22", "Iraq", "Mosul", 161, 0, "One-hundred and sixty-one more Yazidi women and girls than previously reported are executed for refusing sex slavery."], ["2016.04.22", "Pakistan", "Pir Baba", 1, 0, "A Sikh activist is assassinated by Islamists."], ["2016.04.22", "Syria", "Raqqa", 1, 0, "A magician is beheaded by the Islamic State."], ["2016.04.22", "Syria", "Raqqa", 1, 0, "Video shows fundamentalists beheading a man with a necklace bomb."], ["2016.04.22", "Turkey", "Kilis", 4, 0, "An ISIS rocket claims the lives of four people, including a 14-year-old boy."], ["2016.04.23", "Bangladesh", "Rajshahi", 1, 0, "An 'atheist' professor is hacked to death by Islamists."], ["2016.04.23", "Bangladesh", "Tungipara", 1, 0, "A 75-year-old Hindu is stabbed to death over his religion by a young Muslim."], ["2016.04.23", "Iraq", "Baghdad", 4, 8, "A Shahid suicide bomber snuffs out four souls in a suburb."], ["2016.04.23", "Iraq", "Baghdad", 10, 28, "A suicide car bomber successfully kills ten Iraqis."], ["2016.04.23", "Iraq", "Garma", 4, 15, "Four locals are blown to bits by a Fedayeen suicide car bomber."], ["2016.04.23", "Iraq", "Mosul", 2, 0, "Two women are dragged to a market and executed by ISIS."], ["2016.04.23", "Libya", "Brega", 1, 7, "A guard at an oil plant is gunned down by ISIS."], ["2016.04.23", "Syria", "Damascus", 1, 1, "A woman bleeds out following a Sunni mortar attack on a refugee camp."], ["2016.04.23", "Syria", "Idlib", 4, 3, "A Fedayeen suicide bomber murders four rivals."], ["2016.04.24", "Afghanistan", "Helmand", 2, 2, "Two lives are extinguished by a Shahid suicide bomber."], ["2016.04.24", "Iraq", "Baghdad", 2, 2, "Suicide bombers kill two guards outside a rival mosque."], ["2016.04.24", "Iraq", "Roufa", 6, 8, "Six Iraqis are laid out by a Fedayeen suicide bomber."], ["2016.04.24", "Nigeria", "Alau", 30, 0, "Thirty herdsmen and their families are massacred by Boko Haram."], ["2016.04.24", "Syria", "Aleppo", 11, 0, "al-Qaeda linked militant send mortars into a residential neighborhood, killing eleven."], ["2016.04.24", "Thailand", "Yala", 1, 0, "Muslim 'insurgents' gun down a guard at a bank."], ["2016.04.24", "Turkey", "Kilis", 2, 26, "Two civilians are torn to shreds by an ISIS rocket."], ["2016.04.24", "Yemen", "Mukalla", 7, 14, "Seven security personnel are blown up by al-Qaeda bombers."], ["2016.04.25", "Bangladesh", "Dhaka", 2, 0, "A gay rights magazine editor is stabbed to death along with a companion by five men shouting praises to Allah."], ["2016.04.25", "Bangladesh", "Kashimpur", 1, 0, "A man is shot in front of a pharmacy at close range by Islamic militants."], ["2016.04.25", "Iraq", "Baghdad", 7, 32, "An ISIS suicide bomber massacres seven people in a shopping district."], ["2016.04.25", "Iraq", "Baghdad", 11, 39, "Eleven people standing outside a cinema in a Shiite district are eliminated by Sunni extremists."], ["2016.04.25", "Iraq", "Mosul", 4, 0, "Four young people are arrested at a university and then burned alive by caliphate members."], ["2016.04.25", "Iraq", "Salahiya", 3, 0, "Three women are executed for refusing to blow themselves up at a refugee camp."], ["2016.04.25", "Iraq", "Tahrir", 7, 0, "A family of seven, including two women and a 6-year-old, are pulled from their home and shot in the head by Islamic State loyalists."], ["2016.04.25", "Nigeria", "Enugu", 48, 60, "Forty-eight people are reported dead after Muslim terrorists attack their village, hacking, shooting, and burning their homes and church."], ["2016.04.25", "Syria", "Aleppo", 2, 6, "Two civilians are reduced to rubble by a Sunni rocket attack on a café district."], ["2016.04.25", "Syria", "Sayyida Zeinab", 6, 42, "A car bomb strikes a Shiite mosque, killing six bystanders."], ["2016.04.25", "Thailand", "Narathiwat", 1, 11, "A 33-year-old dies from wounds following a Muslim bomb blast."], ["2016.04.25", "Thailand", "Yala", 2, 0, "Two rubber traders are gunned down by Muslim terrorists."], ["2016.04.26", "Iraq", "Faysaliya", 7, 0, "Seven civilians are reportedly drowned in metal cages by a Sharia court."], ["2016.04.26", "Philippines", "Jolo", 1, 0, "The severed head of a Canadian retiree is found seven months after his capture by Abu Sayyaf."], ["2016.04.26", "Somalia", "Baidoa", 8, 13, "Islamists fire an RPG into a government convoy, killing eight occupants."], ["2016.04.26", "Syria", "al-Zahra", 19, 120, "Sunni hardliners pour rocket fire into a small town, killing at least sixteen civilians - including children."], ["2016.04.27", "Afghanistan", "Mehtarlam", 3, 0, "A police officer turns fundamentalist and shoot three others in the back."], ["2016.04.27", "Egypt", "al-Arish", 3, 8, "Three local cops are brought down by an al-Qaeda affiliate."], ["2016.04.27", "Iraq", "Mahmoudiya", 2, 7, "Two patrons are laid out by a Mujahideen bomb blast at a popular market."], ["2016.04.27", "Iraq", "Mosul", 28, 0, "Twenty-eight civilians are executed for trying to flee the caliphate."], ["2016.04.27", "Pakistan", "Pir Mahal", 1, 0, "A Christian boy is lynched for flirting with a Muslim girl."], ["2016.04.27", "Pakistan", "Shopian", 1, 0, "Islamic militants gun down a shopkeeper."], ["2016.04.27", "Syria", "Aziziye", 4, 25, "Four innocents lose their lives to Sunni shrapnel."], ["2016.04.28", "Afghanistan", "Herat", 1, 1, "Suspected Taliban shoot a man to death and wound his 7-year-old son."], ["2016.04.28", "Afghanistan", "Laghman", 5, 3, "The Taliban kill five local cops in two separate terror attacks."], ["2016.04.28", "Iraq", "Mosul", 1, 0, "A Christian girl is burned alive in her home when her family is unable to pay jizya."], ["2016.04.28", "Iraq", "Tuz Khurmatu", 1, 0, "A Shiite militia sniper picks off a teenager from a distance."], ["2016.04.28", "Pakistan", "Donga Gali", 1, 0, "Fifteen members of a jirga council 'honor kill' a 16-year-old girl by burning her alive in a van for helping a couple elope."], ["2016.04.28", "Pakistan", "Fareed", 1, 0, "A teenage girl is beaten and then stabbed to death after disregarding her conservative brother's instructions not to talk to boys."], ["2016.04.28", "Syria", "Aleppo", 6, 43, "Terrorists shell an Armenian district, killing six residents."], ["2016.04.28", "Syria", "Manbij", 2, 0, "Two young men are beheaded by ISIS."], ["2016.04.28", "Thailand", "Yala", 1, 5, "A Muslim bomb targeting military engineers on a humanitarian mission leaves one dead."], ["2016.04.29", "Dagestan", "Shamil", 1, 0, "A retired man is murdered by suspected Islamists."], ["2016.04.29", "Iraq", "Baiji", 11, 12, "Four suicide car bombers kill eleven Iraqis."], ["2016.04.29", "Iraq", "Makhoul", 3, 2, "Three local cops are taken out by an ISIS suicide bomber."], ["2016.04.29", "Syria", "Aleppo", 15, 30, "At least fifteen worshippers are killed when Sunnis shell a rival mosque during Friday prayers."], ["2016.04.30", "Bangladesh", "Gopalpur", 1, 0, "A Hindu tailor is hacked to death for 'slurring the Prophet'."], ["2016.04.30", "Iraq", "Dora", 23, 48, "A Sunni suicide bomber sends two dozen Shiite pilgrims straight to Allah."], ["2016.04.30", "Nigeria", "Dadawa", 2, 0, "A man and his daughter are burnt alive in their church by Boko Haram."], ["2016.04.30", "Pakistan", "Oghi", 1, 0, "A woman is honor killed by her family over a sexual affair."], ["2016.04.30", "Syria", "Aleppo", 25, 0, "Over two dozen civilians are exterminated by an al-Nusra mortar attack on their neighborhood."], ["2016.05.01", "Iraq", "Samawa", 38, 86, "Several children are among over three dozen dead when two suicide car bomb blasts go off in different areas."], ["2016.05.01", "Nigeria", "Fadan Karshi", 2, 0, "A man and his nephew are shot in the head in their own home by Fulani terrorists."], ["2016.05.01", "Somalia", "Runirgood", 22, 10, "Twenty-two defenders of a small town are killed during an al-Shabaab attack that began with a suicide bomber."], ["2016.05.01", "Syria", "Raqqa", 4, 0, "Four teenagers are beheaded by the Islamic State."], ["2016.05.01", "Turkey", "Gaziantep", 2, 23, "An ISIS suicide car bombers detonates at a police station, killing two officers."], ["2016.05.01", "Yemen", "Aden", 5, 0, "Five people are taken down by a Fedayeen suicide car bomber."], ["2016.05.02", "Iraq", "Baghdad", 3, 0, "Three more Shiite pilgrims are taken out by Sunni bombers."], ["2016.05.02", "Iraq", "Baghdad", 18, 45, "Eighteen Shiite pilgrims are reduced to pulp by a Sunni car bomb."], ["2016.05.02", "Iraq", "Mosul", 4, 0, "Four young Yazidi women are dragged to the public square and shot in the head for trying to escape sex slavery."], ["2016.05.02", "Pakistan", "Thakal Bala", 0, 18, "Terrorists toss a hand grenade into a rival mosque."], ["2016.05.02", "Syria", "Aleppo", 3, 17, "Sunni Radicals fire a rocket at a hospital, killing three women."], ["2016.05.02", "Thailand", "Tak Bai", 1, 0, "Muslim bombers kill the member of a local security patrol."], ["2016.05.03", "Bangladesh", "Chuadanga", 0, 2, "Islamists toss a bomb into the home of a Christian family."], ["2016.05.03", "Cameroon", "Mora", 1, 0, "A 14-year-old girl is killed when a suicide bomber goes off next to her."], ["2016.05.03", "DRC", "Beni", 34, 0, "ADF Islamists hack and slash thirty-four Christian villagers to death in their own homes, including eight women and four children."], ["2016.05.03", "Iraq", "Tal Afar", 5, 0, "Five women are executed by the Islamic State."], ["2016.05.03", "Iraq", "Yusufiya", 2, 8, "Two people lose their lives when Mujahid bombers target a vegetable market."], ["2016.05.03", "Syria", "Aleppo", 9, 45, "al-Nusra fire 60 mortars into a Christian residential area, killing nine innocents."], ["2016.05.04", "Iraq", "Hawija", 4, 2, "ISIS bombers pick off four civilians trying to flee the caliphate."], ["2016.05.04", "Iraq", "Mosqul", 5, 0, "Five girls are pulled from their homes and executed after their families could not pay a special tax to the caliph."], ["2016.05.04", "Nigeria", "Zamfara", 10, 0, "Muslim terrorists slaughter ten villagers in their homes."], ["2016.05.04", "Syria", "Aleppo", 3, 1, "al-Nusra militants take out three family members with a rocket attack on their home."], ["2016.05.04", "Syria", "Khween", 15, 0, "Four children are among fifteen civilians murdered by Jabhat al-Nusra."], ["2016.05.05", "Afghanistan", "Qadis", 5, 5, "Fundamentalists take out five civilians with a remote-controlled bomb."], ["2016.05.05", "Iraq", "Haswa", 5, 14, "Five mourners are killed by a bomb planted at a graveyard."], ["2016.05.05", "Libya", "Zamzam", 5, 6, "Five people at are laid out by a Shahid suicide bomber."], ["2016.05.05", "Syria", "Homs", 12, 49, "A dozen people are modularized by a pair of Fedayeen suicide bombers, including four children and three women."], ["2016.05.05", "Syria", "Raqqa", 1, 0, "A 7-year-old boy is executed in the public square by a Sharia court for 'insulting divinity'."], ["2016.05.05", "Turkey", "Kilis", 1, 8, "A 5-year-old girl bleeds to death following an ISIS rocket attack on her neighborhood."], ["2016.05.06", "Afghanistan", "Zabul", 4, 1, "Four small children from the same family are vaporized by Taliban bombers."], ["2016.05.06", "Bangladesh", "Satkhira", 1, 0, "The caretaker for a Hindu temple is stabbed to death by a Muslim gang."], ["2016.05.06", "DRC", "Biane", 4, 0, "Four people are hacked to death by ADF Islamists."], ["2016.05.06", "DRC", "Ituri", 13, 0, "Thirteen innocents are hacked to death by the Muslim Defense International."], ["2016.05.06", "India", "Kupwara", 1, 0, "Islamic terrorists murder a border guard."], ["2016.05.06", "Iraq", "Abu Ghraib", 3, 13, "Mujahideen bombers dismantle three innocentshttp://news.xinhuanet.com/english/2016-05/08/c_135343118.htm."], ["2016.05.06", "Pakistan", "Di Khan", 2, 0, "Two Shiite lawyers are gunned down in a targeted attack."], ["2016.05.06", "Pakistan", "Miryali", 2, 0, "Two Shiite school teachers are shot dead in a targeted attack."], ["2016.05.06", "Syria", "Deir Ezzor", 5, 0, "Five civilians are executed by the caliphate for apostasy."], ["2016.05.06", "Yemen", "Marib", 7, 15, "Seven patrons are left dead after suspected fundamentalists bomb a market selling qat."], ["2016.05.07", "Afghanistan", "Jani Khel", 2, 0, "Two local cops are kidnapped and murdered by religious extremists."], ["2016.05.07", "Afghanistan", "Kandahar", 2, 0, "Two NATO peacekeepers are shot in the back by Taliban in uniform."], ["2016.05.07", "Afghanistan", "Khanqa", 1, 0, "An accused adulteress is forced to kneel, then shot in the head by Sharia enthusiasts."], ["2016.05.07", "Bangladesh", "Rajshahi", 1, 0, "A Sufi leader is hacked to death by Islamists."], ["2016.05.07", "Iraq", "Abu Ghraib", 3, 5, "A suicide bomber blows up himself and three others."], ["2016.05.07", "Iraq", "Madain", 2, 11, "Jihadis set off a bomb at a football stadium, killing two spectators."], ["2016.05.07", "Iraq", "Nasir", 21, 0, "Six women and four children are among twenty-one civilians blown to bits by ISIS bombers."], ["2016.05.07", "Libya", "Benghazi", 5, 11, "Five protesters are killed when suspected Islamists send shells into their demonstration."], ["2016.05.07", "Nigeria", "Coromo", 12, 18, "Two women and three children are among a dozen villagers butchered by Fulani mercenaries."], ["2016.05.07", "Pakistan", "Karachi", 1, 2, "A Sufi religious minority is hacked to death by mainstream Islamists."], ["2016.05.07", "Pakistan", "Karachi", 2, 1, "Two prominent Shiites, including a liberal rights activist, are shot to death by sectarian Jihadis."], ["2016.05.07", "Pakistan", "Saddar", 1, 1, "A conservative family shoots two sisters for helping another elope."], ["2016.05.07", "Syria", "Manbij", 1, 0, "Devout Muslims toss a gay man from a roof top."], ["2016.05.08", "Egypt", "Helwan", 8, 0, "Eight local cops are machine-gunned point-blank while sitting in a bus."], ["2016.05.08", "Iraq", "Baghdad", 6, 11, "A suicide bomber detonates at a funeral, taking six mourners with him."], ["2016.05.08", "Iraq", "Jeraishi", 5, 8, "A Shahid suicide bomber extinguishes five other lives."], ["2016.05.08", "Iraq", "Mosul", 8, 0, "Eight civilians are publicly executed by a Sharia court."], ["2016.05.08", "Pakistan", "Gujaranwala", 1, 0, "A 14-year-old Christian is hanged, allegedly for his faith."], ["2016.05.08", "Saudi Arabia", "Taif", 1, 0, "Terrorists open fire on a police station, killing an officer."], ["2016.05.08", "Syria", "Aleppo", 4, 10, "Two women and two children are killed when Sunni extremists shell their neighborhood."], ["2016.05.08", "Thailand", "Thanto", 1, 0, "A rubber tapper is gunned down by Muslim militants while on his way home."], ["2016.05.08", "Uganda", "Mbaale", 1, 0, "A young woman is strangled by her husband for leaving Islam for Christianity."], ["2016.05.09", "Chechnya", "Grozny", 1, 4, "A local cop is killed by a suicide bomber."], ["2016.05.09", "Iraq", "Baqubah", 16, 54, "An Islamic State suicide car bomb liberates sixteen souls outside a bakery, including children."], ["2016.05.09", "Iraq", "Mosul", 11, 0, "Eleven \"enemies of Allah\" are executed by a Sharia court and thrown into a ditch."], ["2016.05.09", "Pakistan", "Lodhran", 1, 0, "A journalist is murdered by a Muslim family for helping one of their own marry by choice - contrary to Sharia."], ["2016.05.09", "Pakistan", "Shrengal", 4, 0, "Suspected Islamist open fire on a car, killing four, including a woman."], ["2016.05.09", "Philippines", "Tubigan", 1, 1, "Islamic terrorists target and kill a 'Christian' soldier."], ["2016.05.09", "Somalia", "Mogadishu", 4, 9, "Fedayeen suicide bombers murder four outside a police station."], ["2016.05.10", "Afghanistan", "Lashkar Gah", 15, 0, "Armed fundamentalists overrun two checkpoints and massacre fifteen policemen."], ["2016.05.10", "Afghanistan", "Nazyan", 11, 22, "Four children are among eleven blown to bits when a suicide bomber detonates outside a home."], ["2016.05.10", "Germany", "Grafing", 1, 3, "A man shouting praises to Allah stabs four commuters at a train station."], ["2016.05.10", "Iraq", "Baqubah", 3, 0, "Three truck drivers are stopped and summarily executed by caliphate advocates."], ["2016.05.10", "Iraq", "Mahmoudiya", 2, 9, "Two civilians are sectionalized by a Jihadi bomb blast at a market."], ["2016.05.10", "Iraq", "Qayyarah", 45, 0, "Forty-five people are buried alive by the caliphate."], ["2016.05.10", "Iraq", "Riyadh", 5, 0, "Three children are among a family of five burned alive for trying to escape the caliphate."], ["2016.05.10", "Israel", "Jerusalem", 0, 2, "Two elderly women are stabbed by a Palestinian terrorist."], ["2016.05.10", "Nigeria", "Biu", 3, 0, "Boko Haram set fire to two villages, killing three residents."], ["2016.05.10", "Pakistan", "Quetta", 2, 5, "Taliban bombers murder two guards outside a university."], ["2016.05.11", "Iraq", "Jamea", 13, 31, "Over a dozen Iraqis are eliminated by a Shahid suicide bomber."], ["2016.05.11", "Iraq", "Kadhimiya", 17, 43, "A Fedayeen suicide bomber detonates near a Shiite shrine, killing seventeen innocents."], ["2016.05.11", "Iraq", "Sadr City", 68, 165, "A suicide bomber targets a Shiite commercial district and slaughters over sixty near a beauty salon."], ["2016.05.11", "Nigeria", "Maiduguri", 4, 0, "Two bombings, one a suicide attack on a mosque, kill four people."], ["2016.05.11", "Pakistan", "Faisalbad", 3, 0, "Three young women from the same family are shot dead by a conservative relative on suspicion of 'illicit relations'."], ["2016.05.11", "Yemen", "Hadramawt", 4, 0, "An al-Qaeda suicide bomber takes out four other people."], ["2016.05.12", "Iraq", "Abu Ghraib", 3, 10, "Three others are killed by two ISIS suicide bombers."], ["2016.05.12", "Iraq", "Jarayshi", 17, 0, "Seventeen Iraqis are blown to bits by suicide truck bombers."], ["2016.05.12", "Iraq", "Nineveh", 5, 0, "ISIS forces five civilians to shoot kneeling apostates in the head."], ["2016.05.12", "Kenya", "Shamu", 1, 2, "A man is machine-gunned in his own living room by al-Shabaab."], ["2016.05.12", "Mali", "Gao", 2, 0, "Two local soldiers are killed by a Jihadist landmine and ambush."], ["2016.05.12", "Nigeria", "Maiduguri", 8, 19, "A Fedayeen suicide bombing claims eight innocents."], ["2016.05.12", "Yemen", "Mukalla", 13, 15, "An ISIS suicide attack leaves thirteen dead."], ["2016.05.13", "Iraq", "Balad", 4, 0, "Four guards at a vegetable market are turned to paste by a Fedayeen suicide bomber."], ["2016.05.13", "Iraq", "Balad", 16, 20, "Sixteen people at a café are machine-gunned by three Islamists for being soccer fans."], ["2016.05.13", "Iraq", "Mosul", 11, 0, "Eleven civilians are executed by an ISIS firing squad for using cell phones."], ["2016.05.13", "Nigeria", "Tarfi", 60, 11, "Muslim terrorists raid a village and massacre sixty residents."], ["2016.05.13", "Syria", "Aleppo", 7, 0, "Two children are among seven civilians pulled into pieces by Sunni shrapnel."], ["2016.05.13", "Syria", "al-Zara", 19, 0, "Nineteen religious minorities, including six women are butchered in their homes by al-Nusra."], ["2016.05.14", "Afghanistan", "Nad Ali", 3, 9, "Three people are laid out by a Shahid suicide car bomber."], ["2016.05.14", "Bangladesh", "Bandarban", 1, 0, "An elderly Buddhist monk is hacked to death by Religion of Peace activists."], ["2016.05.14", "Dagestan", "Derbent", 2, 15, "Islamic State operatives open fire on police, killing two."], ["2016.05.14", "Iraq", "Amiriyat Fallujah", 6, 18, "A wave of suicide bombers manage to take down only a half-dozen others."], ["2016.05.14", "Nigeria", "Ajaji", 1, 2, "Muslim 'nomads' attack three women, beheading one and leaving the others with deep machete wounds."], ["2016.05.14", "Pakistan", "Gomal", 1, 0, "A member of a peace committee is gunned down by religious extremists."], ["2016.05.14", "Somalia", "Aden Yabal", 4, 0, "Four tribal elders are executed by Islamic hardliners."], ["2016.05.14", "Syria", "Deir Ezzor", 20, 0, "ISIS members assault a hospital, killing twenty inside."], ["2016.05.14", "Syria", "Qamishli", 6, 15, "Terrorists kill six civilians with a car bomb."], ["2016.05.14", "Syria", "Raqqa", 1, 0, "A man is crucified in line with 'Quranic punishment'."], ["2016.05.14", "Thailand", "Sai Buri", 1, 0, "Muslim terrorists are thought responsible for slaying a 55-year-old man on his way home."], ["2016.05.15", "Egypt", "al-Arish", 1, 1, "Fundamentalists assassinate a young police recruit."], ["2016.05.15", "Iraq", "Baghdad", 8, 28, "Suicide bombers murder eight Iraqis."], ["2016.05.15", "Iraq", "Latifiya", 7, 18, "ISIS bombers target a shopping area, killing seven bystanders."], ["2016.05.15", "Iraq", "Taji", 14, 21, "A suicide bomb attack on a cooking gas factory leaves fourteen others dead."], ["2016.05.15", "Syria", "Aleppo", 2, 0, "Two locals are brutally murdered by teenage French ISIS."], ["2016.05.15", "Syria", "Deir Ezzor", 10, 0, "At least ten others are killed when ISIS militants attack and desecrate a non-Muslim cemetery."], ["2016.05.15", "Yemen", "Hadramawt", 6, 1, "Six police officers are disassembled by an ISIS bomber."], ["2016.05.15", "Yemen", "Mukalla", 41, 60, "Forty-one police recruits are obliterated by a Shahid suicide bomber."], ["2016.05.16", "Afghanistan", "Abkhor", 4, 0, "Four guards at a road construction site are blown to bits by Taliban fundamentalists."], ["2016.05.16", "Afghanistan", "Helmand", 3, 0, "Three less radical Muslims are shot in the head by ISIS."], ["2016.05.16", "Afghanistan", "Khoshamand", 7, 4, "Seven local cops are machine-gunned in their cars by the Taliban."], ["2016.05.16", "Chechnya", "Grozny", 0, 6, "An ISIS suicide bomber detonates after disguising himself as a goat herder."], ["2016.05.16", "Dagestan", "Suleiman-Stal", 1, 0, "An accountant is gunned down by suspected Islamists."], ["2016.05.16", "India", "Batapora", 1, 0, "Religious radicals kidnap and execute a carpenter."], ["2016.05.16", "Iraq", "Baghdad", 4, 17, "Two Mujahideen bomb blasts leave four dead."], ["2016.05.16", "Iraq", "Bezaas Kanaan", 1, 0, "A farmer is shot to death at his orchard by Sunni extremists."], ["2016.05.16", "Iraq", "Khalidiya", 5, 15, "The Islamic State sends a rocket into a small town, taking out five residents."], ["2016.05.16", "Iraq", "Tahrir", 21, 0, "A 'moral accountability' squad stones a woman and twenty 'youth' over illicit relations."], ["2016.05.16", "Libya", "Buairat el-Hassun", 32, 50, "Thirty-two locals are taken down by ISIS suicide bombers."], ["2016.05.16", "Somalia", "Mogadishu", 2, 3, "Two others are blown to bits by a suicide car bomber."], ["2016.05.16", "Syria", "Manbij", 1, 0, "A young man is crucified by the Islamic State."], ["2016.05.17", "Iraq", "Daquq", 1, 0, "An ISIS bomb takes out an Australian charity worker trying to protect children."], ["2016.05.17", "Iraq", "Habibia", 9, 0, "At least nine patrons are killed when a suicide bomber wades into a packed restaurant and detonates."], ["2016.05.17", "Iraq", "Rashid", 8, 22, "Eight Iraqis are reduced to pulp by an ISIS car bombing."], ["2016.05.17", "Iraq", "Sadr City", 30, 57, "Thirty people at a market are exterminated by a Fedayeen suicide bomber."], ["2016.05.17", "Iraq", "al-Shaab", 41, 75, "A female suicide bomber murders over forty people who gathered to help victims of an earlier blast."], ["2016.05.17", "Libya", "Abugrein", 4, 5, "ISIS shrapnel claims four lives."], ["2016.05.17", "Syria", "Aleppo", 1, 6, "A woman bleeds to death following a Sunni rocket blast."], ["2016.05.17", "Syria", "Ghouta", 4, 12, "Four civilian bystanders are killed during a clash between rival Islamist groups."], ["2016.05.18", "Iraq", "Latifiya", 9, 9, "The Islamic State kills nine with a booby-trapped home."], ["2016.05.18", "Iraq", "Mosul", 25, 0, "The caliphate tortures and executes twenty-five people with nitric acid."], ["2016.05.18", "Libya", "Sirte", 24, 0, "A rights group reports that two dozen people are pulled from their homes by ISIS and 'unlawfully' executed."], ["2016.05.18", "Mali", "Kidal", 5, 3, "Five UN peacekeepers are murdered by religious extremists."], ["2016.05.18", "Pakistan", "Peshawar", 1, 15, "Islamic militants kill a local cop with a bomb."], ["2016.05.18", "Syria", "Genderes", 1, 1, "A civilian is killed when ISIS members send rockets into a neighborhood."], ["2016.05.19", "Afghanistan", "Baghlan Jadid", 11, 0, "Five children and two women are among a family of eleven exterminated by Taliban bombers."], ["2016.05.19", "Afghanistan", "Qalat", 8, 0, "A Taliban in uniform shoots eight unarmed soldiers."], ["2016.05.19", "Germany", "Baden-Württemberg", 1, 0, "A 70-year-old woman is murdered in her home by a young Muslim who leaves a 'religious' note at the scene."], ["2016.05.19", "Iraq", "Taji", 3, 10, "Mujahideen bomb an industrial district, killing three passersby."], ["2016.05.19", "Syria", "Tabqa", 3, 0, "Three citizens of the Islamic State are executed for apostasy."], ["2016.05.20", "Afghanistan", "Kabul", 1, 1, "A UN security guard is gunned down by suspected Taliban."], ["2016.05.20", "Bangladesh", "Kushtia", 1, 1, "A 55-year-old homoeopathic doctor is hacked to death by Religion of Peace activists."], ["2016.05.20", "England", "London", 0, 4, "A Turkish man yelling about Lee Rigby stabs four women in a parking lot on the third anniversary."], ["2016.05.20", "Iran", "Urmia", 5, 0, "Five Kurdish rights activists are publicly hanged for 'conspiring against Islam'."], ["2016.05.20", "Iraq", "Husseiniya", 2, 6, "A Jihadi bomb blast near a row of shops leaves two dead."], ["2016.05.20", "Iraq", "Mosul", 3, 0, "Three civilians are captured and beheaded by the Islamic State."], ["2016.05.20", "Niger", "Yebi", 8, 7, "Boko Haram set a village on fire and shoot into it, killing at least eight."], ["2016.05.20", "Syria", "Idlib", 1, 0, "A woman is vaporized by an ISIS tank shell."], ["2016.05.20", "Syria", "Sheikh Maqsoud", 1, 5, "A young girl is killed when terrorists bomb her neighborhood."], ["2016.05.20", "Tanzania", "Mwanza", 3, 1, "Islamic extremists hack three people at a rival mosque to death with machetes."], ["2016.05.20", "Yemen", "Wilayet", 3, 0, "Fundamentalists gruesomely execute three men - one by crushing his head with a rock."], ["2016.05.21", "Afghanistan", "Charchino", 6, 0, "A Taliban insider shoots six local cops in the back."], ["2016.05.21", "Egypt", "Sheikh Zuweid", 3, 0, "Three local cops are laid out by a fundamentalist bomb blast."], ["2016.05.21", "Iraq", "Dujail", 7, 28, "A Shahid suicide bomber massacres seven patrons at a popular market."], ["2016.05.21", "Iraq", "Tarmiya", 2, 7, "Two people are blown to bits by a Mujahideen bomb blast at a market."], ["2016.05.22", "Afghanistan", "Herat", 1, 7, "A Taliban rocket claims the life of a civilian."], ["2016.05.22", "Iraq", "Mosul", 19, 0, "Nineteen young women and men are executed by the Islamic State on charges of apostasy."], ["2016.05.22", "Iraq", "Rataba", 8, 0, "Eight people are burned alive in ovens by the caliphate."], ["2016.05.22", "Iraq", "Suleiman Beg", 2, 11, "Two Shiites are taken out by an ISIS suicide bomber."], ["2016.05.22", "Sudan", "Arzini", 8, 5, "Children are among the victims when Arabs fire into a group of Africans at a mosque."], ["2016.05.22", "Syria", "Qamishli", 6, 15, "Six Assyrians are laid out by Allah-praising suicide bombers targeting a Christian restaurant."], ["2016.05.22", "Syria", "Tal Tamr", 5, 0, "Two suicide bombers take out five Kurds."], ["2016.05.23", "Afghanistan", "Shah Wali Kot", 5, 4, "Five civilians are killed and four others badly wounded by a Taliban bomb blast."], ["2016.05.23", "India", "Tengpora", 1, 0, "A police officer is shot to death by Muslim terrorists."], ["2016.05.23", "India", "Zadibal", 2, 2, "Islamic militants gun down two cops at close range."], ["2016.05.23", "Pakistan", "Bara Bandai", 2, 0, "A peace committee member and his guard are assassinated by Islamist gunmen."], ["2016.05.23", "Syria", "Jableh", 180, 300, "Children are among one-hundred and eighty innocents incinerated or blown apart by ISIS suicide blasts."], ["2016.05.23", "Syria", "Mayadin", 1, 0, "A teenager is publicly stoned to death on charges of being gay."], ["2016.05.23", "Yemen", "Aden", 45, 60, "At least forty young people lining up for work are blown to bits by two Fedayeen suicide bombers."], ["2016.05.23", "Yemen", "Jazan", 1, 3, "A Shiite landmine kills a Saudi border guard."], ["2016.05.24", "Iraq", "Mosul", 12, 0, "Twelve civilians are hauled from their homes and executed by the Islamic State."], ["2016.05.24", "Iraq", "Zafaraniya", 2, 6, "Jihadis bomb a popular restaurant, killing two people."], ["2016.05.24", "Yemen", "Sanaa", 2, 2, "Sunni extremists are suspected of a university bombing that leaves two dead."], ["2016.05.25", "Afghanistan", "Kabul", 11, 10, "Eleven lives are snuffed out by a suicide bomber on foot targeting a bus carrying court employees."], ["2016.05.25", "Bangladesh", "Gobindaganj", 1, 0, "A physically disabled Hindu trader's throat is cut by radicalized Muslims."], ["2016.05.25", "India", "Kupwara", 1, 0, "A porter is shot to death by Islamic terrorists."], ["2016.05.25", "India", "Pulwama", 1, 1, "Muslim terrorists shoot a cop to death and injure a woman."], ["2016.05.25", "Iraq", "Suleiman Bag", 2, 6, "At least two others are killed by a Shahid suicide bomber."], ["2016.05.25", "Pakistan", "Karachi", 1, 1, "Religious extremists gun down an Ahmadi religious minority and injure his friend."], ["2016.05.25", "Pakistan", "Patang Chowk", 2, 1, "Islamists fire on a police vehicle, killing two occupants."], ["2016.05.25", "Pakistan", "Peshawar", 1, 0, "A transgender is shot by 'conservative elements.'"], ["2016.05.25", "Syria", "Aleppo", 7, 5, "Three women and two children are among seven innocents torn to shreds by Sunni rockets."], ["2016.05.25", "Turkey", "Hah, Tur Abdin", 5, 0, "At least five people are killed when a suicide bomber targets a checkpoint outside two historic churches."], ["2016.05.26", "Iraq", "Baghdad", 3, 10, "Three shoppers in a retail district are sent to Allah by Mujahid bombers."], ["2016.05.26", "Iraq", "Mishada", 4, 16, "Jihadis strike a commercial area with two bomb blasts, laying out four bystanders."], ["2016.05.26", "Iraq", "Tarmiya", 5, 3, "Five people are killed when ISIS booby-traps a house."], ["2016.05.26", "Pakistan", "Karachi", 2, 0, "Two Shiites are gunned down by sectarian Jihadis."], ["2016.05.26", "Syria", "Aleppo", 1, 0, "Sunni snipers pick off a civilian in a Shiite area."], ["2016.05.27", "France", "Saint Julien du Puy", 0, 1, "An off-duty soldier is stabbed by ISIS supporters while jogging."], ["2016.05.27", "Mali", "Bamako", 5, 4, "Five UN peacekeepers are killed from a Jihadi landmine and small arms attack."], ["2016.05.27", "Syria", "Aleppo", 1, 9, "Holy Warriors fire ten rockets into a neighborhood, managing to take down an elderly woman."], ["2016.05.28", "Iraq", "Baghdad", 12, 8, "Islamists machine-gun a dozen fan watching soccer on television."], ["2016.05.28", "Iraq", "Fallujah", 2, 20, "ISIS shrapnel dismantles two women."], ["2016.05.28", "Philippines", "Sulu", 2, 3, "Abu Sayyaf gunmen kill two people during an attempt to kidnap a female physician."], ["2016.05.28", "Syria", "Ain al-Dananeer", 1, 3, "A woman is obliterated by an al-Nusra rocket."], ["2016.05.28", "Syria", "Raqqa", 4, 0, "Four young men are beheaded by the Islamic State."], ["2016.05.28", "Syria", "Shaddadi", 4, 18, "Three Shahid suicide bombers take out four Kurds."], ["2016.05.29", "Afghanistan", "Nadi Ali", 4, 10, "Four local security personnel lose their lives to a Taliban assault."], ["2016.05.29", "Egypt", "Sinai", 2, 3, "Fundamentalists kill two local cops with a roadside bomb."], ["2016.05.29", "Iraq", "Kahriz", 2, 21, "A chlorine gas attack by ISIS on a small village produces two dead children."], ["2016.05.29", "Iraq", "Karmardi", 11, 0, "A Shahid with a suicide belt sends eleven souls to Allah."], ["2016.05.29", "Iraq", "Mualimeen", 7, 35, "Seven people are slaughtered at a casino by a Fedayeen suicide bomber."], ["2016.05.29", "Iraq", "Wilayat al-Jazihra", 3, 0, "The caliphate imposes the 'rule of Allah' on three captives by executing them."], ["2016.05.29", "Mali", "Savare", 5, 1, "Jihadis ambush and murder five UN peacekeepers."], ["2016.05.29", "Niger", "Pandogari", 4, 0, "A Muslim mob burns churches and kill four people based on a 'blasphemous' post on Facebook."], ["2016.05.29", "Nigeria", "Biu", 5, 0, "A woman and her baby are among five people slain by Boko Haram bombers."], ["2016.05.30", "Afghanistan", "Helmand", 47, 40, "A massive two-day assault by the Taliban leaves nearly fifty police and citizens dead."], ["2016.05.30", "Iraq", "Sadr City", 3, 10, "Sunnis take down three Shiites with a motorcycle bomb at a market."], ["2016.05.30", "Iraq", "Shaab", 11, 14, "Eleven Iraqis are sent to Allah by a Fedayeen suicide car bomber."], ["2016.05.30", "Iraq", "Tarmiya", 10, 24, "A Shahid suicide bomber strikes a popular market, killing ten patrons."], ["2016.05.30", "Kenya", "Bongwe", 3, 0, "Three village elders are shot to death in their homes by al-Shabaab."], ["2016.05.30", "Pakistan", "Mardan", 0, 12, "Children are among the casualties of a suicide bomber."], ["2016.05.30", "Syria", "Aleppo", 5, 21, "Five civilians are pulled into pieces by Sunni rockets."], ["2016.05.30", "Syria", "Palmyra", 150, 0, "A mass grave is discovered containing the remains of one-hundred and fifty victims of ISIS torture and execution."], ["2016.05.30", "Tanzania", "Tanga", 8, 0, "Eight people are hacked to death in their beds by suspected Islamists."], ["2016.05.30", "Tunisia", "Samama Mountain", 2, 0, "Two women collecting herbs are vaporized by an Islamist landmine."], ["2016.05.31", "Afghanistan", "Kunduz", 17, 30, "The Taliban stop four civilian buses and summarily execute seventeen passengers."], ["2016.05.31", "Egypt", "Qabr Omeir", 6, 6, "Six young police recruits are murdered by an Islamic State linked group."], ["2016.05.31", "Iraq", "Suleiman Bek", 4, 13, "A Holy warrior with a suicide vest obliterates four souls along a city street."], ["2016.05.31", "Mali", "Gao", 4, 3, "al-Qaeda members murder four UN mission staff."], ["2016.05.31", "Nigeria", "Ninte", 3, 0, "Muslim terrorists burn churches and a pastors home, and hack three villagers to death as they slept."], ["2016.05.31", "Somalia", "Galgala Hills", 2, 0, "Two Somalis lose their lives to an al-Shabaab bomb blast."], ["2016.05.31", "Thailand", "Narathiwat", 2, 0, "Five Muslim 'separatists' ambush and kill two local security personnel."], ["2016.06.01", "Afghanistan", "Balkh", 1, 3, "A local police chief is assassinated by Taliban bombers."], ["2016.06.01", "Afghanistan", "Ghazni", 6, 13, "Fundamentalists storm a court building in a suicide attack that leaves five civilians and one police officer dead."], ["2016.06.01", "Iraq", "Abu Ghraib", 2, 4, "Two Iraqis are eliminated by Mujahid bombers."], ["2016.06.01", "Iraq", "Madain", 2, 9, "Jihadis set off a bomb near a sports arena, taking out two bystanders."], ["2016.06.01", "Iraq", "Mosul", 6, 0, "Six men are executed by the caliphate for selling cigarettes."], ["2016.06.01", "Iraq", "Nineveh", 13, 0, "Thirteen people are executed for refusing to join the Islamic State."], ["2016.06.01", "Iraq", "Tal Afar", 3, 0, "Three young men are forced to their knees and then shot in the back of the head by the Islamic State."], ["2016.06.01", "Libya", "Sirte", 10, 40, "Ten Libyans are taken out by two ISIS suicide bombers."], ["2016.06.01", "Somalia", "Mogadishu", 16, 55, "Islamists stage a suicide assault on a hotel, killing at least sixteen guests."], ["2016.06.01", "Sudan", "Singi", 1, 0, "A Janjaweed-linked militia guns down a rival imam."], ["2016.06.02", "Afghanistan", "Kunduz", 2, 0, "Two civilians, taken hostage after being pulled from a bus, are executed by the Taliban."], ["2016.06.02", "Afghanistan", "Sheikh Ali", 3, 0, "A woman is among three aid workers murdered by religious extremists."], ["2016.06.02", "Nigeria", "Kano", 1, 0, "Muslim youth behead a Christian woman for insulting Muhammad after an argument over religion."], ["2016.06.02", "Pakistan", "Faqirabad", 1, 0, "A retired man is shot to death by religious radicals."], ["2016.06.02", "Syria", "Latakia", 5, 0, "Five people are reported killed when a suicide bomber strikes a rival mosque."], ["2016.06.03", "Dagestan", "Ashaga-Stal", 1, 0, "Islamists break into a policeman's home and murder him in front of his wife and children."], ["2016.06.03", "India", "Bejbehara", 3, 5, "Islamic terrorists ambush and kill three members of a local security convoy."], ["2016.06.03", "Iraq", "Abu Dsher", 3, 7, "Three Iraqis are reduced to pulp by Mujahid shrapnel."], ["2016.06.03", "Iraq", "Fallujah", 2, 3, "A suicide bomber targets a family fleeing the caliphate, killing two members."], ["2016.06.03", "Iraq", "Khalis", 2, 2, "A probable premature detonation in a taxi cab leaves two dead."], ["2016.06.03", "Iraq", "Mosul", 19, 0, "Nineteen Yazidi girls are put in cages and burned alive for refusing sex with caliphate members."], ["2016.06.03", "Niger", "Bosso", 32, 67, "Thirty-two defenders are slain during a massive Boko Haram assault on a small town."], ["2016.06.03", "Nigeria", "Waga", 2, 3, "Boko Haram kill two villagers and abduct three women."], ["2016.06.03", "Yemen", "Taiz", 17, 30, "Ten women and a girl are among seventeen shredded by Shiite shrapnel at a market."], ["2016.06.04", "India", "Anantnag", 2, 0, "Two cops are gunned down by Muslim terrorists."], ["2016.06.04", "Iraq", "Baghdad", 7, 25, "Terrorists kill seven Iraqis in two separate attacks on a restaurant and market."], ["2016.06.04", "Iraq", "Fallujah", 34, 15, "Thirty-four Iraqis are killed by two Islamic State suicide bombers."], ["2016.06.04", "Iraq", "Fallujah", 400, 0, "A mass grave is discovered containing at least four hundred victims of ISIS executions."], ["2016.06.04", "Iraq", "Tarmiyah", 8, 15, "A Shahid suicide bomber eliminates eight people waiting at a checkpoint."], ["2016.06.04", "Niger", "Bosso", 1, 0, "A convert to Christianity is singled out and executed by Muslim radicals."], ["2016.06.04", "Syria", "Aleppo", 7, 33, "Seven civilians are killed when Sunni terrorists fire rockets into their section of a city."], ["2016.06.04", "Syria", "Hamadaniyey", 5, 47, "A well-placed Sunni shell takes out five residents in their own neighborhood."], ["2016.06.05", "Afghanistan", "Kabul", 1, 0, "An NPR journalist and his translator are picked off by Taliban snipers."], ["2016.06.05", "Afghanistan", "Kabul", 3, 3, "Fundamentalists set off a bomb outside a house that leaves three dead."], ["2016.06.05", "Afghanistan", "Puli Alim", 7, 23, "Islamic hardliners with suicide vests storm a courthouse and murder seven workers."], ["2016.06.05", "Bangladesh", "Chittagong", 1, 0, "A woman is murdered in her home by religious radicals."], ["2016.06.05", "Bangladesh", "Natore", 1, 0, "A Christian man is hacked to death at his shop by Islamists."], ["2016.06.05", "Iraq", "Abu Ghraib", 3, 7, "A Jihadi bomb blast ends the lives of three people at a market."], ["2016.06.05", "Iraq", "al-Mahouz", 3, 0, "Three civilians are beheaded by the Islamic State."], ["2016.06.05", "Kazakhstan", "Aktobe", 6, 3, "Islamic radicals murder six people in two separate attacks."], ["2016.06.05", "Pakistan", "Attock", 1, 0, "A 65-year-old Ahmadi religious minority is gunned down."], ["2016.06.05", "Pakistan", "Sachal Goth", 3, 0, "Two Hindus are among three slain at a liquor shop by members of a banned terror group."], ["2016.06.05", "Philippines", "Sumisip", 2, 0, "Two off-duty soldiers are machine-gunned point-blank by two Abu Sayaaf gunmen."], ["2016.06.05", "Somalia", "Mogadishu", 1, 0, "A female journalist is assassinated by al-Shabaab outside a college campus."], ["2016.06.05", "Syria", "Aleppo", 2, 27, "Two people are killed when Islamists target a church with rockets."], ["2016.06.06", "Afghanistan", "Sari Pul", 7, 0, "A child is among seven gunned down by Taliban fundamentalists."], ["2016.06.06", "Cameroon", "Darak", 10, 0, "Ten fishermen are cut down by Boko Haram."], ["2016.06.06", "Egypt", "Sadwet", 1, 0, "A young policeman is shot to death in the name of Allah."], ["2016.06.06", "Iraq", "Baghdad", 2, 11, "Jihadis bomb a local market, killing two patrons."], ["2016.06.06", "Iraq", "Fallujah", 4, 0, "Four civilians are tortured to death by a Shiite militia."], ["2016.06.06", "Iraq", "Mosul", 11, 0, "Eleven people are executed in front of their families for trying to flee the caliphate."], ["2016.06.06", "Iraq", "Mosul", 65, 0, "Sixty-five civilians, including university students, are rounded up and executed by caliphate staff."], ["2016.06.06", "Jordan", "Amman", 5, 0, "At least five employees are killed in their office by Islamic militants."], ["2016.06.06", "Nigeria", "Adamawa", 4, 0, "Four farmers are murdered by Boko Haram."], ["2016.06.06", "Thailand", "Narathiwat", 3, 2, "Two villagers are shot point blank by Muslim terrorists."], ["2016.06.06", "Yemen", "Khormaksar", 1, 0, "A civilian is killed when Muslim extremists fire on an airport."], ["2016.06.06", "Yemen", "Taiz", 8, 13, "Shiite shells kill eight family members, including three children."], ["2016.06.07", "Afghanistan", "Ghazni", 12, 50, "The Taliban stop vehicles along a highway and massacre a dozen occupants."], ["2016.06.07", "Afghanistan", "Sokhti", 11, 12, "Eleven local security personnel are killed during a Taliban attack."], ["2016.06.07", "Bangladesh", "Jhenaidah", 1, 0, "A 69-year-old Hindu priest is hacked to death by Islamic radicals."], ["2016.06.07", "Iraq", "Haditha", 2, 0, "Two female factory workers are disassembled by a Fedayeen suicide bomber."], ["2016.06.07", "Iraq", "Karbala", 7, 20, "A Sunni suicide bomber produces seven dead Shiites at a commercial area."], ["2016.06.07", "Iraq", "Khazar", 5, 0, "Five displaced persons are further removed by ISIS bombers."], ["2016.06.08", "Iraq", "Hanbas", 3, 3, "An ISIS bomb blast lays out three Shiites."], ["2016.06.08", "Israel", "Tel Aviv", 4, 13, "Muslims disguised as Orthodox Jews fire into a food and retail market, killing four patrons as they praise Allah."], ["2016.06.08", "Libya", "Abu Grein", 25, 32, "Over two dozen defenders are killed during an ISIS assault on a small town."], ["2016.06.08", "Libya", "Buairat el-Hassun", 7, 18, "An ISIS car bomb claims seven lives."], ["2016.06.08", "Pakistan", "Lahore", 1, 0, "A 17-year-old girl is burnt alive by her conservative mother for eloping without permission."], ["2016.06.08", "Syria", "Manbij", 19, 0, "Nineteen civilians are killed by the Islamic State."], ["2016.06.09", "Iraq", "Baghdad", 19, 46, "A Sunni suicide bomber targets a commercial district in a Shiite area, killing nineteen."], ["2016.06.09", "Iraq", "Kirkuk", 1, 5, "A mother is killed by an IS IED while leading her family out of the caliphate."], ["2016.06.09", "Iraq", "Mosul", 1, 0, "A woman is stoned to death in front of a mosque for adultery."], ["2016.06.09", "Iraq", "Taji", 12, 32, "A dozen Iraqis are sent to Allah by a Shahid suicide bomber."], ["2016.06.09", "Iraq", "Wilayat Salahuddin", 1, 0, "A man is beheaded for sorcery by the caliphate."], ["2016.06.09", "Pakistan", "Changa Manga", 0, 1, "A Christian man is badly beaten by a Muslim mob for selling food deemed 'unclean' because of his religion."], ["2016.06.09", "Somalia", "Halgan", 43, 0, "Dozens of AU peacekeepers are massacred during an al-Shabaab suicide assault."], ["2016.06.09", "Syria", "Handarat", 1, 8, "A Sunni rocket claims the life of a child."], ["2016.06.09", "Syria", "Meydan", 5, 50, "At least five are killed when al-Nusra deliberately shells a civilian area."], ["2016.06.10", "Bangladesh", "Dhaka", 1, 0, "A 62-year-old Hindu monastery worker is hacked to death by Religion of Peace proponents."], ["2016.06.10", "Egypt", "Rafah", 1, 0, "A young police recruit is cut down in the prime of life by Islamic radicals."], ["2016.06.10", "Iraq", "Baghdad", 3, 11, "A Shahid suicide bomber takes out three other souls."], ["2016.06.10", "Iraq", "Fallujah", 30, 0, "Islamists spray machine-gun fire into a crowd of women and children trying to flee the caliphate, killing at least thirty."], ["2016.06.10", "Nigeria", "Mairari", 4, 0, "Islamists drag four women out of their homes and slit their throats."], ["2016.06.10", "Pakistan", "Lahore", 3, 1, "A young couple are honor killed for marrying against their family's wishes along with a friend who helped them."], ["2016.06.10", "Somalia", "Bula Fulay", 4, 0, "A pro-Sharia group beheads one man and shoot three others."], ["2016.06.10", "Syria", "Aleppo", 3, 15, "A young girl is among three civilians aerated by Sunni shrapnel."], ["2016.06.10", "Syria", "Bukamal", 1, 0, "One person is crucified for eating during Ramadan."], ["2016.06.10", "Syria", "Ghandoura", 37, 0, "ISIS members massacre at least thirty-seven villagers, including women and children."], ["2016.06.10", "Syria", "al-Zahraa", 1, 6, "A civilian is killed when terrorists send a rocket into a home."], ["2016.06.11", "Afghanistan", "Haska Mena", 6, 11, "At least six are left dead after Islamic State members fire into a police station."], ["2016.06.11", "Afghanistan", "Rodat", 4, 70, "Religious extremists plant a bomb in a rival mosque that eliminates four worshippers."], ["2016.06.11", "Iraq", "Sichr", 17, 0, "Seventeen people are allegedly massacred by a Shiite militia."], ["2016.06.11", "Iraq", "Tarmiya", 7, 0, "Three children and two women are among seven family members massacred in their home by sectarian activists."], ["2016.06.11", "Iraq", "Yathrib", 10, 0, "A grave is discovered containing ten ISIS victims."], ["2016.06.11", "Libya", "Benghazi", 7, 8, "Seven civilians lose their lives when Islamists shell their neighborhood."], ["2016.06.11", "Syria", "Manbij", 1, 3, "Islamists invade a home, kill the man and rape his wife and two daughters."], ["2016.06.11", "Syria", "Sayyida Zeinab", 20, 30, "A double suicide bombing outside a Shiite mosque leaves at least twenty dead."], ["2016.06.12", "Afghanistan", "Ghor", 1, 0, "The Taliban cut out the eyes of a day laborer and skin him alive."], ["2016.06.12", "Cameroon", "Darak", 42, 0, "The bodies of forty-two fishermen are found a few days after they were captured by Boko Haram."], ["2016.06.12", "Iraq", "Fallujah", 27, 17, "Two ISIS suicide attacks produce over two dozen dead Iraqis."], ["2016.06.12", "Iraq", "Razalani", 2, 0, "An ISIS member slaughters his own parents for refusing to hand over his brothers to the caliphate."], ["2016.06.12", "Libya", "Sirte", 1, 0, "A Fedayeen suicide bomber claims one other life."], ["2016.06.12", "Libya", "Sirte", 3, 7, "A suicide bomber detonates at a hospital, taking three others with him."], ["2016.06.12", "Syria", "Raqqa", 1, 0, "A caliphate member executes his own brother for apostasy."], ["2016.06.12", "Syria", "Sanilurfa", 0, 1, "ISIS gunmen shoot a journalist three times."], ["2016.06.12", "USA", "Orlando, FL", 49, 53, "An Islamic extremist massacres forty-nine people at a gay nightclub."], ["2016.06.13", "France", "Magnanville", 2, 1, "A terrorist stabs a couple to death while shouting praises to Allah."], ["2016.06.13", "India", "Kud", 1, 6, "Muslim militants open fire from a bus, killing a woman and injuring a child."], ["2016.06.13", "Iraq", "Fallujah", 49, 0, "Shiite radicals are accused of executing at least forty-nine civilians displaced by the violence."], ["2016.06.13", "Iraq", "Ramadi", 5, 11, "Five Iraqis are taken out by ISIS suicide bombers."], ["2016.06.13", "Libya", "Sirte", 2, 3, "Two people are killed when a suicide bomber detonates outside a government building."], ["2016.06.13", "Pakistan", "Ghor", 1, 0, "A Sharia court executes a woman on a charge of trying to escape her home."], ["2016.06.13", "Pakistan", "Ghor", 1, 0, "A woman is shot dead by her family for attempting to leaver her husband."], ["2016.06.13", "Philippines", "Samal Island", 1, 0, "A Canadian hostage is beheaded by Abu Sayyaf."], ["2016.06.14", "Belgium", "Etterbeek", 0, 1, "A transgender is stabbed by religious radicals."], ["2016.06.14", "CAR", "Ngaoundaye", 10, 0, "At least ten villagers are slaughtered by Muslim militia."], ["2016.06.14", "India", "Kupwara", 1, 5, "A group of terrorists attack a police patrol, killing one officer."], ["2016.06.14", "Iraq", "Baghdad", 2, 9, "A Mujahid bomb blast at a market produces two corpses."], ["2016.06.14", "Nigeria", "Kautuva", 4, 3, "Jihadists burn down houses, murder four villagers and kidnap three women."], ["2016.06.15", "Afghanistan", "Kohmard", 1, 0, "A local governor is assassinated by Sharia proponents."], ["2016.06.15", "Bangladesh", "Madaripur", 0, 1, "A Hindu college professor is stabbed by Muslim radicals."], ["2016.06.15", "Iraq", "Baghdad", 2, 8, "Jihadi bombers target a fruit and vegetable market, killing two patrons."], ["2016.06.15", "Iraq", "Fallujah", 4, 0, "A journalist is among four Iraqis killed by an ISIS mortar round."], ["2016.06.15", "Iraq", "Yusufiyah", 7, 0, "At least seven Iraqis are sent to Allah by a Fedayeen suicide bomber."], ["2016.06.15", "Syria", "Raqqa", 1, 0, "A 4-year-old girl is allegedly beheaded by the caliphate."], ["2016.06.16", "Egypt", "al-Arish", 2, 0, "Two off-duty cops are gunned down in their own homes by four fundamentalists."], ["2016.06.16", "India", "Kashmir", 1, 0, "Islamic terrorists murder a border guard."], ["2016.06.16", "Iraq", "Baghdad", 2, 4, "Two people at a popular market are exterminated by Mujahideen bombers."], ["2016.06.16", "Iraq", "Birahmed", 15, 0, "An ISIS attack on a cluster of towns produces fifteen dead Iraqis, including a father and son."], ["2016.06.16", "Iraq", "Fallujah", 1, 1, "An ISIS sniper picks off a 2-year-old boy in his mother's arms."], ["2016.06.16", "Iraq", "Shirqat", 19, 0, "Nineteen civilians are pulled from their homes and executed by the Islamic State."], ["2016.06.16", "Iraq", "Sinsil", 4, 0, "Four people are stoned to death for adultery."], ["2016.06.16", "Libya", "Abu Grein", 10, 7, "An ISIS suicide bomb blast claims the lives of ten others."], ["2016.06.16", "Pakistan", "Peshawar", 1, 3, "Religion of Peace roadside bombers take out a policeman."], ["2016.06.16", "Syria", "Latakia", 1, 0, "A suicide bomber hits an aid convoy, killing one member."], ["2016.06.16", "Syria", "Mayadin", 2, 0, "Two people are crucified for not fasting during Ramadan."], ["2016.06.16", "Uganda", "Luuka", 1, 0, "A Christian woman's baby is poisoned to death by a Muslim family member for being fed during Ramadan."], ["2016.06.17", "Iraq", "Haj Ali", 12, 6, "A dozen civilians at a displaced persons camp are pulled limb from limb by Jihadi bombers."], ["2016.06.17", "Iraq", "Tuz Khurmatu", 24, 7, "Two dozen people are reported killed following sustained ISIS assault that involved three suicide truck bombs."], ["2016.06.17", "Niger", "Ghafam", 7, 12, "Seven 'apostates' are killed by Boko Haram at a displaced persons camp."], ["2016.06.17", "Nigeria", "Kuda", 24, 0, "Twenty-four women are summarily shot dead at a funeral by Islamic extremists."], ["2016.06.17", "Pakistan", "Burewala", 2, 0, "A man returns from Haj and then honor kills his pregnant sister and her husband."], ["2016.06.17", "Pakistan", "Gujranwala", 1, 0, "A conservative family slits the throat of a young mother who was seven months pregnant for marrying against their wishes."], ["2016.06.17", "Pakistan", "Sohbatpur", 2, 0, "The Taliban is suspected of planted a landmine that claims the lives of two children."], ["2016.06.17", "Syria", "Manbij", 6, 0, "Two children are among six members of one family exterminated by firing squad for trying to flee the caliphate."], ["2016.06.18", "Iraq", "Qayara", 3, 0, "Three people are executed for trying to flee the caliphate."], ["2016.06.18", "Iraq", "Tuz Khurmatu", 2, 6, "A street sweeper is among two people taken out by an ISIS suicide blast."], ["2016.06.18", "Nigeria", "Wumbi", 2, 0, "Islamists set fire to a village, killing two residents."], ["2016.06.18", "Syria", "Aleppo", 7, 0, "Seven members of a Kurdish family are killed in a targeted bombing of their vehicle."], ["2016.06.18", "Syria", "Sheikh Maqsoud", 7, 40, "At least seven residents are aerated by Sunni shrapnel in their own neighborhood."], ["2016.06.19", "Afghanistan", "Tagab Yari", 6, 0, "Fundamentalists open fire on civilians eating during Ramadan, killing six."], ["2016.06.19", "Egypt", "Hasna", 1, 1, "Fundamentalists take down a local cop with an IED."], ["2016.06.19", "Iraq", "Amrli", 9, 0, "Nine Sunnis are executed by Shiite radicals."], ["2016.06.19", "Iraq", "Mahmoudiya", 2, 9, "Two people are left dead following a Mujahideen bomb blast at a popular market."], ["2016.06.19", "Nigeria", "Benue", 18, 0, "Eighteen dead villagers are discovered following a raid by Fulani terrorists."], ["2016.06.19", "Syria", "Latakia", 1, 0, "An ISIS suicide bomber kills one other person."], ["2016.06.19", "Syria", "Qamishi", 3, 5, "At least three people are killed after a suicide bomber detonates at a memorial to massacred Christians."], ["2016.06.19", "Thailand", "Tak Bai", 1, 0, "A 35-year-old woman is murdered by two Muslim militants."], ["2016.06.20", "Afghanistan", "Badakhshan", 10, 40, "Religious fanatics plant a motorcycle bomb at a crowded market that claims ten lives, including five children."], ["2016.06.20", "Afghanistan", "Kabul", 1, 5, "A politician is assassinated by Taliban bombers."], ["2016.06.20", "Afghanistan", "Kabul", 33, 5, "Thirty-three bus passengers are incinerated by a Shahid suicide bomber."], ["2016.06.20", "Egypt", "al-Arish", 1, 0, "Islamic fanatics kill a police officer in his own home."], ["2016.06.20", "Iraq", "Dibs", 1, 4, "A bomb blast targeting a family fleeing the caliphate manages to kill one member."], ["2016.06.20", "Iraq", "Taji", 4, 12, "Four Iraqis are laid out by a Fedayeen suicide bomber."], ["2016.06.20", "Iraq", "Tuz Khurmatu", 1, 0, "A Sunni is murdered at his office by Shiite radicals."], ["2016.06.20", "Kenya", "Dimu", 5, 0, "Five border guards are murdered by al-Shabaab extremists."], ["2016.06.20", "Kenya", "Owane", 1, 3, "An Islamist landmine kills an ambulance driver."], ["2016.06.20", "Nigeria", "Uzzar", 8, 0, "Eight people are slaughtered by Muslim terrorists."], ["2016.06.20", "Pakistan", "Karachi", 1, 0, "An Ahmadiyya doctor is gunned down in a targeted attack on a religious minority."], ["2016.06.20", "Sudan", "Thur", 4, 0, "Suspected Arab militia attack a displaced persons camp and shoot four refugees to death, including a child."], ["2016.06.21", "Egypt", "al-Arish", 1, 0, "Another policeman is murdered in his own home by four religious extremists."], ["2016.06.21", "Iraq", "Baghdad", 2, 3, "Two Sunnis are cut down by more-radical Sunnis."], ["2016.06.21", "Iraq", "Dor", 5, 35, "A Sunni suicide bomber takes out five Shiites."], ["2016.06.21", "Iraq", "Souib", 4, 5, "Four people at a checkpoint are torn to shreds by a Shahid suicide bomber."], ["2016.06.21", "Jordan", "Ruqban", 6, 14, "A suicide car bomber slams into a border gate, killing at least six others."], ["2016.06.21", "Libya", "Garabulli", 29, 30, "An ISIS RPG fired at a group of fleeing civilians hits an armory.  Over two dozen are incinerated in the ensuing explosion."], ["2016.06.21", "Nigeria", "Vase", 12, 0, "Six members of the same family are among a dozen butchered in cold blood by Fulani mercenaries."], ["2016.06.21", "Philippines", "Sulu", 3, 0, "Three accused apostates are beheaded by caliphate loyalists."], ["2016.06.21", "Somalia", "Jowhar", 1, 0, "An Islamist infiltrates a security detail and assassinates a government official."], ["2016.06.21", "Syria", "Manbij", 32, 0, "At least thirty people are killed by ISIS suicide bombers and executioners in a three day assault."], ["2016.06.22", "Afghanistan", "Jalalabad", 2, 2, "A Taliban bomb takes out a traffic cop and a commuter."], ["2016.06.22", "Afghanistan", "Jund", 4, 1, "An Afghan soldier gets religion and turns his gun on four colleagues."], ["2016.06.22", "Egypt", "al-Arish", 1, 1, "A police officer is shot to death by Religion of Peace proponents."], ["2016.06.22", "Pakistan", "Karachi", 1, 1, "A Sufi singer is gunned down in a targeted attack by radicals."], ["2016.06.22", "Pakistan", "Yakatoot", 1, 0, "An official is shot to death outside a mosque by suspected extremists."], ["2016.06.23", "Iraq", "Baghdad", 2, 5, "Jihadis set off a bomb near a candy factory, killing two passersby."], ["2016.06.23", "Iraq", "Naeima", 2, 1, "A man and his son are killed when their house is burnt down by caliphate members."], ["2016.06.23", "Iraq", "Tuz", 2, 3, "Islamic State cadres murder an old man and his brother."], ["2016.06.23", "Saudi Arabia", "Riyadh", 1, 2, "Two ISIS-supporting brothers stab their mother to death."], ["2016.06.23", "Syria", "Maalula", 1, 0, "Jihadists slit the throat of a Christian man in front of his wife."], ["2016.06.23", "Syria", "Raqqa", 1, 0, "A man is stabbed, shot and crucified by the Islamic State."], ["2016.06.23", "Syria", "al-Bab", 20, 0, "Twenty Kurds are executed for refusing to obey the Islamic State."], ["2016.06.23", "Uganda", "Lakabuku", 1, 0, "Faithful Muslims murder a Christian widow for refusing to allow a mosque on her property."], ["2016.06.24", "Afghanistan", "Kot", 8, 12, "At least eight civilians are killed when ISIS loyalists burn down a village."], ["2016.06.24", "Cameroon", "Gouzoudoum", 4, 2, "Boko Haram kill four villagers and torch their homes."], ["2016.06.24", "Iraq", "Hawija", 5, 0, "Five civilians are executed by ISIS at a popular market."], ["2016.06.24", "Libya", "Benghazi", 4, 14, "Four civilians are killed when terrorists set off a car bomb in front of a hospital."], ["2016.06.24", "Pakistan", "Quetta", 3, 32, "The Taliban are suspected of a bomb blast in a shopping district that leaves three dead."], ["2016.06.24", "Saudi Arabia", "Qatif", 1, 0, "A local cop is gunned down by Shia radicals."], ["2016.06.24", "Somalia", "Yurkuk", 5, 0, "Five farmers are killed during an al-Shabaab attack."], ["2016.06.25", "Bangladesh", "Chittagong", 1, 0, "A Hindu practitioner is beheaded by Religion of Peace radicals."], ["2016.06.25", "India", "Pampore", 8, 24, "Lashkar-e-Taiba members pour machine-gun fire into a bus, killing eight passengers."], ["2016.06.25", "Pakistan", "Lahore", 0, 1, "Four Muslims gang-rape a Christian whose brother had eloped with a Muslim."], ["2016.06.25", "Somalia", "Mogadishu", 14, 25, "An al-Shabaab suicide bombing at a hotel claims the lives of fourteen employees and guests."], ["2016.06.25", "Syria", "Deir Ezzor", 4, 0, "ISIS hangs four young people while forcing their families to watch."], ["2016.06.25", "Syria", "Raqqa", 5, 0, "ISIS executed five journalists by forcing them to use cameras and computers rigged with explosives."], ["2016.06.26", "Egypt", "Sheikh Zuweid", 2, 3, "Two policemen are disassembled by an ISIS roadside bomb."], ["2016.06.26", "Iraq", "Baghdad", 2, 1, "Two civilians are blown to bits by Mujahideen bombers."], ["2016.06.26", "Kuwait", "Kuwait City", 1, 0, "A man kills his own brother for not fasting and praying during Ramadan."], ["2016.06.26", "Thailand", "Narathiwat", 1, 2, "A shooting and bombing leave one dead and two injured."], ["2016.06.27", "Egypt", "Sheikh Zuweid", 1, 0, "A young policeman at a checkpoint is picked off by a long-range Islamist sniper."], ["2016.06.27", "Iraq", "Baghdad", 2, 5, "Two people are leveled by a Jihadi bomb blast outside a row of shops."], ["2016.06.27", "Iraq", "Fallujah", 7, 0, "Seven people are found tortured to death by the Islamic State."], ["2016.06.27", "Kenya", "Dimu", 5, 4, "Five border guards are murdered by al-Shabaab extremists."], ["2016.06.27", "Lebanon", "Qaa", 6, 19, "Six people are left dead after four suicide bombers detonate at a small village."], ["2016.06.27", "Yemen", "Mukalla", 42, 30, "A woman and child are among over forty taken out by four suicide bombers."], ["2016.06.28", "Afghanistan", "Kabul", 1, 0, "A secular judge is gunned down by Sharia proponents."], ["2016.06.28", "Iraq", "Abu Ghraib", 14, 32, "At least a dozen worshippers are laid out by a suicide blast at a mosque."], ["2016.06.28", "Iraq", "Baghdad", 4, 0, "Terrorists fire on a suspected brothel, killing three women and a child."], ["2016.06.28", "Iraq", "Sharqat", 4, 0, "Four civilians are kidnapped and executed by the Islamic State."], ["2016.06.28", "Malaysia", "Puchong", 0, 8, "A grenade thrown into a Malaysian bar during Ramadan is the work of an Islamist."], ["2016.06.28", "Thailand", "Muang", 2, 1, "Muslim 'insurgents' gun down a father and son."], ["2016.06.28", "Turkey", "Istanbul", 44, 239, "Three suicide bombers massacre over forty innocents at a busy airport."], ["2016.06.29", "Cameroon", "Djakana", 4, 4, "A young suicide bomber detonates at a video club, killing four patrons."], ["2016.06.29", "Iraq", "Abu Ghraib", 3, 7, "Three patrons at a market are sectionalized by Mujahideen bombers."], ["2016.06.29", "Iraq", "Sharqat", 2, 8, "ISIS mortar crews target refugees fleeing the violence, killing two."], ["2016.06.29", "Mali", "Timbuktu", 3, 6, "al-Qaeda linked militants ambush and kill three local soldiers."], ["2016.06.29", "Syria", "Bokomal", 5, 0, "Five young people are beheaded on video by the Islamic State."], ["2016.06.29", "Syria", "Tal Abyad", 10, 25, "A suicide car bomber targeting Kurdish civilians takes out ten."], ["2016.06.29", "Thailand", "Narathiwat", 1, 3, "A Muslim roadside bomb claims one life."], ["2016.06.30", "Afghanistan", "Paghman", 37, 80, "Two suicide bombers massacre thirty-seven souls in a coordinated attack on a group of buses."], ["2016.06.30", "Bahrain", "Manama", 1, 3, "A bomb planted by suspected Shiites kills a woman and injures her three children."], ["2016.06.30", "Bangladesh", "Bandarban", 1, 0, "A 55-year-old Buddhist leader is hacked to death by Religion of Peace proponents."], ["2016.06.30", "Cameroon", "Limani", 11, 50, "A Fedayeen suicide bomber detonates at a rival mosque, taking eleven others with him."], ["2016.06.30", "Egypt", "Farafra", 6, 3, "Islamic extremists open fire on two police vehicles, killing six officers."], ["2016.06.30", "Egypt", "Rafah", 2, 1, "Two security personnel are ambushed and killed by Islamists."], ["2016.06.30", "Egypt", "al-Arish", 1, 0, "A Coptic priest is shot in the head by Muslim radicals."], ["2016.06.30", "Iraq", "Baghdad", 6, 19, "A Shahid suicide bomber takes out six bystanders at a popular market."], ["2016.06.30", "Iraq", "Fallujah", 4, 5, "An Islamic State supporter sprays a group of policemen with automatic weapons fire, killing four."], ["2016.06.30", "Israel", "Kiryat Arba", 1, 1, "A 13-year-old girl is stabbed to death in her bedroom by a Palestinian terrorist."], ["2016.06.30", "Israel", "Netanya", 0, 2, "A mother shopping for her daughter's wedding dress is among two civilians stabbed by Muslim terrorists."], ["2016.06.30", "Nigeria", "Obi", 1, 0, "An evangelical pastor is hacked to death by militant Muslims."], ["2016.06.30", "Pakistan", "Peshawar", 3, 6, "Three security personnel are taken out in separate attacks by armed fundamentalists."], ["2016.06.30", "Somalia", "Lafole", 18, 20, "Eighteen passengers on a minibus are cooked alive by an Islamist roadside blast."], ["2016.07.01", "Afghanistan", "Kandahar", 5, 0, "Five local cops are gunned down by the Taliban."], ["2016.07.01", "Afghanistan", "Shahwali Kot", 7, 0, "Three woman are among a family of seven murdered in their home by Sunni militants."], ["2016.07.01", "Bangladesh", "Dhaka", 22, 26, "Seven terrorists take hostages at a restaurant and summarily execute all who cannot quote from the Quran."], ["2016.07.01", "Bangladesh", "Jhenaidah", 1, 0, "A Hindu temple worker is hacked to death."], ["2016.07.01", "Iraq", "Baghdad", 5, 30, "Five people lose their lives to a Fedayeen suicide car bomber."], ["2016.07.01", "Iraq", "Tuz Khormato", 2, 4, "A suicide attack at a Shiite mosque leaves two dead."], ["2016.07.01", "Israel", "Hebron", 1, 3, "Palestinians fire on a family's vehicle, killing the father and injuring his wife and two children."], ["2016.07.01", "Kenya", "Wak", 6, 2, "Children are among six people on a bus brutally machine-gunned by religious radicals."], ["2016.07.01", "Pakistan", "Haripur", 1, 0, "A man is shot dead by a conservative family for marrying their daughter without permission."], ["2016.07.01", "Somalia", "Mogadishu", 1, 0, "A moderate cleric is shot to death by more-radical co-religionists."], ["2016.07.01", "Syria", "Damascus", 1, 0, "A pilot is murdered by Jaish-al-Islam."], ["2016.07.02", "Afghanistan", "Jalalabad", 2, 17, "A Shahid suicide bomber on a motorbike kills two bystanders."], ["2016.07.02", "Afghanistan", "Khakrez", 4, 0, "Four people are taken out by a Taliban bomb blast."], ["2016.07.02", "Afghanistan", "Khorasan", 3, 0, "Video shows three 'apostates' executed to religious music by child soldiers."], ["2016.07.02", "Bangladesh", "Satkhira", 0, 1, "A Hindu priest is stabbed at a bakery by Muslim extremists."], ["2016.07.02", "Somalia", "Baidoa", 2, 19, "Two girls, ages 4 and 5, are disintegrated by an al-Shabaab mortar round."], ["2016.07.02", "Syria", "Elkheir", 1, 0, "A man is brutally beheaded for 'pledging to infidels'."], ["2016.07.03", "Iraq", "Arabi", 2, 0, "A father and son are executed by the Islamic State after three months in captivity."], ["2016.07.03", "Iraq", "Karrada", 308, 246, "A Fedayeen suicide bomber detonates in a shopping mall packed with Shiites, slaughtering over three hundred, including many children."], ["2016.07.03", "Iraq", "Kirkuk", 7, 0, "Seven civilians are executed by caliphate members."], ["2016.07.03", "Iraq", "Shaab", 5, 16, "Jihadis set off a bomb in a commercial district that claims five lives."], ["2016.07.03", "Libya", "Banghazi", 2, 7, "An ISIS car bomb explodes in a busy district, killing two traffic cops."], ["2016.07.03", "Libya", "Benghazi", 2, 0, "A car bombing leaves two dead."], ["2016.07.03", "Syria", "Raqqa", 1, 0, "A man is beheaded for 'mocking Islam'."], ["2016.07.03", "Thailand", "Pattani", 1, 2, "One person is killed by a bomb left outside a mosque."], ["2016.07.03", "Thailand", "Yala", 2, 0, "Two civilians are neatly taken out by Muslim bombers."], ["2016.07.04", "Iraq", "Baghdad", 2, 9, "A bomb near a popular market leaves two dead."], ["2016.07.04", "Iraq", "Sharqat", 7, 0, "The Islamic State boils seven members alive."], ["2016.07.04", "Iraq", "Tal Kaif", 3, 0, "Three Kurds are executed by the Islamic State."], ["2016.07.04", "Saudi Arabia", "Jeddah", 0, 2, "A suicide bomber detonates near the US embassy."], ["2016.07.04", "Saudi Arabia", "Medina", 4, 5, "Four guards are killed by a suicide bomber outside Islam's second holiest mosque."], ["2016.07.05", "DRC", "Tenambo", 9, 0, "Nine Christian villagers are murdered by ADF Islamists."], ["2016.07.05", "Indonesia", "Surakarta", 0, 1, "A suicide bomber detonates in front of a police station."], ["2016.07.05", "Iraq", "Saidiya", 3, 12, "Jihadis send mortars into a displaced persons camp, killing three."], ["2016.07.05", "Somalia", "Galcad", 2, 0, "Two staffers at a telecommunication company are beheaded by al-Shabaab."], ["2016.07.05", "Syria", "Hassakeh", 30, 40, "A suicide bomber massacres thirty innocents outside a Shiite bakery."], ["2016.07.05", "Syria", "Raqqa", 4, 0, "Four popular soccer players are forced to kneel and then shot in the head by caliphate members in front of children."], ["2016.07.05", "Syria", "Um al-Housh", 40, 0, "Women and children are among forty civilians captured and 'mercilessly' executed by the Islamic State."], ["2016.07.05", "Thailand", "Bannang Sata", 1, 0, "Militant Muslims launch a grenade from an M79 in front of a mosque, killing a passerby."], ["2016.07.05", "Thailand", "Pattani", 1, 3, "A bomb planted by Muslim militants in front of a police station leaves one dead."], ["2016.07.05", "Thailand", "Songkhla", 1, 2, "Muslim 'insurgents' place a bomb that kills one other person."], ["2016.07.06", "Afghanistan", "Sancharak", 4, 1, "Four family members are wiped out by a Shahid suicide bomber."], ["2016.07.06", "India", "Vijaywada", 1, 0, "A teen is honor-killed by her conservative Muslim mother for having an affair with a Hindu boy."], ["2016.07.06", "Iraq", "Mosul", 6, 0, "Six people are beheaded by a Sharia court."], ["2016.07.06", "Syria", "Aleppo", 3, 3, "Three civilians are flattened by a Sunni mortar barrage."], ["2016.07.06", "Syria", "al-Zahraa", 2, 6, "Two children are turned to paste by a Sunni rocket."], ["2016.07.06", "Yemen", "Aden", 25, 8, "al-Qaeda suicide bombers take out over two dozen local soldiers."], ["2016.07.07", "Bangladesh", "Sholakia", 4, 12, "A police officer is hacked to death and a woman is among four total killed by an Islamist attack during Eid prayers"], ["2016.07.07", "Iraq", "Balad", 56, 70, "Fifty-six pilgrims are blown up by a Sunni suicide bomb attack on a Shiite shrine."], ["2016.07.07", "Libya", "Benghazi", 12, 35, "A dozen souls are sent to Allah by a Shahid suicide bomber."], ["2016.07.08", "Nigeria", "Damboa", 9, 12, "A suicide bomber strikes a rival mosque, killing at least nine."], ["2016.07.08", "Syria", "Aleppo", 34, 200, "al-Nusra members send shells into a populated area, killing thirty-four civilians."], ["2016.07.08", "Syria", "Tel Abyad", 10, 11, "Women and children are among ten taken out by an ISIS suicide bombing at a popular market."], ["2016.07.09", "Bangladesh", "Kajura", 0, 1, "A Catholic nurse is set on fire by suspected Religion of Peace operatives."], ["2016.07.09", "Iraq", "Kirkuk", 2, 2, "ISIS is suspected of a home invasion in which a moderate cleric and his family member are killed."], ["2016.07.09", "Iraq", "Riyadh", 3, 0, "Three Kurdish brothers are executed by the Islamic State."], ["2016.07.09", "Libya", "Sirte", 7, 3, "A secret ISIS prison is unearthed with seven bodies and three surviving torture victims."], ["2016.07.09", "Mali", "Koro", 2, 0, "Two guards at a checkpoint are machine-gunned point-blank by suspected Jihadis."], ["2016.07.09", "Nigeria", "Abuja", 1, 0, "A female pastor is hacked to death by Muslim radicals who left her severed head on a Bible."], ["2016.07.09", "Nigeria", "Rann", 7, 0, "Boko Haram invade a village, stealing food and gunning down seven residents."], ["2016.07.09", "Pakistan", "Islamabad", 1, 1, "The wife of a Shiite cleric is gunned down in a targeted attack."], ["2016.07.10", "Afghanistan", "Kandahar", 3, 6, "Three children are ripped apart by Taliban shrapnel."], ["2016.07.10", "India", "Kashmir", 3, 96, "At least three security personnel are killed by a Muslim mob, angered over the death of a terrorist."], ["2016.07.10", "Iraq", "Fallujah", 46, 0, "Forty-six Sunnis are burned alive by Hashd al-Shaabi, a Shiite militia."], ["2016.07.10", "Nigeria", "Benue", 81, 0, "The death toll from two weeks of rolling Fulani attacks on peaceful farming communities rises to over 80."], ["2016.07.10", "Syria", "Aleppo", 5, 61, "al-Nusra members sends a barrage of explosives into a residential neighborhood, laying out five civilians."], ["2016.07.10", "Syria", "Raqqa", 5, 0, "Five civilians are beheaded in front of their families by the Islamic State."], ["2016.07.11", "India", "Keran", 1, 2, "A border guard is murdered by Muslim terrorists."], ["2016.07.11", "Iraq", "Nineveh", 4, 0, "Four doctors are beheaded by the Islamic State."], ["2016.07.11", "Iraq", "Qayara", 9, 0, "Women and the elderly are among nine members of two families dragged from their homes and executed by ISIS."], ["2016.07.11", "Nigeria", "Paikoro", 11, 0, "Eleven people in two villages are hacked to death by Fulani terrorists."], ["2016.07.11", "Pakistan", "Orangi", 1, 1, "A woman is shot dead by her conservative brother-in-law for 'bringing dishonor' to the family."], ["2016.07.11", "Pakistan", "Parachinar", 1, 0, "A young tribal leader is tortured and murdered by suspected militants."], ["2016.07.11", "Somalia", "Lanto Buro", 11, 6, "At least eleven others are killed by a Fedayeen suicide car bomber."], ["2016.07.11", "Somalia", "Mogadishu", 1, 6, "An al-Shabaab bomb blast claims one life."], ["2016.07.12", "Iraq", "Baghdad", 12, 37, "A dozen people at a vegetable and fruit market are reduced to pulp by a Shahid suicide bomber."], ["2016.07.12", "Iraq", "Mahmoudiya", 3, 10, "Three shoppers are sectionalized by a Religion of Peace bomb blast at an outdoor market."], ["2016.07.12", "Nigeria", "Akombo", 5, 0, "A school principal is among five villagers murdered by Fulani terrorists."], ["2016.07.12", "Nigeria", "Kangarwa", 2, 7, "A Boko Haram attack leaves two others dead."], ["2016.07.12", "Pakistan", "Faisalabad", 1, 0, "A Christian family man is murdered in a targeted attack by Muslim kidnappers."], ["2016.07.12", "Philippines", "Tipo-Tipo", 1, 5, "One person is taken out by an Abu Sayyaf IED."], ["2016.07.13", "Iraq", "Baghdad", 4, 16, "Two separate Mujahid blasts leave four dead."], ["2016.07.13", "Iraq", "Baqubah", 2, 0, "Two people are killed in their own home by a suicide bomber."], ["2016.07.13", "Iraq", "Quayyarah", 1, 2, "A well-placed ISIS bomb takes out a journalist."], ["2016.07.13", "Iraq", "Rashidiya", 7, 11, "Seven Iraqis are laid out by a Fedayeen suicide bomber."], ["2016.07.13", "Syria", "Aleppo", 1, 0, "A teenager is disassembled in his own home by a Sunni rocket."], ["2016.07.14", "Bangladesh", "Krishnarampu", 1, 0, "An imam's throat is slit at his home by Religion of Peace rivals."], ["2016.07.14", "France", "Nice", 84, 202, "A Muslim migrant mows down eighty-four Bastille Day revelers (including ten children) with a truck while shouting praises to Allah."], ["2016.07.14", "Iraq", "Meshahda", 1, 5, "One other person is killed by a suicide bomber."], ["2016.07.14", "Iraq", "Taji", 3, 4, "Three Iraqis are blown to bits by a Fedayeen suicide bomber."], ["2016.07.14", "Pakistan", "Bashirabad", 1, 0, "A traffic cop is gunned down by religious radicals."], ["2016.07.14", "Philippines", "Manilop", 3, 0, "Three off-duty soldiers are ambushed and killed by Abu Sayyaf while buying food."], ["2016.07.15", "India", "Kulgam", 1, 7, "A terrorist lobs a grenade into a group of policemen, killing one."], ["2016.07.15", "Iraq", "Quayyarah", 22, 0, "Twenty-two people are taken to a swamp and executed by the Islamic State."], ["2016.07.15", "Kenya", "al-Wak", 4, 0, "Four Kenyans lose the lives to an al-Shabaab ambush."], ["2016.07.15", "Nigeria", "Oke-Ogun", 1, 0, "A Fulani man beats a shepherd to death and credits Allah."], ["2016.07.16", "Afghanistan", "Kabul", 1, 2, "A bomb attached to a vehicle kills one and injures two."], ["2016.07.16", "Iraq", "Taji", 3, 6, "Mujahideen detonate a bomb outside a market that leaves three dead."], ["2016.07.16", "Iraq", "Tal Abta", 5, 0, "Five civilians are burned alive in cages by Islamic State members."], ["2016.07.16", "Kazakhstan", "Kyzylorda", 1, 0, "Two Islamic radicals kill a woman."], ["2016.07.16", "Pakistan", "Multan", 1, 0, "A model is strangled to death by her brother after offending religious conservatives."], ["2016.07.16", "Syria", "Aleppo", 5, 9, "Two brothers are two women are among five civilians ripped to shreds by Sunni shrapnel."], ["2016.07.16", "Syria", "Saikol", 24, 0, "Dozens of Kurdish civilians, including women and children, are brutally stabbed to death by Islamic State members."], ["2016.07.17", "Bangladesh", "Ektarpur", 0, 3, "Two elderly women are among three religious minorities hacked in the beds by machete-wielding extremists."], ["2016.07.17", "Egypt", "Tahna al-Gabal", 1, 1, "One member is slain when a Coptic family is attacked by a Muslim mob armed with knives."], ["2016.07.17", "India", "Kawari", 1, 0, "A civilian is gunned down at close range by Islamic militants."], ["2016.07.18", "Germany", "Wuerzburg", 0, 5, "A 'refugee' with an axe hacks at people on a train while screaming 'Allah Akbar'."], ["2016.07.18", "Iraq", "Rathba", 3, 5, "Three people are leveled by a suicide bomb blast."], ["2016.07.18", "Kazakhstan", "Almaty", 4, 0, "An extremist shouting praises to Allah murders a civilian and three policemen."], ["2016.07.18", "Nigeria", "Sha", 2, 0, "A village leader and his driver are murdered by Fulani terrorists."], ["2016.07.18", "Pakistan", "Chota Lahore", 1, 0, "A secular politician is shot to death in his car by Sharia proponents."], ["2016.07.18", "Pakistan", "Doag Dara", 7, 3, "Seven members of a peace committee are pulverized by a Taliban IED."], ["2016.07.18", "Pakistan", "Marghuzar", 1, 0, "Suspected militants kill a rival prayer leader inside a mosque."], ["2016.07.18", "Syria", "Aleppo", 3, 15, "Sunnis send rockets into a residential neighborhood, taking out a child and two women."], ["2016.07.18", "Yemen", "Hajr", 1, 19, "At least one other person is killed by a Fedayeen suicide bomber."], ["2016.07.18", "Yemen", "Mukalla", 10, 18, "Ten people are blown to bits by a suicide car bomber."], ["2016.07.19", "France", "Garda-Colombe", 0, 4, "A mother and her three young daughters are stabbed by a Muslim man during breakfast for not being sufficiently clothed."], ["2016.07.19", "Iraq", "Jadha", 33, 0, "Thirty-three civilians are executed in cold blood by the Islamic State."], ["2016.07.19", "Mali", "Nampala", 17, 35, "An al-Qaeda linked group claims an assault on a local security camp that leaves seventeen others dead."], ["2016.07.19", "Saudi Arabia", "Jizan", 3, 0, "Three Saudis lose their lives to a rocket fired by Shiite radicals."], ["2016.07.20", "Iraq", "Mosul", 12, 0, "A dozen brave women hold a protest against the caliphate and are quickly gunned down."], ["2016.07.20", "Iraq", "Ninawa", 2, 0, "Two men are beheaded in front of children by the Islamic State."], ["2016.07.20", "Syria", "Handarat", 1, 0, "A video shows the beheading of a boy at the hands of Sunni 'rebels'."], ["2016.07.20", "Yemen", "Aden", 4, 6, "Four security personnel are murdered by an ISIS bomber."], ["2016.07.21", "Afghanistan", "Qalay-i-Zal", 1, 4, "Taliban gunmen fire into a group of police, killing one."], ["2016.07.21", "Iraq", "Mosul", 2, 0, "Two 'terrified' men are beheaded by the caliphate."], ["2016.07.21", "Iraq", "Shaab", 1, 6, "A Mujahideen bomb blast outside a row of shops leaves one dead."], ["2016.07.21", "Libya", "Sirte", 1, 0, "A photojournalist is picked off by an ISIS sniper."], ["2016.07.22", "Iraq", "Kirkuk", 1, 0, "A suspected homosexual is flung from a rooftop in the caliphate."], ["2016.07.22", "Syria", "Aleppo", 11, 44, "A child and two women are among seven civilians laid out by Sunni shrapnel."], ["2016.07.22", "Syria", "Damascus", 1, 0, "Caliphate members shoot a man in the back of the head for 'insulting Allah'"], ["2016.07.22", "Yemen", "Aden", 1, 0, "A clergyman is shot to death by Religion of Peace rivals outside his mosque."], ["2016.07.23", "Afghanistan", "Kabul", 81, 231, "Three suicide bombers massacre more than eighty innocents at a mass Shiite demonstration."], ["2016.07.23", "CAR", "Ngakobo", 3, 3, "Three villagers are cut down in their own homes by Muslim militia gunmen."], ["2016.07.23", "India", "Furkian", 1, 2, "A border guard is dropped by Islamic snipers."], ["2016.07.23", "Iraq", "Baghdad", 3, 13, "Two planted bombs kill three Iraqis."], ["2016.07.23", "Iraq", "Osaji", 1, 1, "An ISIS IED takes out a 10-year-old girl."], ["2016.07.23", "Iraq", "Sharqat", 2, 10, "Caliphate bombers obliterate two children."], ["2016.07.23", "Iraq", "Sharqat", 11, 9, "A suicide bomber targets families fleeing the caliphate, killing eleven members."], ["2016.07.24", "Afghanistan", "Kot", 1, 0, "An 'apostate' is shot in the head and thrown into a ravine."], ["2016.07.24", "Germany", "Ansbach", 0, 15, "A Syrian 'asylum seeker' detonates a nail-packed suicide bomb at a wine bar outside a music festival."], ["2016.07.24", "Iraq", "Abu Ghraib", 3, 11, "Mujahideen bomb a popular market, taking out three patrons."], ["2016.07.24", "Iraq", "Baghdad", 21, 35, "An Islamic State suicide bomber detonates in a Shiite neighborhood, obliterating twenty-one souls including women and children."], ["2016.07.24", "Nigeria", "Mbagbe", 1, 2, "A 45-year-old farmer is beheaded by Muslim terrorists."], ["2016.07.24", "Syria", "Damascus", 8, 16, "Jaish al-Islam lob a mortar into a restaurant, taking out eight patrons."], ["2016.07.25", "Egypt", "al-Arish", 1, 0, "A young police officer is assassinated by ISIS."], ["2016.07.25", "Iraq", "Khalis", 16, 41, "At least sixteen others are incinerated by a suicide car bomber, including women and children packed onto a minibus."], ["2016.07.25", "Iraq", "Mosul", 23, 0, "The Islamic State beheads two dozen young Iraqis."], ["2016.07.25", "Iraq", "Rashad", 3, 0, "A little girl is among three members of a family burned alive for trying to flee the caliphate."], ["2016.07.25", "Syria", "Khaldiya", 2, 4, "A woman and her young son are disassembled by al-Nusra shrapnel."], ["2016.07.26", "France", "Saint-Etienne-du-Rouvray", 1, 1, "Muslim radicals take hostages at a church and slit the throat of an 84-year-old priest."], ["2016.07.26", "Iraq", "Shirqat", 5, 0, "An ISIS bomb targeting fleeing families takes out a mother and her four daughters."], ["2016.07.26", "Somalia", "Mogadishu", 13, 5, "At least thirteen people are killed by two suicide bombers near an airport and UN building."], ["2016.07.27", "Syria", "Qamishli", 67, 185, "Women and children are among over sixty innocents blown apart by two Fedayeen suicide bombers."], ["2016.07.28", "Afghanistan", "Pashtunkot", 1, 0, "A 22-year-old woman is shot to death for 'having relations' with a man over the phone."], ["2016.07.28", "Iraq", "Mosul", 14, 0, "Five women and a child are among fourteen civilians executed by firing squad for trying to flee the caliphate."], ["2016.07.31", "Iraq", "Kirkuk", 5, 2, "ISIS members enter the control room for a pumping station and shoot five employees to death."], ["2016.07.31", "Somalia", "Mogadishu", 10, 15, "At least ten are killed when religious hardliners launch a suicide attack on a police building."], ["2016.08.01", "Afghanistan", "Kabul", 1, 4, "A guard is killed during a suicide assault on a foreign guesthouse."], ["2016.08.01", "Pakistan", "Quetta", 2, 0, "Two Hazara religious minorities are brutally gunned down on the street."]], "columns": ["Date", "Country", "City", "Killed", "Injured", "Description"], "year": 2016}