{"rows": [["2002.01.01", "India", "Baramulla", 1, 0, "Terrorists enter the home of a civilian and kill his wife."], ["2002.01.01", "India", "Poshkar", 2, 0, "Two civilians are abducted from their homes then executed by the Mujahideen."], ["2002.01.01", "Indonesia", "Palu", 1, 0, "Four bombs explode at Christian churches and one man dies in a hand grenade attack in Jakarta."], ["2002.01.02", "India", "Jehangir Chowk", 2, 25, "A Muslim militant kills two and injures twenty-five in a grenade attack on a city street."], ["2002.01.02", "India", "Rajouri", 6, 9, "Three separate terror attacks in the district leave a civilian and five security forces dead."], ["2002.01.03", "Pakistan", "Karachi", 1, 0, "A cleric is gunned down in a sectarian attack."], ["2002.01.04", "India", "Kashmir", 2, 0, "Two civilians are abducted and killed by the Mujahideen in separate incidents (Badran and Kulgam)."], ["2002.01.05", "India", "Mahore", 2, 3, "An ambush on a security patrol leaves two members dead."], ["2002.01.06", "India", "Luddu", 4, 4, "Four civilians, three of whom were in the same family are gunned down when fleeing their home after Jaish-e-Mohammed cadres flush them out with grenades."], ["2002.01.06", "India", "Ramsu", 3, 12, "Three brothers are killed in their home by Lashkar-e-Toiba terrorists.  A dozen others are injured in the attack."], ["2002.01.06", "USA", "Tampa, FL", 0, 0, "Fifteen year-old flies plane into an office building in Tampa. Suicide note reveals his admiration for Osama Bin Laden and desire to commit a terrorist attack."], ["2002.01.08", "India", "Srinagar", 1, 2, "Soldier killed by two Mujahideen suicide attackers."], ["2002.01.09", "Israel", "Kerem Shalom", 4, 2, "Palestinian terrorists infiltrate border and kill four soldiers. Two others were wounded."], ["2002.01.09", "Pakistan", "Gulshan-i-Iqbal", 1, 0, "Government official is killed by Islamists."], ["2002.01.10", "India", "Bafliaz", 1, 0, "Terrorists kill a village official."], ["2002.01.13", "India", "Beerwah", 1, 0, "A civilian is murdered by the Mujahideen."], ["2002.01.14", "India", "Kashmir", 6, 3, "In separate attacks, three civilians are killed by Islamic militants.  A security checkpoint is attacked as well, with three security forces killed."], ["2002.01.15", "India", "Keri", 2, 0, "A man and his wife are abducted and killed by Lashkar-e-Toiba."], ["2002.01.15", "Israel", "Beit Jala", 1, 0, "An American citizen is kidnapped then killed by Al-Aqsa Brigade."], ["2002.01.15", "Israel", "Givat Ze-ev", 1, 1, "Woman killed near gas station. Her aunt is injured in the shooting attack by Palestinians."], ["2002.01.16", "Indonesia", "Malei", 1, 0, "A Christian man is gunned down by angry Muslims while collecting fruit."], ["2002.01.16", "Israel", "Jenin", 1, 0, "Arab killed in Jenin while sitting in a car bearing Israeli license plates."], ["2002.01.16", "Pakistan", "Lahore", 0, 5, "Five guards are injured in an Islamist attack on the airport."], ["2002.01.17", "India", "Kanak Mandi", 2, 8, "Two civilians are killed in a terrorist bombing.  Eight others are injured."], ["2002.01.17", "Israel", "Hadera", 6, 35, "Terrorist barges into a bat mitzvah reception and kills six guests with an assault rifle. Thirty-five others also shot."], ["2002.01.18", "India", "Budhan", 0, 2, "Two children are injured when a Muslim throws a grenade into a house."], ["2002.01.20", "India", "Behra", 11, 3, "Muslim terrorists invade a home and slaughter eight children, two women and one man in a bloody rampage."], ["2002.01.22", "Bangladesh", "Kolkata", 5, 20, "Five guards at the American Center are killed in a drive-by shooting attack by Islamists."], ["2002.01.22", "Israel", "Jerusalem", 2, 40, "Palestinian terrorist fires assault rifle into a bus-stop, killing two women and injuring forty others."], ["2002.01.23", "India", "Donipora-Kantpora", 2, 0, "Two civilians are abducted and murdered by the Mujahideen."], ["2002.01.24", "India", "Sathra", 1, 3, "A security officer is killed in an ambush by Muslim militants."], ["2002.01.26", "India", "Hala", 2, 0, "The Mujahideen murder a man and his mother inside their home."], ["2002.01.27", "India", "Pingla Dai", 2, 0, "Two civilians are killed by Islamic terrorists at their village."], ["2002.01.27", "Israel", "Jerusalem", 1, 150, "An 81-year-old is killed and over one-hundred and fifty injured by suicide bomber armed with more than 10k of explosives."], ["2002.01.30", "India", "Lachipora", 2, 0, "An off-duty police officer and a family member are killed in their home by the Mujahideen."], ["2002.01.31", "India", "Reasi", 3, 5, "Islamic militants lob a grenade at the families of migrant workers, killing three, including two infants."], ["2002.01.31", "India", "Sarhuti", 1, 1, "Two family members are injured in a Mujahideen attack on their home.  One later dies of injuries."], ["2002.01.31", "India", "Soo Bathoi", 2, 0, "Pakistani-backed militants abduct two civilians and kill them in captivity."], ["2002.02.01", "India", "Dodabug", 2, 0, "A political activist and his bodyguard are gunned down."], ["2002.02.01", "India", "Sangrawas", 2, 0, "Two civilians are abducted and murdered by Muslim terrorists."], ["2002.02.01", "India", "Srinagar", 1, 0, "Muslim separatists assassinate an independent newspaper editor in his office."], ["2002.02.03", "Algeria", "al-Medya", 12, 8, "Five Islamic fundamentalists set up a false roadblock and proceed to slaughter a dozen unlucky motorists."], ["2002.02.04", "Algeria", "Seidi Lakhder", 22, 3, "Most of the 25 victims were from the same family and were killed for trying to defend themselves. Knives and bullets were used by the Muslim radicals."], ["2002.02.04", "Bangladesh", "Chittagong", 1, 3, "Jamaat-e-Islami militants set off a series of bombs at a press club, killing at least one person."], ["2002.02.04", "India", "Batfozen", 3, 0, "Islamic militants attack two women in their home, brutally killing them along with the young daughter of one."], ["2002.02.04", "Pakistan", "Jhang", 1, 0, "Two Muslim terrorists gun down a cop involved in anti-terror activities."], ["2002.02.06", "Israel", "Moshav Hamra", 3, 0, "Three people including a mother and her 11-year-old daughter are killed in a home invasion by an armed terrorist."], ["2002.02.07", "India", "Chillar", 1, 0, "A civilian is abducted and tortured to death by the Mujahideen."], ["2002.02.08", "Israel", "Jerusalem", 1, 0, "A 25-year-old Israeli is stabbed to death by four Palestinian teen-agers."], ["2002.02.09", "Israel", "Ariel", 1, 0, "Elderly man shot to death in a Palestinian ambush while driving car."], ["2002.02.10", "Algeria", "Bouqra", 6, 0, "Islamic fundamentalists slaughter a family of six in a senseless and barbaric attack."], ["2002.02.10", "Israel", "Be'er Sheva", 2, 4, "Drive-by shooting leaves two young Israelis dead and four others wounded."], ["2002.02.12", "India", "Parori Gujaran", 3, 1, "Three security forces are killed by Muslim terrorists in a shootout."], ["2002.02.12", "Pakistan", "Karachi", 1, 0, "A doctor is gunned down outside his clinic in a sectarian attack."], ["2002.02.13", "India", "Bathian", 1, 0, "Islamic militants kill a party activist and burn his house."], ["2002.02.14", "India", "Thanna Mandi", 1, 0, "A woman is killed by a group of Muslims."], ["2002.02.15", "Algeria", "Jejil", 3, 1, "Three members of the Algerian self-defense forces are killed in a bombing by Islamic fundamentalists."], ["2002.02.15", "India", "Kashmir", 3, 0, "Three civilians are murdered by terrorists in separate attacks (Gowran, Markpora Sumbal and woman at Darhal)."], ["2002.02.16", "India", "Narala", 8, 7, "In a horrible attack, Lashkar-e-Toiba terrorists massacre eight members of two families, including two women and four children."], ["2002.02.16", "Israel", "Karnei Shomron", 3, 30, "Three teen-agers are blown apart by a Muslim suicide bomber at a pizzeria. Thirty others injured."], ["2002.02.18", "Israel", "Gush Katif", 3, 1, "Three Israelis are killed in a Palestinian shooting attack."], ["2002.02.19", "India", "Gool", 2, 0, "Two people, including a civilian, are killed in an IED attack by the Mujahideen."], ["2002.02.19", "India", "Kishtwar", 1, 16, "A civilian is killed, and sixteen others injured in a grenade attack by Muslim terrorists."], ["2002.02.19", "Israel", "Ramallah", 6, 1, "Six soldiers are killed when terrorists open fire at a roadblock."], ["2002.02.22", "India", "Aragam", 2, 2, "The Mujahideen attack four civilians, killing two of them."], ["2002.02.22", "Israel", "Jerusalem", 1, 0, "A 59-year-old man is murdered by a Palestinian terrorist while driving home from work."], ["2002.02.22", "Pakistan", "Karachi", 1, 0, "Jewish journalist Daniel Pearl is kidnapped, held for several weeks, then killed by five Islamics. Videotape shows throat being cut."], ["2002.02.23", "India", "Wagbal", 1, 1, "A man is murdered by the Mujahideen, who also seriously injure his sister."], ["2002.02.24", "Morocco", "Casablanca", 1, 0, "An 'impious' Muslim is stoned to death."], ["2002.02.24", "Nigeria", "Gombi", 1, 0, "A young Christian woman is kidnapped by four Muslim men, who slit her throat and leave her to die."], ["2002.02.25", "Israel", "Neve Ya'akov", 1, 2, "One killed and two injured by a Palestinian terrorist while waiting for a bus."], ["2002.02.25", "Israel", "Tekoa", 2, 1, "An Islamic terrorist kills two Jews and injures one other in a shooting attack."], ["2002.02.26", "India", "Gujarat", 59, 38, "In a horrific and senseless attack, a group of militant Muslims set fire to a train carrying Hindu pilgrims. Fifty-nine innocents are burned to death, including fifteen children."], ["2002.02.26", "India", "Kashmir", 2, 1, "Two civilians are killed in separate attacks by the Mujahideen (Moila, Newatta)."], ["2002.02.26", "Pakistan", "Rawalpindi", 10, 21, "Ten Shias are slaughtered, as Sunnis open up with automatic weapons at point-blank range at a mosque.  At least twenty others are injured."], ["2002.02.27", "India", "Tangwari", 1, 1, "The Mujahideen pull a man from a passenger bus and execute him by the roadside."], ["2002.02.27", "Nigeria", "Ilorin", 3, 0, "Eid-el-Kabir celebrants kill three Christians."], ["2002.02.28", "India", "Udhampur", 2, 0, "Separate attacks by the Mujahideen leave a police officer and a civilian dead."], ["2002.02.28", "Israel", "Atarot", 1, 0, "Jewish employer killed by a Muslim employee. Fatah takes credit for this attack."], ["2002.02.28", "Pakistan", "Karachi", 2, 11, "Islamists ambush a prisoner transport, killing a guard and a prisoner."], ["2002.03.02", "India", "Roshli", 2, 0, "A man and wife are abducted from their home and killed by Muslim terrorists."], ["2002.03.02", "Israel", "Jerusalem", 10, 52, "Ten people, mostly women and small children were killed by a suicide bomber. Most were waiting with baby carriages for their husbands to return from the synagogue."], ["2002.03.02", "Israel", "Mar Saba", 1, 0, "Jerusalem police detective assassinated by Tanzim while on holiday in the desert."], ["2002.03.03", "India", "Kashmir", 2, 0, "Two civilians are killed in separate terror attacks (Handwara, Yaripora)."], ["2002.03.03", "Israel", "Kissufim", 1, 4, "Soldier killed at a roadblock by Palestinian gunman. Four others injured."], ["2002.03.03", "Israel", "Ofra", 10, 6, "Hamas terrorist kills ten and wounds six by opening fire at a roadblock."], ["2002.03.04", "India", "Morha Pathana", 4, 0, "The Mujahideen abduct and massacre four civilians in a brutal attack."], ["2002.03.04", "Pakistan", "Khyaban-e-Hafiz", 1, 0, "A doctor is killed by two gunmen in a sectarian attack."], ["2002.03.05", "Israel", "Afula", 1, 17, "85-year-old man is killed in a Fedayeen suicide bombing at a bus station."], ["2002.03.05", "Israel", "Bethlehem", 1, 1, "A female motorist gunned down by a Palestinian sniper. Her husband is badly injured."], ["2002.03.05", "Israel", "Tel Aviv", 3, 30, "Three Israelis are killed and more than thirty injured when two Muslim gunmen open fire at adjacent restaurants."], ["2002.03.06", "Israel", "Khan Yunis", 2, 0, "Two Israeli soldiers are killed in a Palestinian ambush."], ["2002.03.07", "India", "Kashmir", 3, 0, "In separate attacks (Watnar, Mendhar, Androon) three civilians are killed after being taken captive."], ["2002.03.07", "Israel", "Gush Katif", 5, 23, "Five Israeli teen-agers are killed and twenty-three are injured by a Palestinian sniper in a heinous shooting."], ["2002.03.07", "Nigeria", "Enugu", 12, 0, "Muslim gunmen storm a Christian prayer meeting attempting to kill the leader. Twelve are killed, an unknown number injured."], ["2002.03.07", "Pakistan", "Lyari", 1, 0, "Another physician is killed in a sectarian attack on his car."], ["2002.03.08", "Algeria", "al-Bleida", 6, 0, "Islamic attackers open fire on a civilian vehicle then set the car on fire, killing a half-dozen people."], ["2002.03.08", "Israel", "Tulkarm", 1, 0, "An Israelis soldier is killed by a Palestinian sniper."], ["2002.03.08", "Pakistan", "Multan", 1, 0, "A retired Shia banker is killed by radical Sunnis in his shop."], ["2002.03.09", "Israel", "Jerusalem", 11, 54, "A Hamas (Islamic Resistance) suicide bomber kills eleven and injures 54 at a crowded cafe."], ["2002.03.09", "Israel", "Netanya", 2, 50, "The Fatah Al-Aqsa Brigades takes credit for killing a 9-month-old infant and one other in grenade attack that also left 50 others injured."], ["2002.03.09", "Pakistan", "New Karachi", 1, 1, "A doctor is gunned down by Sunnis on motorcycles, who also injure a patient."], ["2002.03.10", "India", "Chak Seri", 1, 1, "The Mujahideen abduct two civilians, later executing one of them.  Fate of the other is unknown."], ["2002.03.10", "Pakistan", "Akora Khattak", 2, 20, "Bomb rocks a local exhibition, killing at least two."], ["2002.03.11", "Pakistan", "Muzaffargarh", 4, 0, "Four people are killed in sectarian violence between Shias and Sunnis."], ["2002.03.12", "India", "Kashmir", 4, 0, "Four civilians are abducted and murdered by the Mujahideen in separate attacks."], ["2002.03.12", "Israel", "Metzuba", 6, 7, "Gunmen disguised in IDF uniforms ambush a bus and kill six, wound seven."], ["2002.03.12", "Pakistan", "Karimabad", 1, 0, "A Shia doctor is gunned down outside his clinic."], ["2002.03.13", "India", "Morha Kuthyani", 2, 0, "A civilian and his son are shot to death by radical Muslims."], ["2002.03.13", "India", "Nowshera", 2, 0, "Islamic rebels rape a Hindu woman before killing her and her son.  The bodies are left in the forest."], ["2002.03.14", "Israel", "Gaza", 3, 2, "Terrorists detonate a bomb by remote control that kills three Israelis and injures two."], ["2002.03.16", "Pakistan", "Jhang", 5, 0, "Five policemen are gunned down by Islamists."], ["2002.03.17", "Israel", "Kfar Saba", 1, 16, "A Palestinian terrorist opens fire on motorists, taking the life of a teenager and injuring sixteen others."], ["2002.03.17", "Pakistan", "Islamabad", 5, 45, "Grenade attack on a Christian church kills five worshippers including American woman and her 17-year-old daughter. Forty-five others were injured."], ["2002.03.18", "Pakistan", "Quetta", 1, 0, "A party activist is killed in a sectarian attack."], ["2002.03.19", "Algeria", "Algiers", 0, 13, "Thirteen injured by home-made bomb at the post office set by Islamic fundamentalists."], ["2002.03.19", "Algeria", "Souq al-Had", 4, 0, "Four farmers are ambushed and killed by armed Islamic fundamentalists."], ["2002.03.19", "Algeria", "Souq al-Had", 6, 0, "Islamic fundamentalists kill six victims, all from the same family. The father and mother were beheaded - the four children mutilated."], ["2002.03.19", "India", "Plangar", 1, 0, "Militant Muslims hang a young girl."], ["2002.03.19", "Pakistan", "Lahore", 3, 0, "Three people, including a professor, are killed in two sectarian attacks."], ["2002.03.19", "USA", "Tuscon, AZ", 1, 0, "A 60-year-old man is gunned down by Muslim snipers on a golf course."], ["2002.03.20", "India", "Dogripora", 2, 5, "Two children are killed by a Mujahideen IED blast."], ["2002.03.20", "Israel", "Musmus", 7, 30, "Seven passengers are killed when a Fedayeen suicide bomber blows up a passenger bus.  Thirty others are injured in the blast."], ["2002.03.21", "India", "Damhal Hanjipora", 0, 14, "Fourteen people are injured when a Muslim radical throws a grenade at a bus stop."], ["2002.03.21", "Israel", "Jerusalem", 3, 86, "Suicide bomber kills three and injures eighty-six when detonating in a crowd of shoppers."], ["2002.03.21", "Pakistan", "Karachi", 1, 0, "The Shia owner of a video shop is gunned down by militant Sunnis."], ["2002.03.22", "India", "Shopian", 0, 35, "Thirty-five people sustain injury when a Fedayeen hurls a grenade into a crowded market."], ["2002.03.23", "India", "Srinagar", 2, 20, "A woman is among two people killed by Lashkar-e-Toiba in a grenade attack."], ["2002.03.24", "India", "Kashmir", 6, 2, "Lashkar-e-Toiba terrorists are thought responsible for three attacks that leave six security force members dead."], ["2002.03.24", "Israel", "Ramallah", 1, 0, "A woman is killed by a Palestinian sniper while riding on a bus."], ["2002.03.25", "India", "Malanu", 1, 0, "A man is abducted and tortured to death by the Mujahideen."], ["2002.03.27", "Israel", "Netanya", 29, 133, "Hamas (Islamic Resistance) bomber kills twenty-nine Jews celebrating Passover in a hotel. One-hundred and thirty-seven others are injured in the attack."], ["2002.03.28", "Israel", "Elon Moreh", 4, 0, "A 20-year-old man, his two middle-aged parents and his grandfather were killed during a home invasion by a Muslim gunman."], ["2002.03.29", "India", "Kalakote", 2, 1, "A Fedayeen attack kills two border guards."], ["2002.03.29", "India", "Rajouri", 2, 0, "The Mujahideen burn houses and kill two civilians."], ["2002.03.29", "Israel", "Jerusalem", 4, 28, "Two security guards are killed and twenty-eight people injured by a suicide bomber. Two soldiers were also killed by Palestinians in Ramallah."], ["2002.03.29", "Israel", "Neztarim", 2, 0, "Two elderly Jews are killed by a Palestinian terrorist.  Two Palestinian groups claim credit."], ["2002.03.30", "India", "Jammu", 7, 20, "A Fedayeen attack on a Hindu temple kills seven people, including a female pilgrim."], ["2002.03.30", "Israel", "Tel Aviv", 1, 30, "A 36-year-old woman is murdered, and thirty others wounded by a suicide bomber in a cafe."], ["2002.03.31", "India", "Azmatabad", 1, 0, "A man is killed inside his home merely for being the brother of a police officer."], ["2002.03.31", "Israel", "Haifa", 15, 40, "Fifteen Israelis are killed in a restaurant by a Fedayeen suicide bomber. Over forty others are burned and maimed in the explosion."], ["2002.03.31", "Pakistan", "Bahawalpur", 2, 0, "A mosque caretaker and his son are killed in a sectarian attack."], ["2002.04.01", "India", "Bowan-Watsar", 1, 1, "Islamic terrorists kill a teacher inside his home in an attack that also injures his young son."], ["2002.04.01", "Pakistan", "Spin Qaira", 2, 12, "Bomb explodes on a passenger bus, killing at least two people."], ["2002.04.02", "India", "Tabaloo-Sung", 2, 0, "Two policemen are killed in a village ambush by the Mujahideen."], ["2002.04.03", "India", "Chanchora", 2, 1, "Terrorists attack the house of a civilian, killing his son.  Elsewhere (Handwara) a man is abducted and murdered."], ["2002.04.04", "India", "Baramulla", 4, 0, "In a brutal attack, Tehreek-e-Jehad-e-Islami members enter the house of a civilian and shoot him to death, along with his wife, daughter and another girl."], ["2002.04.04", "India", "Lopra", 1, 0, "A public works employee is murdered outside his residence."], ["2002.04.04", "Indonesia", "Ambon", 5, 57, "An Islamist throws a bomb into a Christian center, killing five and injuring fifty-seven other innocents."], ["2002.04.06", "Israel", "Rafiah Yam", 1, 5, "Palestinian gunman opens fire at the entrance to a settlement. One is killed, five are wounded."], ["2002.04.08", "Afghanistan", "Jalalabad", 9, 92, "A terrorist bomb explodes near a government convoy. Nine are killed, ninety-two are injured."], ["2002.04.08", "India", "Dandli Dansal", 8, 6, "A horrific assault by Hizbul Mujahideen on a village leaves seven persons, including three children and two women dead.  Another child subsequently dies of injuries."], ["2002.04.09", "India", "Kokernag", 2, 11, "A grenade attack by militant Muslims leaves two civilians dead and eleven others, including three girls, critically injured."], ["2002.04.09", "India", "Kulgam", 2, 0, "Two brothers are abducted and murdered by Lashkar-e-Toiba."], ["2002.04.09", "Israel", "Jenin", 13, 7, "Thirteen IDF reservists are killed and seven injured by the combined efforts of a very young Palestinian suicide bomber and supporting gunfire."], ["2002.04.10", "Israel", "Yagur", 8, 22, "Eight people are killed by a Muslim bomber while riding on a bus. Twenty-two others are injured in the attack."], ["2002.04.11", "Tunisia", "Erriadh", 21, 18, "Islamic suicide bomber kills twenty-one in an attack on town's oldest synagogue. Youngest fatality is an 11-year-old German boy."], ["2002.04.12", "India", "Kashmir", 10, 17, "Four separate Fedayeen attacks across the region leave ten innocents dead and at least seventeen others injured."], ["2002.04.12", "Israel", "Jerusalem", 6, 104, "Six people, including two Chinese nationals, are killed by a Palestinian suicide bomber at a bus stop in an attack that leaves one-hundred and four others injured."], ["2002.04.13", "India", "Bonkoot", 1, 2, "A Mujahideen attack on a security patrol leaves one member dead."], ["2002.04.14", "India", "Pulwama", 1, 9, "A grenade lobbed onto the road by a militant Muslim kills a civilian and injures nine others."], ["2002.04.15", "India", "Doda", 1, 0, "A woman is cut down by Muslim terrorists."], ["2002.04.16", "India", "Awantipora", 2, 4, "Two civilians are killed in a bomb blast at a market."], ["2002.04.16", "India", "Srinagar", 2, 0, "The Mujahideen kills two civilians with an IED."], ["2002.04.18", "India", "Dooru", 1, 0, "A civilian is abducted and killed by Islamic terrorists."], ["2002.04.20", "India", "Milan", 3, 4, "The Mujahideen attacks a security patrol, killing three members."], ["2002.04.20", "India", "Sagarian Azmatabad", 2, 0, "Islamists kill a man and his grandmother at their residence."], ["2002.04.21", "Pakistan", "Karachi", 1, 0, "A physician succumbs to injuries suffered in a sectarian attack."], ["2002.04.22", "India", "Kashmir", 3, 0, "In separate attacks, two people are abducted and killed, and a woman is killed inside her home by Islamic militants."], ["2002.04.22", "India", "Nagam", 2, 0, "Two laborers are shot to death by Islamic terrorists."], ["2002.04.23", "Bangladesh", "Chittagong", 1, 0, "A Buddhist monk is stabbed to death by Islamic terrorists after returning home from prayers."], ["2002.04.23", "India", "Shopian", 1, 3, "Four students are kidnapped and 'severely' tortured.  A 15-year-old dies and the others are freed."], ["2002.04.24", "Algeria", "al-Jeije", 16, 0, "Fundamentalists kill a total of sixteen includes eight children and four women, all from the same family."], ["2002.04.25", "Algeria", "Mashraat Sava", 4, 0, "Armed Islamic attack kills four people."], ["2002.04.25", "India", "Dharmsal", 2, 0, "Two civilians are abducted by militant Muslims.  Their bodies are recovered four days later."], ["2002.04.25", "India", "Gharat Morh", 1, 2, "A civilian is killed when Islamic militants lob a bomb under a passenger bus.  Twenty-one others are injured."], ["2002.04.25", "Pakistan", "Lahore", 12, 25, "Radical Sunnis bomb a Shia ceremony, slaughtering twelve, including seven women and five children.  Twenty-five others suffer injury."], ["2002.04.27", "Israel", "Adora", 4, 7, "Palestinian terrorists dressed in IDF uniforms infiltrate a settlement and killed four civilians, including a 5-year old boy. Seven others were injured."], ["2002.04.28", "Indonesia", "Soya", 12, 6, "Muslims attack a Christian village with knives and guns. They are able to slaughter twelve people and hurt six more."], ["2002.04.28", "Sudan", "Shoba Karika", 24, 23, "An Arab militia attacks two villages, killing about two dozen African civilians and burning many houses.  At least that many are injured as well."], ["2002.04.29", "India", "Sangarwani Keller", 1, 0, "A civilian is abducted and murdered by the Mujahideen."], ["2002.05.01", "Bangladesh", "Natore", 1, 25, "Islamic fundamentalists bomb a cinema, killing a young boy and injuring two dozen others."], ["2002.05.01", "Pakistan", "Karachi", 0, 20, "Two blasts, occurring at a market and a nursery, injure twenty, including children."], ["2002.05.01", "Pakistan", "Muzaffarabad", 1, 4, "A bombing kills a 5-year-old boy and injures four of his family members."], ["2002.05.02", "Algeria", "Kasar Shalala", 20, 5, "Islamist attack on civilians in the Teyart region leaves twenty dead."], ["2002.05.02", "Algeria", "Sedi Khaled", 11, 0, "Eleven civilians, including children, are massacred by Islamic fundamentalists."], ["2002.05.02", "India", "Athwatoo", 1, 0, "A civilian is abducted and murdered by the Mujahideen."], ["2002.05.02", "Pakistan", "Karachi", 1, 4, "A man is killed by a bomb in his own home.  Four family members are injured."], ["2002.05.03", "India", "Bandipore", 3, 0, "Islamists behead two brothers and shoot another civilian dead in a separate attack."], ["2002.05.04", "India", "Madiyani", 5, 0, "Hizb-ul-Mujahideen murder five people, including two brothers and a father and son in an overnight raid."], ["2002.05.05", "India", "Kashmir", 2, 0, "Two civilians are murdered by the Mujahideen in separate attacks (Hajipora & Budhal)."], ["2002.05.05", "Pakistan", "Karachi", 1, 0, "A Sunni activist is slain in a sectarian attack."], ["2002.05.05", "Pakistan", "Karachi", 1, 0, "Policeman killed by Islamist gunmen."], ["2002.05.06", "Pakistan", "Karachi", 3, 0, "Three persons - principal of a government institute, his driver and assistant - are killed in an ambush by armed fundamentalists."], ["2002.05.07", "Israel", "Rishon Lezion", 15, 55, "Fifteen people are killed and fifty-five more injured in a Fedayeen suicide attack on a crowded game club."], ["2002.05.07", "Pakistan", "Karachi", 1, 0, "Another sectarian killing by two gunmen."], ["2002.05.07", "Pakistan", "Lahore", 3, 0, "Noted religious scholar Ghulam Murtaza Malik, his driver and a police personnel are shot to death by Islamists.."], ["2002.05.08", "India", "Morha Bagla", 1, 0, "Two Jihad terrorists kill a man after getting directions from him."], ["2002.05.08", "Pakistan", "Karachi", 16, 34, "Twelve French nationals and four Pakistanis are killed and 34 more injured in a suicide bombing against a bus opposite Sheraton Hotel."], ["2002.05.09", "Dagestan", "Kaspiisk", 45, 170, "Chechen terrorists detonate a bomb at a Russian military parade, slaughtering forty-five innocents and injuring more than one-hundred and seventy."], ["2002.05.09", "India", "Dalwa", 1, 1, "Lashkar-e-Toiba abduct two brothers who refuse to join them.  Both are tortured, with one dying."], ["2002.05.09", "Pakistan", "Rawalpindi", 2, 1, "Two policemen killed and one injured in Islamist attack."], ["2002.05.10", "India", "Kither", 1, 1, "The Mujahideen kill one civilian and severely injure another in their homes."], ["2002.05.10", "India", "Nandipora-Beerwah", 2, 0, "A man and his elderly father are killed inside their home by militant Muslims."], ["2002.05.12", "India", "Butshungni-Winder", 2, 2, "The Mujahideen kill two civilians, critically injure another and abduct a fourth."], ["2002.05.13", "India", "Sarawa", 1, 0, "Lashkar-e-Toiba terrorists force their way into a home and kill a man's son for his refusal to join them."], ["2002.05.14", "Algeria", "Baraqi", 5, 0, "Five policeman are assassinated by fundamentalists in two separate attacks (first attack was in Dali Ibrahim)."], ["2002.05.14", "Algeria", "Tazmalt", 7, 5, "Religious fundamentalists set off a bomb at the entrance to a market."], ["2002.05.14", "India", "Kaluchak", 36, 48, "Islamic militants raid a military camp, killing thirty-six people, mostly the wives and children of Indian soldiers, including a 2-month-old child."], ["2002.05.16", "Indonesia", "Tamonjeka", 2, 0, "Two Christian men are killed by suspected Muslim radicals."], ["2002.05.17", "India", "Bonkoot", 1, 1, "Jaish-e-Mohammed murder an 18-year-old and injure his mother as she tries to protect him."], ["2002.05.17", "India", "Jammu", 2, 16, "Two are killed in militant Muslim bomb blast."], ["2002.05.19", "India", "Chasana", 4, 7, "Fedayeen attack on Indian military camp kills four and leaves seven injured."], ["2002.05.19", "Israel", "Netanya", 3, 59, "A Palestinian suicide bomber kills three and injures fifty-nine other shoppers at a market."], ["2002.05.21", "Pakistan", "Karachi", 1, 12, "One person is killed in a sectarian attack on a Shia religious procession."], ["2002.05.22", "India", "Kashmir", 5, 3, "Five people are killed by the Mujahideen in four separate attacks."], ["2002.05.22", "Israel", "Rishon Lezion", 2, 40, "A Palestinian suicide bomber kills two and injures forty people at a shopping mall."], ["2002.05.22", "Pakistan", "Gulistan-e-Mustafa", 1, 0, "A Sunni activist is killed in a sectarian attack."], ["2002.05.23", "India", "Kashmir", 2, 10, "Two civilians are separately abducted and murdered by the Mujahideen (Kandi, Warpora).  Ten others are injured in a grenade attack at a bus station."], ["2002.05.24", "India", "Kupwara", 2, 0, "Two civilians are killed in separate attacks by Islamic terrorists (one in captivity)."], ["2002.05.25", "India", "Shopian", 9, 0, "Nine persons are injured in a grenade attack on a city street."], ["2002.05.25", "Indonesia", "Saparua", 5, 11, "A Muslim boat attack kills five Christians and wounds eleven others."], ["2002.05.27", "Israel", "Petah Tikva", 2, 37, "Fatah takes credit for killing a 14-month-old baby and her grandmother near an ice-cream parlor in an attack that also injured thirty-seven."], ["2002.05.27", "USA", "Denton, TX", 1, 0, "Muslim snipers kill a man as he works in his yard."], ["2002.05.28", "India", "Sharat Shopian", 2, 0, "The Mujahideen murder two sisters."], ["2002.05.28", "Israel", "Itamar", 3, 2, "Palestinian gunman kills three teenagers and injures another two. All youths were playing basketball in their community at the time."], ["2002.05.30", "India", "Doda", 3, 3, "A Fedayeen attack on a police station leaves three officers dead and three injured."], ["2002.05.30", "India", "Thanna Mandi", 2, 1, "A female police officer and a civilian are killed in a Mujahideen attack."], ["2002.05.30", "India", "Thuru", 2, 0, "Two security personnel are killed in a Jihad ambush."], ["2002.05.30", "Pakistan", "Karachi", 1, 0, "The female principle of a private school is shot to death by Islamists as she is walking to the building."], ["2002.05.31", "India", "Gonikhan", 1, 16, "A Jihadi kills a young child and injures sixteen others with a grenade."], ["2002.05.31", "India", "Srinagar", 0, 14, "Fourteen people are critically injured in a grenade attack by a militant Muslim."], ["2002.06.01", "India", "Anantnag", 0, 18, "Three women are among eighteen victims of a grenade attack on a city street."], ["2002.06.02", "England", "Orpington, Kent", 1, 0, "33-year-old British man beaten to death by a Muslim gang."], ["2002.06.02", "India", "Kashmir", 2, 0, "Two civilians are murdered is separate Mujahideen attacks (Gudder & Botingo)."], ["2002.06.02", "Philippines", "Jolo", 1, 2, "Abu Sayyaf militants abduct three sailors and hold them for nearly a year.  Two escape and one is executed."], ["2002.06.03", "India", "Dureja", 1, 0, "Muslims kill a woman for granting official approval to an inter-religious marriage."], ["2002.06.05", "India", "Bangalore", 2, 0, "A Christian man and his Muslim wife are captured and hacked to death by her family for marrying outside Islam.  Their one-year-old baby is spared."], ["2002.06.05", "India", "Kashmir", 3, 0, "Three civilians are killed by Jihadis in separate attacks."], ["2002.06.05", "Indonesia", "Tentena", 4, 17, "A bomb planted by Muslim radicals explodes on a church bus killing four, including the pastor, and wounding seventeen."], ["2002.06.05", "Israel", "Afula", 17, 38, "Seventeen people killed by a Muslim suicide bomber while riding in a bus. Thirty-eight others were injured."], ["2002.06.06", "Afghanistan", "Kabul", 2, 0, "The country's Deputy President and his driver are assassinated by the Taliban."], ["2002.06.06", "Nigeria", "Katsina", 1, 0, "A Muslim mob clubs a Christian police officer to death after a cleric makes false charges that he trampled a Qur'an."], ["2002.06.08", "India", "Mahore", 4, 0, "Four village guards are captured and killed by Muslim terrorists posing as policemen."], ["2002.06.08", "India", "Sultan Pathri", 3, 0, "Three security forces are killed in a Mujahideen ambush."], ["2002.06.09", "India", "Berneli", 4, 0, "In a brutal slaying, Islamic terrorists abduct four brothers from a wedding party, then execute them."], ["2002.06.09", "India", "Poonch", 1, 0, "Jihadis kill a woman and set fire to three homes."], ["2002.06.09", "Indonesia", "Kayamanya", 1, 0, "An older Christian man is beheaded by a Muslim."], ["2002.06.09", "Pakistan", "Mashkey", 2, 0, "A BNP party leader is assassinated along with an associate."], ["2002.06.10", "Afghanistan", "Kabul", 1, 0, "A government official is stabbed to death by a crowd of Muslims."], ["2002.06.10", "India", "Gambhir Mugalan", 1, 0, "Militant Muslims abduct a girl on the day of her wedding, then cut off her head."], ["2002.06.10", "India", "Kashmir", 3, 0, "The Mujahideen kill three civilians in separate attacks, including a school teacher."], ["2002.06.11", "Algeria", "al-Medya", 12, 9, "Armed Islamists open fire on a train.  One dozen passengers are murdered and several more are injured."], ["2002.06.11", "India", "Surankote", 2, 0, "Two civilians are abducted, tortured and killed by militant Muslims."], ["2002.06.11", "Pakistan", "Lahore", 1, 0, "A man is murdered in prison by a member of the Anjaman-e-Sipahe Sahaba extremist group after being sentenced for blasphemy."], ["2002.06.13", "India", "Dharam Chowki", 2, 0, "Muslim terrorists force entry into two houses and behead two civilians."], ["2002.06.14", "Pakistan", "Karachi", 10, 51, "Ten persons, including five women, killed and fifty-one others injured in a car-bomb blast outside the US Consulate."], ["2002.06.15", "India", "Bindra", 3, 1, "Lashkar-e-Toiba terrorists lob a grenade at a group of Hindus returning from a pilgrimage, killing three children and injuring an adult."], ["2002.06.15", "Pakistan", "Faisalabad", 0, 1, "A 16-year-old Christian girl is doused with acid for refusing to convert to Islam."], ["2002.06.16", "India", "Balmakote", 5, 3, "Five villagers are killed by Jihadis in an overnight attack."], ["2002.06.17", "Pakistan", "Multan", 3, 0, "Radical Sunnis open fire on Shia worshippers as they are leaving a mosque.  Three people are killed."], ["2002.06.18", "India", "Branwar", 2, 0, "The Mujahideen barge into the home of a civilian and kill him, along with his wife."], ["2002.06.18", "Israel", "Jerusalem", 19, 50, "Several children on their way to school are among the nineteen dead and fifty injured by Fedayeen (\"holy warrior\") suicide attack on a bus."], ["2002.06.19", "India", "Khanyar", 1, 0, "A political activist is killed by al Umar Mujahideen."], ["2002.06.19", "Israel", "Jerusalem", 7, 35, "One day after killing nineteen Jews, a second Muslim blows up a bus-stop killing seven more. Thirty-five are injured."], ["2002.06.20", "Israel", "Itamar", 4, 4, "Mother and three young sons killed in their home by Muslim invader."], ["2002.06.21", "India", "Kashmir", 2, 0, "Two civilians are abducted and murdered by the Mujahideen (Zallah Charote & Bandipora)."], ["2002.06.26", "India", "Chak Rishipora", 2, 0, "A man and his wife are shot to death in their home by Muslim terrorists."], ["2002.06.27", "Algeria", "Bou Ismail", 2, 0, "Two Islamic terrorists shot dead a bus driver and one passenger."], ["2002.06.27", "India", "Gurwatan Bahak", 5, 0, "Five members of a family of shepherds are massacred by the Mujahideen."], ["2002.06.27", "India", "Lal Chowk", 1, 37, "A woman is killed, and thirty-seven others injured when a militant Muslim hurls a grenade into the street."], ["2002.06.27", "Pakistan", "Kachi Abadi", 1, 2, "15-year old Christian tortured to death by police for blasphemy. In the same country a 17-year old Christian girl was blinded from having acid thrown in her face and another girl was raped (occurring on different days)."], ["2002.06.27", "Pakistan", "Multan", 1, 0, "A Shia activist is shot to death in a sectarian attack."], ["2002.06.28", "Algeria", "Algiers", 13, 0, "Islamic radicals riddle a bus with machine guns. Thirteen people are killed, an unknown number are wounded."], ["2002.06.28", "India", "Kakran-Kulgam", 1, 0, "A policeman is abducted and murdered by the Mujahideen."], ["2002.06.29", "India", "Basuni", 3, 0, "Three migrant workers are kidnapped and killed by Islamic terrorists."], ["2002.06.30", "India", "Gadyari", 1, 0, "The Mujahideen attack a wedding, killing a civilian."], ["2002.07.01", "India", "Kashmir", 3, 0, "The Mujahideen murder three civilians in separate attacks."], ["2002.07.02", "India", "Singhpura Chatru", 1, 0, "A man is abducted from his home and killed by Muslim terrorists."], ["2002.07.03", "Indonesia", "Landangan", 1, 0, "Muslim gunmen murder a Christian man."], ["2002.07.03", "Pakistan", "Kohat", 2, 2, "Two Pakistani security forces are killed when al-Qaeda militants stage an attack on a bridge."], ["2002.07.04", "India", "Kashmir", 2, 0, "Two civilians are killed in their homes by the Mujahideen (Bandipora & Shah Mohallah)."], ["2002.07.04", "USA", "Los Angeles", 2, 0, "Muslim gunman kills two people waiting at the El Al counter in the LAX airport."], ["2002.07.05", "Algeria", "al-Arbaa", 49, 17, "Bomb explosion results in the largest number of killings by Islamic fundamentalists since the beginning of the year."], ["2002.07.05", "India", "Gandoh", 3, 1, "A village herdsman is among three people killed by Islamic militants in separate attacks."], ["2002.07.05", "India", "Khansaheb", 0, 16, "Muslim militant lobs a hand grenade at a group of Hindus, injuring sixteen, including four women."], ["2002.07.07", "Algeria", "Algiers", 6, 0, "Six persons including four children were stabbed to death by Islamic extremists while grazing sheep."], ["2002.07.07", "India", "Handwara", 1, 0, "A boy is shot and killed by Muslim terrorists."], ["2002.07.07", "India", "Kasblari", 1, 0, "The Mujahideen intrude into a residence and behead and elderly man who refuses to give up the location of his son and grandson."], ["2002.07.07", "Indonesia", "Wayura", 1, 0, "A Christian fisherman is shot in the head by suspected Islamists."], ["2002.07.07", "Philippines", "Unknown", 2, 1, "Kidnapped American missionary and Philippine nurse are killed during rescue attempt."], ["2002.07.10", "India", "Surankote", 1, 0, "The body of a civilian, kidnapped and beheaded by the Mujahideen, is recovered."], ["2002.07.11", "India", "Ghat Palhalan", 2, 1, "Islamists attack a marriage party, killing two civilians and injuring another."], ["2002.07.11", "India", "Warpora", 1, 0, "A man is killed by the same Muslim terrorists who killed his brother two years earlier."], ["2002.07.12", "Indonesia", "Kawua", 1, 4, "Islamic bombers nearly crash a bus carrying Christians.  Only one passenger is killed by the explosion."], ["2002.07.13", "Algeria", "Algiers", 10, 0, "Victims in two separate attacks by fundamentalists include four women and two children from one family."], ["2002.07.13", "India", "Jammu", 28, 30, "Lashkar-e-Toiba terrorists staged an attack on a Hindu shantytown, killing twenty-eight and injuring more than thirty with grenades and firearms."], ["2002.07.13", "India", "Khrew", 1, 0, "Hizb-ul-Mujahideen cadres gun down a civilian in his home."], ["2002.07.13", "Pakistan", "Mansehra", 0, 12, "Twelve persons, including seven Germans, injured in a terrorist attack at an Archaeological site."], ["2002.07.14", "India", "Rajdhani", 1, 0, "A woman is murdered in her home by Muslim terrorists."], ["2002.07.15", "India", "Sambora", 1, 0, "A man is gunned down by the Mujahideen while traveling down a road."], ["2002.07.16", "Algeria", "Wilad Alal", 7, 0, "Seven family members slaughtered by Islamic fundamentalists, including a father, mother and three children ages 4, 12, and 14."], ["2002.07.16", "India", "Sarna", 1, 0, "Islamic militants kill a village headsmen in his home."], ["2002.07.17", "India", "Aishmuqam", 3, 9, "Hizb-ul-Mujahideen kill three people and injure nine, including three women, with a mine blast."], ["2002.07.17", "India", "Bonkoot", 3, 3, "Three security forces are killed in a Fedayeen ambush."], ["2002.07.17", "India", "Kashmir", 3, 0, "Three people, including a 16-year-old boy, are killed by Muslims in separate terror attacks."], ["2002.07.17", "Israel", "Emmanuel", 7, 26, "Palestinian attack on a bus kills at least seven and injures twenty-six."], ["2002.07.17", "Israel", "Tel Aviv", 3, 40, "Dual Palestinian suicide attack on an Israeli convenience store leaves at least three dead and more than forty injured."], ["2002.07.19", "Indonesia", "Poso", 2, 0, "Two Hindus make easy marks for Muslim snipers."], ["2002.07.20", "India", "Hill Tak", 3, 0, "Three people are abducted by Muslims, tortured and then beheaded."], ["2002.07.21", "India", "Wali-Dok", 1, 0, "A man abducted from his home is killed in captivity two days later."], ["2002.07.22", "Indonesia", "Mayoa", 0, 3, "Three Christian farmers survive a brutal shooting attack by Jihad warriors."], ["2002.07.23", "India", "Halla", 3, 0, "Three brothers are killed by militant Muslims while gathering firewood."], ["2002.07.23", "India", "Rajouri", 1, 27, "A young girl is killed, and twenty-seven others injured when a militant Muslim throws a grenade into a city street."], ["2002.07.24", "India", "Anantnag", 0, 20, "Twenty persons at a crowded bus stand sustain injuries from an Islamist grenade attack."], ["2002.07.24", "India", "Chanser", 2, 0, "Two border guards are cut down by the Mujahideen."], ["2002.07.25", "India", "Batmaloo", 1, 23, "A civilian is killed at a bus stand, and two dozen others injured, when a militant Muslim tosses a hand grenade."], ["2002.07.26", "India", "Budgam", 3, 0, "Three political activists are kidnapped and killed by the Mujahideen."], ["2002.07.26", "Israel", "Hebron", 4, 3, "Four people, including a mother, father and son, were killed by gunmen while riding in two cars."], ["2002.07.27", "India", "Badgam", 4, 3, "Four civilians are killed when Muslims set off a grenade blast at a market."], ["2002.07.28", "India", "Surankote", 1, 0, "A man is abducted and brutally tortured to death by Islamic militants."], ["2002.07.28", "India", "Thanna Mandi", 1, 1, "Lashkar-e-Toiba terrorists kill a civilian in his home in an attack that also injures his mother."], ["2002.07.29", "India", "Mangota", 1, 4, "Five civilians are abducted and tortured by the Mujahideen.  At least one succumbs to death."], ["2002.07.29", "India", "Rajpura", 0, 15, "Women and children are among fifteen civilians injured in a grenade attack on a city street."], ["2002.07.30", "India", "Anantnag", 2, 5, "Muslim terrorist attacks a car carrying Hindu pilgrims with a grenade, killing two family members."], ["2002.07.30", "India", "Kashmir", 3, 0, "Three civilians are killed in separate Mujahideen attacks, including a boy who is abducted and murdered."], ["2002.07.30", "Israel", "Jerusalem", 0, 7, "Fedayeen suicide bomber injures seven civilians."], ["2002.07.31", "India", "Shahdara Sharief", 1, 0, "A youth is murdered by the Lashkar-e-Toiba."], ["2002.07.31", "India", "Tral", 3, 2, "Jaish-e-Mohammed terrorists stage a political assassination that leaves three people dead."], ["2002.07.31", "Israel", "Jerusalem", 9, 90, "Nine students, including five Americans, are killed in a bombing at a Hebrew University cafeteria. More than 90 others were injured."], ["2002.08.01", "India", "Raika", 2, 1, "A Lashkar-e-Toiba terrorist kills two police officers in an ambush."], ["2002.08.02", "India", "Ichhgooza", 1, 0, "A civilian is murdered in his home by the Mujahideen."], ["2002.08.03", "India", "Kashmir", 2, 0, "Two civilians killed in separate attacks (Koochipora & Srinagar)."], ["2002.08.03", "Israel", "Jerusalem", 1, 2, "Palestinian gunman kills telephone truck driver and wounds two other passengers."], ["2002.08.04", "India", "Morha Badana", 1, 0, "Hizbul Mujahideen kidnap a man, behead him, and then hang his headless body from a bridge."], ["2002.08.04", "Indonesia", "Matako", 0, 8, "A Muslim mob screaming praises to Allah sweeps through a Christian village, burning homes and churches, and shooting residents."], ["2002.08.04", "Israel", "Meron Junction", 8, 50, "Suicide bomber kills eight and injures over fifty in an attack on a bus."], ["2002.08.05", "Pakistan", "Jhika Gali, Murree", 6, 4, "Six persons killed and four others injured in terrorist attack on Christian missionary school."], ["2002.08.06", "India", "Handwara", 9, 3, "Fedayeen attack on a security camp is one of two attacks that leave nine Indians dead."], ["2002.08.06", "India", "Nar", 2, 0, "A man and his wife are killed in their home by the Mujahideen."], ["2002.08.06", "India", "Pahalgam", 9, 32, "Nine Hindu pilgrims are massacred in a senseless attack by Fedayeen.  Approximately thirty others sustain various injuries."], ["2002.08.06", "India", "Rajouri", 0, 12, "Twelve civilians are injured in a militant grenade attack near a hospital."], ["2002.08.07", "India", "Surankote", 3, 0, "Three people, including one woman, are killed in two separate attacks on residences."], ["2002.08.07", "Indonesia", "Tentena", 1, 4, "An Italian tourist is killed by Jihad terrorists. Four others are injured."], ["2002.08.08", "Algeria", "Algiers", 6, 1, "Five persons are killed by a machine-gun fired from an open car in a drive-by. Islamists also assassinated a man in Tazrout."], ["2002.08.08", "India", "Bijbehara", 0, 15, "A grenade tossed by an Islamist on a city street injures fifteen civilians."], ["2002.08.08", "India", "Patrara", 4, 0, "Two women and two children, all family members, are slaughtered in a barbaric attack by militant Muslims."], ["2002.08.09", "Indonesia", "Malei", 2, 0, "Jihad warriors attack two Christian villages and kill two people."], ["2002.08.09", "Pakistan", "Taxila", 3, 24, "Three women and a terrorist are killed, and 24 others injured as terrorists attack John C. Heinrich Memorial chapel in the Mission Hospital."], ["2002.08.10", "Philippines", "Unknown", 2, 4, "Abu Sayyaf kidnap six missionaries. Two are subsequently beheaded."], ["2002.08.11", "India", "Sarawa", 3, 0, "Three civilians are senselessly murdered by the Mujahideen."], ["2002.08.11", "Indonesia", "Kayamanya", 5, 0, "A Muslim mob attacks a bus and one other vehicle, killing five Christians, including one who was burned."], ["2002.08.13", "India", "Kulgam", 1, 21, "A militant Muslim lobs a grenade into a bus station, killing one civilian and injuring twenty-one others."], ["2002.08.15", "Algeria", "Harshoun", 26, 0, "Islamists attacked and slaughtered three families including women and children."], ["2002.08.15", "Indonesia", "Manyomba", 1, 3, "Fifty militants attack two Christian villages. They shoot three people and strangle a 3-year-old child to death."], ["2002.08.15", "Iraq", "Baghdad", 1, 0, "A 71-year-old nun is savagely attacked and stabbed to death in a monastery by Islamic extremists, who then behead her."], ["2002.08.16", "India", "Fatehpur", 1, 0, "A man who refuses to work for the Mujahideen is abducted and killed for his principles."], ["2002.08.18", "India", "Bana", 2, 0, "A man and his son are killed by the Mujahideen in a home invasion."], ["2002.08.18", "India", "Bhat Pura", 1, 0, "A woman is killed by Islamists in her home."], ["2002.08.18", "Pakistan", "Skardu", 1, 3, "A youth is killed and three women injured in a sectarian bombing attack."], ["2002.08.20", "India", "Gund", 0, 1, "Hizb-ul-Mujahideen kill two security forces with a land mine."], ["2002.08.22", "India", "Gorihakhar", 2, 0, "Two civilians are abducted from their homes and murdered by the Mujahideen."], ["2002.08.22", "India", "Lassana", 2, 2, "Militant Muslims ambush a security patrol, killing two members."], ["2002.08.23", "India", "Rajouri", 4, 19, "The Mujahideen murder four civilians in separate attacks and injure nineteen with a grenade."], ["2002.08.23", "India", "Srinagar", 2, 0, "Two civilians are gunned down at a shrine."], ["2002.08.23", "India", "Thanna Mandi", 10, 0, "Lashkar-e-Toiba terrorists massacre ten civilians including three women in two separate incidents."], ["2002.08.25", "India", "Reka Chowk", 0, 12, "Twelve civilians are injured when a Muslim tosses a grenade into a city street."], ["2002.08.25", "India", "Surankote", 4, 1, "Three family members are killed, and a surviving child badly injured, by a Mujahideen attack on their car."], ["2002.08.26", "India", "Kashmir", 4, 1, "A woman is among four victims of the Mujahideen, killed in separate attacks."], ["2002.08.30", "India", "Kashmir", 5, 2, "Five separate Mujahideen attacks leave five civilians dead and two injured."], ["2002.08.31", "India", "Maalbani", 3, 0, "Muslims drag two woman and a man out of their house, then rake them with machine-gun fire."], ["2002.08.31", "India", "Raie Kashte", 1, 0, "The Mujahideen kill an elderly man in his home."], ["2002.08.31", "Indonesia", "Irian Jaya", 3, 12, "Three teachers, including two Americans, are killed by Indonesian soldiers."], ["2002.09.01", "Afghanistan", "Kabul", 1, 3, "Taliban bombing kills one, injures three others."], ["2002.09.01", "Algeria", "Bantous", 4, 6, "Ambush of a military vehicle by armed Islamists leaves four innocents dead."], ["2002.09.01", "India", "Gounthal", 2, 1, "Muslim terrorists kill the two young sons of a government official in an attack that also injures his daughter."], ["2002.09.02", "India", "Kashmir", 4, 20, "Four Mujahideen attacks leave four civilians dead (including one who was beheaded).  A grenade attack (Hadyal Chowk) injures nineteen, including a child."], ["2002.09.04", "India", "Pulwama", 3, 0, "Three people are killed in two attacks by the Mujahideen."], ["2002.09.05", "Afghanistan", "Kabul", 22, 65, "Bomb explodes in busy Kabul marketplace. At least twenty-two civilians are killed, sixty-five are taken to the hospital."], ["2002.09.05", "Pakistan", "North Nazimabad", 1, 0, "A religious leader is killed in a sectarian attack."], ["2002.09.06", "Afghanistan", "Akora Khattak", 1, 2, "Muslim militants disguise a bomb as a toy.  One 6-year-old girl is killed, and her two sisters injured."], ["2002.09.06", "India", "Gorihakhar", 4, 2, "Jamiat-ul-Mujahideen murder four people in an ambush, including an election candidate."], ["2002.09.08", "India", "Kashmir", 2, 7, "Two civilians are killed, and seven injured, in three separate attacks by Islamic militants."], ["2002.09.08", "Indonesia", "Galunggung", 1, 0, "A Christian is beaten, then burned to death by a Muslim mob."], ["2002.09.09", "India", "Batmaloo", 0, 13, "Thirteen civilians are injured when a Muslim tosses a grenade onto a city street."], ["2002.09.09", "India", "Lower Dubri", 4, 2, "Four people are killed when the Mujahideen ambush a security patrol."], ["2002.09.09", "India", "Thanna Mandi", 5, 1, "Five members of the minority community, including two couples are massacred by militant Muslims."], ["2002.09.10", "India", "Kashmir", 5, 23, "Five Mujahideen attacks leave five civilians dead and twenty-three injured."], ["2002.09.11", "India", "Kupwara", 4, 5, "A Muslim terrorist dresses in women's clothes to sneak weapons into a political rally.  He guns down four innocents."], ["2002.09.11", "India", "Poonch", 14, 22, "Fourteen people are mowed down at an election rally by the Mujahideen."], ["2002.09.11", "India", "Surankote", 12, 22, "Terrorists use grenades and arms fire to kill ten security force personnel and two civilians in an ambush."], ["2002.09.15", "Pakistan", "Hyderabad", 1, 5, "One person is killed and five others, including a girl, injured in a bomb explosion in a Karachi-bound bus."], ["2002.09.16", "India", "Hasote", 1, 2, "The Mujahideen kill a young boy and seriously injure his grandparents."], ["2002.09.16", "India", "Seri Khwaja", 1, 0, "A child is killed in an attack by Muslim militants against a polling station."], ["2002.09.16", "Pakistan", "Miranshah", 1, 1, "A woman is killed and a child injured in a toy-bomb explosion."], ["2002.09.18", "India", "Golibud", 1, 0, "A forest worker is abducted and beheaded."], ["2002.09.18", "India", "Katarmal", 10, 0, "Ten people are killed by a Mujahideen ambush."], ["2002.09.18", "India", "Srinagar", 2, 0, "Two political leaders are murdered by Lashkar-e-Toiba."], ["2002.09.19", "India", "Doda", 2, 0, "The Mujahideen abduct and murder two civilians."], ["2002.09.19", "India", "Jamsalan", 2, 0, "Militant Muslims stage an attack on a school, killing a teacher and a student."], ["2002.09.19", "Israel", "Tel Aviv", 5, 40, "Five Israelis are massacred in a bus bombing by Palestinian terrorists that also injures more than forty others."], ["2002.09.21", "India", "Hadipora", 2, 0, "Two apple orchard workers are murdered by the Mujahideen."], ["2002.09.21", "India", "Palpora", 1, 0, "A man is killed in his home by Islamic terrorists."], ["2002.09.21", "Indonesia", "Kelang", 2, 2, "Two Christians are killed and two wounded by Muslim gunmen."], ["2002.09.21", "USA", "Atlanta, GA", 1, 0, "Muslim terrorists gun down an employee at a liquor store."], ["2002.09.21", "USA", "Montgomery, AL", 1, 1, "A Muslim sniper takes down one woman and injures another."], ["2002.09.23", "USA", "Baton Rouge", 1, 0, "Muslim sniper shoots a Korean mother in the back."], ["2002.09.24", "India", "Ahmedabad", 31, 86, "Hindu monks and dozens of worshippers were massacred in an attack on a Hindu temple members of Lashkar-e-Toiba, an Islamic extremist group."], ["2002.09.24", "India", "Bijbehera", 2, 0, "Islamists kill two civilians with a grenade."], ["2002.09.24", "India", "Shamdilli", 1, 0, "A woman is killed inside her home by Muslim radicals."], ["2002.09.24", "India", "Udhyanpur", 2, 0, "A man and woman are murdered by the Mujahideen in their village."], ["2002.09.25", "India", "Mogla", 5, 3, "Five border guards are killed in an ambush by Islamic radicals."], ["2002.09.25", "Pakistan", "Karachi", 7, 3, "Seven persons are killed and three others injured in a terrorist attack on a Christian welfare organization's office - the Idara Amn-O-Insaaf (Institute for Peace and Justice). The victims were blind-folded, tied to chairs and shot in the head."], ["2002.09.26", "India", "Maroti", 1, 2, "The Mujahideen murder a civilian in a brutal attack."], ["2002.09.26", "India", "Pulwama", 0, 14, "Fourteen civilians sustain injury when a militant Muslim hurls a grenade into a marketplace."], ["2002.09.28", "Bangladesh", "Satkhira", 3, 125, "Islamic fundamentalists bomb a local cinema and also hurl bombs at female performers at a circus in two attacks that kill three and leave over one-hundred injured."], ["2002.09.28", "India", "Anantnag", 3, 4, "Muslim terrorists use an IED to kill three civilians and injure four more on a road."], ["2002.09.29", "India", "Kashmir", 2, 0, "The Mujahideen kill two civilians in separate attacks (Battal & Akhal Bhatpora)"], ["2002.09.29", "India", "Tral", 1, 17, "One person is killed, and seventeen others injured when a Muslim tosses a grenade into the road."], ["2002.09.29", "Saudi Arabia", "Riyadh", 1, 0, "A terrorist car bomb kills one German national."], ["2002.09.30", "India", "Graogund", 7, 1, "Seven Indian security forces are killed in a landmine attack on their vehicle."], ["2002.09.30", "India", "Saran Khadi", 1, 1, "A man and his wife are abducted by the Mujahideen.  The husband is murdered.  Fate of his wife is unknown."], ["2002.10.01", "India", "Hiranagar", 8, 10, "Al-Mansoor terrorists open fire on a passenger bus with automatic weapons, killing eight people and injuring ten."], ["2002.10.02", "India", "Manda Morh", 2, 22, "Two Hindu pilgrims, including a young girl, bleed out after Muslim terrorists detonate an IED under a bus."], ["2002.10.02", "India", "Pastoona", 5, 1, "Five members of a bomb squad are killed when Islamists detonate a remote-controlled device as they are trying to defuse it."], ["2002.10.02", "Philippines", "Zamboanga", 4, 24, "Abu Sayyaf bomb outside a restaurant kills four, including an American, and injures at least two dozen more."], ["2002.10.02", "USA", "Wheaton, MD", 1, 0, "Muslim sniper kills 55-year-old man."], ["2002.10.03", "Algeria", "Wadi Shurfa", 12, 2, "Twelve persons from two families are killed by Islamists. One woman is kidnapped and one child was injured."], ["2002.10.03", "India", "Doda", 2, 0, "Two civilians are killed in their homes by the Mujahideen in separate attacks."], ["2002.10.03", "USA", "Maryland", 5, 0, "Muslim sniper kills three men and two women in five separate attacks."], ["2002.10.04", "India", "Kashmir", 6, 0, "Six people are killed in three separate Jihad attacks."], ["2002.10.06", "India", "Kashmir", 3, 1, "Two Mujahideen attacks leave three civilians dead.  One was killed in his home for participating in an election."], ["2002.10.06", "Yemen", "Coast", 1, 0, "al-Qaeda suicide boat detonates explosives next to French tanker, killing one crewman."], ["2002.10.07", "India", "Kashmir", 3, 1, "Three civilians are killed in three attacks.  One other person is abducted."], ["2002.10.08", "India", "Doda", 2, 5, "Lashkar-e-Toiba terrorists attack a polling station, killing two people."], ["2002.10.08", "Israel", "Zief Junction", 1, 3, "A Palestinian terrorist shoots and Israeli to death."], ["2002.10.08", "Kuwait", "Failaka", 1, 1, "One Marine is killed, another wounded in terrorist attack."], ["2002.10.09", "India", "Sorabati", 2, 7, "Two security forces are killed in a Jihadi landmine attack.  Six others injured."], ["2002.10.09", "USA", "Manassas, VA", 1, 0, "Muslim sniper kills 53-year-old man."], ["2002.10.10", "Israel", "Tel Aviv", 1, 20, "Muslim bomber kills a 71-year-old grandmother of fifteen."], ["2002.10.10", "Philippines", "Kidapawan City", 6, 10, "An Abu Sayyaf bomb at a crowded bus stop sends six souls to Allah."], ["2002.10.11", "India", "Kangan", 1, 6, "A civilian is killed in a grenade attack by Muslim militants."], ["2002.10.11", "USA", "Fredericksburg, VA", 1, 0, "Muslim sniper kills 53-year-old man."], ["2002.10.12", "Indonesia", "Bali", 202, 300, "Series of Al-Qaeda bombs in nightclubs kill more than two-hundred people, injure at least three-hundred more."], ["2002.10.14", "USA", "Falls Church, VA", 1, 0, "A Muslim sniper takes down a 47-year-old woman."], ["2002.10.15", "India", "Lawaypora", 3, 0, "Radical Muslims fire on a house, killing three family members."], ["2002.10.16", "Algeria", "Boukaat El Hadjadj", 13, 1, "Early morning Islamic extremist attack on a Western Algerian village kills thirteen boys who were students at al-Fiqh and injures one."], ["2002.10.16", "Algeria", "al-Qantara al-Zarqa", 2, 0, "Two unarmed civilians are murdered by Islamic fundamentalists."], ["2002.10.16", "India", "Rajpura", 2, 1, "Islamic terrorists force their way into a widow's home and kill her in an attack that also leaves her son seriously injured.  Elsewhere (Parihote) a civilian is abducted and murdered."], ["2002.10.16", "Pakistan", "Karachi", 0, 9, "Nine people are injured in a series of Lashkar-e-Jhangvi bomb blasts."], ["2002.10.17", "Philippines", "Zamboanga", 7, 152, "Moro Islamic Front bombings at two department stores kill seven and injure one-hundred and fifty-two."], ["2002.10.18", "India", "Kupwara", 3, 2, "Three people are killed when Islamic terrorists attack a search party."], ["2002.10.18", "Philippines", "Manila", 2, 19, "An Abu Sayyaf bus bomb kills two passengers and injures nineteen."], ["2002.10.19", "India", "Kashmir", 3, 5, "Three attacks leave three people dead, including a man who died defending his wife in his home from Jihadis."], ["2002.10.20", "India", "Kashmir", 2, 0, "Two people, including a young student, are murdered by the Mujahideen."], ["2002.10.20", "Pakistan", "Punjab", 1, 20, "An 11-year-old girl is killed, and twenty others injured by a bomb placed in a flower vase."], ["2002.10.20", "Philippines", "Zamboanga", 1, 18, "A Roman Catholic shrine is bombed by Muslim terrorists. One killed, eighteen injured."], ["2002.10.21", "Algeria", "Ain Kechra", 7, 5, "Seven ordinary people have their throats slit and five more are kidnapped by armed Islamists in a rural area."], ["2002.10.21", "India", "Tral", 1, 8, "Muslim militants kill a woman with an IED.  Eight others are injured in a separate blast at Kulgam."], ["2002.10.21", "Israel", "Tel Aviv", 16, 24, "Hamas (Islamic Resistance) car bombers kills at least sixteen people riding on a bus. More than twenty-four are injured."], ["2002.10.22", "India", "Kashmir", 5, 7, "Five civilians are murdered by the Mujahideen in four separate attacks."], ["2002.10.22", "USA", "Silver Spring, MD", 1, 0, "Muslim sniper kills 35-year-old bus driver."], ["2002.10.23", "India", "Danis", 1, 0, "A man is abducted by radical Muslims, who then behead him."], ["2002.10.24", "India", "Sonargund", 1, 0, "A retired teacher is murdered by the Mujahideen."], ["2002.10.24", "Nigeria", "Fajul", 40, 48, "At least forty Christians are killed by a Muslim mob of several thousand, who also rape women and burn churches."], ["2002.10.25", "Algeria", "Boukaat Ouled Abdellah", 21, 3, "Twenty-one people from the same family were shot and stabbed to death, including a three-year old child. Three others survived with injuries."], ["2002.10.25", "India", "Goza Mohalla", 2, 1, "Muslim terrorists attack a taxi, killing the driver and a passenger."], ["2002.10.26", "Russia", "Moscow", 129, 150, "Chechen Muslims storm a theater and hold 916 people hostage in appalling conditions. Several are shot and killed and others die in the rescue attempt."], ["2002.10.28", "Jordan", "Amman", 1, 0, "An American diplomat is shot dead by two al-Qaeda terrorists while sitting in his car."], ["2002.10.29", "India", "Srinagar", 7, 0, "Seven members of the Indian security forces are gunned down by Mujahideen members in separate incidents. Several were off-duty at the time."], ["2002.10.29", "Israel", "Hermesh", 3, 1, "Palestinian terrorist infiltrate a settlement and kill one woman and two girls."], ["2002.10.30", "Algeria", "Boukaat Sidi Bouaissa", 8, 0, "Armed Muslim terrorists kill eight, including four children in a gruesome attack."], ["2002.10.31", "Israel", "Gaza", 3, 6, "Hamas (Islamic Resistance) bomb goes off prematurely killing three and injuring six, including a 10-year-old girl."], ["2002.10.31", "Nigeria", "Zaria", 20, 51, "Muslims go on a rampage against Christian students at a local college, killing twenty and injuring over fifty."], ["2002.11.01", "India", "Kashmir", 3, 2, "Three civilians are killed in separate attacks, including a young girl who was abducted from Shangus and tortured."], ["2002.11.01", "Pakistan", "Lahore", 1, 0, "A Shia doctor is murdered in a sectarian attack."], ["2002.11.01", "Pakistan", "Quetta", 2, 0, "Fundamentalists kill two policemen."], ["2002.11.02", "India", "Budgam", 2, 0, "The Mujahideen abduct and murder two civilians."], ["2002.11.02", "India", "Mastandara", 2, 2, "In a home invasion, Jihadis murder a man and his daughter.  Two children are injured in the attack."], ["2002.11.02", "India", "Naik Mohalla Palhalan", 2, 0, "A man and woman are kidnapped from their home and killed in captivity by radical Muslims."], ["2002.11.02", "India", "Srinagar", 3, 0, "Muslim rebels assassinate an Indian politician along with two bodyguards."], ["2002.11.04", "India", "Madaana", 4, 1, "The Mujahideen attacks a funeral party, killing four civilians and injuring at least one other."], ["2002.11.04", "India", "Rajouri", 1, 14, "Fourteen people are injured in a bomb blast at a hotel that also kills a 5-year-old girl."], ["2002.11.04", "Israel", "Kfar Saba", 2, 40, "Jihad suicide bomber kills two mall shoppers and wounds more than forty with a powerful blast."], ["2002.11.05", "India", "Doda", 3, 0, "Three civilians are killed in separate attacks, including a village leader at a wedding."], ["2002.11.06", "India", "Achhabal", 2, 11, "Two civilians are killed when militant Muslims hurl a grenade into a bus stand."], ["2002.11.07", "Algeria", "Chlef", 4, 6, "Islamic terrorists machine-gun a bus. Four civilians are killed, six are injured."], ["2002.11.07", "India", "Billawar", 2, 0, "The Hizb-ul-Mujahideen kills two policemen who were brothers."], ["2002.11.08", "India", "Kashmir", 5, 0, "Five people are killed in three attacks by Jaish-e-Mohammed cadres."], ["2002.11.10", "Israel", "Metzer", 5, 0, "Palestinian gunman kills five including mother and her two children ages 4 and 5. She was in the process of reading a bedtime story."], ["2002.11.11", "India", "Rajouri", 1, 0, "The Mujahideen kill a 6-year-old boy inside his home."], ["2002.11.11", "India", "Srinagar", 13, 5, "Mine planted by Islamic militant kills thirteen civilians and injures five."], ["2002.11.12", "Algeria", "Medea", 2, 0, "Islamic fundamentalist gunmen burst into a cafe and kill two patrons."], ["2002.11.13", "India", "Kapran-Dooru", 1, 0, "A civilian is killed in his residence by the Mujahideen."], ["2002.11.14", "India", "Kashmir", 2, 2, "Two home invasions leave two civilians dead and two women injured."], ["2002.11.15", "Israel", "Hebron", 12, 14, "Palestinian ambush kills twelve and injures fourteen. Victims were returning from a prayer service."], ["2002.11.15", "Pakistan", "Hyderabad", 2, 9, "Islamists bomb a bus killing two civilians and injuring nine."], ["2002.11.16", "Algeria", "Azeffoun", 1, 0, "Policeman gunned down by armed Islamists as he was leaving his home."], ["2002.11.17", "India", "Gool", 1, 0, "A civilian is abducted and murdered by the Mujahideen."], ["2002.11.18", "Israel", "Rimonim Junction", 1, 0, "Woman killed by Palestinian gunmen in a drive-by."], ["2002.11.19", "India", "Barsoo", 1, 0, "Islamists kill the widow of a man they killed four years earlier."], ["2002.11.20", "Algeria", "El-Ancer", 3, 1, "Islamic extremists attack a family. They kill the father and his two daughters (ages 3 and 5) then severely wound the mother."], ["2002.11.20", "India", "Kashmir", 3, 2, "The Mujahideen kill three civilians in separate attacks."], ["2002.11.20", "Israel", "Tulkarm", 1, 1, "Palestinian bomb explodes prematurely. Kills one, injures one."], ["2002.11.21", "Algeria", "Ain Rich", 6, 2, "Terrorist bombing by Islamic fundamentalists kills six and injures two."], ["2002.11.21", "India", "Anantnag", 2, 0, "Two civilians are abducted from their homes an murdered by the Mujahideen."], ["2002.11.21", "India", "Sarurnagar", 2, 20, "Bomb placed near Hindu temple by the Mujahideen kills two and injures at least twenty."], ["2002.11.21", "Israel", "Jerusalem", 11, 50, "Muslim bomber kills eleven and injures over fifty passengers on a bus. Most victims were high-school students."], ["2002.11.21", "Kuwait", "Arifjan", 0, 2, "Two soldiers in Kuwait wounded by Islamist terrorist. One is shot in the face."], ["2002.11.21", "Lebanon", "Sidon", 1, 0, "Female missionary shot three times in the head by Muslim radicals."], ["2002.11.22", "India", "Srinagar", 6, 9, "Islamic suicide attack kills six and injures nine."], ["2002.11.22", "Nigeria", "Kaduna", 216, 521, "A Muslim mob, angered by an insult to Muhammad, burns 58 Christian churches and rampages through the streets stabbing, bludgeoning and burning over two hundred people to death."], ["2002.11.23", "Algeria", "Tizi Ouzou", 9, 12, "Nine soldiers killed and twelve wounded after militant Islamic ambush."], ["2002.11.23", "India", "Lower Munda", 19, 34, "The Mujahideen kill nineteen, including three women and two children, with an IED."], ["2002.11.24", "India", "Jammu", 12, 45, "Twelve Hindu worshippers are killed and more than forty-five wounded when Islamic gunmen attack two historic temples."], ["2002.11.24", "India", "Tral", 2, 1, "Islamic terrorists kidnap three people, including a woman, and torture two of them to death."], ["2002.11.25", "India", "Kashmir", 3, 0, "Three civilians, including a shop owner, are killed in separate attacks by the Mujahideen."], ["2002.11.26", "India", "Waterhail", 3, 0, "Muslims force their way into a home and abduct three family members, including two women.  All are tortured to death."], ["2002.11.27", "India", "Kashmir", 2, 0, "One of two men killed by the Mujahideen refused to direct them to a police officer's home."], ["2002.11.28", "Israel", "Beit Shean", 6, 35, "Two Palestinian gunmen kill four Israelis who were waiting for a bus. More than two dozen people were also injured."], ["2002.11.28", "Kenya", "Mombasa", 13, 26, "Three suicide bombers kill twelve people, including two children. More than two dozen people were hurt. Muslim attackers also fired two missiles at an Israeli plane carrying 261 people."], ["2002.12.01", "India", "Bilalabad Mohalla", 3, 3, "Fedayeen attack kills three people."], ["2002.12.01", "India", "Hari Mohalla", 1, 0, "Disgruntled Muslims enter the home of a civilian and kill his daughter."], ["2002.12.01", "India", "Srinagar", 1, 8, "A civilian is killed in a Mujahideen grenade attack.  Eight others are injured."], ["2002.12.02", "Algeria", "Relizane", 4, 6, "Armed Muslim fundamentalists kill four and wound six civilians in an attack."], ["2002.12.02", "India", "Ghatkopar", 2, 34, "Students Islamic Movement thought responsible for Indian bus blast killing two and injuring thirty-four."], ["2002.12.03", "India", "Manyalan", 4, 0, "Two civilians are abducted and murdered by Islamic militants.  Two others are killed in Arin and Karnah."], ["2002.12.05", "India", "Bhagwa", 1, 3, "Islamic terrorists kill a man for refusing to hand over his son.  Three other family members are injured."], ["2002.12.05", "Indonesia", "Makassar", 3, 11, "Bomb blast rips through a McDonald's restaurant killing three people and injuring several more.  Islamic extremists take credit."], ["2002.12.05", "Pakistan", "Karachi", 3, 0, "Macedonian embassy bombed in Karachi. Three bodies are found."], ["2002.12.06", "Bangladesh", "Mymenshingh", 27, 200, "Four bombs detonate concurrently at four packed movie cinemas killing twenty-seven and injuring over two-hundred.  Muslim fundamentalists had been critical of entertainment venues and those who frequented them."], ["2002.12.07", "Pakistan", "Shahkas", 4, 7, "Four members of a family are killed by an IED."], ["2002.12.12", "Algeria", "Boukadir", 4, 16, "Bomb blast in a market kills four and injures sixteen."], ["2002.12.12", "India", "Joura", 1, 0, "A man is killed in his home by Mujahideen."], ["2002.12.12", "India", "Pulwama", 0, 26, "Grenade attack by Muslim separatists injures twenty-six civilians."], ["2002.12.12", "Israel", "Hebron", 2, 0, "Israeli man and woman killed in an ambush shooting attack by Palestinians."], ["2002.12.12", "Nigeria", "Rim", 13, 0, "Muslim nomads attack a Christian village and kill thirteen people including a clergyman and his family."], ["2002.12.13", "Algeria", "Sidi Baizid", 6, 0, "Three adults and three children are killed during an attack by Islamic extremists."], ["2002.12.13", "Chechnya", "Grozny", 2, 2, "Device detonated beneath a convoy escorting a water-transportation vehicle kills two and injures two."], ["2002.12.14", "Algeria", "Sidi Baizid", 3, 0, "Three shepherds are abducted by Islamic militants.  They are found dead, with their throats slit."], ["2002.12.16", "India", "Rajouri", 2, 6, "A Mujahideen grenade attack outside a pharmacy leaves two people dead and six injured."], ["2002.12.18", "Algeria", "Sidi Medjaded", 10, 0, "Ambush by Islamic hardliners kills ten people."], ["2002.12.19", "India", "Kashmir", 2, 20, "Two soldiers are killed and about twenty other people, including civilians were killed in separate grenade and shooting attacks by Muslim rebels."], ["2002.12.19", "Pakistan", "Karachi", 3, 0, "At massive terrorist bomb explodes early, killing the bomb maker and three others."], ["2002.12.20", "India", "Hangal", 1, 0, "A man is abducted and beheaded by the Mujahideen."], ["2002.12.20", "India", "Paraott", 3, 0, "Muslim attackers invade the home of three young women who were not wearing veils.  They killed the three by slitting the throats of two and then shooting a third."], ["2002.12.21", "Pakistan", "Hyderabad", 2, 7, "Two people are killed, and seven more injured by a bus bomb."], ["2002.12.22", "India", "Reban", 4, 3, "Terrorists invade a house, force victims to recite Muslim passage, then kill four of them, including a four-year old boy.  Three other family members are wounded."], ["2002.12.22", "India", "Surankote", 3, 2, "Three young boys are shot to death at point-blank range by Islamic radicals, who attack their house.  Two family members are badly injured."], ["2002.12.24", "India", "Bela Khwas", 2, 2, "The Mujahideen kill two villagers and injure two more."], ["2002.12.24", "India", "Mahore", 2, 0, "Two people, including a woman, are murdered in their home by the Mujahideen."], ["2002.12.24", "Philippines", "Cotabato", 17, 13, "Islamic militants blow up bomb using remote control.  The seventeen killed include the town's mayor.  More than a dozen others were injured."], ["2002.12.25", "India", "Doda", 2, 0, "A woman is among two people killed in a Jihad attack."], ["2002.12.25", "India", "Gopalpora", 3, 0, "A teacher and his two sons are gunned down by Muslim radicals."], ["2002.12.25", "Pakistan", "Daska", 3, 14, "Christmas grenade attack on a Christian church kills three girls and injures fourteen young women."], ["2002.12.26", "Philippines", "Mindanao", 12, 10, "Muslim rebels ambush employees of a Canadian company.  Twelve civilians are killed and ten injured."], ["2002.12.27", "Chechnya", "Grozny", 80, 127, "Three Fedayeen suicide bombers kill more than eighty Russians and Chechens.  At least one-hundred and twenty-seven people are injured in the attacks."], ["2002.12.27", "Israel", "Otniel", 4, 6, "Palestinian gunman breaks into a Jewish seminary and kills four students who were sitting down to Sabbath dinner, wounds six others."], ["2002.12.28", "Algeria", "Boudouaou", 1, 5, "Attack by Islamic extremists leaves one policeman dead and five injured."], ["2002.12.28", "India", "Srinagar", 2, 0, "Al-Madeena terrorists gun down two police officers near a hotel."], ["2002.12.30", "India", "Bijbehara", 1, 0, "The Mujahideen abduct and kill a civilian in a brutal attack."], ["2002.12.30", "Yemen", "Jibla", 3, 1, "Muslim gunman posing as a father carrying a child kills three American humanitarian workers at a missionary hospital and wounds one other."], ["2002.12.31", "India", "Surankote", 2, 4, "A young girl is killed and her three family members injured when Muslim militants use them as human shields after attacking a security patrol."], ["2002.12.31", "Philippines", "Tacurong", 10, 20, "Grenade hurled by Islamic fundamentalist at a crowd of people celebrating the new year kills ten and injures about twenty."]], "columns": ["Date", "Country", "City", "Killed", "Injured", "Description"], "year": 2002}