{"rows": [["2002-02-21", "Peru", "Lima", 9, 30, "At least nine people were killed and 30 injured by a powerful car bomb which went off near the United States embassy in Lima."], ["2002-04-07", "Colombia", "Villavicencio", 12, 70, "Two bombs explode in the restaurant district of Villavicencio, killing twelve and injuring 70. FARC is the prime suspect for the attack."], ["2002-04-14", "Colombia", "Barranquilla", 2, 20, "During an assassination attempt of then-presidential candidate Álvaro Uribe Vélez a bomb kills two and injures 20 in Barranquilla. Rebel group FARC is blamed."], ["2002-04-19", "Colombia", "Cartagena", 3, 10, "Two bombs, allegedly placed by FARC kill three and injure ten near Cartagena."], ["2002-05-02", "Colombia", "Colombia", 119, 98, "Bojayá massacre: FARC launches a mortar bomb against a church during combats with AUC, killing at least 117 civilians, 48 of them children in what is known as the Bojayá massacre. Delayed response from the authorities make it impossible to establish a final count, as most of the dead were buried before they could be accounted for."], ["2002-05-03", "United States", "Midwest US", 0, 6, "Luke Helder injures 6 by placing pipebombs in mailboxes in the Midwest. Motivation to protest government control over daily lives and the illegality of marijuana and promotion of astral projection."], ["2002-07-07", "Colombia", "Bogotá, Colombia", 0, 6, "Three round of mortars are fired against an Army base in Bogotá, injuring six. FARC is blamed for the attack."], ["2002-07-07", "Colombia", "Bogotá, Colombia", 13, 50, "Four rounds of mortars are fired against the Presidential Palace in Bogotá during the inauguration ceremony of President Álvaro Uribe Vélez. 13 people, mostly homeless, die and 50 are wounded when some of the rounds hit slums in downtown Bogotá. FARC is blamed."], ["2002-07-09", "India", "Rafiganj", 130, 150, "A train derailment kills 130 people in the Rafiganj rail disaster. Naxalite (Communist guerrilla groups in India) terrorism is suspected."], ["2002-07-28", "Colombia Cali", "Colombia", 0, 0, "A carbomb partially destroys government buildings in Cali. FARC is blamed for the attack. No casualties."], ["2002-10-11", "Finland", "Myyrmanni, Finland", 6, 166, "Myyrmanni bombing: A bomb explosion kills 7 people including the perpetrator and wounds 166 people at Myyrmanni shopping mall."], ["2002-10-22", "Colombia", "Bogotá", 3, 11, "A bomb kills three and wounds at least eleven in Bogotá. No claims are made for the attack."], ["2002-10-30", "South Africa", "Soweto", 1, 3, "2002 Soweto bombings: Eight bombings across Soweto target a mosque, the Nan Hua Temple as well as railways and petrol stations across the city. One woman is killed and her husband and two other people were injured. A group calling itself \"Warriors of the Boer Nation\" claimed responsibility."], ["2002-11-19", "Colombia", "Cúcuta, Colombia", 0, 0, "Police deactivate a bomb left by ELN members in front of newspaper La Opinión in Cúcuta."], ["2002-12-09", "Colombia", "Western Bogotá, Colombia", 0, 50, "A car bomb injures 50 in western Bogotá. Authorities blame FARC."], ["2002-12-13", "Colombia", "Downtown Bogotá, Colombia", 0, 30, "A package bomb injures 32 on the 30th floor of the Intercontinental Hotel in downtown Bogotá. No groups claim responsibility."], ["2002-12-17", "Colombia", "Colombia", 1, 20, "A bomb blast kills one and injures 20 in Neiva. The bomb was placed outside the building of the National Telecommunications Company, Telecom Colombia. Authorities suspect FARC is responsible for the attack."], ["2003-02-07", "Colombia", "El Nogal", 36, 200, "Club bombing: A car bomb blew up in the parking garage of an elite club in Bogota. (FARC)"], ["2003-03-05", "Colombia", "Cúcuta", 6, 68, "A car bomb kills six and injures 68 in a covered parking lot in Cúcuta. Rebel group ELN is blamed for the attack. (ELN)"], ["2003-08-10", "United States", "West Virginia", 3, 0, "sniper: Three people were killed in a series of sniper shootings in West Virginia. Eight years after the shootings, a suspect named Shawn Lester was arrested and was eventually convicted and sentenced to 46 years in prison for the shootings. (Shawn Lester)"], ["2003-08-24", "Colombia", "Puerto Rico", 6, 28, "Six die and 28 are wounded when a bomb explodes in a riverboat in the town of Puerto Rico. Rebel group FARC is blamed. (FARC)"], ["2003-09-11", "Colombia", "Chita", 8, 15, "A bomb strapped to a horse kills eight and injures 15 in the village of Chita. The attack is blamed on FARC, as the same technique had been used in the past. (FARC)"], ["2003-09-29", "Colombia", "Caquetá", 10, 54, "A motorcycle packed with explosives kills ten and injures 54 in downtown Florencia, capital of Caquetá. Rebel group FARC is blamed. (FARC)"], ["2003-10-08", "Colombia", "Bogotá", 6, 11, "A car bomb kills six and injures eleven in downtown Bogotá. FARC is blamed. (FARC)"], ["2003-12-08", "United States", "Abbeville", 2, 0, "Two police officers are killed in 14-hour shootout and standoff with three self-proclaimed \"sovereign citizens\" in Abbeville, South Carolina. (Arthur, Rita and Steven Bixby)"], ["2004-01-15", "Colombia", "Puerto Guzman", 1, 0, "Luis Alberto Campos, a municipal councilor in Puerto Guzman, was murdered. Campos was dragged from his house and killed by a group who claimed to be from the 32nd Revolutionary Armed Forces of Columbia (FARC) front. This is the first politician elected at the local level to be murdered this year. (FARC)"], ["2004-01-16", "Nepal", "Dharann.", 3, 5, "Three people were killed and five injured when rebels of the Communist Party of Nepal-Maoists (CPN-M) planted a bomb in a bus headed for Dharan township. The device detonated as the bus was being stopped at a security checkpoint. One police officer, the bus driver and a passenger were killed. (Communist Party of Nepal-Maoists)"], ["2004-02-12", "Nepal", "Kabhre District.", 6, 13, "Maoist rebels from the Communist Party of Nepal-Maoists (CPN-M) hurled bombs at a passenger bus killing at least six people. The bus was carrying civilians as well as some soldiers to the Kabhre district. (Communist Party of Nepal-Maoists)"], ["2004-02-21", "Republic of Ireland", "Dublin", 5, 17, "Five people died and 17 were injured when Ulster Loyalists bombed a bus in central Dublin. (Ulster Loyalists)"], ["2004-03-01", "Sri Lanka", "Batticola District.", 1, 2, "A United National Party candidate for the Batticola District in an upcoming election was gunned down yesterday in the first polls-related killing. The Liberation Tigers of Tamil Eelam (LTTE) is suspected in the attack; the candidate resisted an earlier warning from the group. Unidentified gunmen had attempted to shoot him Sunday night. A niece and nephew living in the same house were also attacked. (Tigers of Tamil Eelam (LTTE))"], ["2004-03-08", "Israel", "Jerusalem.", 0, 2, "Dozens of ultra-Orthodox Jews attacked Arab taxi drivers with rocks in the Me'a Sharim neighborhood of Jerusalem. One driver was wounded and his car was damaged. The second driver was lightly hurt and sent to hospital. (ultra-Orthodox Jews)"], ["2004-04-03", "Nepal", "Dhading District.", 1, 2, "An office employee was killed and other injured when a bomb went off at the District Education Office in Dhading district. The Communist Party of Nepal-Maoists (CPN-M) is responsible for the attack. (The Communist Party of Nepal-Maoists (CPN-M))"], ["2004-04-22", "Colombia", "Bogota.", 6, 82, "A bomb exploded in a crowded tavern/discothèque at 11:00 pm Saturday night killing six (some reports indicate seven) and wounding eighty-two. The bomb was packed in a small suitcase and left in the bathroom by suspected Revolutionary Armed Forces of Colombia (FARC) rebels. It is believed the bombing is part of a FARC campaign marking the organizations 40th anniversary. (FARC)"], ["2004-04-27", "Nepal", "Annapur.", 1, 2, "Maoists, believed members of the Communist Party of Nepal-Maoists (CPN-M) killed a newspaper delivery driver who defied the latest guerrilla anti-government strike. A homemade bomb was thrown at the driver who was delivering the Annapur Post. Two other passengers were injured. The CPN-M had demanded that all traffic stay off the roads in the western Himalayan kingdom as a series of strikes leading up to a three-day nationwide shutdown were taking place. (Communist Party of Nepal-Maoists)"], ["2004-06-08", "India", "Assam.", 0, 23, "Twenty-three were injured when suspected United Liberation Front of Assam (ULFA) militants threw a grenade into a crowded cinema hall during a town screening of a Hindi movie. The police say that the attacks may be connected to a ULFA call for the banning of Hindi movies last year. The group opposes the state film industry and is believed to have been responsible for explosions at other cinemas in Assam. (Front of Assam (ULFA))"], ["2004-06-08", "Italy", "Bologna.", 0, 6, "An explosive device, made of a bottle full of inflammable liquid, a detonator and a timer, detonated at a political rally in Bologna, which featured National Alliance party leader Gianfranco Fini. The device exploded in the middle of Fini's speech, injuring six people, but causing no major damage. The bomb had been hidden inside an election vehicle on the side of the stage and only the detonator managed to explode. (Anarchists)"], ["2004-06-15", "Colombia", "La Gabarra.", 34, 0, "Presumed Revolutionary Armed Forces of Colombia (FARC) guerillas killed thirty-four farm workers in La Gabarra. Reports indicate that the workers were coca growers which led to different ideas about the motivation on the massacre. Some believe that it was caused by an ongoing battle between different armed groups over the control of coca productions and thus economic interests. Others speculate that the attack was a destabilizing act aimed at provoking an AUC reaction and thus sabotaging the peace process. (FARC)"], ["2004-06-24", "India", "Assam.", 5, 15, "Five passengers on a minibus were killed when United Liberation Front of Assam (ULFA) militants triggered a time bomb. Fifteen others were injured in the blast."], ["2004-07-02", "Nepal", "Pokhara.", 1, 1, "Members of the Communists Party of Nepal-Maoists (CPN-M) shot the mayor of Pokhara, a major tourist town. Mayor Harkha Gurung was driving through a crowded market place on his way to work, when a pedestrian stopped to shake his hand. When the mayor stopped to talk to the person, they shot him in the face at close range. Two other Maoists rush forward and also opened fire, on the mayor who received five bullet wounds to the head and chest. The mayor's driver was injured in the attack. (Communist Party of Nepal-Maoists)"], ["2004-07-02", "Turkey", "Van.", 5, 24, "A remote-detonated explosive device exploded in Blue Plaza on Ordu Boulevard in Van as Hikmet Tan, the governor of Van was passing through with his convoy. Five people were killed and twenty-four other injured by the blast. Hikmet was uninjured by the bomb. A Kurdish organization calling itself the Kurdistan Freedom Hawks (TAK) claimed responsibility for this assassination attempt. In their claim of responsibility, the group writes, \"we will speak in a language that the Turkish state will understand and we will develop our revolutionary resistance struggle in a more radical manner in the face of the unjust and ugly policy that is currently being pursued by the Turkish state.\". (Kurdistan Freedom Hawks (TAK))"], ["2004-08-26", "India", "Assam", 5, 43, "Two blasts on bus transportation links killed five people and injured 43 in insurgent racked Assam province. (Front of Assam (ULFA))"], ["2004-09-04", "Colombia", "Colombia", 4, 14, "Hooded gunmen opened fire on a congregation inside a church located near Colombia's border with Ecuador. Four parishioners were killed and fourteen wounded in the attack. Army officials believe the Revolutionary Armed Forces of Columbia (FARC) carried out the attack because the church had spoken out against the FARC's forced recruitment of local youth. It was reported the Protestant pastors in the region had preciously received death threats. (FARC)"], ["2004-10-02", "India", "Assam", 10, 40, "A second bomb blast occurred at the busy Hong Kong market, almost simultaneously with the railway blast in Assam. The bomb killed ten people and injured at least forty others. The two blasts are thought to have been coordinated. (Front of Assam (ULFA))"], ["2004-10-02", "India", "Assam", 12, 60, "Twelve people were killed and at least sixty others injured in a bomb blasts targeting a rail line in Assam. The first occurred at the Dimapur railway station, and resulted in the deaths of all twelve people. The platform was packed with people waiting to board a train to Assam's Karbi district. (Front of Assam (ULFA))"], ["2004-10-02", "India", "Assam", 13, 23, "In Assam militants exploded a bomb that killed thirteen people and injured twenty-three. The National Democratic Front of Bodoland (NDFB) is believed to be responsible for the attack. The intended target of the attack is unclear. (Front of Assam (ULFA))"], ["2004-10-03", "India", "Kashmir", 3, 25, "The National Democratic Front of Bodoland (NDFB) bombed a market in Dhubri District, killing three and wounding twenty-five people. No further information is provided. (Front of Assam (ULFA))"], ["2004-11-28", "Colombia", "Bogota", 1, 6, "A bomb exploded beside the mayor's office in the Rafael Uribe district of Bogotá on Sunday evening. Initial reports indicated the Revolutionary Armed Forces of Colombia (FARC) were involved. The only fatality was the person who was carrying the bomb. Those injured where passengers in a bus traveling by when the explosion took place. Otherwise the explosion damaged the building and broke the windows of the bus. (Unknown)"], ["2004-11-29", "Colombia", "Bogota.", 2, 2, "A bomb exploded near a bus stop along Bogotá's Transmilenio bus system route. A taxi passing by was caught in the blast resulting in the death of the driver and a passenger. Two other passengers were also injured. The explosion damaged about 30 houses in the area. The chief of police believes the attack was aimed at the bus stop but did not comment on the motive of the attack or who was responsible for it. The Transmilenio system has been the target of at least three attacks. (Unknown)"], ["2004-11-30", "Colombia", "Bogota", 3, 8, "Three people were killed and eight wounded when a fragment grenade was left at a supermarket checkout counter. It is believed that the National Liberation Army (ELN) is behind the attack which was carried out in retaliation for the recent capture of one of their chiefs. A man who left the bomb quickly fled through the back exit. (Unknown)"], ["2004-12-14", "India", "Assam", 2, 8, "Two explosions occurred near the Assam Assembly building. The attacks were carried out by the United Liberation Front of Assam (ULFA). Two persons were killed and eight injured. Authorities believe that the group carried out these attacks to mark the completion of a year of the Bhutan operations that have \"evicted the ULFA from the Himalayan kingdom.\" (United Liberation Front of Assam (ULFA))"], ["2005-04-07", "Myanmar", "Yangon", 11, 162, "May 2005 Yangon Bombings: Two supermarkets are bombed nearly simultaneously. (Karen National Union (suspected))"], ["2005-06-06", "Nepal", "Badarmude, Nepal", 45, 71, "Badarmude bus explosion: A bomb was detonated near a bus while is passing across a bridge, causing the bridge collapse. (Communist Party of Nepal (suspected))"], ["2005-06-16", "Turkey", "Kuşadası", 5, 14, "A bomb exploded on a minibus carrying people to a beach (PKK (suspected))"], ["2005-08-15", "Sri Lanka", "Sri Lanka", 2, 0, "Lakshman Kadirgamar, the foreign minister of Sri Lanka and an ethnic Tamil was shot by an alleged LTTE sniper. (LTTE)"], ["2005-10-01", "United States", "United States", 0, 0, "2005 University of Oklahoma bombing: Joel Henry Hinrichs III detonated a bomb near the packed football stadium at the University of Oklahoma in Norman, Oklahoma killing himself in the process. (Joel Henry Hinrichs III)"], ["2006-02-06", "Spain GRAPO", "", 1, 1, "(First of October Anti-Fascist Resistance Group) shot dead Ana Isabel Herrero, owner of a temporary work agency, and injured another person in Zaragoza. This was the last attack of this organization. (First of October Anti-Fascist Resistance Group)"], ["2006-06-15", "Sri Lanka", "", 68, 60, "The LTTE detonate two claymore mines targeting a bus carrying 140 civilians. 68 civilians, including ten children, three pregnant women and their unborns, are killed. Approximately 60 civilians are injured. (Unknown)"], ["2006-07-31", "Colombia:", "", 17, 22, "16 soldiers die in an ambush in Tibu and a car bomb kills one and injures 22 in Bogotá. Both attacks are blamed on FARC. (FARC)"], ["2006-08-04", "Colombia:", "", 5, 0, "A car bomb kills five outside a police station in Cali. The local government blames FARC. (FARC)"], ["2006-09-18", "Sri Lanka", "", 92, 0, "An LTTE suicide bomber rams a truck packed with explosives into convoy of buses carrying unarmed Sri Lankan Navy personal going home, on leave, killing at least 92 Navy Personnel. The Government of Sri Lanka called this a terrorist attack (LTTE)"], ["2006-10-28", "Colombia", "", 2, 4, "A car bomb kills two and injures four outside a military base in Villavicencio, Meta. FARC is blamed. (FARC)"], ["2007-01-05", "Sri Lanka", "Nittambuwa", 6, 30, "A bus is bombed. The government blames Tamil Tiger, who denies it. See 2007 Sri Lankan bus bombs. (Unknown)"], ["2007-01-06", "Sri Lanka", "Hikkaduwa", 15, 24, "A bus is bombed. The government blames Tamil Tiger, who denies it. (Unknown)"], ["2007-01-10", "Philippines", "General Santos City, Kidapawan City, Cotabato City", 7, 27, "Three bombs exploded in cities across Mindanao ahead of the ASEAN summit held in Manila, killing a total of 7 and injuring at last 27. (Unknown)"], ["2007-01-17", "India", "Dispur, Assam", 2, 12, "A bomb planted in a vegetable carton by suspected members of the United Liberation Front of Assam (ULFA) exploded in a market in Dispur on January 17. Two people, including a child, were killed and 12 people were injured in the attack. (ULFA)"], ["2007-02-19", "India", "Samjhauta", 68, 49, "A train headed toward Lahore an hour after it leaves New Delhi; two bombs explode. See 2007 Samjhauta Express bombings (Abhinav Bharat)"], ["2007-03-16", "Colombia", "Buenaventura: A bomb kills 16 and injures 16 in Buenaventura. Authorities blame FARC.", 16, 16, "FARC"], ["2007-05-18", "India", "Hyderabad: Attack on Mecca Masjid. For details, see 18 May 2007 Mecca Masjid bombing", 16, 100, "Rashtriya Swayamsevak Sangh (Suspected)"], ["2007-10-21", "Turkey", "Hakkâri Province", 12, 16, "PKK stages an attack on the Turkish outpost in Hakkari. The attack wounds 16 and kills 12 Turkish soldiers carried out of northern Iraq. Also, eight soldiers are kidnapped. (PKK)"], ["2008-01-16", "Sri Lanka", "Buttala", 30, 65, "A civilian bus was bombed, and the fleeing passengers were gunned down and the feeing gunmen also attacked farmers, killing at least 30 people. The Sri Lankan government claimed that the gunman belonged to LTTE. (LTTE)"], ["2008-02-02", "Sri Lanka", "Dambulla.", 20, 50, "A bus carrying civilians bombed."], ["2008-02-03", "Sri Lanka", "Colombo.", 12, 100, "Suspected Tamil Tiger suicide bomber blew herself up outside a train at the main railway station in Colombo."], ["2008-02-04", "Sri Lanka", "Weli-Oya and Colombo.", 13, 20, "Suspected Tamil Tiger rebels killed 13 people with two roadside bombs on Monday, just hours after the government celebrated the island's 60th anniversary of independence with a parade of military might in the capital."], ["2008-03-07", "Spain", "Mondragón", 1, 0, "An ETA gunman kills Isaías Carrasco, former town councilor for Mondragón, on his way to work, two days before the General Elections."], ["2008-04-06", "Sri Lanka", "Weliveriya.", 15, 90, "See 2008 Weliveriya bombing"], ["2008-04-25", "Sri Lanka", "Piliyandala.", 26, 64, "The bombing of a commuter bus in a suburb of Colombo killed 26 and injured at least 64. See 2008 Piliyandala bus bombing"], ["2008-05-10", "Sri Lanka", "Ampara.", 11, 29, "A bomb attributed to Tamil Tiger rebels ripped through a cafe, 11 killed, 29 injured."], ["2008-05-14", "Spain", "Legutiano, Alava.", 1, 4, "A powerful bombing outside a civil guard, blamed on Basque separatist ETA group, killing one guard."], ["2008-05-16", "Sri Lanka", "Downtown Colombo.", 9, 93, "A suicide bomb exploded near the Sri Lankan president residence,carried out by the LTTE ."], ["2008-05-26", "Sri Lanka", "Colombo.", 8, 72, "A packed commuter train carrying 200 passenger on board which time bombing exploded at Dehiwela railroad station, carried out by the LTTE."], ["2008-06-06", "Sri Lanka", "Kandy district.", 2, 20, "The Sri Lankan government blamed LTTE militants for a bomb explosion that occurred aboard a commuter bus only a few hours after a similar attack near the capital. See 2008 Polgolla bus bombing"], ["2008-06-06", "Sri Lanka", "Moratuwa suburb of Colombo.", 21, 47, "A roadside bomb blast targeted a crowded state-run commuter bus at about 7:35 am The government quickly placed blame upon LTTE, who had yet to claim responsibility. See 2008 Moratuwa bus bombing"], ["2008-06-15", "Nepal", "Rautahat District.", 2, 12, "A group calling itself the Tarai Army claimed responsibility for an explosion in a crowded bus station in southern Nepal. The bomb had been hidden in a wheat sack."], ["2008-06-16", "Sri Lanka", "Northern Province, Sri Lanka.", 12, 40, "Explosives in a motorcycle is detonated in front of a police station in Vavuniya, killing 12 members of police and injuring 40, including children."], ["2008-07-21", "China", "Kunming, Yunnan.", 2, 13, "Two bomb explosions occurred on board separate passenger buses during the early morning commute. The first blast happened at about 7:00 am and the second came about an hour later."], ["2008-07-27", "Turkey", "Istanbul.", 17, 150, "Two bombs kill 17 people and wound at least 150 in Istanbul. Kurds suspected"], ["2008-07-27", "United States", "Knoxville, Tennessee.", 2, 7, "Unitarian Universalist church shooting, Jim David Adkisson kills 2 people and injures 7 in Knoxville, Tennessee."], ["2008-08-15", "Colombia", "Ituango, Antioquia.", 7, 50, "Seven people were killed and more than 50 wounded when a bomb detonated in a small town. FARC denies responsibility on the attack, blaming Colombian State."], ["2008-09-01", "Colombia", "Cali.", 4, 26, "Four people were killed and around 26 more wounded by a car bomb in the Colombian city of Cali in one of the worst urban attacks this year. Police said they believed FARC guerrillas were responsible for the attack."], ["2008-09-13", "India", "Delhi.", 30, 90, "A series of 5 bombs exploded in Delhi, killing 30 and injuring 90."], ["2008-09-15", "Mexico", "Morelia, Michoacán.", 7, 101, "A series of grenades are detonated in crowds gathered to celebrate Independence Day."], ["2008-09-21", "Spain", "Basque Country.", 1, 12, "Three car bombs detonate in a 24-hour period killing one (a military personnel) and injuring 12. The ETA is confirmed by authorities as responsible."], ["2008-09-24", "Israel", "Jerusalem.", 0, 1, "Israeli historian Zeev Sternhell, known for his criticism of Jewish settlements in the occupied West Bank, was injured when a bomb exploded at his home. Peace Now, an Israeli rights group devoted to ending the occupation of the Palestinian territories, blamed extreme right-wing groups for the attack."], ["2008-09-25", "United", "Kingdom", 0, 1, "A man survived after being shot in the neck by the RIRA on the County Londonderry-County Donegal border. The same man was targeted in a pipe bomb attack on his home on 25 October, the RIRA did not claim responsibility for the attack, but security forces believe they were responsible for it."], ["2008-09-25", "Myanmar", "Yangon.", 0, 7, "A small bomb exploded at a bus stop near the city hall in a busy downtown area. The blast came about a year after anti-government protests were suppressed."], ["2008-09-29", "Sri Lanka", "Colombo.", 0, 5, "A bomb placed underneath a van exploded in the Pettah market area. The government immediately blamed the LTTE."], ["2008-10-1", "Turkey", "Diyarbakir.", 1, 1, "PKK militants attacked Turkish soldiers."], ["2008-10-11", "Mexico", "Monterrey.", 0, 0, "Unknown assailants shot at the U.S. consulate building and threw a grenade that failed to explode. Two men attacked the consulate around midnight when it was closed. Though nobody was hurt in the assault, the gate was pockmarked and six spent .45-caliber casings were found at the scene. It was not clear if the attack was related to a wave of violence by drug gangs; there was no evidence it was related to political terrorism."], ["2008-10-12", "Colombia", "Neiva.", 1, 7, "Authorities blamed FARC for two attacks on hotels in the center of Neiva in the south west of Colombia. ."], ["2008-10-14", "Nepal", "", 3, 0, "A woman and her two children died in a bomb explosion in the Terai, a region that has seen constant ethnic unrest for nearly two years. Shortly afterwards two separate militant groups both said they were responsible. Each claim to fight for the rights of the Madhesi ethnic group."], ["2008-10-17", "United States", "Dalton", 1, 4, "An explosion at a personal injury law firm in downtown Dalton, Ga., injured four people, including at least one lawyer, and resulted in the death of the apparent bomber in what a federal law enforcement spokesman described as a suicide attack."], ["2008-10-19", "Pakistan", "Balochistan.", 4, 6, "A separatist group, Baloch Republic Army, claimed responsibility for a bomb blast in northwestern Balochistan province. The blast occurred in a bazaar of the Dera Bugti district, and the remote-controlled bomb was planted in a motorcycle."], ["2008-10-20", "India", "Chhattisgarh.", 13, 12, "Naxalites allegedly killed Central Reserve Police Force (CRPF) personnel in the Bijapur District following the announcement of two-phase Assembly elections in Chhattisgarh. The attack also left 12 personnel of CRPF and the Border Roads Organisation, who were carrying out road construction work in the area, injured. The attack took place at about 13:30 between Modukpal and Kongupalli in the district. According to reports, one of the attackers was also killed in the exchange of fire that followed."], ["2008-10-21", "Finland", "Helsinki.", 0, 0, "Finnish police say an Embassy employee was injured in an arson attack on the Turkish embassy building in central Helsinki. Officers said the front door was burned in the attack and the fire spread indoors before it was extinguished by fire fighters. The early morning attack came hours after a peaceful anti-Turkey protest the day before outside the embassy by a few dozen Kurdish demonstrators. Police said four men had been detained on suspicion of the attack, and that the attack could have been politically motivated and that some of the men had a Turkish-Kurdish background."], ["2008-10-21", "Thailand", "Bangkok.", 0, 1, "A bomb blast hit the residence of the Supreme Administrative Court of Supreme Administrative Court president Akrathorn Chularat in Chatuchak district in the early hours of the morning. Akrathorn was not in his residence in Soi Lat Phrao 25, Phahonyothin Road, as he was on an overseas trip. Police were alerted to the bomb blast at about 1:00 where they found a 10-centimetre deep pit about four meters wide on the grounds within the compound. Witnesses said they heard the sound of motorcycles in front of the house shortly before the bomb exploded."], ["2008-10-21", "India", "Imphal.", 17, 30, "A bomb was suspected to have been planted on a moped near the Manipur police commando complex at Minuthong in Imphal at 19:30. Police said none of the Manipur police commando personnel staying at the barrack complex were among the casualties. Unconfirmed reports, however, said a surrendered militant may be among the dead."], ["2008-10-22", "India", "Belpahari, West Bengal.", 3, 3, "Three members of a mobile medical team were killed in a blast triggered by Maoists. The Maoists, however, issued an apology for the killing of the health staff and stated that they were not the intended target. Two people have been arrested in connection with the blast though locals claimed that the duo were innocent of the charges."], ["2008-10-23", "Colombia", "Bogota.", 0, 16, "Police blame FARC for a series of blasts occurring throughout the capital. The explosives had been left in waste bins in six separate residential areas. Witnesses described the blasts as \"not high-powered,\" and the injuries were minor."], ["2008-10-24", "Greece", "Athens.", 0, 0, "At about 4:00 am police were able to defuse a homemade explosive that had been left outside the offices of Royal Dutch Shell. They had received an anonymous phone call warning of the device's location. Authorities usually attribute similar attacks to extreme leftists and anarchists."], ["2008-10-25", "Georgia", "Near Abkhazia. Giorgi Mebonia,", 2, 1, "governor of the Tsalenjikha district of Georgia, was killed in an explosion close to the border with Abkhazia. A citizen also died in the attack and a police officer was wounded in the village of Mujava. The Georgian interior ministry said Mebonia's car was hit by an explosive device and his convoy was fired at, but it was not known who had fired the shots."], ["2008-10-28", "India", "Gadchiroli.", 4, 5, "Four policemen, including a sub-inspector, were killed in an encounter with Naxalites in the Korepile forest in Aheri Taluka of Gadchiroli district. Five other policemen also received bullet injuries. The police party came under attack during routine patrolling."], ["2008-10-3", "Spain", "Tolosa.", 0, 0, "At about 1:15, 10 kg worth of explosives detonated in front of the Tolosa court house causing minimal damage."], ["2008-10-3", "Georgia", "Tskhinvali.", 7, 8, "A car full of explosives blew up near a Russian military base."], ["2008-10-30", "Spain", "Pamplona.", 0, 21, "A car bomb exploded at the University of Navarra. The explosion occurred at a time when students would have been walking near the lot where the car had been parked. Most of the injuries were a result of flying glass shards, while rainy weather may have prevented more casualties. Authorities blamed ETA, who had yet to claim responsibility."], ["2008-10-30", "India", "Assam.", 84, 470, "A series of 13 blasts occurred in and around Guwahati."], ["2008-10-31", "India", "Bastar, Chhattisgarh.", 0, 17, "At least 17 policemen sustained minor injuries when Maoist guerrillas detonated a powerful land mine in front of their vehicle in the southern Bastar region of Chhattisgarh. The incident took place on a highway in Narayanpur district, some 250 km south of the capital Raipur."], ["2008-10-31", "India", "Srinagar.", 0, 4, "Four security personnel were injured when militants hurled a grenade at a police station in the Baramulla district of Jammu and Kashmir. The blast, at about 11:20, landed inside the compound of the Baramulla police station, injuring two CRPF personnel and two policemen in the explosion. No militant outfit had claimed responsibility for the attack so far. This was the first attack on security forces in the Kashmir valley since the announcement of election schedule legislative assembly elections by Election Commission on 19 October."], ["2008-10-6", "Sri Lanka", "Anuradhapura.", 27, 80, "A suicide bomb exploded in the office of the United National Party near a bus stand. A former senior general, Janaka Perera, who had been serving as a regional leader for the party was among the dead. The Tamil Tigers were quickly blamed."], ["2008-10-8", "India", "Guwahati.", 0, 5, "A bomb exploded near a crowd gathered for Durga Puja festivities. A police spokesman said the low-intensity blast took place near the Japorigog area at around 20:30."], ["2008-10-8", "Turkey", "Diyarbakir.", 4, 22, "Three police trainees and a civilian were killed, with 22 others also wounded, in an attack on a police bus. Unidentified assailants armed with guns and explosives attacked the vehicle on a busy street outside the city of Diyarbakir. Of the injured at least 11 of the wounded were trainee police officers and the others were civilians. Though there was no immediate claim of responsibility for the attack, Kurdish separatist guerrillas frequently target Turkey's armed forces and police in the mainly Kurdish southeast; the attack also came shortly before the parliament in Ankara was scheduled to approve a government request to extend a mandate to launch military operations against PKK rebels based in northern Iraq."], ["2008-10-9", "Sri Lanka", "Colombo.", 1, 3, "A suicide bomb attack targeted a convoy carrying the agriculture minister near a Buddhist temple in the Borelesgamuwa suburb."], ["2008-11-02", "India", "Salboni, West Midnapur district, West Bengal.", 0, 6, "A landmine blast targeted West Bengal Chief Minister Buddhadeb Bhattacharya. Six policemen travelling in the last car of a convoy escorting Indian steel minister, Ram Vilas Paswan, and the CM were wounded. Eight villagers were arrested for possible links with Maoist insurgents who triggered the blast. Seven police officials, including an Additional Superintendent of Police of the Purbo Medinipur district were issued show cause notices and asked to explain their role in the supervision of security along the stretch of road at Kalaichandi in Paschim Medinipur district after the CM's convoy passed through. Bhattacharya specifically implicated the Sasadhar Mahato-led Lalgarh squad of the Maoists."], ["2008-11-04", "Pakistan", "Doaba, North West Frontier Province.", 2, 9, "A bomber targeted an army check post early on Tuesday, officials said. One report said that the bomber drove up in a car and detonated explosives. No one has claimed responsibility. A police official told the AFP news agency that paramilitary soldiers and policemen had been injured in the blast."], ["2008-11-10", "South Ossetia", "Georgian-South Ossetian border.", 2, 3, "Two Georgian policemen were killed and three wounded by explosive devices near South Ossetia. The EU Monitoring Mission (EUMM) patrolling the area called the attack an unacceptable breach of the ceasefire that could dangerously escalate tensions in the region. The risk of skirmishes and tit-for-tat attacks remained high with further violence likely."], ["2008-11-13", "Thailand", "Bangkok.", 0, 15, "At least 15 market traders were wounded when a bomb was thrown into a camp in Bangkok where they were staging a protest vigil against attempts to evict them. The explosion took place at 2:00 at Klong Toey market, next to the capital's biggest slum, where about 300 protesters were demonstrating against the new management of the site. The bomb was apparently tossed into the camp by an unidentified man on a nearby footbridge, while two people suffered serious injuries. The attack did not appear to be linked to an anti-government protest movement that had occupied Government House in Bangkok since late August, where there were a series of small bombings in the weeks preceding."], ["2008-11-14", "Serbia/Kosovo", "Pristina.", 0, 0, "An explosive charge was thrown at the building housing the office of the European Union's special envoy to Kosovo, Peter Feith. No one was injured in the blast, which shattered the windows of the office of the International Civilian Office. On 20 November, Kosovo police arrested three German citizens suspected of having thrown the explosive charge."], ["2008-11-14", "India", "Kanker and Bastar, Chhattisgarh.", 3, 4, "Three policemen were injured in a landmine blast triggered by rebels at Injeram in Konta constituency, close to the Andhra Pradesh border; while several low-intensity explosions ripped through Chhattisgarh's Bastar region as the first phase of assembly elections began in 39 constituencies. There was a low electoral turnout following the murder of Trinath Thakur, the Dantewada block unit chief of the Congress, the previous night. Dantewada District Superintendent of Police Rahul Sharma said: \"Rebels slit his throat and he died on the spot due to excessive bleeding.\" Soon after voting started, gunbattles erupted between policemen and Maoist guerrillas in about 15 places in the Sukma, Kistaram, Konta, Bhairamgarh, Antagarh, Pakhanjoor, Bijarpur, Dantewada and Antagarh constituencies. Despite the presence of 65,000 policemen, including paramilitary forces, Maoist guerrillas managed to block roads leading to polling booths in over 50 places."], ["2008-11-16", "Eritrea", "Barentu.", 8, 5, "Eritrea blamed the TPLF for a roadside bomb explosion along the road between Barentu and Elala. The explosion occurred at about 8:30 am as citizens passed en route to an engagement party."], ["2008-11-20", "Thailand", "Bangkok.", 1, 29, "A grenade attack on protesters occupying the prime minister's office killed one person and wounded 29. No one took responsibility for the blast, but the protest group, the People's Alliance for Democracy, blamed the government. The prime minister denied the charge."], ["2008-11-22", "Iraq Turk", "Iraqi border.", 0, 0, "The PKK claimed responsibility for an explosion at an oil pipeline linking Iraq with southern Turkey. The PKK said the explosion was an act of sabotage, but a spokesman for Iraq's Oil Ministry says the pipeline will be out of action for about a week."], ["2008-11-22", "Thailand", "Bangkok.", 0, 8, "The second grenade attack in three days targeted protesters occupying the Thai prime minister's compound in Bangkok. The blast occurred at 3:00 and injured eight people, one of them seriously. Chamlong Srimuang, one of the key protest leaders, said the grenade was launched from the headquarters of the Bangkok Metropolitan police about 500 feet (150 meters) away."], ["2008-12-01", "Turkey", "Istanbul.", 0, 5, "A bomb blast outside of a building used by the AK Party occurred in the Sutluce district at around 3 pm. Two of the injured were reported to be police."], ["2008-12-02", "India", "Assam.", 2, 0, "Police blame the Karbi Longri N.C. Hills Liberation Front (KLNLF) for taking two migrant workers from their homes in the village of Dolamara and shooting them."], ["2008-12-18", "Zimbabwe", "", 0, 1, "The leader of Zimbabwe's air force – an ally of president Robert Mugabe – was shot and wounded in an attempt on his life, state media has said."], ["2008-12-22", "NigeriaAwka", "Iborn.", 1, 3, "Gunmen attacked two oil services vessels in separate incidents in Nigeria's restive Niger Delta on Thursday, kidnapping a Russian, a Mexican and seven Nigerians, security sources working in the industry said."], ["2008-12-30", "Bhutan", "Singye.", 4, 1, "Members from the Communist Party of Bhutan ambushed and killed four forest rangers and took their weapons in Singye village, 155 miles away from the capital."], ["2009-01-01", "India", "Guwahati, India.", 6, 67, "A serial blast kills 5 civilians and injures 67 in the city of Guwahati. Police believe the United Liberation Front of Assam are responsible for the attacks."], ["2009-01-02", "Ukraine", "Melitopol, Ukraine.", 0, 25, "A bomb exploded inside a bank injuring 25 people in the town of Melitopol. The bank and other buildings were damaged in the blast the bomber is unknown."], ["2009-01-02", "Sri Lanka", "Colombo, Sri Lanka.", 4, 37, "Hours after the capture of the Tamil Tigers capital in northern Sri Lanka, a suicide bomber in Colombo struck killing three security officers and himself and wounding an additional 37 others."], ["2009-01-03", "Sri Lanka", "Colombo, Sri Lanka.", 0, 3, "A bomb blast outside a mosque in Colombo injured three people."], ["2009-01-17", "Spain", "Hernani, Spain.", 0, 0, "A blast went off at a television station in Hernani causing damage but no injuries. ETA is blamed for the attack."], ["2009-01-24", "Serbia", "Kosovska Mitrovica, Serbia.", 0, 0, "Two explosions, with no injured, happened during the night in Tri solitera suburb."], ["2009-01-26", "Nepal", "Katahariya village, Nepal.", 2, 6, "A bomb hanging from a tree at the Katahariya village local market exploded killing one person and injuring two other people seriously. The Tarai Army has claimed responsibility for the blast."], ["2009-01-27", "France", "Corsica.", 0, 0, "Rocket attack against a police station."], ["2009-01-28", "Colombia", "Bogota, Colombia.", 2, 4, "An explosion in a two-story building in Bogota has killed 2 people and injured at least four others."], ["2009-01-30", "Philippines", "Davao City, Philippines.", 0, 10, "Communist rebels set off a landmine by a military convoy in Davao City and then attacked a police station with gunfire, injuring 10 people."], ["2009-02-01", "China", "Zhumadian, Henan Province, China.", 3, 40, "An explosive device detonated outside a hospital in Zhumdian in Henan Province killing 3 people and injuring 40 others according to the Hong Kong Centre and police report four dead and two injured. It is believed someone unhappy with the hospital might be behind the explosion."], ["2009-02-03", "Sri Lanka", "Colombo, Sri Lanka.", 4, 24, "Rebels detonated a bomb on a bus carrying Sri Lankan soldiers in the capital of Colombo killing four people and injuring twenty-four others as the military continues its offensive in northern Sri Lanka against Tamil rebels."], ["2009-02-09", "Spain", "Madrid, Spain.", 0, 0, "A van carried with 100 kg of explosive exploded near the offices of construction company Ferrovial and the blast is being blamed on ETA rebels in the Basque Country after two political parties connected to ETA were banned from upcoming regional elections. No one was hurt or killed in the blast."], ["2009-02-09", "Sri Lanka", "Vishvamadu, Sri Lanka.", 30, 90, "A female suicide bomber from the LTTE Black Tigers detonated her explosives in a crowd of soldiers and fleeing refugees in northern Sri Lanka as an attempt to cow people into not leaving rebel-held areas of Sri Lanka. Twenty-eight people including eight civilians were reportedly killed and at least ninety others wounded."], ["2009-02-14", "Sri Lanka", "Puliyankulam, Sri Lanka.", 1, 13, "LTTE rebels tossed a hand grenade into a bus packed with refugees in Northern Sri Lanka killing one civilian and injuring 13 other people."], ["2009-02-15", "Philippines", "Maitum, Philippines.", 0, 5, "An improvised explosive device detonated in front of a government building housing a gymnasium injuring five people."], ["2009-02-18", "Greece", "Athens, Greece.", 0, 0, "Two gunmen fired 13 shots into a private T.V studio's compound and tossed in an explosive device before fleeing on two sport motorcycles. No one was hurt or killed in the incident and the bomb failed to explode."], ["2009-02-20", "Sri Lanka", "Colombo, Sri Lanka.", 4, 50, "Two Tamil Tigers aircraft packed with C4 explosives en route to the national airforce headquarters were shot down by the Sri Lankan military before reaching their target. 4 people including the two pilots were killed while over 50 were injured."], ["2009-02-22", "Spain", "Barakaldo, Spain.", 0, 0, "A bomb detonated in Basque Country. No injuries were reported."], ["2009-02-23", "Spain", "Lazkao, Spain.", 0, 0, "A rucksack packed with around 10 kg worth of explosives explodes outside the Basque Socialist Party headquarters in the town after a warning call from ETA. The blast took place at 3:00 am, causing major damage to the local but no injuries were reported."], ["2009-02-24", "Spain", "Vitoria, Spain.", 0, 0, "A bomb explodes in front of a PNV headquarters in Vitoria causing minimal damage and no injuries."], ["2009-02-27", "India", "Thoubal, India.", 0, 0, "Unknown militants threw bombs into a congressional office resulting in one bomb exploding resulting in significant damage but no injuries or deaths."], ["2009-03-07", "United Kingdom", "Antrim town, Northern Ireland.", 2, 4, "Two unarmed soldiers, Patrick Azimkar and Mark Quinsey, of the 38 Engineer Regiment were shot dead outside Massereene Barracks. Two other soldiers and two civilian delivery men were also shot and wounded during the attack. An Irish republican paramilitary group, the Real IRA, issued a statement claiming responsibility."], ["2009-03-07", "China", "Nanyang, Henan, China.", 2, 6, "A bomb exploded in an apartment complex killing two people and injuring six others including five kindergarten-aged children and an instructor."], ["2009-03-09", "United Kingdom", "Craigavon, Northern Ireland.", 1, 0, "PSNI officer Stephen Carroll was shot dead by a sniper in Craigavon, County Armagh. This was the first killing of a police officer in Northern Ireland since 1998. The Continuity IRA claimed responsibility for the shooting."], ["2009-03-10", "Sri Lanka", "Southern Sri Lanka, Sri Lanka.", 14, 41, "A suicide bomber occurred at a mosque in a southern town in Sri Lanka killing 14 people and injuring 41 others including a minister."], ["2009-03-15", "Israel", "Shchem, Israel", 2, 0, "Two Israeli traffic policeman were killed near the town of Nablus by the Imad Mughniyeh Group, an organization named after the assassination of Hezbollah leader Imad Mughniyah. Israeli police spokesman Micky Rosenfeld said \"nationalistic motive\" appeared to have been behind the attack."], ["2009-03-18", "Greece", "Athens, Greece.", 0, 0, "A homemade bomb exploded at the government office of the ruling party in Greece, causing damage but no injuries according to the police. Deputy Kyriakos Mitsotakis was not at the office during the attack."], ["2009-03-18", "India", "New Jalpaiguri, India.", 1, 12, "An explosive detonates, killing 1 person and injuring at least 12 others. The provincial administration believes the blast is not related to upcoming district elections, but by unidentified terrorists."], ["2009-03-22", "Philippines", "Kidapawan, Philippines.", 0, 7, "A bomb exploded on an overpass over a busy marketplace wounding seven people. The blast blew out windows of local shops and police officers and soldiers began stepped up patrols of the area."], ["2009-03-25", "India", "Tezpur, Assam, India.", 0, 12, "Militants in insurgent racked Assam province tossed a grenade into a busy marketplace in Tezpur, Assam injuring twelve people, two seriously."], ["2009-03-26", "Spain", "Amorebieta,", 0, 0, "a bomb explodes in a businessman chalet suspected to be the work of ETA. No one was killed or injured."], ["2009-04-06", "India", "Assam", 7, 60, "Two bomb blasts kill 7 and injure 60 a day before Prime Minister Manmohan Singh was expected to visit. Police accuse United Liberation Front of coordinating the attacks."], ["2009-04-09", "Indonesia", "Jayapura", 5, 0, "A bomb attack in Jayapura killed 5 men and injured severely several others. Police blamed Free Papua Movement. Meanwhile, about 500 militants attacked a police post with bows and arrows and petrol bombs. The police reply and kills someone."], ["2009-04-10", "Thailand", "Chalerm", 1, 3, "Black clothed militants opened fire on a train as it was stopped at a local train station. One train attendant was shot and killed and three others were injured in the attack before the engineer was able to pull away from the station ensuring the attackers couldn't kill or injure anyone else."], ["2009-05-06", "Spain", "Castro Urdiales", 0, 0, "Two bombs exploded at two cellphone towers in the Basque region of northern Spain resulting in damage to both towers but no injuries or deaths."], ["2009-05-12", "Greece", "Athens", 0, 0, "In southern Athens at a Eurobank a bomb exploded early in the morning causing damage to the building but no injuries or deaths. It is believed to be the fourth attack by far-left militants on government targets since the beginning of the year."], ["2009-05-15", "India", "Orissa", 0, 8, "A bomb placed for Indian security forces exploded when day laborers working a field disturbed the explosive device resulting in the explosion. Eight civilians were injured."], ["2009-05-16", "Hong Kong", "Hong Kong", 0, 30, "Acid was tossed into a popular market filled with shoppers on a busy Hong Kong street injuring thirty people including an infant. Most people suffered burns to their faces, arms and legs and it is suspected that the acid was corrosive but had been sent to a lab for analyst."], ["2009-05-17", "Nepal", "Janakpur", 0, 60, "The only train system in Nepal was targeted by a cylinder bomb as a train passed resulting in sixty people being injured in the blast."], ["2009-05-20", "Sweden", "Stockholm", 0, 1, "A female television journalist for Sweden's TV4 channel was seriously injured after a bomb exploded when she went to open the front door to her apartment. Stockholm police believe the attack was a deliberate terrorist act against the journalism community in Sweden."], ["2009-05-23", "Nepal", "Kathmandu", 2, 15, "An explosion rocked a Christian church in Kathmandu, Nepal during Saturday morning mass in this mostly Buddhist and Hindu nation. An Indian national and a Nepalese civilian were killed in the blast and fifteen were hurt. Communal and religious violence in this mountainous nation is extremely rare and police state an underground Hindu organization made a claim of responsibility for the blast."], ["2009-05-25", "United States", "New York City", 0, 0, "A small explosive device exploded out front of a Starbucks in New York City destroying a bench it had been placed on. No injuries or deaths were reported in the blast."], ["2009-05-30", "Ecuador", "Quito", 0, 0, "A right-wing television station with fifty employees onsite, and the Ministry of Education building in a northern Quito, Ecuador suburb were targeted by two letter bombs that exploded early on Saturday morning. The two blasts caused moderate damage to both the TV station and the Education Ministry building but no deaths or injuries were reported. Anti-government letters were found near both locations."], ["2009-06-02", "Georgia", "Jvari.", 0, 0, "A bomb blast damaged the Tbilisi-to-Zugdidi railway line. No one was killed or injured in the blast. The blast happened near the village of Jvari by the Georgia-Abkhazia border just two hours before a passenger train was due to travel the route."], ["2009-06-03", "Philippines", "Cotabato", 2, 4, "An unarmed Filipino soldier and a civilian was killed in an explosion outside Cotabato and four unarmed soldiers were injured."], ["2009-06-05", "Spain", "Spain", 0, 0, "A homemade bomb went off outside a policeman's home near Bilbao causing material damage but no injuries."], ["2009-06-07", "Spain", "Olivenza", 0, 0, "On the day of the 2009 European polls voting in Spain, a bomb explodes in a local office of the conservative party Partido Popular."], ["2009-06-08", "Thailand", "Narathiwat", 11, 12, "At least eleven were killed and twelve wounded when gunmen opened fire on worshippers at a mosque in Thailand's Muslim-majority south. The attack comes amid a sudden spike in a five-year insurgency that has left 3,700 people dead."], ["2009-06-10", "United States", "Washington", 1, 1, "A racist elderly man, identified as James W. von Brunn, began to shoot people indiscriminately in the Holocaust Memorial Museum, killing one security guard and injuring another."], ["2009-06-10", "Russia", "Ingushetia", 1, 5, "Russia A top judge was shot dead by unknown gunmen, as she was dropping her children off at school. It is known that a small child was among those who had been injured."], ["2009-06-15", "Spain", "Ponferrada", 0, 0, "A homemade bomb explodes in front of a Unión General de Trabajadores (UGT) office in the city of Ponferrada, causing extensive damage to the local. No injuries were reported in the attack against the trade union."], ["2009-06-17", "Spain", "Vigo", 0, 0, "A bomb explodes in a bank in the northern city of Vigo, in Spain. No injuries were reported. Another explosive device exploded in the house of a businessman. Another explosive device placed in the car of a TAV worker exploded in Northern Spain that same day. The two first attacks were blamed on Galician separatists while the third to ETA young members."], ["2009-06-19", "Spain", "Bilbao", 1, 0, "A senior police officer is killed in a car bomb attack in the Spanish city of Bilbao. The bomb, which was attached to the victim's car, is blamed on Basque separatists ETA"], ["2009-06-20", "Spain", "Terrassa", 0, 1, "Catalan separatists tossed flaming Molotov cocktails at a crowd watching a football match between Spain and South Africa. luckily, only a cameraman was injured in the attack."], ["2009-06-22", "Spain", "Vigo", 0, 0, "Another bomb explodes in the northern city of Vigo causing great damage but no injuries."], ["2009-06-22", "Russia", "Nazran,", 4, 5, "Ingushetia, Russia A suicide bomber targeted the Ingush president, Yunus-bek Yevkurov, injuring five people including himself. It is also known that four people were killed in this suicide blast."], ["2009-07-05", "Serbia", "Bujanovac,", 0, 2, "Serbia. Two policemen, Nenad Nikolic and Miloš Cerovic were injured in RPG attack on their vehicle while patrolling the village of Lucane near Bujanovac."], ["2009-07-07", "Spain", "Durango, (Spain).", 0, 0, "A powerful bomb damages a recreation center of the ruling Socialist Party in Northern Basque region of Spain. No one was injured in the attack, claimed to ETA."], ["2009-07-07", "Philippines", "Jolo", 6, 40, "and Iligan, Mindanao. Two bombs exploded in two separate cities, killing six and injuring up to 40."], ["2009-07-22", "France", "Vescovato", 0, 0, "A car bomb exploded against à police station in Vescovato (Corsica). This attack is claimed by FLNC."], ["2009-07-29", "Spain", "Burgos", 0, 65, "A car bomb containing 200 kilogrames of explosives exploded in a 14-story barracks of the Guardia Civil in the northern city of Burgos. no deaths were reported, but more than 60 people were injured."], ["2009-07-30", "Spain", "Calvia, Majorca", 2, 3, "A car bomb exploded outside a Guardia Civil offices in Calvià, Majorca, killing two members of the Guardia Civil Carlos Sáenz de Tejada and Diego Salva Lezaun. ETA was blamed for the attack and the authorities 'sealed' all entry and exit points to the island to avoid the terrorists' escape. Another explosive device was found under a policeman car in the same town some hours later and deactivated by police. \"Two Spain police killed by new bomb blamed on ETA\". Reuters UK. July 30, 2009. Retrieved July 30, 2009."], ["2009-08-12", "Russia", "Ingushetia", 1, 1, "Two masked gunmen shot dead the construction minister for the republic of Ingushetia whilst he was in his office. His assistant was reportedly wounded in this assault."], ["2009-08-17", "Russia", "", 25, 164, "Nazran at least 25 people have been killed by a powerful bomb attack at a police station in southern Russia, officials and hospital sources say."], ["2009-08-26", "Colombia", "San Vicente del Caguán", 3, 3, "Colombia A bomb blast killed 3 civilians and wounded 3 other in the Caqueta department."], ["2009-09-02", "Greece", "Athens", 0, 1, "Greece A bomb in a van explodes outside the Athens Stock Exchange, injuring a passerby and damaging the building, and a bomb explodes outside a government building in Thessaloniki causing minor damage but no injuries."], ["2009-11-22", "India", "Assam", 7, 25, "India Suspected ULFA militants triggered two blasts on bicycle close to a police station in Nalbari, Assam, killing at least seven persons and injuring 25 others."], ["2009-12-05", "Philippines", "Zamboanga City", 1, 5, "A cell-phone triggered improvised bomb explosion leveled a police station to the ground and greatly damaged a municipal jail."], ["2009-12-07", "Turkey", "Tokat", 7, 0, "Turkey Seven Turkish soldiers are killed in an ambush carried out by suspected PKK rebels."], ["2009-12-26", "Lebanon", "Beirut", 3, 3, "Lebanon A car bomb attack in the Lebanese capital Beirut targets a Hamas official."], ["2010-01-08", "United Kingdom", "Randalstown, Northern Ireland", 0, 1, "A Police Service of Northern Ireland officer was wounded when a bomb exploded underneath his car in Randalstown, County Antrim. Real IRA  Symbol confirmed.svg"], ["2010-02-14", "Serbia", "Bujanovac, Serbia", 0, 4, "An ethnic Albanian policeman was injured by an explosion in Bujanovac, Serbia."], ["2010-02-18", "United States", "Austin, Texas", 1, 13, "Andrew Joseph Stack III crashes his plane into an IRS building in Austin, Texas killing himself and a person inside the building and injuring 13 others. The crash caused a serious fire and significant damage to the building."], ["2010-03-05", "Rwanda", "Kigali, Rwanda", 0, 16, "Two near-simultaneous grenade explosions at a car-washing yard and at a bus station injured 16 people. Hutu militia was blamed."], ["2010-03-16", "France", "Dammarie-lès-Lys, France", 1, 0, "Ten ETA members shot dead a French gendarme, Jean Serge Nerin, 53 years old, in Dammarie-lès-Lys, near Paris. Spanish government confirmed the shooting took place after a patrol of the local police found several people robbing a garage of vehicles. One suspect was arrested on the spot and identified himself as a member of ETA. This is the first time that ETA, which had always targeted Spanish officials and policemen, kills a French national policeman."], ["2010-03-24", "Colombia", "Buenaventura, Colombia", 6, 30, "A car bomb detonated in the centre of the Colombian pacific port of Buenaventura, near the mayor's office and the local public prosecutor's building. No group has claimed responsibility for this attack although left-wing FARC rebels are suspected."], ["2010-04-15", "Myanmar", "Yangon, Burma", 9, 170, "Three explosions went off at a park in the former capital of Yangon, Myanmar's commercial hub. These explosions happened as revellers gathered for a New Year water festival. Most of the pavilions on the U Htaungbo Road are run by companies said to be close to the governing authorities. Previous explosions were also blamed on dissident or ethnic rebels."], ["2010-05-01", "Russia", "Nalchik, Kabardino-Balkaria, Russia", 1, 30, "A bomb exploded in the VIP lodge of a hippodrome during horse races within the city of Nalchik."], ["2010-05-08", "Turkey", "Hakkari Province, Sirnak Province, Turkey", 2, 0, "Two separate bomb explosions killed two Turkish soldiers, whilst they were on patrol in the border districts of both the Hakkari and Sirnak provinces within the country."], ["2010-05-14", "Greece", "Thessaloniki, Greece", 0, 1, "A bomb exploded inside court house in Thessaloniki. One person was injured in the blast and there was some damage to the building."], ["2010-05-30", "Turkey", "Sirnak Province, Siirt Province, Antakya, Turkey", 6, 3, "PKK rebels launched a series of attacks against security forces and village guardsmen within three Turkish provinces."], ["2010-06-02", "Turkey", "Hakkari Province, Turkey", 1, 3, "PKK militants clashed with Turkish soldiers near the town of Cukurca, within the Hakkari Province, in the south-east of the country."], ["2010-06-08", "Turkey", "Istanbul, Turkey", 0, 15, "A bomb attack injured 15 policemen. The attack was claimed by TAK."], ["2010-06-15", "Turkey", "Sirnak Province, Turkey", 1, 3, "A bomb explosion targeting Turkish military personnel, occurred within the Sirnak Province of eastern Turkey."], ["2010-06-19", "Turkey", "Semdinli, Turkey", 10, 14, "PKK rebels killed ten Turkish soldiers in an attack in the city of Semdinli."], ["2010-06-22", "Turkey", "Istanbul, Turkey", 5, 12, "A bomb explosion occurred next to a military bus carrying Turkish soldiers and their relatives in Turkey's largest city of Istanbul. PKK militants are being suspected for carrying out this latest attack."], ["2010-06-24", "Greece", "Athens, Greece", 1, 0, "A bomb explosion occurred near to the offices of Greece's public order ministry within the Greek capital city of Athens."], ["2010-06-25", "Turkey", "Elazig Province, Turkey", 3, 5, "PKK militants assaulted a group of villagers who were on their way home, killing and wounding both Turkish soldiers and civilians in the process."], ["2010-07-02", "Serbia", "Kosovska Mitrovica, Serbia", 1, 11, "A bomb exploded during a demonstration against the opening of a government office in the Serbian enclave in the North of Mitrovica. The dead man was a Bosniak who lived in the Bosnian Mahal."], ["2010-07-05", "Serbia", "Kosovska Mitrovica, Serbia", 0, 1, "A Serbian politician, named Petar Miletic, who is an elected Mp for Serbs in Kosovo was shot 4 times on the leg outside his apartment in Northern Mitrovica. He may have been shot because he is one of the few Serbs who collaborate with Kosovan institutions."], ["2010-07-13", "Argentina", "Cipolletti, Rio Negro Province", 1, 0, "In an incident labelled as a \"terrorist act\" by Interior Ministry, a home-made bomb exploded in a police academy school and killed a municipal employee. A second bomb was defused at the scene."], ["2010-08-12", "Colombia", "Bogota, Colombia", 0, 9, "A suspected car bomb has exploded near the studios of a major radio station in the north of the Colombian capital, Bogota. Television pictures showed a bus with shattered windows and panicked residents in the streets following the explosion, which happened at around 0530 (1130 GMT), as the Caracol Radio morning show began."], ["2010-08-14", "United Kingdom", "Lurgan, Northern Ireland", 0, 3, "Three children are injured when a \"no-warning\" bomb exploded in a bin, in what the PSNI claim was an attempt to \"kill police or injure police officers providing a service to this community as they responded to a neighbouring area following a very vague warning that a device had been left at a local school.\""], ["2010-09-16", "Turkey", "Hakkâri Province, Turkey", 12, 3, "The attack occurred when a remote-controlled device explodes, on a minibus in the Turkish village of Gecitli in southeastern Hakkari near the borders with Iraq and Iran. 12 people have died, and another 3 were injured."], ["2010-10-01", "Nigeria", "Abuja, Nigeria", 12, 17, "Two car bombings in the capital city occurred during celebrations marking the 50th anniversary of the nation's independence."], ["2010-10-04", "United Kingdom", "Derry, Northern Ireland", 0, 2, "A carbomb left by the Real IRA explodes outside an Ulster Bank branch, injuring two police officers and causing extensive damage."], ["2010-10-07", "Iran", "Sanandaj, Iran", 5, 9, "The gunmen connected to counter-revolutionary cells opened fire on a police petrol vehicle and pedestrians in the Azadi square of Sanandaj in Kurdistan province, said police official Ebrahim Kazeminejad on Thursday."], ["2010-10-29", "Turkey", "Taksim Square, Istanbul, Turkey", 0, 32, "The 2010 Istanbul bomb blast was a suicide bombing which took place on Taksim Square in Istanbul, Turkey on October 31, 2010 at 10:34."], ["2011-01-19", "Russia", "Kabardino-Balkaria", 4, 1, "4 Russian tourists from Moscow were ambushed and killed on a Ski lift that was heading up to Elbrus Mountain. (Caucasus Emirate)"], ["2011-01-21", "Senegal", "Carongue", 3, 6, "Rebels killed three soldiers and wounded six others in Senegal's troubled Casamance region. Two of the injured are reported to be in serious condition. The government has been battling a low-level insurgency since the 1980s. (Movement of Democratic Forces of Casamance)"], ["2011-01-23", "Ivory Coast", "Abidjan", 10, 2, "Unidentified rebels ambushed four army vehicles, killing all of the occupants, in the major city of Abdigan, which acts as the economical capital of the Ivory Coast. (Forces Nouvelles de Côte d'Ivoire)"], ["2011-01-26", "Russia", "Moscow", 1, 0, "An unidentified individual blew himself up with a grenade outside a supermarket, killing only himself, in an unknown motivational attack, within the north-eastern sectors of Russia's capital city of Moscow."], ["2011-01-27", "Uganda", "Kampala", 1, 0, "Ugandan gay rights campaigner David Kato was murdered after Uganda's Rolling Stone magazine published an article calling for him to be hanged."], ["2011-01-31", "Somalia", "Mogadishu", 16, 56, "Somali governmental troops and local police exchanged fire in a shoot-out, with many civilians getting caught in the crossfire, within the Somali capital city of Mogadishu. (Transitional Federal Government)"], ["2011-03-02", "Germany", "Frankfurt", 2, 2, "A Kosovon was arrested for shooting two US Air Force personnel at Frankfurt's airport. Manfred Fuellhardt, the Frankfurt police spokesman, said one of the dead was a bus driver and the other was a passenger and that one of the wounded personnel was in serious conditions. Chancellor Angela Merkel condemned the \"terrible incident\" and pledged to carry out a full investigation. (Lone wolf)"], ["2011-03-03", "Madagascar", "Antananarivo", 0, 0, "President Andry Rajoelina escaped an assassination attempt after a bomb exploded by his car. His aide de camp Lieutenant Colonel Fidimalala Rafaliarison said that the bomb occurred after on the president's daily route home where the presidential convoy usually slows down and that there was no damage to the armour-plated car that the president sits in. He said an investigative team then go to the side and found a 150 metre long wire and explosive material hidden in the grass on the side of the road. Prime Minister Camille Vital said that \"Given the political context, it could be have been a political assassination attempt. It could be intimidation. In any case, investigations will show what really happened.\""], ["2011-03-03", "Nigeria", "Abuja", 13, 11, "A bomb attack struck a political rally that was based near to a market in Sulega, which is located some 40 km from Nigeria's capital city of Abuja. President Goodluck Jonathan reacted with vows that the perpetrators would not be punished. One person had been arrested."], ["2011-03-09", "Russia", "Moscow", 0, 0, "A bomb explosion occurred at a bus stop on Michurinsky Avenue, which is located near to Russia's FSB national anti-terrorist committee in south-eastern Moscow. No casualties were reported at the scene of this bombing, however nearby vehicles and the bus stop were damaged as a result of this bombing. (Caucasus Emirate)"], ["2011-04-02", "Northern Ireland", "Omagh", 1, 0, "In a widely condemned attack, a car bomb explodes killing Ronan Kerr, a Catholic member of the PSNI. (Suspected Dissident republicans[138])"], ["2011-04-08", "Nigeria", "Suleja", 10, 20, "A bomb explosion struck an office of the country's election commission, as citizens of the country inside the office were preparing for voting within the central town of Sulega, which is located in central Nigeria."], ["2011-04-09", "Netherlands", "Alphen aan den Rijn", 6, 17, "A gunman in the Netherlands has killed six people and wounded at least 11 before taking his own life."], ["2011-04-11", "Belarus", "Minsk", 14, 200, "A bomb explosion occurred at the escalators of the Minsk Metro at the peak of the evening rush hour, targeting commuters in the underground Metro system, near to President Lukashenko's central office, which is located in the centre of Belarus's capital city of Minsk."], ["2011-04-24", "Southern Sudan", "Jonglei", 55, 77, "At least 55 fighters were killed when south Sudan's army clashed with a rebel group in Jonglei State."], ["2011-05-03", "India", "Lohardaga, Jharkhand", 11, 40, "A landmine planted by Maoist rebels struck a convoy of police vehicles in the Lohardaga district, of the country's eastern state of Jharkhand, which is located in north-eastern India. (Communist Party of India (Maoist))"], ["2011-05-04", "Turkey", "Kastamonu", 1, 2, "An armed assault involving a grenade explosion and a shooting struck a police vehicle at a political rally in the country's north-eastern city of Kastamonu, which is located in north-eastern Turkey. (Kurdistan Workers' Party)"], ["2011-05-04", "Yemen", "Zinjibar", 9, 20, "Unknown gunmen have attacked a Yemeni military patrol, killing five soldiers and four civilians in the ensuing fire fight in the city of Zinjibar in the southern province of Abyan. (Islamic Jihad of Yemen)"], ["2011-07-13", "India", "Mumbai", 20, 130, "Three simultaneous blasts rocked India's financial capital. Two of the bombings were in the southern business centre parts of the city (Zaveri Bazaar and the Opera House). At this time it is still unknown if local or foreign groups are behind the attacks."], ["2011-07-14", "Turkey", "Diyarbakir Province", 20, 7, "Thirteen Turkish soldiers were killed in a battle with Kurdish PKK rebels. The rebels attacked the military camp with grenades, starting a fire in the process. The death toll includes seven militants who died in the firefight, as well as seven wounded soldiers. It also represents the highest single day loss of life in the country in more than 3 years. Turkish Prime Minister Recep Tayyip Erdogan told reporters \"Our security forces are strong... and I believe they will make them pay a heavy price.\"  (PKK)"], ["2011-07-19", "Guinea", "Conakry", 3, 0, "A former army chief and a member of the presidential guard were arrested hours after two attacks that have been labeled an assassination attempt. Both incidents took place at the president of Guinea's residence and involved gunfire and rocket launchers. Alpha Condé escaped without injury and later spoke to the country saying that \"My house was attacked last night, but I congratulate the presidential guard who fought heroically from 3.10 until 5:00 before backup arrived.\" He also added that his plans for reform would not fail."], ["2011-07-20", "India", "Chhattisgarh", 7, 4, "At least seven Indian National Congress party workers were killed and four others injured after a Naxalite ambush against a 25 car convoy travelling through the countryside in the state of Chhattisgarh, according to Chhattisgarh state Congress president Nandkumar Patel. Local police were still investigating the attack and the casualty number could rise. (Communist Party of India (Maoist))"], ["2011-07-22", "Norway", "Oslo and Utøya", 77, 319, "A massive bomb exploded outside Norwegian Prime Minister Jens Stoltenberg's office and other government office buildings, and later a shooting of Young members of the Labour party occurred on the Utøya island, both allegedly committed by right-wing militant Anders Behring Breivik in a supposed lone wolf attack. There have been 77 confirmed deaths. (Anders Behring Breivik (Lone wolf))"], ["2011-07-24", "Turkey", "Mardin Province", 3, 0, "Suspected Kurdish rebels ambushed a group of soldiers and shot three of them dead near a village in the southern province of Mardin, close to the border with Syria. This attack comes 10 days after another firefight that left 13 soldiers and 7 militants dead, following which the Turkish army began a large operation to counter the Kurdish rebel groups in the area. (PKK)"], ["2011-07-29", "Colombia", "Arauca department", 0, 5, "In a region where FARC and ELN are active, five petroleum industry workers employed by the US-based Occidental Petroleum Corporation were kidnapped by FARC rebels. A few days later, General Jaime Reyes, commander of the Army's 18th Brigade, said that \"[The Colombian Army] started an operation with three battalions in the area where the guerrillas fled with the hostages to secure the release of these people while trying to avoid combat so as not to hurt the workers. We did it.\" (FARC)"], ["2011-08-01", "India", "Imphal, Manipur", 5, 7, "A bomb blast at Sangakpham market in the Manipuri capital resulted in the deaths of two schoolgirls, amongst others. Chief Minister Okram Ibobi Singh blamed the National Socialist Council of Nagaland-Isaac Muivah for the incident; however the group issued a statement saying \"it will not accept any blanket allegation hurled against [them] and that it is not responsible for [the] incident.\" Singh claimed that this was the sixth such strike by the NSCN-IM in less that four months. (NSCN-IM (Accused, but denied))"], ["2011-08-17", "Turkey", "Hakkâri Province, Cukurca", 8, 15, "The PKK claimed responsibility for an ambush near the Iraqi border resulting in the deaths of Turkish soldiers. A spokesman for the PKK said that \"our forces have carried out an ambush against the Turkish army. Several Turkish soldiers were killed in the clashes, which have been continuing for two hours until now.\" Turkish security services said that the rebels used bombs and automatic gunfire; while Turkish Defence Minister Ismet Yilmaz said Turkey would \"retaliate in kind.\" The attack also follows Prime Minister Recep Tayyip Erdogan hinting at a tougher military response to the PKK after Ramadan as he said \"patience is running out\" following an increase in fighting the previous month. Reports later said that eight people had died. (PKK)"], ["2011-08-18", "Colombia", "between Puerto Wilches and Barrancabermeja, Santander department", 0, 3, "Three petroleum industury workers, employed by Petroseismic, who were contracted by the state-owned Ecopetrol. Though FARC and the ELN rebels were known to be present in the area it was later found that four armed men were responsible for the kidnapping, who Santander Interior Minister Constantino Tami said were holding the hostages for ransom payments. (Gangs)"], ["2011-08-18", "Russia", "Ingushetia", 1, 0, "Unknown gunmen shot Savarbek Matiyev, a senior police officer in Ingushetia, at his house at 22:50. A criminal case had been lodged as a result of the attack."], ["2011-08-18", "South Sudan", "Bier sub-county, Jonglei", 40, 0, "Murle tribals were suspected of attacking five villages of the Lou Nuer tribe mostly because of disputes over livestock. They allegedly burnt tukuls (huts) and, according to Kuol Manyang Juuk, the governor of Jonglei, \"They have gone away with cattle. Some children were also abducted, and women. It's known that Jonglei state tribes have been fighting [among] themselves and mainly for cattle.\" Though Juuk said 38 people were killed, he added that further investigation could lead to an increased toll as high as 50; the United Nations, however, said that it found 58 bodies in two different locations. (Murle tribe (Suspected))"], ["2011-08-20", "India", "Gurez district, Jammu and Kashmir", 13, 0, "The Indian Army said that it intercepted alleged \"heavily-armed militants tried to infiltrate\" crossing into the country from Pakistan. Lieutenant General JS Brar said that \"There were 12 terrorists who tried to cross over in a boat...and the Kishen Ganaga River is a de facto line of control in some areas and during the gun battle six fell in the river and six others were killed on the shore. [The six who fell into the river would not have survived] the fast torrent and the depth of this river.\" He added that \"More [fighters] will try over the next few months...but we are monitoring the area closely and we will kill them. They are desperate to infiltrate because they have not been able to infiltrate over the past few months. Their identities have not been confirmed but they are likely to foreigners, in other words, Pakistani. And though there are a couple of groups operating in the valley and we do not want to pre-empt and speculate which group they might have been involved with.\" (sic) One lieutenant Indian Army officer was also killed in the attack. (Indian Army)"], ["2011-08-25", "Pakistan", "Nowshera, Khyber Pakhtunkhwa", 10, 14, "A bomb planted on a child's bicycle exploded in the courtyard of a hotel as people were gathered for iftar. Mohammad Hussain, a senior police officer in Nowshera, said that toll could further rise after the initial report of nine deaths increased following the death of one of the wounded victims in hospital. He added that: \"The hotel was destroyed along with an adjacent hotel. Six nearby shops were badly damaged.\""], ["2011-08-28", "Turkey", "Cukurca, Van province", 1, 0, "Amidst protests by ethnic Kurds in Turkey over the bombing of Iraq in retaliations against PKK rebels, police fired tear gas on the protesters resulting in the death of Yildirim Ayhan, a provincial assembly member, after a tear gas canister hit him in the chest. Security sources confirmed that Ayhan had been hit by the canister, but also said that an autopsy was needed to determine the cause of death. (Turkish Armed Forces)"], ["2011-09-04", "Bosnia and Herzegovina", "Mostar", 0, 0, "6 cars were set on fire in front of the State agency of the Ministry in Mostar, three of which are state cars and the other three from civilians which were not public persons. Two of those cars were from Education Agency staff at the Ministry of Security, while the third one was from Ombudsman for Human Rights in BiH with diplomatic number plates of Spain, since that institution is also funded by the IC."], ["2011-11-25", "Canada", "Innisfail, Alberta", 1, 0, "A 23-year-old paraplegic single mother was killed after an unknown package left at her front door detonated as she tried to open it."], ["2011-12-09", "Italy", "Rome", 0, 1, "Tax agency director, Marco Cuccagna was injured after a letter bomb detonated at an Equitalia office in Rome. The injuries were caused by a glass desktop that was shattered during the explosion. (?)"], ["2011-12-12", "Nigeria", "Jos", 1, 10, "Multiple bombs were detonated at bar, resulting in the death of one person, and ten injuries. (?)"], ["2011-12-12", "Italy", "Florence", 3, 3, "Gianluca Casseri, member of Casa Pound opened fire in a suburb market where many Senegalese immigrants were selling goods. He killed two of them, and two are injured for life. He finally committed suicide. (Gianluca Casseri)"], ["2011-12-15", "Canada", "Claresholm, Alberta", 4, 1, "The shooter targeted his ex-girlfriend on the highway in Alberta, killing her and two of her male friends from Prince Edward Island, and injuring one other woman, before killing himself. (Derek Jensen)"], ["2011-12-16", "Kazakhstan", "Zhanaozen", 11, 86, "Police allegedly fired on a crowd of oil workers protesting. (Riot police)"], ["2012-01-03", "Rwanda", "Kigali, Rwanda", 2, 16, "A grenade explosion at a busy market in Rwanda's capital Kigali killed 2 and injured at least 16 in the latest in a string of similar attacks. Since 2010 the city has been hit by numerous grenade bombings, which the government blames on two high-ranking army officers in exile."], ["2012-01-17", "Ethiopia", "Afar Region, Ethiopia", 5, 3, "Unidentified attackers shot and killed at least 5 foreign tourists and kidnapped 4 people near the Erta Ale volcano in Ethiopia's northern Afar Region. At least three other tourists were injured and two Germans were among the kidnapped together with 2 Ethiopians. The dead included two Germans, two Hungarians and one Austrian. The government placed the blame on \"members of a group that was trained and armed by the Eritrean government. A number of insurgent groups from Ethiopia, Eritrea and Djibouti operate in the area."], ["2012-01-24", "Rwanda", "Muhanga, Rwanda", 0, 10, "A grenade explosion at a taxi rank in the southern city of Muhanga injured at least 10 in the latest in a string of similar attacks. Since 2010 the country has been hit by numerous grenade bombings, which the government blames on two high-ranking army officers in exile."], ["2012-02-01", "Colombia", "Tumaco, Colombia", 5, 20, "A motorcycle packed with explosives was detonated in front of a police station in the Pacific port city of Tumaco, killing at least 5 people and injuring 20 others. Government officials placed the blame on FARC, although no group has so far claimed responsibility. Ten soldiers were killed in a mortar attack close to the same city in October 2011."], ["2012-02-27", "Nepal", "Kathmandu, Nepal", 3, 7, "A powerful bomb exploded in front of the main offices of Nepal Oil in the capital Kathmandu, killing at least three people and injuring six more in the first major attack in the city in three years. The building targeted is very close to the fortified Singhadurbar complex housing several key ministries. A little-known militant organisation called the Unified National Liberation Front (Samyukta Jatiya Mukti Morcha) claimed responsibility the attack, which it claimed happened because of the government's inability to curb corruption and rising fuel prices. (Unified National Liberation Front)"], ["2012-03-01", "Turkey", "Istanbul, Turkey", 0, 16, "An explosion near the ruling party's headquarters in Istanbul wounded at least 16 people, most of them policemen that were passing by in a bus. No claim of responsibility has been received yet."], ["2012-03-01", "Nigeria", "Bayelsa State, Nigeria", 4, 0, "Gunmen ambushed a police patrol in the Niger Delta, shooting 4 officers to death. Responsibility was claimed by the Movement for the Emancipation of the Niger Delta in a press release the next day. (MEND)"], ["2012-03-11", "Nigeria", "Jos, Nigeria", 10, 0, "At least 4 people were killed and an unknown number were wounded after a car bomb exploded close to a church in the central city of Jos. Seucirty officials appear to have stopped the bomber at the gates of the church before he could approach the building itself. In the aftermath of the attack Christian youths set up roadblocks and killed at least 10 people in reprisal attacks. (Boko Haram suspected Christian mobs)"], ["2012-03-13", "Ethiopia", "Gambela Region, Ethiopia", 19, 8, "Unknown gunmen attacked a public bus in the southwest of the country, killing 19 passengers and injuring eight more."], ["2012-03-17", "Colombia", "Arauca, Colombia", 11, 2, "Eleven members of the Colombian Army were killed and 2 injured in an ambush by FARC rebels in the eastern department of Arauca. The group claimed responsibility for this latest attack, even as they recently denounced civilian kidnappings and promised to release all remaining hostages. (FARC)"], ["2012-04-27", "Ukraine", "Dnipropetrovsk, Ukraine", 0, 27, "At least four explosions hit the Ukrainian city of Dnipropetrovsk, leaving 27 people injured, including at least 9 children. No group has claimed responsibility and authorities are still searching for a motive. The city is the birthplace of jailed opposition leader Yulia Timoshenko."], ["2012-04-27", "Peru", "Apurímac Region, Peru", 3, 2, "Three soldiers were killed and two others seriously injured after an attack by Shining Path in the country's south-central region. This latest attack follows the kidnapping of 36 oil workers two weeks ago. That incident sparked a large military operation, during which a helicopter was downed by the rebels and at least six soldiers were reported dead. (Shining Path)"], ["2012-04-27", "Colombia", "Caquetá Department, Colombia", 8, 0, "Suspected FARC rebels shelled a police station in the country's south, but missed the target and hit a local house instead, killing two adults and an infant. Later an army patrol was ambushed in the southern Caquetá Department. At least five soldiers were killed in that attack."], ["2012-05-01", "Nepal", "Janakpur, Nepal", 4, 18, "Four people were killed and eighteen others injured after a bomb went off near a political rally in the southeastern Nepalese city of Janakpur. (JTMM)"], ["2012-05-15", "Colombia", "Bogota, Colombia", 2, 39, "In a rare attack in the Colombian capital Bogota, a bomb targeting former interior minister Fernando Londoño Hoyos killed his driver and a police officer and left him and almost 40 bystanders injured. No group has claimed responsibility for the attack, but leftist rebels belonging to FARC are the main suspects. The government announced a 500 million peso ($277,000) award for any information regarding the attackers."], ["2012-05-19", "Italy", "Brindisi, Italy", 1, 5, "Giovanni Vantaggiato, a 68-year-old storekeeper, detonated three gas cylinder bombs hidden in a rubbish bin in front of the \"Morvillo Falcone\" vocational school. The attack killed one student and injured other 5 girls. Vantaggiato, arrested on June 8, justified his deed as a form of protest, giving generic answers."], ["2012-06-08", "Ivory", "CoastMoyen-Cavally, Côte d'Ivoire", 15, 0, "Unidentified militiamen ambushed a UNOCI patrol in a remote southwestern province, killing seven UN peacekeepers and eight civilians. The Ivorian government promised a military operation to hunt down those responsible."], ["2012-06-29", "China", "Hotan, Xinjiang, China", 2, 13, "On Tianjin Airlines Flight GS7554 between Hotan and Urumqi, six ethnic Uyghur men, one of whom allegedly professed his motivation as jihad, announced their intent to violently hijacking. In the ensuing resistance by passengers, two hijackers were killed, and a second two hospitalized; 13 passengers and crew were injured by the aluminum crutch and explosive-armed hijackers, according to Chinese media."], ["2012-07-04", "Colombia", "Putumayo Department, Colombia", 5, 3, "Colombian leftist guerrillas ambushed a convoy belonging to state oil company Ecopetrol, killing 5 workers and injuring 3 others. The assault took place in a remote part of the southern Putumayo Department, near the border with Ecuador. (FARC)"], ["2012-08-20", "Turkey", "Gaziantep, Turkey", 9, 69, "A remote-controlled car bomb exploded outside a police station close to the border with Syria. At least nine people were killed and more than 60 injured, most of them police officers. Security officials suspected the PKK was behind the attack, although the group later denied this."], ["2012-09-01", "United Kingdom", "County Armagh, United Kingdom", 1, 0, "A prison officer was shot dead by gunmen on the M1 motorway between Lurgan and Portadown. It was reported that another then car drove up beside him and fired a number of shots at him, causing the car to swerve into a ditch. Dissident republicans were blamed for the attack."], ["2012-09-02", "Turkey", "Beytüşşebap, Turkey", 13, 7, "Around 100 suspected PKK fighters simultaneously attacked four government and security buildings in the small town of Beytüşşebap, near the border with Syria. At least 10 soldiers and 3 attackers were killed during the assault, while 7 soldiers were injured. (Kurdistan Workers' Party)"], ["2012-09-11", "Turkey", "Istanbul, Turkey", 1, 7, "A suicide bomber hurled a grenade at a police station, before detonating his vest in western Istanbul's Sultangazi neighborhood. One officer was killed and four injured, in addition to 3 civilians. The leftist group Dev Sol claimed responsibility for the attack in a statement published online. (Dev Sol)"], ["2012-09-15", "Turkey", "Batman Province, Turkey", 0, 4, "Helicopter working for a seismic company attacked, 4 security guards wounded. Seismic line equipment burnt on the 15th and 16th. (Kurdistan Workers' Party)"], ["2012-09-15", "Turkey", "Bingol Province, Turkey", 12, 9, "A roadside bombing in Turkey's southeastern Bingol Province killed 8 soldiers and injured 9 others, less than a day after 4 officers were killed in an attack near the borders with Iran and Iraq. (Kurdistan Workers' Party)"], ["2012-09-18", "Turkey", "Bingol Province, Turkey", 10, 60, "A group of suspected PKK fighters attacked a Turkish Army convoy with rocket-propelled grenades and small arms fire in the country's southeast. At least one bus was completely destroyed, killing 10 soldiers and leaving more than 60 others injured. Witnesses later reported seeing military F-16 jets taking off from the air base in Diyarbakir. (Kurdistan Workers' Party)"], ["2012-09-25", "Turkey", "Tunceli, Turkey", 7, 5, "An explosive device hidden in a car exploded as an Army patrol was passing by in the eastern Turkish city of Tunceli, killing 6 soldiers and a civilian. Several others were injured in the blast, which authorities blamed on the PKK. (Kurdistan Workers' Party)"], ["2012-10-02", "Nigeria", "Mubi, Nigeria", 24, 0, "Unknown assailants attacked a hostel near Federal Polytehnic campus in the northeastern Nigerian city of Mubi near the border with Cameroon. The gunmen went door-to-door for more than an hour, killing 22 students, a soldier and a security guard."], ["2012-10-19", "Lebanon Beirut, Lebanon", "A car bomb exploded at Sassine Square in the Lebanese capital of Beirut, killing at least 8 people (including a top intelligence officer) and wounding 110 others. Lebanese officials said the targer was Wissam al-Hassan, the head of the intelligence branch of the Lebanese Internal Security Forces and a prominent Sunni figure in the country. This was the first car bombing in Beirut since 2008.[100]", 8, 110, ""], ["2012-11-02", "Philippines", "Davao, Philippines", 4, 0, "Suspected NPA insurgents ambushed an army patrol in the south of the Philippines, killing 4 soldiers. (New People's Army (Communists))"], ["2012-11-05", "Bahrain", "Manama, Bahrain", 2, 1, "At least five homemade bombs exploded in the nation's capital, killing 2 Asian workers and injuring another."], ["2012-12-27", "Kenya", "Nairobi, Kenya", 5, 37, "At least 5 people were killed and 37 others injured after unknown attackers threw a grenade outside a mosque in Nairobi's predominantly Somali Eastleigh neighborhood. Among the wounded was Kenyan MP Abdi Yusuf Hassan, the district's representative."], ["2013-02-11", "Turkey", "Cilvegözü, Turkey", 13, 28, "A car bomb exploded at the Bab al-Hawa border crossing between Turkey and Syria, killing 13 people, including 3 Turkish citizens. At least 28 others were injured in the blast, which occurred after a Syrian-registered minivan was detonated close to a customs building on the Turkish side of the border."], ["2013-02-12", "Norway", "Oslo, Norway", 0, 0, "An unknown man stated that he was on his way to Oslo centre to blow up the Parliament during a bus tour. The statements were overheard by the bus driver who alerted police. When he was arrested, he was armed with a gas guns and wore a bulletproof vest. The man had repeatedly spoken out hatefully about Norwegian authorities. He was in his 20s and was born and raised in Norway, with possible ties to Norwegian Defence League, a fascist political organisation. (Unknown)"], ["2013-04-05", "Nigeria", "Bayelsa, Nigeria", 12, 0, "Militants ambushed a police patrol boat in Nigeria's southern delta region, killing all 12 occupants. The MEND group claimed responsibility, saying it was in response to jail sentence given to their leader Henry Okah. (MEND)"], ["2013-04-16", "India", "Bangalore, India", 0, 16, "A bomb placed on a motorcycle exploded next to the offices of the opposition Bharatiya Janata Party in the southern city of Bangalore, injuring 11 policemen and 5 civilians."], ["2013-04-28", "Italy", "Rome, Italy", 0, 4, "During Letta Cabinet swornig at Quirinale Palace in Roma, a gunman shot at four police officers, seriously injuring two, outside the premier's office. Luigi Preiti was sentenced to 16 years in prison. (Luigi Preiti)"], ["2013-05-04", "Philippines", "Sipalay, Philippines", 5, 2, "Suspected New People's Army militants raided a mining complex, burning several vehicles and buildings before being pursued by Philippine Army forces. In the ensuing firefight at least 5 soldiers were killed and two others injured, while insurgent casualties remained unknown. (New People's Army)"], ["2013-05-26", "Philippines", "Cagayan Province, Philippines", 7, 8, "Special Action Force personnel traveling to a hospital near Cataratan in the country's far north were targeted with a roadside bomb. Rebels then opened fire on their vehicle, killing 7 marines and stealing a number of weapons. (New People's Army)"], ["2013-07-02", "Libya", "Benghazi/Tripoli, Libya", 0, 7, "A car bomb exploded at a checkpoint that was being manned by special military forces, injuring four soldiers and at least three civilians. Additionally, in the capital Tripoli, an unnamed armed group attacked the interior ministry's building, resulting in its closure for the day. The armed men surrounded the building and blocked the entrance with sand. An Interior Ministry employee said: \"They were calling for the minister to resign because of his dependence on the Supreme Security Committee (SSC).\" (MilitiasSuspected)"], ["2013-07-02", "India", "Kathikund, Dumka district, Jharkhand, India", 6, 0, "An ambush against the Superintendent of Police of neighbouring Pakur district, Amarjit Balihar, resulted in his death, along with five other policemen. (Communist Party of India (Maoist))"], ["2013-07-09", "Lebanon", "Dahiyeh, Beirut, Lebanon", 0, 53, "A powerful car bomb exploded in the southern suburbs of the capital, a Hezbollah stronghold, suggesting that the attack was a response to the Syrian civil war. As Interior Minister Marwan Charbel visited the site, he was attacked by angry civilians, and the army had to fire in the air to disperse the crowd."], ["2013-07-15", "Nigeria", "Abaji, Nigeria", 0, 0, "Two gasoline-laden trucks were attacks with threats of more action against the national downstream petroleum industry. The attacks happened using military-grade timed magnetic explosives on the trucks that were queued outside a fuel depot operated by the state-owned Nigerian National Petroleum Corporation. MEND spokesman Jomo Gbomo said: \"From today, every tanker vehicle we find distributing petroleum products including propane gas has become a legitimate target in our war against injustice, corruption, despotism and oppression;\" he also warned the truck drivers that they worked at their own risk and also warned the public to keep a safe distance from such vehicles as \"they can explode anytime and anywhere.\" MEND added that such attacks would continue until Okah, his brother Charles and others jailed or facing trial for a 2010 Independence Day bombing in Abuja are released \"unconditionally;\" it also called for the resignation of Petroleum Minister Diezani Alison-Madueke. (MEND)"], ["2013-07-20", "Colombia", "Arauca, Colombia", 21, 6, "During clashes over two days, 17 Colombian forces died on the first day and four others the next day. At the same time the rebels, believed to be either FARC or ELN, had taken U.S. citizen Kevin Scott Sutay hostage on 20 June. The attacks occurred during peace talks in Cuba between the government and FARC. (FARC or ELN)"], ["2013-07-30", "Syria", "Qamishli, Syria", 1, 0, "A bomb in the northern Kurdish city near the Turkish border killed Kurdish opposition leader Issa Hisso. Though no one claimed responsibility for the attack, the Syrian Observatory of Human Rights and Kurdish member of the Syrian parliament, Omar Ossi, confirmed Hisso's death."], ["2013-08-04", "Russia", "Dagestan, Russia", 1, 0, "Sufi imam Ilyas Ilyasov was killed while in his car."], ["2013-08-05", "India", "Poonch district, India", 6, 0, "Late in the night an alleged ambush by Pakistani troops in India's Jammu and Kashmir resulted in the deaths of Indian soldiers. The Indian government stated it was carried out by Pakistani troops. Defence Minister A. K. Antony later said that the perpetrators were \"20 heavily-armed terrorists, along with persons in Pakistani army uniform\" creating confusion. He added that \"a strong protest\" was lodged with the Pakistani government. Jammu and Kashmir Chief Minister Omar Abdullah wrote on Twitter: \"Was briefed early this morning about news that 5 of our soldiers had been killed on the LOC. My heartfelt condolences to their next of kin.\" In return, Pakistan's Foreign Ministry dismissed the allegations as \"baseless and unfounded,\" it denied the exchange of fire took place and added that it was committed to the 2003 ceasefire in Kashmir."], ["2013-08-17", "Libya", "Benghazi, Libya", 0, 0, "As dozens of protesters were at the Egyptian consulate agitating against the government crackdown three days earlier in Egypt, unknown assailants threw an explosive device at the building resulting in damages to the windows and of nearby buildings, according to security spokesman Abdallah al-Zayedi. It also caused part of the outer wall to the compound to collapse. Police then cordoned off the area."], ["2013-09-19", "Kosovo", "Zvecan, Kosovo", 1, 2, "At approximately 7:30, two vehicles carrying six EULEX staff members came under fire in the vicinity of Zvecan town resulting in one dead customs officer from Lithuania. EULEX issued a statement condemning the attack, which it called an \"act of cowardly violence and mindless terrorism against its staff members.\" "], ["2013-10-24", "Libya", "Benghazi, Libya", 1, 0, "Gunmen shot air force Colonel Adel al-Tawahi from Beninah air as he left his home in his chest and head, which kiiled him instantly. He was known for sending the initial airplanes that targeted Muammar Gaddafi's convoy in August 2011, as it left for the latter's hometown of Sirte."], ["2013-10-26", "Mozambique", "Muxungue, Sofala, Mozambique", 1, 10, "An attack occurred against three civilian vehicles early in the morning which President Armando Guebuza's office blamed on Renamo. However Renamo spokesman Fernando Mazanga said: Renamo distances itself from the attack in Muxungue. We carried out our investigations and came to the conclusion that it was not carried out by Renamo.\""], ["2013-11-13", "Philippines", "Matnog, Sorsogon, Philippines", 2, 1, "The New People's army attempted to ambush a relief convoy of the Philippine Army and Red Cross en route to Tacloban to deliver relief goods to the victims of Typhoon Haiyan. The suspected communist rebels suffered two casualties and one injury. There were no casualties from the side of the government forces. (New People's Army)"], ["2013-12-17", "India Dibrugarh", "Assam, India", 1, 9, "Suspected militants detonated a crude bomb planted below an electric pole in Dibrugarh, Assam killing one teenage girl and wounding nine others."], ["2013-12-27", "Lebanon", "Beirut Lebanon", 8, 70, "At approximately 9:40am, a car bomb struck the convoy of Mohamad Chatah, a former Lebanese minister of finance and ambassador to the United States. The bombing killed a total of eight people, among them Chatah, and injured seventy others."], ["2014-01-02", "Kenya", "Diani, Kenya", 0, 10, "Three attackers hurled a grenade into the Tandoori bar in the Kenyan resort town of Diani, south of the port city of Mombasa, wounding ten people. No organization claimed responsibility for the grenade attack, however the region is a popular target area for Islamic extremists. (Unknown)"], ["2014-01-02", "Cameroon", "Oundjiki, Cameroon", 3, 0, "Assailants attacked a group of Cameroonian soldiers in the border village of Oundjiki, East region, Cameroon. The assailants crossed into Cameroon from the Central African Republic. A village leader, two soldiers and four assailants were killed in the attack. No group claimed responsibility for the incident; however, sources attributed the attack to Séléka. (Séléka)"], ["2014-01-06", "Nigeria", "Shonong, Plateau, Nigeria", 34, 24, "More than 100 gunmen attacked the Shonong village, Bachit District, Plateau state, Nigeria. Thirty four people were killed and 24 others were wounded. Additionally, 56 homes were burned down and dozens of domesticated animals were stolen or killed in the attack. No group claimed responsibility for the incident; however, surviving victims and local authorities attributed the attack to Fulani militants. (Fula millitants (suspected))"], ["2014-01-11", "Austria", "Vienna, Austria", 2, 0, "A hand grenade exploded inside of a vehicle in the Ottakring district of Vienna city, Vienna state, Austria. Two people, an Austrian Social Democratic Party councilor and his German companion, were killed in the attack. An autopsy later showed that the Austrian had been shot several times before the grenade exploded. No group claimed responsibility for the incident. (Unknown)"], ["2014-01-16", "Central African Republic", "Bossembele, Central African Republic", 43, 12, "Assailants attacked a mosque in Bossembele town, Ombella-M'Poko prefecture, Central African Republic. At least 43 people were killed and at least 12 others were injured in the attack. No group claimed responsibility for the incident; however, authorities attributed it to an anti-Balaka militia. (Anti-balaka)"], ["2014-01-17", "Thailand", "Bangkok, Thailand", 1, 35, "A blast occurred, most likely from a grenade as reported by Bangkok police officials, at a rally led by an oppositional protest leader Suthep Thaugsuban during the ongoing political crisis that started in November 2013. One person died of shrapnel wounds and blood loss on January 18, 2014, and 35 people were injured. (Unknown)"], ["2014-01-20", "India", "Jamshedpur, Jharkhand, India", 1, 0, "Assailants in pursuit of Lakhai Hansda, Vice President of the Jharkhand Mukti Morcha state political party, threw a grenade at him and fled. Hansda was fatally wounded. Indian police were unable to locate the attackers."], ["2014-01-25", "Madagascar", "Antananarivo, Madagascar", 1, 31, "Assailants threw a grenade at civilians outside of Mahamasina Stadium in Antananarivo city, Analamanga region, Madagascar, after the inauguration of new president Hery Rajaonarimampianina. At least one person, a two-year old baby, was killed and at least 31 other people were injured as a result of the blast. No group claimed responsibility for the incident. (Unknown)"], ["2014-01-31", "South Sudan", "Juer, South Sudan", 35, 10, "Assailants attacked Juer town in Bahr el Ghazal region, South Sudan. At least 35 people were killed and 10 others wounded in the attack. No group claimed responsibility for the incident. (Unknown)"], ["2014-02-04", "Yemen", "Sana'a, Yemen", 2, 10, "Two soldiers were killed and an additional ten soldiers injured after a bomb exploded on a Sanaa street as their military bus passed by transporting troops to their base. (Unknown)"], ["2014-02-07", "Egypt", "Cairo, Egypt", 0, 6, "Two bombs exploded near Giza Square, a popular anti-military staging area for Morsi Brotherhood protesters, targeting two police patrols causing six police officers to report to hospital with varying degrees of injuries. A BBC correspondent who arrived to report on the explosions noted that there was minimal damage caused by the two blasts. (Soldiers of Egypt)"], ["2014-03-17", "Libya", "Benghazi, Libya", 8, 13, "A car bomb detonated at the gates of the military academy in Benghazi, eastern Libya, followed by two more bombings in the compound, targeting graduating military recruits. Eight were killed and 13 others wounded. (Unknown)"], ["2014-03-27", "India", "Gadchiroli, India", 15, 0, "A landmine explosion killed at least 15 policemen. Officials blamed Maoist rebels. (Left-wing insurgents (suspected))"], ["2014-04-02", "Egypt", "Cairo, Egypt", 1, 5, "Two bombs detonated next to a police station near Cairo University killing a police chief and injuring five others. (Unknown)"], ["2014-04-15", "Egypt", "Cairo, Egypt", 0, 3, "A bomb detonated at a traffic police post, injuring two police officers and one civilian. (Unknown)"], ["2014-04-18", "South Sudan", "Bor, South Sudan", 20, 100, "During the South Sudanese Civil War, armed men stormed a United Nations Mission in South Sudan shelter, killing at least 20 people and injuring at least 70 others. (Pro-government (Kiir) civilian militia[144])"], ["2014-04-24", "India", "Dumka, Jharkhand, India", 8, 0, "Suspected left wing insurgents detonated a car bomb outside a polling station in Dumka, Jharkhand, killing two policemen and six polling officials. (Left wing insurgents)"], ["2014-05-01", "India", "Baksa and Kokrajhar, Assam, India", 32, 0, "On May 1, Insurgents raided the Narsingbari village of Baksa district opening fire on a house, killing three women and injuring two others. The attackers had arrived on a bicycle. On 2 May, another group of insurgents opened fire at three houses in Balapara village of Kokrajhar district, killing seven people. On the evening of the same day, another group killed 12 people and burnt down 30 thatched houses near Baksa's Manas National Park. On 3 May, four suspected insurgents attacked police in the forest near Tejpur. Police fired in retaliation, killing two, while two others escaped. Police also killed one more suspect in Udalguri district from whom they recovered a revolver and a hand grenade. (National Democratic Front of Bodoland)"], ["2014-05-08", "United States Las Vegas", "Nevada, United States", 3, 0, "Two lone wolf attackers killed two police officers as they were eating lunch, then went to a nearby Walmart and killed a shopper before both killing themselves. (Lone wolf Sovereign Citizen Movement)"], ["2014-05-14", "Tanzania", "Stone Town, Zanzibar, Tanzania", 1, 7, "An assailant threw a hand-made explosive device into a mosque killing one and wounding seven others. (Unknown)"], ["2014-05-22", "South Korea", "Goseong County, Gangwon, South Korea", 5, 1, "A renegade soldier threw a grenade at and then opened fire on his colleagues, killing five and wounding at least one other. He subsequently fled towards North Korea. The motive behind the shooting was unclear. (Lone Wolf (likely))"], ["2014-05-23", "Central African Republic", "Ardo-Djobi, Central African Republic", 18, 0, "An Anti-balaka militia attacked a Muslim village of Fulani tribesmen, killing at least 18 people. (Anti-balaka)"], ["2014-05-25", "Djibouti", "Djibouti", 3, 15, "Two suicide bombers detonated their explosives at a busy restaurant frequented by international soldiers, killing three people and injuring another 15. (Unknown)"], ["2014-11-06", "Egypt", "Cairo, Egypt", 2, 8, "A bomb detonated inside a train carriage in Menufiya province in the north of Cairo. Passengers were in progress of evacuated while police were investigating the bomb when it detonated, killing two police officers and injuring eight people. (Unknown)"], ["2014-11-16", "United Kingdom", "Belfast, Northern Ireland", 0, 0, "A rocket was fired at an armoured Land Rover in Belfast. The police officers inside were unharmed. It has been blamed on dissident republicans. (Dissident republicans)"], ["2014-11-28", "United States", "Austin, Texas", 0, 0, "A man was killed while shooting at the Austin police department headquarters after shooting at a federal courthouse and a Mexican consultate, which he tried to set on fire. Later investigation showed that he identified with the Phineas Priesthood and had 34 targets in total. (Phineas Priesthood)"], ["2014-12-28", "India", "Bangalore, India", 1, 3, "A low intensity blast killed one woman and injured three men in Bangalore, India. (Unknown)"], ["2015-01-06", "Turkey", "Istanbul, Turkey", 1, 1, "January 2015 Istanbul suicide bombing: A female suicide bomber detonated her explosives in front of a police station, killing one officer, wounding one officer, and killing herself in the process. (DHKPC)"], ["2015-01-13", "Ukraine", "Volnovakha, Ukraine", 12, 18, "Volnovakha bus attack: The Volnovakha bus attack was an MRLS attack on a highway checkpoint near the village of Buhas outside the Volnovakha municipality in the Donetsk Oblast, Ukraine. It resulted in the deaths of 12 passengers of an intercity bus and injuries to 18 others in the area. OSCE Special Monitoring Mission found that all craters were caused by rockets fired from a north-north-eastern direction. These territories were controlled by Donetsk People's Republic. (Donetsk People's Republic)"], ["2015-01-22", "Ukraine", "Donetsk, Ukraine", 13, 0, "Donetsk bus shelling incident: In Donetsk, Ukraine, two military shelling projectiles exploded near a trolleybus and a car. Early reports indicated at least 13 people, all civilians, were killed. (Donetsk People's Republic or Armed Forces of Ukraine (suspected))"], ["2015-01-24", "Ukraine", "Mariupol, Ukraine", 30, 108, "January 2015 Mariupol rocket attack: An MRLS attack on Mariupol was launched by pro-Russian forces associated with the Donetsk People's Republic. Shelling killed 30 civilians and injured 108. The OSCE Special Monitoring Mission conducted an analysis, and its initial assessment showed that the impacts were caused by Grad and Uragan rockets that were fired from areas controlled by the \"Donetsk People's Republic\" (\"DPR\"). (Donetsk People's Republic)"], ["2015-02-10", "Ukraine", "Kramatorsk, Ukraine", 7, 26, "There was a military shelling incident involving 7 civilian fatalities, which happened on February 10, 2015, in Kramatorsk, Ukraine. Shelling killed 7 civilians and injured 26, including 5 wounded children. 32 Ukrainian Armed Forces personnel were also injured at Kramatorsk airport. OSCE Special Monitoring Mission assessed that the shells were heavy 300mm calibre ammunition fired from a BM-30 Smerch or a latest Tornado Multiple Launch Rocket System (MLRS). Local authorities said the rockets were fired from the DPR-controlled Horlivka, which is about 50 km away from the Kramatorsk. (Donetsk People's Republic)"], ["2015-02-14", "Philippines", "Mati, Davao Oriental, Philippines", 5, 3, "At least 50 New People's Army members attacked a police station in Mati, Davao Oriental. 30 Police officers on duty were able to defend the police station from attacks prompting the rebels to retreat using three vans. The Philippine Army pursued the escaping militants. A landmine was triggered killing three soldiers and injuring one. Another soldier was killed when he crossed through a NPA checkpoint. The 701st Brigade was caught up with the retreating militants and engaged in a firefight with the communist rebels killing one rebel, but sustaining two more injuries. (New People's Army)"], ["2015-02-22", "Ukraine", "Kharkiv, Ukraine", 4, 10, "2015 Kharkiv bombing: An explosion at a pro-Ukraine march killed 4 persons and injured more than 10 in Kharkiv, Ukraine. The police informed the OSCE Special Monitoring Mission that the device consisted of the explosive trinitrotoluene (TNT) and shrapnel concealed in a plastic bag and was detonated remotely. Security Service of Ukraine informed OSCE SMM that three suspects associated with the bombing in Kharkiv had been arrested on 26 February, all of whom are linked to Anti-Maidan groups involved in the take-over of government buildings in April 2014. (Anti-Maidan)"], ["2015-03-20", "India", "Kashmir, India", 4, 10, "Two heavily armed militants wearing Indian Army uniforms opened fire on a police station near the Pakistani border early Friday, killing three Indian security personnel and a civilian. (Unknown)"], ["2015-03-31", "Turkey", "Istanbul, Turkey", 1, 2, "In Istanbul at a courthouse, the Revolutionary People's Liberation Party-Front of Turkey took one hostage a prosecutor dealing with the case of a 15-year-old who died in a police gas attack. The situation ended with police killing the gunmen. The prosecutor later died at the hospital. (Revolutionary People's Liberation Party-Front)"], ["2015-04-02", "India", "Arunachal Pradesh, India", 3, 4, "An ambush of an army convoy in Arunachal Pradesh in the remote northeast killed three soldiers and wounded four others. (Unknown)"], ["2015-04-02", "India", "Kashmir, India", 5, 7, "Gunmen attacked Indian forces in northeastern India and Kashmir on Thursday, killing five security personnel and wounding seven other people. (Unknown)"], ["2015-04-21", "Republic of Macedonia", "Lipkovo, Republic of Macedonia", 0, 3, "40 armed men took over a police station at the border of Kosovo, tied the policemen and beat them the policemen and stole arms and equipment. See: Gošince attack (NLA)"], ["2015-05-03", "India", "Nagaland, India", 8, 6, "At least eight Assam Rifles personnels have been killed and six others injured in an ambush by suspected NSCN militants in Mon district of Nagaland on Sunday afternoon. Four other jawans of the paramilitary force are reported missing. (NSCN)"], ["2015-05-09", "Republic of Macedonia", "Kumanovo, Republic of Macedonia", 22, 37, "Kumanovo shootings: On 9 May 2015 an armed group clashed with police and army forces of the Republic of Macedonia in Kumanovo in northern Republic of Macedonia. Kumanovo is situated 40 km from the capital city of Skopje. (UÇK)"], ["2015-05-25", "Tunisia", "Tunis, Tunisia", 7, 9, "Tunis barracks shooting: A Tunisian soldier kills 8 of his fellow soldiers and injures 9 others in a shooting rampage in Tunis before killing himself. (Unknown)"], ["2015-06-04", "India", "Manipur, India", 20, 11, "The attack, in the Chandel district of Manipur State close to the border with Myanmar, was carried out against a small convoy of army vehicles traveling from one army camp to another in the hilly and forested area about 60 miles south of the state capital, Imphal. (Unknown)"], ["2015-06-17", "United States", "Charleston, South Carolina, United States", 9, 1, "Charleston church shooting: White supremacist Dylann Roof shot and killed nine black people during a Bible study at the Emanuel African Methodist Episcopal Church in an attempt to spark a race war. (Dylann Roof (lone wolf))"], ["2015-06-29", "Chad", "N'Djamena, Chad", 11, 0, "Five Chadian security officials and six militants was killed during an explosion in a raid in the capital N'Djamena. (Unknown)"], ["2015-07-27", "India Punjab, India", "Gunmen dressed in Indian Army uniforms opened fire on a civilian bus and then took over a police station in the northern state of Punjab early on Monday, killing at least five people, the police said, in a region that has been mostly calm since India quelled a Sikh insurgency there two decades ago.[29]", 10, 8, "Unknown"], ["2015-07-28", "Bahrain", "Sitra, Bahrain", 2, 6, "Two policemen were killed and six others injured in a bombing in the village of Sitra in Bahrain. (Unknown)"], ["2015-07-31", "Israel", "Jerusalem", 1, 5, "Thirty-nine-year-old Yishai Schlissel, an ultra-Orthodox Jew, stabbed six people in a Jerusalem gay pride parade. Among them was 16-year-old Shira Banki, who died from her wounds two days later. Shlissel had been recently released from prison after serving a ten-year sentence for stabbing three people in a similar gay pride parade in 2005. (Yishai Schlissel (lone wolf))"], ["2015-07-31", "Duma", ", West Bank", 3, 1, "Duma arson attack: Two masked men arrived at two houses in Duma and threw two Molotov cocktails into the houses. One of the houses was empty; in the other, the Daobasa family slept and the explosive burned the house, killing 18-months-old Ali Saad and severely wounding his parents and his 4-year-old brother. The father of the family succumbed to his wounds on 8 August. (Jewish gang)"], ["2015-08-02", "Turkey", "Dogubeyazit, Turkey", 2, 24, "A suicide attack by the PKK kills two Turkish Army soldiers and injures 24 in the Turkish town of Dogubeyazit in Agri Province near the Iran border.[citation needed] (Kurdistan Workers' Party (PKK))"], ["2015-08-17", "Thailand", "Ratchaprasong Intersection, Bangkok", 21, 123, "2015 Ratchaprasong bombing: Bomb attack outside the Erawan Shrine at the Ratchaprasong Intersection in Pathum Wan District, Bangkok, Thailand. (Grey Wolves (suspected))"], ["2015-08-19", "Turkey", "Siirt Province, Turkey", 8, 0, "Eight soldiers were killed in a bomb attack in Turkey's south-eastern Siirt Province. Kurdistan Workers' Party was blamed for the attack. (Kurdistan Workers' Party (PKK))"], ["2015-08-21", "France", "Oignies, Pas-de-Calais", 0, 3, "2015 Thalys train attack: A man opened fire with an AKM assault rifle on a Thalys high speed train between Amsterdam and Paris. One person was shot in the neck. Two United States military personnel and their civilian friend intervened and stopped the attack continuing. One of them was cut in the struggle. Another passenger received glass cuts. (Ayoub El Kahzani[71])"], ["2015-10-01", "Turkey", "Mardin, Turkey", 4, 7, "Four Turkish soldiers were killed in PKK attacks across southeastern Turkey. (PKK)"], ["2015-10-11", "Ireland", "Omeath", 1, 1, " (New IRA)"], ["2015-10-19", "Philippines", "Bhutan Philippines", 2, 0, "Loreto Mayor Dario Otaza and his son Daryl were kidnapped and killed by the New People's Army (NPA). The militant group says that Otaza and his son were guilty of war crimes, crimes against humanity and other human rights violations. Otaza was also a former NPA commander and a Lumad himself and has been advocating against the armed struggle and for the reintegration of NPA rebels to mainstream society. 19 NPA members has been criminally charged for the incident. (New People's Army)"], ["2015-10-22", "Sweden", "Trollhättan, Sweden", 3, 1, "Trollhättan school attack: 21-year-old Anton Lundin Pettersson attacked Kronan School in Trollhättan, Sweden, with a sword. He killed a teaching assistant and a male student, stabbed another male student and a teacher, and died later of the gunshot wounds he received during his apprehension. The second teacher who was wounded died in hospital six weeks after the attack, on 3 December. (Anton Lundin Pettersson)"], ["2015-11-21", "Philippines", "Maasim, Philippines", 0, 0, "Three rebels suspected to be from the Front 73 guerrilla unit of the New People's Army attacked a compound of a pineapple plantation owned by Dole Philippines and burned a tractor, a bulldozer and a 'Saddam' truck of the company by using siphoned fuel from one of the vehicles. It was initially reported that three company guards were hurt in the incident but it was later said that no one was hurt. (New People's Army (suspected))"], ["2015-11-27", "United States", "Colorado Springs, Colorado, United States", 3, 9, "2015 Colorado Springs shooting: A shooting and five-hour standoff with police occurred at a Planned Parenthood clinic in Colorado Springs, Colorado. A police officer and two civilians were killed. Five officers and four civilians were injured. The suspected shooter, identified as Robert Lewis Dear, was captured alive after police convinced him to surrender. His motives appear to be political (specifically anti-abortion) in nature. (Robert Lewis Dear (lone wolf))"], ["2015-12-12", "Philippines", "Near Mabini, Philippines", 3, 14, "Militants planted a land mine-styled explosive device and detonated it on a group of Philippine soldiers patrolling on a road near Mibani town in southern Philippines. The blast killed three: two soldiers and a civilian, another 14 were wounded. Attack was attributed to New People's Army. (New People's Army)"], ["2016-01-13", "Turkey", "Diyarbakır Province, Turkey", 5, 36, "A massive bomb blast, followed by rocket and long gun fire, destroyed a police headquarters in the city of Cinar in the Diyarbakir Province. 5 people, including a baby, were killed and 36 were wounded. 8 terrorists were killed in clashes with police following the bombing. The militant Kurdish organization PKK has been blamed for the blast and accused of launching more attacks in the towns of Bismil, Cizre, Mardin, Silopi, Sirnak, and Van. (PKK)"], ["2016-01-15", "India", "Koraput, India", 1, 0, "About 20 armed Maoists dragged a former Naib Sarpanch (deputy head of village level local self-government institution) identified as Krishna Miniaka to a nearby forest in Kandho Tikarapada village and there executed him. He was killed on the suspicion of being a ‘police informer’. CPI-Maoist claimed responsibility. (Communist Party of India (Maoist))"], ["2016-01-15", "Burkina Faso", "Tin Abao, Burkina Faso", 2, 2, "Around 20 unidentified heavily armed militants attacked policemen in Tin Abao village, in Tin-Akof near the border with Mali, killing two and wounding two. No group claimed responsibility. (Unknown)"], ["2016-01-18", "Turkey", "Sirnak province, Turkey", 3, 4, "Three policeman were killed by an IED in the province of Sirnak while 4 other were injured. According to the authority, PKK was responsible. (PKK (suspected))"], ["2016-01-27", "Turkey", "Diyarbakır Province Turkey", 4, 0, "A clashes between soldier and PKK terrorist left 4 soldier dead in Diyarbakır Province, Sur district. (PKK)"], ["2016-02-05", "Republic of Ireland", "Dublin, Ireland", 1, 2, "Several men wielding AK-47s opened fire on a Dublin hotel where a weigh-in for a boxing match was taking place, killing one man and wounding another two. The CIRA claimed responsibility and said that the shooting was retaliation for the murder of Real IRA leader Alan Ryan at the hands of a drug dealer. (CIRA)"], ["2016-02-06", "Burundi", "Bujumbura, Burundi", 4, 10, "Four people have been killed in Burundi in a grenade attack on a bar in the capital Bujumbura, officials say. Among the victims was a child selling boiled eggs. Ten other people were injured in Saturday's attack. Unknown attackers also threw grenades at an army patrol and at police in Bujumbura, hurting several people. (Unknown)"], ["2016-02-17", "Turkey", "Ankara, Turkey", 30, 61, "February 2016 Ankara bombing: At least 30 people died and 61 were injured in the Turkish capital. The attack targeted the army buses near the central square of Kizilay. Many ministries, the headquarters of the army and the Turkish parliament are in this neighbourhood. The Turkish news channels showed images of a raging fire that engulfed military vehicles. The explosion was audible several kilometers away. (Kurdistan Freedom Falcons)"], ["2016-02-18", "Turkey", "Diyarbakır, Turkey", 6, 1, "2016 Diyarbakır bombing: A bomb killed at least 6 soldiers and another were injured. The attack occurred on 18 February 2016 in Diyarbakır a city in Diyarbakır Province. (Kurdistan Freedom Falcons)"], ["2016-02-19", "Turkey", "Diyarbakir, Turkey", 3, 0, "At least 2 soldiers and one police officer die in an PKK attack in Diyarbakir. (PKK)"], ["2016-02-20", "India", "Srinagar, India", 2, 10, "Several gunmen attacked a paramilitary convoy in Indian Kashmir, killing two soldiers, after they fired on an office building, where there were one hundred people. They also injured ten people. Two attackers were killed. (Unknown)"], ["2016-02-22", "Philippines", "Esperanza, Sultan Kudarat, Philippines", 1, 38, "Two attackers on motorcycles threw two grenades into a crowd. The attack in the town of Esparanza wounded 38 people and killed a child of six years. (Unknown)"], ["2016-02-22", "Burundi", "Bujumbura, Burundi", 2, 9, "Assailants on a motorcycle threw three grenades into a crowd. The first grenade was thrown at Kwa Siyoni market in the district of Ngagara (north of the capital), killing one person and wounding seven. A second exploded in the market Kamenge (northeast) also killing one person and injuring two, followed by a third grenade, launched in Butere district (north-west of the capital), which has no injuries. This new killer episode comes a few hours after the arrival of the Secretary-General of the United Nations, Ban Ki-moon. Three men were arrested in connection with the attacks. (Unknown)"], ["2016-02-23", "Burundi", "Bujumbura, Burundi", 0, 10, "During the night of February 23, assailants threw ten grenades in deserted places of the city or on soldiers. Two soldiers were wounded in the Mutakura and another in the Musaga district. Relating the count of injured civilians, authorities said \"a dozen\". (Unknown)"], ["2016-03-03", "Turkey", "Istanbul, Turkey", 0, 1, "Two women opened fire on a police station in the suburbs of Istanbul. Police fired back and wounded one of the women before the two fled. Police later cornered the two women and killed them both in a raid. A police officer was also wounded in the raid. (DHKP-C)"], ["2016-03-04", "United Kingdom", "Belfast, United Kingdom", 1, 0, "A Prison Officer was badly wounded when a booby-trap bomb exploded under his van on Hillsborough Drive, East Belfast. The RIRA claimed responsibility but referred to themselves as the New IRA and said it was a response to the alleged mistreatment of republican prisoners at Maghaberry Prison. It added that the officer was targeted because he trained Prison Officers at Maghaberry. The Prison Officer later died from result of the attack. (New IRA)"], ["2016-03-04", "Turkey", "Nusaybin, Turkey", 2, 35, "Two policemen were killed and 35 people injured in the explosion of a car bomb and in a rocket attack in the Mardin Province in southeastern Turkey. The attack occurred in the town of Nusaybin, near the Syrian border. The operation was not claimed immediately, but it would be the fact of fighters Kurdistan Workers' Party (PKK), according to Turkish security services. (PKK (suspected))"], ["2016-03-10", "Turkey", "Diyarbakir, Turkey", 1, 0, "A Turkish soldier succumbed to his wounds on March 10 after sustaining injuries in an outlawed Kurdistan Workers’ Party (PKK) attack in southeastern Diyarbakır's Sur district last month. (PKK)"], ["2016-03-10", "Sudan", "North Darfur, Sudan", 1, 1, "A unidentified gunmen killed a South African soldier and a wounded another in an ambush on a patrol of the hybrid peacekeeping mission in North Darfur. (Unknown)"], ["2016-03-12", "Democratic Republic of the Congo", "Virunga National Park, Democratic Republic of Congo", 2, 0, "Two guards of the Virunga National Park were killed by militiamen Mai-Mai with the Democratic Forces for the Liberation of Rwanda. . (Mai-Mai with FDLR)"], ["2016-03-13", "Turkey", "Ankara, Turkey", 37, 125, "March 2016 Ankara bombing: A car bombing in the Kizilay area of Ankara killed at least 34 people and wounded at least 125. The bombing caused several vehicles to catch on fire and gunfire was heard after the blast. (Kurdistan Freedom Falcons)"], ["2016-03-15", "Philippines", "Masbate, Philippines", 0, 2, "11 bomb explosions also rocked the politically tense province of Masbate, wounding two policemen.  (New People's Army)"], ["2016-03-16", "Burundi", "Bururi and Makamba, Burundi", 2, 0, "Two Burundi officials were slain in shootings on Tuesday night because of their support for president Pierre Nkurunziza. (Unknown)"], ["2016-03-19", "Philippines", "Bicol Region, Philippines", 0, 7, "Five soldiers and two civilians were hurt in separate bomb blasts perpetrated by the New People's Army (NPA) in the Bicol province  (New People's Army)"], ["2016-03-22", "Turkey", "Nusaybin, Turkey", 1, 6, "PKK killed with bomb one Turkish soldier and 6 others were injured in Nusaybin a city in Turkey. (PKK)"], ["2016-03-22", "Burundi", "Bujumbura, Burundi", 2, 0, "Two top military officials in Burundi were assassinated by unknown gunmen in the Burundian capital Bujumbura on Tuesday. On Tuesday around midday, Lieutenant Colonel Darius Ikurakure, who was a close ally of President Pierre Nkurunziza, was shot and killed at the Defense Ministry compound by a man who was dressed in military uniform. Hours after Mr. Ikurakure's assassination, Major Didier Muhimpundu was shot and killed outside a bar in Bujumbura. (Unknown)"], ["2016-03-23", "Rwanda", "Rubavu District, Rwanda", 1, 0, "An armed man wearing DR Congo military uniform was killed on the Rwandan territory following an attack on a Rwanda Defence Forces. One of the attackers died. (Armed Forces of the Democratic Republic of the Congo)"], ["2016-03-24", "Burundi", "Bujumbura, Burundi", 0, 4, "At least four people were injured after two grenades exploded outside the army hospital in the capital. (Unknown)"], ["2016-03-24", "Turkey", "Şırnak, Turkey", 1, 0, "In addition, one police officer was also killed on March 24 in a PKK attack in the southeastern province of Şırnak.  (PKK)"], ["2016-03-24", "Turkey", "Nusaybin, Turkey", 1, 4, "PKK militants detonated an explosive in the Nusaybin district of the southeastern province of Mardin. One specialized sergeant was killed and four soldiers were wounded. (PKK)"], ["2016-03-24", "Turkey", "Nusaybin, Turkey", 2, 5, "In a separate attack in the district, two soldiers were killed and five others were wounded when PKK militants detonated explosives placed on a road during the passage of soldiers. (PKK)"], ["2016-03-24", "Turkey", "Lice, Turkey,", 3, 24, "A car bomb attack in southeast Turkey has killed three soldiers. 24 soldiers were wounded when the Kurdistan's Workers Party, or PKK, attacked the military post in Lice. (PKK)"], ["2016-03-26", "India", "Bijbehara, India", 0, 3, "Two soldiers and a civilian was injured in a grenade attack. (Unknown)"], ["2016-03-26", "Democratic Republic of the Congo", "Mpati, Democratic Republic of Congo", 2, 1, "Two soldiers killed in an attack by militia Nyatura and Alliance of Patriots for a Free and Sovereign Congo. (Nyatura and APCLS)"], ["2016-03-27", "Turkey", "Nusaybin, Turkey", 0, 2, "Two members of the security forces were injured in Nusaybin, a town on the Syrian border that has been at the center of a counter-terrorism operation for the last two weeks. (PKK)"], ["2016-03-27", "Turkey", "Mardin Province, Turkey", 1, 0, "A Turkish soldier and police officer were killed in an armed attack by PKK terrorists in the southeastern province of Mardin. (PKK)"], ["2016-03-29", "Burundi", "Bujumbura, Burundi", 0, 7, "Seven people were injured, two seriously, in the explosion of two grenades thrown against a bus Burundian police. (Unknown)"], ["2016-03-29", "South Sudan", "Juba, South Sudan", 2, 0, "Two people were killed on Bor-Juba road Tuesday when unknown gunmen opened fire on a passenger bus, survivors and eyewitnesses said. Several other people were reportedly left with injuries following the highway attack. One of the people killed is a Ugandan, the other is from South Sudan. (Unknown)"], ["2016-03-30", "India", "Dantewada district, India", 7, 0, "At least seven Central Reserve Police Force (CRPF) personnel are killed in an IED attack on their vehicle in the Indian state of Chhattisgarh's Dantewada district. Naxalite insurgents are suspected to have been behind the attack. (Unknown)"], ["2016-03-31", "South Sudan", "Juba, South Sudan", 2, 4, "Two people were killed and four others injured after a boat carrying passengers from the South Sudan capital, Juba was attacked on Thursday. After the boat left Magala, a payam located about 75 km north of Juba, and travelled only one kilometre, some armed youth started firing from both sides of the Nile River killing a young girl of 17 years old and one woman. Seven boats were loaded with cars and pastoralists in Magala Thursday, heading to Bor county. 52 cows were killed, several others injured and about two dozen are missing. (Unknown)"], ["2016-03-31", "Turkey", "Diyarbakir, Turkey", 7, 27, "March 2016 Diyarbakır bombing: Seven police officers were killed and twenty seven wounded when the minibus they were travelling in was hit by a car bomb. The attack occurred in the city of Diyarbakir. The PKK claimed responsibility for the attack. (PKK)"], ["2016-04-02", "Turkey", "Kızıltepe, Turkey", 1, 11, "One building guard was killed and 11 others were injured in a bomb attack by PKK terrorists at a military station in the southeastern Mardin province. (PKK)"], ["2016-04-07", "Turkey", "Nusaybin, Turkey", 5, 5, "Five security officials, including two police chiefs and a major, have been killed in an attack in the Nusaybin district of the southeastern province of Mardin. (PKK)"], ["2016-04-08", "India", "Bijbehara, India", 0, 2, "Two people were injured in a grenade attack on Friday in busy Gorwian market. (Unknown)"], ["2016-04-09", "Turkey", "Derik, Turkey", 2, 0, "One police officer and one civilian were killed in an outlawed PKK attack in the Derik of the southeastern province of Mardin. (PKK)"], ["2016-04-09", "Peru", "Hatun Asha, Peru", 3, 6, "At least 3 people are killed and another 6 were wounded in a remote part of Peru in an attack by Shining Path guerillas (Shining Path)"], ["2016-04-11", "Burundi", "Ruyigi, Burundi", 5, 6, "A gunman killed 5 civilians and wounded 6 at a market in Ruyigi near the Tanzanian border. (Unknown)"], ["2016-04-12", "Lebanon", "Sidon, Lebanon", 1, 0, "A member of Fatah group died in a bomb attack in Sidon near a Palestinian refugee camp. (Unknown)"], ["2016-04-12", "Turkey", "Hani, Turkey", 2, 50, "A car bomb attack on a Turkish gendarmerie in the town of Hani killing at least two people and injuring 50. (PKK)"], ["2016-04-15", "Nigeria", "Lagos, Nigeria", 1, 0, "A vehicle waylaid a bus and a passenger on the bus was dragged out of the it and butchered by unknown gunmen. The victim is identified as forty year old Olusola Bamidele. (Unknown)"], ["2016-04-15", "Democratic Republic of the Congo", "Bukavu, Democratic Republic of Congo", 3, 0, "Three people were killed after a grenade explosion in Bukavu, South Kivu. (Unknown)"], ["2016-04-15", "Turkey", "Savur, Turkey", 4, 2, "At least four Turkish Army soldiers are killed and two others are wounded after a roadside bomb hit their vehicle in the southeast Mardin Province. (PKK)"], ["2016-04-17", "Central African Republic", "Rafaï, Central African Republic", 1, 0, "A Moroccan peacekeeper of Minusma was killed during of an attack by alleged members of the Lord's Resistance Army. (Lord's Resistance Army)"], ["2016-04-17", "Turkey", "Nusaybin, Turkey", 1, 3, "One police officer was killed while three others were wounded as militants detonated an improvised explosive device during the passage of policemen in Nusaybin, in southeastern Mardin province. (PKK)"], ["2016-04-17", "Burundi", "Bujumbura, Burundi", 4, 0, "Four members of the ruling party were killed in a bar while they were gathering for an environmental clean-up exercise. (Unknown)"], ["2016-04-19", "Turkey", "Şırnak Province, Turkey", 2, 4, "A sergeant and a specialized sergeant were killed while four others were wounded as militants from the outlawed Kurdistan Workers' Party detonated a homemade bomb in the Bahçelievler neighbourhood of the southeastern Şırnak Province on April 19. (PKK)"], ["2016-04-22", "Turkey", "Tunceli, Turkey", 3, 0, "Three soldiers who were in the car were killed in a bomb attack by the outlawed Kurdistan Workers' Party in the eastern province of Tunceli. (PKK)"], ["2016-04-24", "Burundi", "Bujumbura, Burundi", 0, 2, "Human rights Minister Martin Nivyabandi and his wife were injured when a grenade was thrown into their car. (Unknown)"], ["2016-04-25", "Armenia", "Yerevan, Armenia", 1, 6, "At least one person was killed and six wounded in a bus explosion in Yerevan, capital of Armenia. The explosion took place after the commemorations of the 101th anniversary of the Armenian Genocide. (Grey Wolves or MNS (suspected))"], ["2016-04-25", "Burundi", "Bujumbura, Burundi", 3, 3, "An advisor of the vice president was shot dead in the capital by unknown gunmen, while he was dropping of his daughter for school. Brig. Gen. Athanase Kararuza was killed along with his wife and one of his bodyguards. His daughter, another bodyguard and his driver were injured. (Unknown)"], ["2016-04-25", "Turkey", "Nusaybin, Turkey", 4, 16, "One soldier were killed after an explosive was detonated by PKK members in southeastern Turkey. Sixother soldiers were also wounded in the explosion that happened in the heart of the Nusaybin district. After the first attack three Turkish soldiers were killed and 10 wounded during security operations in the first attack's zone when another explosive detonated. (PKK)"], ["2016-04-27", "Turkey", "Bursa, Turkey", 0, 13, "2016 Bursa bombing: A suicide bomber blew herself up in the Turkish city of Bursa, wounding 13 people in the Bursa's 14th century Grand Mosque, a historic symbol of the city that was the first capital of the Ottoman Empire. (Kurdistan Freedom Falcons)"], ["2016-04-27", "Turkey", "Van Province, Turkey", 0, 3, "Three soldiers were wounded in an attack by the outlawed Kurdistan Workers' Party militants in the eastern province of Van. (PKK)"], ["2016-04-28", "Turkey", "Varto, Turkey", 1, 2, "One police officer was killed and two others were wounded in an outlawed Kurdistan Workers' Party bomb attack in the Varto district. PKK militants detonated an explosive placed on the road during the passing of an armored police vehicle. (PKK)"], ["2016-04-28", "Democratic Republic of the Congo", "Masisi, Democratic Republic of Congo", 3, 3, "Three people died and three others were injured during an armed attack against a position of the Armed Forces of the Democratic Republic of the Congo in North Kivu. (Nyatura)"], ["2016-04-28", "Burundi", "Bujumbura, Burundi", 5, 3, "Five people were killed in a gun and grenade attack in a district of Burundi's capital which is stronghold of opposition to president Pierre Nkurunziza. (Unknown)"], ["2016-05-02", "Turkey", "Diyarbakır, Turkey", 1, 23, "One soldier was killed and 23 people were injured in a suicide car bomb against the security forces in Diyarbakır. (PKK)"], ["2016-05-02", "Turkey", "Hakkâri Province, Turkey", 2, 0, "Two soldiers were killed when outlawed PKK attacked a military station zone in the Şemdinli district of the southeastern province of Hakkâri Province. (PKK)"], ["2016-05-05", "Turkey", "Mardin, Turkey", 1, 10, "PKK used a car laden with explosives to attack a gendarmerie station in Turkey's Mardin. Initial reports from the scene said that 1 soldier has died and 10 others have been wounded. (PKK)"], ["2016-05-06", "Burundi", "Bujumbura, Burundi", 0, 8, "Eight people were injured by a grenade explosion, in the north of Bujumbura, (Unknown)"], ["2016-05-08", "Burundi", "Bujumbura, Burundi", 1, 5, "One person was killed and five others injuredin the explosion of a grenade in a bar, in the center of Bujumbura. (Unknown)"], ["2016-05-08", "Burundi", "Bujumbura, Burundi", 2, 12, "A grenade was thrown in a small market. Its explosion killed two saleswoman and injured twelve others  (Unknown)"], ["2016-05-09", "Burundi", "Rumonge Province, Burundi", 3, 1, "Three people were killed in a bar in Maramvya, Burambi district of Rumonge province, 70 km south of the Burundian capital Bujumbura. Two of the victims were retired soldiers. Another man was seriously injured in the shooting. (Unknown)"], ["2016-05-10", "Ukraine", "Donbass region, Ukraine", 1, 5, "One Ukrainian serviceman was killed and three others wounded in action in the Donbass region on 10 May. All the casualties were caused by explosions of explosive devices. Two civilians, employees of a thermal power station, were injured by explosion of a grenade launcher's ammunition that was hidden underground. (Unknown)"], ["2016-05-10", "Turkey", "Diyarbakir, Turkey", 3, 0, "May 2016 Diyarbakır bombing: At least three are killed in a car bomb targeting a Turkish police vehicle in Diyarbakır, Turkey. (PKK)"], ["2016-05-13", "Turkey", "Hakkari province, Turkey", 6, 0, "6 soldiers were killed during clash with PKK fighters near a military base (PKK)"], ["2016-05-18", "Ukraine", "Pavlopil, Ukraine", 1, 1, "One male civilian was killed and another injured when a tractor they were driving on hit an unidentified explosive device in Pavlopil, Donetsk Oblast. The incident in Pavlopil was the fifth incident of similar kind since the beginning of 2016. (Donetsk People's Republic (suspected))"], ["2016-05-20", "Georgia", "Abkhazia, Georgia", 1, 0, "Georgia's Ministry of Foreign Affairs expresses \"shock and deep concern\" after a Georgian citizen, 31-year-old Giga Otkhozoria, was shot dead by Russian Armed Forces troops patrolling areas near the administrative boundary with Abkhazia. (Russian Armed Forces (suspected))"], ["2016-05-24", "Turkey", "Van Province, Turkey", 6, 4, "At least six Turkish soldiers are killed and four others are wounded in a PKK attack in Turkey's eastern Van Province. (PKK)"], ["2016-05-24", "Ukraine", "Donbass region, Ukraine", 7, 0, "Seven Ukrainian servicemen are killed in suspected attacks by pro-Russian rebels (Donetsk People's Republic (suspected))"], ["2016-05-25", "Burundi", "Bujumbura, Burundi", 1, 1, "Retired army Colonel Lucien Rufyiri was killed and his son wounded in a shooting. (Unknown)"], ["2016-05-25", "Burundi", "Mwaro Province, Burundi", 2, 1, "Gunmen killed two people, including a police chief. One other person was wounded. (Unknown)"], ["2016-05-28", "South Africa", "Mbombela, South Africa", 1, 0, "Michael Phelemebe, an ANC branch deputy chairperson was shot four times in his house in Mbombela. He succumbed to his wounds in the hospital. (Unknown)"], ["2016-05-30", "Turkey", "Van, Turkey", 2, 1, "Suspected PKK militants detonated a roadside bomb in the city of Van as an armored vehicle passed. Two policemen were killed and a third was wounded. (PKK (suspected))"], ["2016-05-30", "Turkey", "Silopi, Turkey", 4, 19, "Four civilians were killed and nineteen people, including 5 policemen, were wounded when a roadside bomb that had been placed in a street sewer was detonated when a police car pasted. PKK has been blamed for the attack. (PKK (suspected))"], ["2016-06-07", "Turkey", "Istanbul, Turkey", 11, 36, "June 2016 Istanbul bombing: A bomb exploded on a police bus in the Vezneciler district of Istanbul (TAK)"], ["2016-06-08", "Israel", "Tel Aviv, Israel", 4, 18, "June 2016 Tel Aviv shooting: Two Palestinian gunmen opened fire in a Max Brenner restaurant in Tel Aviv killing four diners. Both perpetrators were arrested. (Fatah)"], ["2016-06-08", "Turkey", "Midyat, Turkey", 5, 30, "June 2016 Midyat car bombing: a car bomb exploded in the Turkish town of Midyat. 5 people were killed and 30 others were injured. (PKK (Suspected))"], ["2016-06-13", "Uganda", "Gulu, Uganda", 1, 5, "Gunmen with machine guns attacked a police station in the town of Gulu. One soldier was killed and three soldiers and two police officials were wounded in the attack. The attack comes after the reelection of Uganda's president since 1986, President Yoweri Museveni. (Unknown)"], ["2016-06-14", "Burundi", "Ngozi Province, Burundi", 2, 4, "A soldier blew himself up with grenade, killing him and two other people as well as injuring four other people in the town of Ngozi in Ngozi Province. (Unknown)"], ["2016-06-14", "India", "Kud, India", 3, 9, "A double terrorist attack in India resulted in the death of a victim and a militant, and the injury of 9. The status of the second attacker is currently unknown. The attack sparked protests, as it was later revealed that two civilian victims were actually shot by Indian troops amid the chaos. (Unknown)"], ["2016-06-16", "United Kingdom", "Birstall, United Kingdom", 1, 1, "Killing of Jo Cox: Labour Party politician Jo Cox was shot and stabbed to death by Thomas Mair, a British nationalist, a week before the UK's EU membership referendum. He is charged under terrorism protocols. (Lone wolf)"], ["2016-06-25", "Madagascar", "Antananarivo, Madagascar", 3, 91, "A grenade exploded outside a stadium in Antananarivo where people were celebrating Madagascar's independence.one of the wounded later died in the hospital  (Unknown)"], ["2016-06-26", "Myanmar", "Thuye Tha Mein, Myanmar", 0, 1, "Buddhist extremists rampaged a village containing a of Rohingya Muslims minority, forcing 70 people to seek shelter and others to flee. Only one man was confirmed injured, yet in the past other raids by Buddhist extremists have killed people, as this attack is another in a series conducted by them. (Buddhist extremists)"], ["2016-06-30", "Bahrain", "East Eker, Bahrain", 1, 3, "1 person was killed and 3 injured after a roadside bombing. 2 people were arrested who were suspected of planting the bomb. Bahrain accused Iran's Revolutionary Guards for being behind the bombing, although this is only an accusation, and does not rule out the possibility of terrorism. U.S. Vice President Joe Biden expressed his concerns after the attack. The bombing was described as a \"terrorist bombing\". (Iran's Revolutionary Guards (suspected))"], ["2016-07-01", "Venezuela", "Caracas, Venezuela", 1, 0, "Elizabeth Aguilera, a political activist and a local leader of Venezuela's governing socialist political party, was shot dead by a paramilitary group, in retaliation for her work against organized crime in Venezuela. Her body was burned with pictures being posted on-line after her death. (Paramilitary group)"], ["2016-07-01", "Bahrain", "Eker, Bahrain", 1, 3, "Militants detonated a bomb in a village south of Bahrain's capital Manama, hitting a car carrying a woman who died in the blast and three children who sustained minor injuries as well. Bahraini authorities said the attack was carried out by \"terrorists\", but no group claimed responsibility. (Unknown)"], ["2016-07-01", "Democratic Republic of the Congo", "Masisi Territory, Democratic Republic of Congo", 6, 0, "The Nyatura and the Alliance of Patriots for a Free and Sovereign Congo simultaneously attacked several Armed Forces of the Democratic Republic of the Congo positions in the Masisi Territory. (Nyatura and APCLS)"], ["2016-07-03", "Ukraine", "Khartsyzk, Ukraine", 1, 0, "Near Khartsyzk, a commander of militants was killed in a land mine blast. (Donetsk People's Republic)"], ["2016-07-06", "Mozambique", "Tete Province, Mozambique", 0, 0, "RENAMO militants attacked during early morning. According to the commander of the provincial police in Tete Mozambique, Pedro Fabião Nhancololo, the group broke into the residence of the head of the city of Banga and civil registration facilities, and stole all drugs health post. (RENAMO)"], ["2016-07-06", "Nigeria", "Oyo, Nigeria", 1, 0, "Gideon Aremun a Nigerian lawmaker and member of the House of Assembly, was assassinated by gunmen. (Unknown)"], ["2016-07-06", "Turkey", "Hakkâri, Turkey", 1, 0, "A village guard was killed in an attack by outlawed PKK militants in the southeastern province of Hakkâri. (PKK)"], ["2016-07-07", "Taiwan", "Taipei, Taiwan", 0, 25, "One man set off firecrackers in the subway in Taipei near the Songshan Airport. The explosion caused a fire and injured 25 people. (Lone wolf)"], ["2016-07-07", "United States", "Dallas, Texas, United States", 5, 9, "2016 shooting of Dallas police officers: Micah Xavier Johnson shot at police from an elevated position at a Black Lives Matter protest in downtown Dallas. 5 officers have been killed and 7 were wounded. 2 civilians were also injured. (Micah Xavier Johnson)"], ["2016-07-09", "Turkey", "Cevizlik, Turkey", 3, 10, "2 soldiers and 1 civilian were killed in a car bombing in Southeast Turkey. (PKK (suspected))"], ["2016-07-10", "Cambodia", "Phnom Penh, Cambodia", 1, 0, "Kem Ley,a Cambodian political commentator and activist and the founder of the Grassroots Democracy Organization was assassinated in the capital. (Unknown)"], ["2016-07-11", "Turkey", "Dereli , Turkey", 0, 1, "Unknown assailants opened fire on a police vehicle patrolling in the Dereli district. A police officer was injured in the attack. (PKK (suspected))"], ["2016-07-11", "Turkey", "Dereli , Turkey", 0, 2, "Another two police officers were wounded when an explosive was detonated near the scene of the first attack . (PKK (suspected))"], ["2016-07-13", "United States", "Panaca, United States", 0, 1, "A powerful explosion blew up a house in Nevada killing the perpetrator. Debris from the explosion injured one person. (Glen Jones)"], ["2016-07-13", "Ukraine", "Krasnohorivka, Ukraine", 0, 2, "Near Krasnohorivka, two Ukrainians soldiers were wounded in a land mine blast. (Donetsk People's Republic)"], ["2016-07-13", "Burundi", "Bujumbura, Burundi", 1, 0, "Close to President Pierre Nkurunziza, the former minister Hafsa Mossi was murdered in Bujumbura. She had been very quiet since the beginning of the crisis. (Militiamen from the opposition (suspected))"], ["2016-07-14", "Democratic Republic of the Congo", "Rutshuru Territory, Democratic Republic of Congo", 2, 2, "Two people died and two were injured in an attack of AFDRC position in Tongo-Rusheshe in Rutshuru Territory. (DFLR)"], ["2016-07-15", "Turkey", "Siirt Province, Turkey", 0, 2, "Two civilians, including a child, were wounded early on July 15 when PKK militants staged armed attacks against a military barracks and a police station in the southeastern Siirt Province. (PKK)"], ["2016-07-15", "India", "Kulgam, India", 1, 7, "One person was killed and 7 injured after a grenade attack on policemen in Kulgam, India. (Unknown militants)"], ["2016-07-15", "Democratic Republic of the Congo", "Rutshuru Territory, Democratic Republic of Congo", 2, 0, "Two people, aged 25 and 26, were shot dead by Mai-Mai militiamen in Rutshuru Territory in North Kivu. They were killed while chopping wood in the forest. (Mai-Mai)"], ["2016-07-16", "Venezuela", "Rosario de Perijá, Venezuela", 1, 0, "An Indian chief was shot dead Saturday in the Venezuelan city of Rosario de Perija in Zulia (west), reported the Public Ministry. (Unknown)"], ["2016-07-17", "Ukraine", "Avdiivka, Ukraine", 0, 1, "In Avdiivka, one person was wounded as a result of DPR shelling. (Donetsk People's Republic)"], ["2016-07-17", "Ukraine", "Marinka, Ukraine", 0, 1, "In Marinka, a local woman was wounded as a result of DPR shelling. (Donetsk People's Republic)"], ["2016-07-17", "United States", "Baton Rouge, Louisiana, United States", 3, 3, "2016 shooting of Baton Rouge police officers: An ambush by a black separatist on Baton Rouge Police left 3 dead and 3 injured. (Gavin Long)"], ["2016-07-18", "Kazakhstan", "Almaty, Kazakhstan", 5, 8, "2016 shooting of Almaty police officers: Six people were killed, and eight others were injured following an attack on a police station in Almaty, Kazakhstan’s largest city. One of the attackers has been detained. (Ruslan Kulikbayev)"], ["2016-07-18", "Democratic Republic of the Congo", "Kibiriz, Democratic Republic of Congo", 7, 5, "Seven people were killed and five others wounded during an incursion of armed men in Kibiriz. (Nyatura and Mai-Mai)"], ["2016-07-19", "Ukraine", "Avdiivka, Ukraine", 1, 0, "In Avdiivka, a 19-year-old man was killed as a result of DPR shelling. (Donetsk People's Republic)"], ["2016-07-19", "Democratic Republic of the Congo", "Kyanyunda, Democratic Republic of Congo", 3, 5, "Two people died and five others were wounded after militiamen attacked a truck Kyanyunda. (Mai-Mai(suspected))"], ["2016-07-20", "Ukraine", "Kiev, Ukraine", 1, 0, "The journalist Pavel Sheremet was killed when a bomb exploded under his car in the center of Kiev. (Unknown)"], ["2016-07-21", "Democratic", "Republic of the Congo Mitwaba, Democratic Republic of Congo", 1, 0, "Five Mai-Mai militiamen tried to attack a prison in Mitwaba. In the confrontation they beheaded a policeman and cut his body into pieces. The police subsequently killed three militiamen and wounded the remaining two, who were then arrested. (Mai-Mai)"], ["2016-07-22", "Turkey", "Diyarbakir, Turkey", 3, 0, "In the province of Diyarbakır Ergani in the operation organized members of the PKK organization, three policemen were killed and a policeman was injured. Security officers organized operation to an address that was used as a \"nest\" .One of the two wounded policemen entered the Ergani State Hospital fell despite the effort (PKK)"], ["2016-07-25", "Mozambique", "Niassa Province, Mozambique", 0, 0, "A RENAMO Gunmen from Mozambique’s opposition party Renamo on morning attacked a health centre and a police station in the administrative post of Muapula in the northern province of Niassa. The armed men stole medicines and surgical equipment from the health centre. No casualties have been reported. (RENAMO)"], ["2016-07-25", "Mozambique", "Barue, Mozambique", 0, 2, "Two truck drivers received minor injuries over the weekend when a convoy driving along the EN7 highway was ambushed by gunmen from the opposition party Renamo. (RENAMO)"], ["2016-07-25", "Turkey", "Mardin Province, Turkey", 3, 0, "Three policemen were killed in a PKK roadside bomb attack in Turkey's southeastern Mardin Province. (PKK)"], ["2016-07-26", "Turkey", "Diyarbakır, Turkey", 1, 1, "One soldier was killed and another injured in a rocket attack on a military checkpoint near the Silvan Dam. (PKK)"], ["2016-07-26", "Turkey", "Van, Turkey", 1, 2, "A truck bomb exploded when passing on a landmine in the eastern city of Van, killing one person and injuring two more. (PKK)"], ["2016-07-26", "Japan", "Sagamihara, Japan", 19, 25, "Sagamihara stabbings: 26-year-old Satoshi Uematsu broke into a care centre for people with mental disabilities by smashing a window and stabbed 44 people, one-by-one while they were sleeping. He then surrendered to the police which arrived on scene. (Satoshi Uematsu)"], ["2016-07-27", "Turkey", "Siirt, Turkey", 3, 0, "A military vehicle exploded when passing on a landmine in the eastern district of Siirt, killing two soldiers and injuring two more. (PKK)"], ["2016-07-28", "Burundi", "Commune of Gisozi, Burundi", 2, 4, "Two patrons were killed in a shooting in a pub.Four people were injured in the attack.One of the attackers were killed (Unknown)"], ["2016-07-29", "Paraguay", "Santa Rosa del Aguaray, Paraguay", 0, 0, "A 17-year Mennonite guerrillas kidnapped by Paraguayan People's Army (EPP), read a statement sent today by the armed group that he founded the kidnapping by \"the violation of revolutionary laws prohibiting deforestation.\" (Paraguayan People's Army)"], ["2016-07-29", "Democratic Republic of the Congo", "Nyamilima, Democratic Republic of Congo", 0, 1, "Mai-Mai attack an army positions in Nyamilima (North Kivu). An old women was wounded. (Mai-Mai)"], ["2016-07-29", "Turkey", "Çukurca, Turkey", 5, 8, "Five soldiers were killed, and 8 were injured in an PKK attack in Çukurca. (PKK)"], ["2016-07-29", "Angola", "Cabinda Province, Angola", 9, 14, "Front for the Liberation of the Enclave of Cabinda (FLEC) reportedly killed nine Angolan soldiers and wounded 14 others in recent clashes in the oil-rich Cabinda Province. (Reuters) (Front for the Liberation of the Enclave of Cabinda)"], ["2016-07-30", "Mozambique", "Mopeia, Mozambique", 0, 0, "A group of 20 armed men invaded the village of the headquarters of the Renamo Mopeia province of Zambezia, in central Mozambique district and occupied the police headquarters for an hour, normalcy returned after the departure of men (RENAMO), after a 45-minute shootout with police.  (RENAMO)"], ["2016-07-31", "Mozambique", "Maiaca, Mozambique", 0, 0, "Renamo gunmen overran Sunday Maiaca city in the province of Niassa, northern Mozambique, and attacked the health center, police facilities and the administrator's house, local sources cited by Radio Mozambique. (RENAMO)"], ["2016-07-31", "Armenia", "Yerevan, Armenia", 2, 77, "2016 Yerevan hostage crisis: About 20 gunmen took control of a police station, killing two officers. 77 people were injured and 100 arrested. 3 gunmen were also injured. Hostages were taken. The gunmen surrendered on July 31, two weeks after seizing the police station (Daredevils of Sassoun)"]], "columns": ["Date", "Country", "City", "Killed", "Injured", "Description"]}